{
    "article": "It was Monday. Mrs. Smith's dog was hungry,but there was not any meat in the house. Thinking that there was no  other  way, Mrs. Smith took a piece of paper, and wrote the following words  _  it:\"Give my dog half a pound of meat.\"Then she gave the paper to her dog and said, \"  _  this to the butcher, and he's going to give you your lunch today.\"  _  the piece of paper in its mouth, the dog ran to the butcher's shop. It gave the paper to the butcher. The butcher read it  _  , recognized that it was  _  the lady's handwriting and soon did  _  he was asked to. The dog was very happy, and ate the meat up at once. At midday, the dog came to the shop again. It gave the butcher a piece of paper again. After reading it, he gave half a pound of meat  _  . The next day, the dog came again just at midday. And as usual, it brought a piece of paper in the mouth. This time, the butcher did not take a look at the paper, and gave the dog  _  meat, for he had regarded the dog as one of his customer. But, the dog came again at four o'clock. And the same thing happened once again. To the butcher's surprise, it came for the third time at six o'clock. The butcher  _  puzzled. He said to himself, \"This is a small dog. Why does Mrs. Smith give it so much meat to eat today? \" Looking at the piece of paper, he found that there were not any words there.", 
    "options": [
        [
            "under", 
            "in", 
            "on", 
            "above"
        ], 
        [
            "Take", 
            "Bring", 
            "Get", 
            "Carry"
        ], 
        [
            "Eating", 
            "Drinking", 
            "Dropping", 
            "Holding"
        ], 
        [
            "carefully", 
            "quietly", 
            "slowly", 
            "clearly"
        ], 
        [
            "possibly", 
            "really", 
            "hardly", 
            "strongly"
        ], 
        [
            "when", 
            "since", 
            "as", 
            "after"
        ], 
        [
            "too", 
            "also", 
            "again", 
            "either"
        ], 
        [
            "its", 
            "his", 
            "himself", 
            "it"
        ], 
        [
            "felt", 
            "turned", 
            "stayed", 
            "kept"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "A", 
        "B", 
        "C", 
        "C", 
        "A", 
        "A"
    ], 
    "source": "middle232"
}