{
    "article": "On a Saturday morning, I went camping in Green Natural Park with some friends. We were happy because it was a sunny day. All the way there, we sang songs and made jokes. _ , in the afternoon, when we finished our picnic at one o'clock, it was dark and windy. Soon, it started to rain. Unluckily, none of us brought a(n) _ . We ran about but couldn't find any places to _ .\nTwenty minutes passed and it was still raining. There was a long way to go _ we reached the campsite  . It was _ worse because our compass   showed that we went the wrong way.\nWe had to make a quick decision because it was raining heavily. Chris said we could set up a tent   to hide in, so Mary and Tom _ to set up the tent. Chris and I tried to make a fire to keep us warm. But we were not able to light the fire, because everything was _ . We dried ourselves, talked and waited inside the tent. At about five o'clock, it stopped raining. We _ to stop the camping trip because all of us were very tired.\nThis camping trip might not be very _ but we got to know each other better. And the most important thing I've learned from this trip is the importance of team spirit.", 
    "options": [
        [
            "Instead", 
            "Usually", 
            "Luckily", 
            "However"
        ], 
        [
            "cap", 
            "book", 
            "umbrella", 
            "coat"
        ], 
        [
            "live", 
            "eat", 
            "hide", 
            "sleep"
        ], 
        [
            "after", 
            "before", 
            "since", 
            "when"
        ], 
        [
            "nearly", 
            "hardly", 
            "still", 
            "even"
        ], 
        [
            "continued", 
            "began", 
            "wished", 
            "preferred"
        ], 
        [
            "wet", 
            "dry", 
            "dark", 
            "bright"
        ], 
        [
            "forgot", 
            "tried", 
            "decided", 
            "refused"
        ], 
        [
            "careful", 
            "successful", 
            "awful", 
            "helpful"
        ]
    ], 
    "answers": [
        "D", 
        "C", 
        "C", 
        "B", 
        "D", 
        "B", 
        "A", 
        "C", 
        "B"
    ], 
    "source": "middle1960"
}