{
    "article": "Last month we asked our students  _  their free time activities. Our questions were about exercise , use of the Internet and watching TV . Here  _  the results. We found that only fifteen percent of our students exercise  every day  . Forty-five percent exercise four to six times a week .Twenty percent exercise only one to three times a week .And twenty percent do not exercise  at all  We all know that many students often  go online  but we were  _  that ninety percent of them use the Internet every day.  the other  ten percent use it at three or four times a week.  Most  students use it for fun and not for homework.. The answers  _  our questions about  _  television were also interesting. Only two percent of the students watch TV one to three times a week . Thireteen percent watch TV four to six times a week. And eighty--five percent watch TV every day!  _  many students like to watch sports, game shows are the most popular. It is good  to relax  by using the Internet or watching game shows, but we think the best way to relax is through exercise . It is healthy for the mind and the body. Exercise  such as  playing sports is fun , and you can  _  time with your friends and family  _  you play together. And remember,\" old habits die hard\". So start exercising before it is too late !", 
    "options": [
        [
            "to", 
            "about", 
            "of", 
            "with"
        ], 
        [
            "is", 
            "was", 
            "were", 
            "are"
        ], 
        [
            "surprise", 
            "surprised", 
            "surprising", 
            "surprises"
        ], 
        [
            "with", 
            "by", 
            "about", 
            "to"
        ], 
        [
            "watch", 
            "watches", 
            "watching", 
            "watched"
        ], 
        [
            "But", 
            "Although", 
            "Because", 
            "so"
        ], 
        [
            "cost", 
            "take", 
            "spend", 
            "pay"
        ], 
        [
            "while", 
            "when", 
            "then", 
            "as"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "B", 
        "D", 
        "C", 
        "B", 
        "C", 
        "B"
    ], 
    "source": "middle1622"
}