{
    "article": "From the time I was in the third grade, I knew I wanted to be a writer. After  _  the first prize for my story, I spent much of my free time writing wild stories of strange living animals, kids' fun experiences and poems of  _  I felt about my world. In the fourth grade, I continued to write. I always took a small notebook with me so I could write whenever I felt  _  writing something down on it. When I started the fifth grade, my English teacher was Mrs. Foster. She was the  _  teacher I'd ever had. She always had something nice to say about everyone, and she  _  failed to say it out loud. I loved her  _  much that I showed her my notebook and what I had been writing ever since the third grade. When she returned my  _  to me, she had written encouraging notes on them, which made me  feel  really great. \"Don't give up your dream, Kathy,\" she said, \"I didn't give up  _  . I always wanted to be a teacher, and here I am.\" I did what Mrs. Foster encouraged me to do. Now I have had most of my stories published in books and magazines. The secret of success is to  _  your dream. And sometimes, it takes other dreamers to help keep your dreams alive. I'm glad Mrs. Foster was a dreamer too.", 
    "options": [
        [
            "making", 
            "giving", 
            "winning", 
            "writing"
        ], 
        [
            "what", 
            "how", 
            "when", 
            "where"
        ], 
        [
            "about", 
            "like", 
            "with", 
            "for"
        ], 
        [
            "better", 
            "Worse", 
            "best", 
            "worst"
        ], 
        [
            "no", 
            "not", 
            "never", 
            "ever"
        ], 
        [
            "before", 
            "such", 
            "so", 
            "after"
        ], 
        [
            "lessons", 
            "stories", 
            "interests", 
            "experiences"
        ], 
        [
            "yours", 
            "mine", 
            "your", 
            "my"
        ], 
        [
            "break", 
            "follow", 
            "give", 
            "bring"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "B", 
        "C", 
        "C", 
        "C", 
        "B", 
        "B", 
        "B"
    ], 
    "source": "middle1044"
}