{
    "article": "The books in David's schoolbag felt like bricks as he ran down the street. What he wanted to do was to play basketball with Eric, _ his mother told him he would have to return his sister's books to the library first.\nHe had _ set foot in a library and he wasn't about to do so today. He would just _ the books in the outside return box. But there was a _ , it was locked.\nHe went into the building, only a few minutes _ closing time. He put the books into the return box. And after a brief   _ in the toilet, he would be on his way to the playground to _ Eric.\nDavid stepped out of the toilet and stopped in _ -- the library lights were off. The place was _ . The doors had been shut. They _ be opened from the inside, he was trapped   -- in a library!\nHe tried to _ e of the building. _ the sun began to set, he searched for a light and found it.\nAt last he could see. David wrote on a piece of paper: \" _ ! I'm TRAPPED inside!\" and stuck it to the glass door. Surely, someone passing by would see it.\nHe was surprised to discover that this place was not so unpleasant, after all. Rows and rows of shelves held books, videos and music. He saw a book about Michael Jordan and took it off the shelf. He settled into a chair and started to _ .\nHe knew he had to wait, but now, that didn't seem to be such a _ thing.", 
    "options": [
        [
            "but", 
            "because", 
            "since", 
            "or"
        ], 
        [
            "ever", 
            "nearly", 
            "never", 
            "often"
        ], 
        [
            "pass", 
            "drop", 
            "carry", 
            "take"
        ], 
        [
            "problem", 
            "mistake", 
            "case", 
            "question"
        ], 
        [
            "during", 
            "after", 
            "over", 
            "before"
        ], 
        [
            "rest", 
            "break", 
            "walk", 
            "stop"
        ], 
        [
            "visit", 
            "meet", 
            "catch", 
            "greet"
        ], 
        [
            "happiness", 
            "anger", 
            "surprise", 
            "kindness"
        ], 
        [
            "lonely", 
            "empty", 
            "noisy", 
            "crowded"
        ], 
        [
            "wouldn't", 
            "shouldn't", 
            "couldn't", 
            "needn't"
        ], 
        [
            "make", 
            "fix", 
            "use", 
            "pick"
        ], 
        [
            "If", 
            "When", 
            "Though", 
            "Until"
        ], 
        [
            "Come", 
            "Help", 
            "Hello", 
            "Sorry"
        ], 
        [
            "watch", 
            "play", 
            "read", 
            "write"
        ], 
        [
            "cool", 
            "strange", 
            "nice", 
            "bad"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "B", 
        "A", 
        "D", 
        "D", 
        "B", 
        "C", 
        "B", 
        "C", 
        "A", 
        "B", 
        "B", 
        "C", 
        "D"
    ], 
    "source": "middle318"
}