{
    "article": "My six-year-old granddaughter, Cindy, and I stopped at a food shop for some bread.  Cindy had _  it for several days. As we were going out of the door, a young teenage boy was coming in.\nThe boy had no hair on the side of his head but a set of blue spiked hair on top of it. His nose was _ , and a ring ran through the hole. A chain went across his face and it was connected to his earring. He held a skateboard under one arm and a basketball under the other.\nCindy, who was walking ahead of me, _ stopped when she saw the boy. I thought he had _  my granddaughter. I was wrong. My granddaughter  backed up  against the door and opened it as wide as it would go. Now I came face to face with the young man. I _ aside and let him pass. He replied very _ , \"Thank you very much.\"\nOn our way to the car, I  _ Cindy for holding open the door for the boy. To my surprise, she didn't seem to be troubled by the young boy's _ . But I wanted to make sure. I wanted to be ready to talk about freedom of expressing themselves and allowing people's _ .\nAs it  turned out , the person who needed the talk was me.\nThe only thing Cindy noticed about the boy was the fact that his arms were  _ . \"He held a skateboard under one arm and a basketball under the other. He would have a  _ time to open the door,\" said Cindy.\nI just paid attention to the partially shaved head, the set of spiked hair, the piercing and the chain. She saw a person carrying something under each arm and heading toward a(n) _ door.\nWhat my granddaughter said _ me that I should change my ways of judging people and learn from my granddaughter to be open-minded and warm-hearted.", 
    "options": [
        [
            "waited", 
            "expected", 
            "dreamed", 
            "asked"
        ], 
        [
            "pierced", 
            "cut", 
            "held", 
            "treated"
        ], 
        [
            "finally", 
            "suddenly", 
            "generally", 
            "usually"
        ], 
        [
            "knocked", 
            "discovered", 
            "afforded", 
            "frightened"
        ], 
        [
            "stepped", 
            "set", 
            "put", 
            "turned"
        ], 
        [
            "anxiously", 
            "proudly", 
            "excitely", 
            "politely"
        ], 
        [
            "praised", 
            "forgot", 
            "paid", 
            "thanked"
        ], 
        [
            "behavior", 
            "appearance", 
            "spirit", 
            "request"
        ], 
        [
            "styles", 
            "tastes", 
            "differences", 
            "lives"
        ], 
        [
            "heavy", 
            "busy", 
            "full", 
            "open"
        ], 
        [
            "long", 
            "hard", 
            "free", 
            "busy"
        ], 
        [
            "open", 
            "closed", 
            "front", 
            "back"
        ], 
        [
            "encouraged", 
            "requested", 
            "expected", 
            "reminded"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "B", 
        "D", 
        "A", 
        "D", 
        "A", 
        "B", 
        "C", 
        "C", 
        "B", 
        "B", 
        "D"
    ], 
    "source": "middle1998"
}