{
    "article": "One day an old woman was walking along the street. She was dirty. Her clothes were worn out and smelled bad. And most of her _ were missing.\nShe stopped and asked me for _ . I invited her to lunch instead and she agreed. So we went across the street to an outdoor cafe. The waitress was taken aback   when this woman appeared and did not want to serve us, _ forced herself. We ate our lunch--- she was very hungry and the food disappeared almost as soon as it arrived.\nWhen we were _ to leave, I was feeling very good about myself and then she asked for a hug . At that moment I had to _ myself and all the hidden bias   that I had towards the woman. She wasn't _ but I didn't feel like giving the hug. I gave her a passing type of hug and soon felt shame. She thanked me for lunch and began to go off .\nI stood there for a moment and realized that I had _ to give this woman the one thing that cost nothing--- love. I called to the woman and caught up with her. Then I asked her if I could give her a real hug and she agreed. I gave the woman the best one I had _ given anyone. \"That's getting it right,\" she said later and her big smile lit up my road as she went away.\nThe lesson I learned was that if you were going to give, then give it your _ and get it right at the beginning. I was deeply moved every time the woman came into my mind.", 
    "options": [
        [
            "money", 
            "clothes", 
            "teeth", 
            "hair"
        ], 
        [
            "change", 
            "lunch", 
            "hug", 
            "meal"
        ], 
        [
            "and", 
            "but", 
            "before", 
            "until"
        ], 
        [
            "afraid", 
            "sad", 
            "ready", 
            "sorry"
        ], 
        [
            "agree", 
            "turn", 
            "leave", 
            "face"
        ], 
        [
            "right", 
            "good", 
            "wrong", 
            "well"
        ], 
        [
            "hoped", 
            "failed", 
            "decided", 
            "succeeded"
        ], 
        [
            "still", 
            "even", 
            "yet", 
            "ever"
        ], 
        [
            "all", 
            "rest", 
            "half", 
            "Some"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "B", 
        "C", 
        "D", 
        "C", 
        "B", 
        "D", 
        "A"
    ], 
    "source": "middle1845"
}