{
    "article": "It was yearbook day and we were given an hour to sign each other's yearbooks in the cafeteria. I was president of the class and I played sports. When I sat down at a table, people started to come over to get their yearbooks signed and to sign  _ .\nAmong them, a weak boy with ugly teeth and thick glasses kept shaking. I had seen him around, and I knew he was always laughed at. He seemed  _  of himself, and was so pale that it hurt us to look at him.\nHe came up and asked me nervously, \"Can you sign this?\" I took his yearbook but I didn't know  _  to write. I saw that there was the name \"Ricky Sanders\" written on the front of it. So I wrote:\nRicky,\nI think you're a really nice kid, and I hope you have lots of fun in your summer vacation.\nSignature:Will\n(Sign your name here)\nI put down the yearbook and turned around to get some signatures from some of my friends when I  _  my yearbook was gone. I saw that Ricky had sat down with my yearbook. \"What are you doing?\" I asked him. He looked up calmly  and  _ said \"Sign!\"\nMy friends broke into a loud laugh, and I saw that he was carefully frying to put a signature in my yearbook. He hadn't even finished the \"R\" yet. I thought for a while and  _  to let him sign.\nIt took him nearly five minutes to sign and when I got my yearbook back, there was a very shaky \"RICKY\". He hugged  his yearbook and  _ . I couldn't help but smile back at him.\nIn that moment, my attitude changed completely.\nI gave him a high five and suddenly everyone at my table wanted his signature. He was asked politely to write in their yearbooks and the signature  _  of his yearbook were filled up. He was smiling so big that it lit up the whole room.\nI changed school the next year, and I never saw Ricky again. However, I will never forget the day that he became the most  _  guy in school. Whenever I'm  _ , I still look back at that yearbook.", 
    "options": [
        [
            "mine", 
            "his", 
            "ours", 
            "theirs"
        ], 
        [
            "unafraid", 
            "unsure", 
            "proud", 
            "tired"
        ], 
        [
            "how", 
            "which", 
            "where", 
            "what"
        ], 
        [
            "saw", 
            "noticed", 
            "thought", 
            "believed"
        ], 
        [
            "still", 
            "ever", 
            "even", 
            "just"
        ], 
        [
            "decided", 
            "meant", 
            "began", 
            "prepared"
        ], 
        [
            "smiled", 
            "waited", 
            "left", 
            "rose"
        ], 
        [
            "lists", 
            "pages", 
            "boxes", 
            "tables"
        ], 
        [
            "different", 
            "patient", 
            "popular", 
            "important"
        ], 
        [
            "away", 
            "out", 
            "behind", 
            "down"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "D", 
        "B", 
        "D", 
        "A", 
        "A", 
        "B", 
        "C", 
        "D"
    ], 
    "source": "middle1652"
}