{
    "article": "Nowadays, Internet becomes much easier for people to use. More and more people like to  _  on the Internet. How can you protect yourself from different types of Internet tricks? Following ideas can make your online shopping  safer  . Never click on an unsolicited email. If you are  _  in the things, some well-known companies sell the same things. Don't  _  on any website address in the email itself. Don't  _  any email that asks you for personal financial information. Most of the legitimate companies will not ask for your information through emails. And don't believe what the email says  _  . Sometimes some emails will ask you to make a telephone call to get more information about the thing you want. When you meet this, don't forget  to check  the phone number on your phonebook to make sure it is the number of a legitimate company before you make the call. When you are  searching for  information on the Internet, make sure that there is a key symbol  _  the bottom of your browser and the \"https://\" is in the website address. These mean that the website is safe. Don't send your money to an unknown website before you  _  the things they send to you and make sure they work well. Shopping on the Internet is easy and fun. It is also safe if you are careful enough.", 
    "options": [
        [
            "read", 
            "write", 
            "travel", 
            "shop"
        ], 
        [
            "surprised", 
            "crazy", 
            "interested", 
            "worried"
        ], 
        [
            "click", 
            "touch", 
            "close", 
            "open"
        ], 
        [
            "receive", 
            "answer", 
            "write", 
            "refuse"
        ], 
        [
            "quickly", 
            "easily", 
            "happily", 
            "slowly"
        ], 
        [
            "on", 
            "at", 
            "in", 
            "for"
        ], 
        [
            "receive", 
            "accept", 
            "take", 
            "bring"
        ]
    ], 
    "answers": [
        "D", 
        "C", 
        "A", 
        "B", 
        "B", 
        "B", 
        "A"
    ], 
    "source": "middle2216"
}