{
    "article": "A group of fifteen-year-olds at a middle school in a town are holding a charity   sale to raise money to _ their classmate Li Xia. Li Xia had cerebral palsy  when she was a baby. _ Li Xia has to use a wheelchair   to help her get around, she never gives up . And she is always ready to help others.\nMany parents have known it from their children and the news has been spread  . Some kind people give her a(n) _ and Li Xia's classmates decided to raise money to show their love for her.\n\"Li Xia has the _ of standing up, but she needs an operation  which will cost lots of money.\" Li Xia's doctor said.\n\"I _ thought that I could stand up one day. Actually the _ is surprising for me. However, when I see my parents are worried about the cost of the operation, I am sad. I am used to my life. I don't _ even if I can't stand up,\" Li Xia said, \"Now my classmates and some other kind people are helping me. I am really thankful. If I stood up one day, I would try my best to help more people.\"\n\"While helping Li Xia, we can also learn a lot. We have learned _ to cook cookies and how to _ them,\" Ma Fang, one of Li Xia's classmates said. \"Now we know making money is not easy, so we won't _ money anymore.\"\nZhang Tong, a boy in Li Xia's class, told a reporter that they could raise about 100 yuan every day. \"We have raised about 2,100 yuan so far. We hope we will raise more money for Li Xia's operation,\" said he.\nLi Xia is very thankful. And she is very _ because so many people are helping her.", 
    "options": [
        [
            "help", 
            "thank", 
            "encourage", 
            "see"
        ], 
        [
            "Since", 
            "Because", 
            "When", 
            "Although"
        ], 
        [
            "gift", 
            "hand", 
            "smile", 
            "idea"
        ], 
        [
            "confidence", 
            "chance", 
            "trouble", 
            "skill"
        ], 
        [
            "never", 
            "often", 
            "really", 
            "nearly"
        ], 
        [
            "dream", 
            "hope", 
            "help", 
            "news"
        ], 
        [
            "forget", 
            "believe", 
            "mind", 
            "doubt"
        ], 
        [
            "where", 
            "why", 
            "when", 
            "how"
        ], 
        [
            "sell", 
            "share", 
            "keep", 
            "enjoy"
        ], 
        [
            "receive", 
            "spend", 
            "waste", 
            "make"
        ], 
        [
            "kind", 
            "excited", 
            "brave", 
            "lucky"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "B", 
        "B", 
        "A", 
        "D", 
        "C", 
        "D", 
        "A", 
        "C", 
        "D"
    ], 
    "source": "middle110"
}