{
    "article": "Raising virtual pets is a popular online game among teenagers.\"More than 20 of my classmates have adopted pets online,  _  last year the number was just 10,\" said Wang, a 15-year-old student. If you go to some websites, you can adopt virtual pets like penguins , chickens, dogs and elephants. You can feed, wash, talk  _  and play with your pet. Dai Yingshuang of Chongqing  _  pets on Kaixin001.com. She said it was great  _  She thinks that by looking after her pet she has also learned how to  take care of  others. But raising an online pet means one needs to  _  a lot of time online. If one doesn't feed and look after the pet, it becomes unhappy and unhealthy. There are  many other  things an online carer must do. Some parents feel  _  They are afraid that their children may be neglecting their studies. Wang Zhaotong of Anhui, has been raising a penguin on QQ.com since last year. The 14-year-old takes good care of the penguin, which is  _  healthy and happy. She said her parents knew about the penguin and think it's okay. \"They believe I can keep the balance between studying and playing,\" said Wang. \"During the school period, I  _  go online and see my penguin at the weekends.\"", 
    "options": [
        [
            "but", 
            "when", 
            "or", 
            "then"
        ], 
        [
            "about", 
            "to", 
            "of", 
            "over"
        ], 
        [
            "buys", 
            "raises", 
            "borrows", 
            "wants"
        ], 
        [
            "fun", 
            "funny", 
            "boring", 
            "frustrating"
        ], 
        [
            "take", 
            "pay", 
            "spend", 
            "cost"
        ], 
        [
            "worried", 
            "happy", 
            "tired", 
            "sad"
        ], 
        [
            "neither", 
            "nor", 
            "both", 
            "either"
        ], 
        [
            "also", 
            "only", 
            "always", 
            "never"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "B", 
        "A", 
        "C", 
        "A", 
        "C", 
        "B"
    ], 
    "source": "middle180"
}