{
    "article": "I played a tennis game against my cousin Ed last week, and I will never forget it.\nI had played a lot of games before, but it was one of the most _ games I've ever had. When Ed first phoned and suggested we play, I _ quietly, thinking I was sure to beat him, because I didn't think Ed could win any games with his fat body.\nAs long as I can remember: Ed's been the least physically fit member in the family, but strangely _ of himself. His big stomach has always ballooned out between his T-shirt and trousers. Although the family often joked about that, Ed _ to buy a larger T-shirt or to lose weight. So when Ed arrived for our game not only with the bottom of his shirt inside his trousers but also with a stomach you could _ notice. I was so surprised that I was speechless.\nMy cousin must have made an effort to get himself into _ . As a result, at the point in our game, when I'd have predicted  I would win the game by 9 to 1, it was _ 7 to 9 --and Ed was leading. The sudden realization was _ . We continued to play like two _ men. When the score was 16 up. I even thought if I could stay alive. When the game finally ended, my cousin and I were lying on the floor on our backs, too tired to move. In some ways, I think that we _ won: I won the game, but Cousin Ed won my respect.", 
    "options": [
        [
            "tiring", 
            "interesting", 
            "moving", 
            "frightening"
        ], 
        [
            "cheered", 
            "screamed", 
            "performed", 
            "smiled"
        ], 
        [
            "proud", 
            "afraid", 
            "shy", 
            "guilty"
        ], 
        [
            "agreed", 
            "wanted", 
            "refused", 
            "afforded"
        ], 
        [
            "nearly", 
            "hardly", 
            "properly", 
            "suddenly"
        ], 
        [
            "size", 
            "shape", 
            "height", 
            "weight"
        ], 
        [
            "like", 
            "between", 
            "around", 
            "instead"
        ], 
        [
            "unknown[", 
            "ungrateful", 
            "unpleasant", 
            "unnecessary"
        ], 
        [
            "mad", 
            "smart", 
            "lucky", 
            "brave"
        ], 
        [
            "none", 
            "either", 
            "both", 
            "neither"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "A", 
        "C", 
        "B", 
        "B", 
        "D", 
        "C", 
        "A", 
        "C"
    ], 
    "source": "middle559"
}