{
    "article": "It was \"Double 11\"yesterday. Many people say it's Bachelor's Day because it's named after the  _  November 11th. For most young singles , it's such a special day that they usually  _  lots of shopping online to celebrate themselves. They are happy because they are free. Whenever the day comes, I think of my parents. I once doubted whether there was  _  between my parents. Every day they were very busy trying to make money for my brother and me. They never act  _  the romantic ways that I read in books or see on TV. In their opinion, \"I love you\" is too  _  for them to say. Sending each other flowers on Valentine's Day is  _  more impossible. Finally Dad became impatient when he was very tired from the hard work. One day, Mum was sewing a quilt . I silently sat down beside her. \"Mom, I have a question to ask you. Is there love between you and Dad?\" Mom stopped  working  and raised her head with surprise in her eyes. She didn't answer at once. I was worried because I thought I had hurt her and didn't know  _  to do. At last she said thoughtfully, \"Look at this thread . Sometimes it appears, but most of it disappears in the quilt. The thread really makes the quilt strong. If life is a quilt, then love should be thread. It can hardly be seen  _  or anytime, but it's really  _  . Love is inside.\" I couldn't understand  _  until the next spring, when Dad suddenly got sick seriously. Mom had to stay with him in the hospital for a month. When they returned, I read the \"love\" in their hearts. After that, every day at dusk , Mom  _  Dad walk slowly on the country road. How  _  I was to see that!. Once I thought love meant flowers, gifts and sweet  _  . But from this experience, I know life a lot  _  . Love is life, it is inside, making life strong and warm.", 
    "options": [
        [
            "season", 
            "date", 
            "time", 
            "month"
        ], 
        [
            "do", 
            "play", 
            "buy", 
            "spend"
        ], 
        [
            "money", 
            "luck", 
            "love", 
            "peace"
        ], 
        [
            "with", 
            "by", 
            "in", 
            "at"
        ], 
        [
            "easy", 
            "quick", 
            "beautiful", 
            "interesting"
        ], 
        [
            "so", 
            "quite", 
            "very", 
            "even"
        ], 
        [
            "how", 
            "where", 
            "when", 
            "what"
        ], 
        [
            "somewhere", 
            "anywhere", 
            "nowhere", 
            "everywhere"
        ], 
        [
            "that", 
            "here", 
            "there", 
            "this"
        ], 
        [
            "him", 
            "you", 
            "them", 
            "her"
        ], 
        [
            "helped", 
            "asked", 
            "advised", 
            "wanted"
        ], 
        [
            "tired", 
            "moved", 
            "interested", 
            "bored"
        ], 
        [
            "looks", 
            "kisses", 
            "foods", 
            "Walks"
        ], 
        [
            "more", 
            "farther", 
            "higher", 
            "longer"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "C", 
        "A", 
        "D", 
        "D", 
        "B", 
        "C", 
        "D", 
        "A", 
        "B", 
        "B", 
        "A"
    ], 
    "source": "middle435"
}