{
    "article": "Once upon a time, a little fish lived in a pond. But she wanted to go to the forest. The pond was deep, and high banks keep it from the view of the forest. Wanting to see the forest, the fish would jump out of water now and then, reaching _ over the pond with the strength of her tail. It seemed to her that, with a little more effort, she could fly, but unfortunately each time she would fall right back into the _ .\nThe fish's mother--a big fish with kind eyes would _ , \"What would you want the forest for? We fish must live in water, and that is the way it is.\"\nThe fish would answer, \"I want to go to the forest and that is my _ . And it must come true.\"\nSo she went to the little fairy  who had been friends with her for her whole life and pleaded , \"Oh little fairy! I have been living in the water all the time. Now I am tired of my small world. I want to see those big trees covered with beautiful flowers, leaves and fruits. I want to meet _ and animals.\"\nTo make her friend happy, the little fairy swung her little wand . The rain started falling on the earth, and a few days later, the forest around the pond was covered with water,\n _ the small pond into a lake. The fish swam to the forest. How _  it was! The fish was very excited because her dream would come true soon.\n\"Hello,\" the fish said to the flowers and the trees. She _ on and saw animals sitting on fallen trees which were sticking out of the water. But as soon as she swam closer to the trees, she saw that all the animals were very sad. \" We are without _ . The water has flooded the whole forest,\" the animals told the fish _ . All this made the fish very unhappy.\n\"I am _ with this rain but my friends--trees and animals are quite unhappy. Oh little fairy! Please _ the rain. I will go back to my pond. I will be more pleased when trees, animals and birds are happy,\" pleaded the fish. The water began to _ , and the animals were very glad and ran off, and the fish _ to the pond and she was happier than ever before.\nThe art of happiness is to serve all. To be really happy, we must think not only of how we can help ourselves, but how we can help others.", 
    "options": [
        [
            "lower", 
            "farther", 
            "higher", 
            "faster"
        ], 
        [
            "land", 
            "pond", 
            "lake", 
            "forest"
        ], 
        [
            "say", 
            "speak", 
            "shout", 
            "laugh"
        ], 
        [
            "way", 
            "dream", 
            "reply", 
            "future"
        ], 
        [
            "friends", 
            "insects", 
            "fish", 
            "birds"
        ], 
        [
            "rushing", 
            "taking", 
            "going", 
            "turning"
        ], 
        [
            "beautiful", 
            "terrible", 
            "quiet", 
            "noisy"
        ], 
        [
            "insisted", 
            "jumped", 
            "walked", 
            "swam"
        ], 
        [
            "food", 
            "water", 
            "sunshine", 
            "idea"
        ], 
        [
            "excitedly", 
            "happily", 
            "hopefully", 
            "sadly"
        ], 
        [
            "unhappy", 
            "happy", 
            "sorry", 
            "busy"
        ], 
        [
            "continue", 
            "stop", 
            "restart", 
            "keep"
        ], 
        [
            "rise", 
            "appear", 
            "fall", 
            "lose"
        ], 
        [
            "went", 
            "came", 
            "returned", 
            "rushed"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "A", 
        "B", 
        "D", 
        "D", 
        "A", 
        "D", 
        "A", 
        "D", 
        "B", 
        "B", 
        "C", 
        "C"
    ], 
    "source": "middle1080"
}