{
    "article": "The Sled   Dog Race was about to begin. Susan's team of dogs was lined up at the starting gate. Susan stood behind them. _ teams were lined up, too, and the dogs were excited. Susan kept her _ on the clock. At exactly ten o'clock, she and the other racers yelled, \"Mush!\" The dogs knew that meant \" _ !\" They ran forward and the race began!  Susan had trained months for this race, and she hoped she and her dogs would win. Day after day, Susan's dogs _ the sled to get ready for the race.\nNow, they ran over snowy hills and _ into deep valleys  . They stopped only to rest and eat. The racers had to go a thousand miles across Alaska. Alaska is one of the _ places on Earth. The dogs' thick fur coats helped keep them warm. In many places along the route , the snow was _ . Pieces of ice were as sharp   as a knife. The ice could cut the dogs' feet. To keep that from happening, Susan had put special boots on their feet.\nAt first, the dogs seemed to pull the sled very slowly. They were _ getting used to the race. On the third day, they began to pull more quickly. They worked as a _ and passed many of the other racers. Once, one of the dogs dropped into a hole and the sled _ . Susan could have given up then, but she didn't. She fixed it and they kept going. When they finally reached the finish line, they found out that they had come in first place!", 
    "options": [
        [
            "Her", 
            "His", 
            "Other", 
            "Another"
        ], 
        [
            "eyes", 
            "hands", 
            "head", 
            "arms"
        ], 
        [
            "Act", 
            "Go", 
            "Walk", 
            "Jump"
        ], 
        [
            "pushed", 
            "carried", 
            "pulled", 
            "drove"
        ], 
        [
            "down", 
            "up", 
            "around", 
            "below"
        ], 
        [
            "wettest", 
            "highest", 
            "lowest", 
            "coldest"
        ], 
        [
            "little", 
            "light", 
            "deep", 
            "high"
        ], 
        [
            "almost", 
            "already", 
            "yet", 
            "still"
        ], 
        [
            "family", 
            "team", 
            "class", 
            "queue"
        ], 
        [
            "failed", 
            "died", 
            "broke", 
            "disappeared"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "B", 
        "C", 
        "A", 
        "D", 
        "C", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "middle256"
}