{
    "article": "Time flies so quickly! We become mature ( ) girls or boys, or at least we _ we are. At the same time, our parents are no longer young.\nThey _ all they have to us but never look forward to getting _ back. When we are ill in bed, it is our parents who look _ us day and night; when we are trying to make progress , it is our parents who are much happier than we are; when we're hungry or cold or sad, it is our parents who _ give us help.\nBut what have we done for our parents? _ we grow up, we have our own ideas and we think we are _ enough to think and act by ourselves, so we usually dislike their care. As a result , sometimes we don't listen to them; even _ with them !\nTo change the _ , we must act at once, letting them know that we love them, too. In doing so, don't hesitate  and don't be _ .Try our best to understand our parents, _ something for our parents and not to make them feel hopeless. In a word, make it a duty to bring _ to our parents, for that's the very sign that we are really mature.\nChildren are parents' _ and we are carrying both our dreams and theirs.\nThe pleasure of our parents is what we should try to do!", 
    "options": [
        [
            "think", 
            "explain", 
            "advise", 
            "affect"
        ], 
        [
            "pass", 
            "give", 
            "show", 
            "take"
        ], 
        [
            "something", 
            "everything", 
            "anything", 
            "nothing"
        ], 
        [
            "for", 
            "like", 
            "at", 
            "after"
        ], 
        [
            "never", 
            "hardly", 
            "seldom", 
            "always"
        ], 
        [
            "If", 
            "Before", 
            "As", 
            "Though"
        ], 
        [
            "careful", 
            "old", 
            "young", 
            "patient"
        ], 
        [
            "quarrel", 
            "help", 
            "begin", 
            "drink"
        ], 
        [
            "choice", 
            "situation", 
            "wisdom", 
            "suggestion"
        ], 
        [
            "energetic", 
            "active", 
            "shy", 
            "modest"
        ], 
        [
            "throw", 
            "ask", 
            "read", 
            "do"
        ], 
        [
            "stress", 
            "money", 
            "happiness", 
            "cheese"
        ], 
        [
            "hope", 
            "award", 
            "task", 
            "Aim"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "C", 
        "D", 
        "D", 
        "C", 
        "B", 
        "A", 
        "B", 
        "C", 
        "D", 
        "C", 
        "A"
    ], 
    "source": "middle2183"
}