{
    "article": "My dad was a fisherman. He worked hard and stayed out until he caught enough  _  to feed the family nearly every day. When the weather was bad he would  _  me to school. An old truck was used in his fishing business. When we got to the school, he would give me a big  _  on the face and tell me to be a good  _  . It was so embarrassing for me. I was 12 years old, and my dad would still kiss me goodbye! I remember the day when I decided I was too  _  for a goodbye kiss. When we got to the school and came to a stop, he had his usual big smile. He started to lean toward me, but I put my hand up and  _  , \"No, Dad.\" It was the first time I had ever talked to him that way. He had a surprised look on his face for a long time, and his  _  started to be wet. He turned and looked out of the windshield . \"You're  _  ,\" he said.\"You are a big boy--a man. I won't kiss you any more.\" It wasn't long after that when my dad went out to  _  and never came back. It was a day when most of the fishermen stayed at home except Dad. He had a big family to feed How I wish I had been a man then. If I had been a man, I would  _  have told my dad I was too old for a goodbye kiss.", 
    "options": [
        [
            "food", 
            "birds", 
            "animals", 
            "fish"
        ], 
        [
            "ride", 
            "carry", 
            "drive", 
            "bring"
        ], 
        [
            "kiss", 
            "laugh", 
            "look", 
            "hand"
        ], 
        [
            "man", 
            "boy", 
            "teacher", 
            "fisherman"
        ], 
        [
            "old", 
            "young", 
            "excited", 
            "moved"
        ], 
        [
            "spoke", 
            "said", 
            "repeated", 
            "answered"
        ], 
        [
            "hands", 
            "feet", 
            "eyes", 
            "face"
        ], 
        [
            "kind", 
            "clever", 
            "wrong", 
            "right"
        ], 
        [
            "school", 
            "sea", 
            "boat", 
            "river"
        ], 
        [
            "still", 
            "ever", 
            "never", 
            "only"
        ]
    ], 
    "answers": [
        "D", 
        "C", 
        "A", 
        "B", 
        "A", 
        "B", 
        "C", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "middle430"
}