{
    "article": "It was raining. I went into a cafe and asked for a cup of coffee.  _ I was waiting for my drink, I realized there were other people in the place, but I sensed  _ . I saw their bodies, but I couldn't feel their souls  because their souls belonged to the  _ .\nI stood up and walked between the tables. When I came to the biggest computer, I saw a thin, small man  _ in front of it . \"I'm Steve ,\" he finally answered after I asked him a couple of times what his name was. \" I  _  talk with you. I'm busy.\" he said. He was chatting online and at the same time, he was playing a computer game - a war game. I was  _ .\n _  didn't Steve want to talk with me? I tried again to speak to that computer geek ,    _ not a word came out of  _  mouth. I touched his shoulder, but no reaction . I was unhappy. I put my hand in front of the monitor , and he started to shout, \"Leave me alone!\"I took a few steps back, wondering if all those people in the cafe were looking at me . I  raised my head and nobody showed any interest .\n At that moment , I realized that people they were having a nice conversation with their machines, not with people. They were more interested in having a relationship with the computer,  _  Steve. I wouldn't want to  _  the future of human beings if they preferred sharing their lives with machines  instead of  people. I was worried and sank  _  my thoughts. I didn't even notice that the coffee was bad , just as Steve didn't notice there was a person next to him.", 
    "options": [
        [
            "Before", 
            "Since", 
            "Although", 
            "While"
        ], 
        [
            "pain", 
            "loneliness", 
            "sadness", 
            "pleased"
        ], 
        [
            "home", 
            "world", 
            "Net", 
            "Cafe"
        ], 
        [
            "sleeping", 
            "laughing", 
            "sitting", 
            "learning"
        ], 
        [
            "can't", 
            "mustn't", 
            "couldn't", 
            "needn't"
        ], 
        [
            "surprised", 
            "happy", 
            "moved", 
            "worried"
        ], 
        [
            "What", 
            "Why", 
            "How", 
            "Who"
        ], 
        [
            "but", 
            "so", 
            "if", 
            "or"
        ], 
        [
            "my", 
            "her", 
            "their", 
            "his"
        ], 
        [
            "especially", 
            "usually", 
            "really", 
            "nicely"
        ], 
        [
            "tell", 
            "plan", 
            "imagine", 
            "design"
        ], 
        [
            "on", 
            "between", 
            "for", 
            "in"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "C", 
        "C", 
        "A", 
        "A", 
        "B", 
        "A", 
        "D", 
        "A", 
        "C", 
        "D"
    ], 
    "source": "middle857"
}