{
    "article": "One summer evening as I was cooking dinner, there was a knock at the door. I  _ it and saw an old man. But his voice was pleasant as he said, \"Good evening. I come to see if you have a _  for just one night. I came for a(n) _  this morning from the eastern part. And there's no bus till next morning.\" He told me he'd been _ for a room but with no success. \"I guess it's my face ... I know it looks terrible, but my doctor says with a few more treatments...\" he said. I told him we would  _ him a bed, but to rest on the porch . I went inside and prepared dinner. When we were _ , I asked him if he would like to _ us. \"No, thank you. I have plenty.\"\nWhen I had finished the dinner, I went out to talk with  _ . It didn't take a long time to see that this old man had an oversized heart crowded into that tiny body. He told me he fished for a living to  _ his daughter, her five children, and her husband, who was hopelessly disabled. At bedtime, we _ a bed in the children's room for him.\nOn his next trip, _ a gift, he brought a big fish I had never seen. In the years he came to stay overnight with us, and there was _ a time he did not  _ us some fish or vegetables from his garden.\nI knew our family will always be _  to have known him. From him we learned what it was to accept the _ without a complaint   and the good with thanks.", 
    "options": [
        [
            "felt", 
            "opened", 
            "repaired", 
            "painted"
        ], 
        [
            "room", 
            "book", 
            "bus", 
            "castle"
        ], 
        [
            "interview", 
            "meeting", 
            "show", 
            "treatment"
        ], 
        [
            "crying", 
            "hunting", 
            "studying", 
            "choosing"
        ], 
        [
            "offer", 
            "borrow", 
            "send", 
            "sell"
        ], 
        [
            "happy", 
            "free", 
            "busy", 
            "ready"
        ], 
        [
            "call", 
            "visit", 
            "join", 
            "invite"
        ], 
        [
            "her", 
            "him", 
            "them", 
            "it"
        ], 
        [
            "expect", 
            "save", 
            "support", 
            "serve"
        ], 
        [
            "put", 
            "planted", 
            "covered", 
            "discovered"
        ], 
        [
            "at", 
            "in", 
            "for", 
            "as"
        ], 
        [
            "always", 
            "never", 
            "ever", 
            "even"
        ], 
        [
            "bring", 
            "water", 
            "desert", 
            "buy"
        ], 
        [
            "beautiful", 
            "thankful", 
            "special", 
            "silent"
        ], 
        [
            "poor", 
            "wounded", 
            "ill", 
            "bad"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "D", 
        "B", 
        "A", 
        "D", 
        "C", 
        "B", 
        "C", 
        "A", 
        "D", 
        "B", 
        "A", 
        "B", 
        "D"
    ], 
    "source": "middle881"
}