{
    "article": "Homesick is a compound word made up of \"home\" and \"sick\". You know  _  each word means on its own, of course. But think about what the words mean when they are  _  together. \"Homesick\" means \"Thinking of home, unhappy away from home.\" In other words, it means \"sick for home\". Now think for a minute  _  the word SEASICK. If you change the word \"home\" in the definition to the word \"sea\", would the definition  _  \"seasick\" ? Does seasick mean \"thinking of sea, unhappy away from sea\"? It means something quite  _  . Seasick means \"made sick by the only place where you are on the sea.\" It means \"sick because of the sea.\" When you are homesick, the only place you want to be is at home. When you are seasick, the  _  place you want to be is at sea. Have you ever  heard of  a person being heartsick? Heartsick does not mean that something is wrong with a person's heart. People are heartsick when they are  _  down deep inside as if their hearts are broken. And so, when you are carsick, you are \"made sick by the movement of a car on the road.\" You are sick because of the car, not sick for it. You can see, then, that  not all  compound words are what they seem at first glance . Think about the compound words, such as handshake and  _  . Perhaps you may write definitions for them. It must be helpful to know something like this in your English study.", 
    "options": [
        [
            "what", 
            "that", 
            "which", 
            "who"
        ], 
        [
            "read", 
            "used", 
            "thought", 
            "understood"
        ], 
        [
            "for", 
            "from", 
            "about", 
            "like"
        ], 
        [
            "fit", 
            "read", 
            "get", 
            "have"
        ], 
        [
            "different", 
            "same", 
            "right", 
            "wrong"
        ], 
        [
            "first", 
            "only", 
            "safe", 
            "last"
        ], 
        [
            "hit", 
            "hurt", 
            "loved", 
            "moved"
        ], 
        [
            "careful", 
            "southern", 
            "illness", 
            "handwriting"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "C", 
        "A", 
        "A", 
        "D", 
        "B", 
        "D"
    ], 
    "source": "middle1486"
}