{
    "article": "Ian Scott Wilson, 13, studies at a middle school in the US. He thinks kids don't  _  enough respect from the grown-up world. \"Kids are usually ignored by adults\" he said. \"They say: 'That's a  _  idea. You can't do that.'\". That's why he took part in a national  _  for student made documentaries. He wanted to be heard. A documentary is a film or TV show that  _  a serious issue. Ian had never made one and wanted to try. Ian made a  _  film about problems at Walter Reed, a hospital in Washington. He won first  _  in the competition for middle school students. Walter Reed is taking care of many injured  _  of the Iraq war earlier this year, reports said that the hospital had problems. For example, some said the rooms were  _  . Ian paid much attention  _  the issue because his 23-year-old brother is a soldier in Iraq. \"I thought about how terrible it would be  _  these things happened to my brother,\" Ian said. \"It was that feeling that helped make Ian's film  _  out\", said Joanne Wheeler. Wheeler helped run the competition. \"Ian was very passionate, but he was  _  a good listener.\" Ian interviewed 100 people for the  _  . He reported on what was wrong. But he also  _  on efforts to deal with the problems. Ian got a prize of $1,000. He decided to give the money to an  _  soldier staying in the hospital.", 
    "options": [
        [
            "get", 
            "take", 
            "make", 
            "release"
        ], 
        [
            "good", 
            "silly", 
            "surprising", 
            "exciting"
        ], 
        [
            "meeting", 
            "competition", 
            "lecture", 
            "interview"
        ], 
        [
            "talks", 
            "tells", 
            "says", 
            "speaks"
        ], 
        [
            "10-minute", 
            "10-minutes", 
            "10-minute's", 
            "10-minutes'"
        ], 
        [
            "room", 
            "place", 
            "area", 
            "price"
        ], 
        [
            "doctors", 
            "nurses", 
            "soldiers", 
            "engineers"
        ], 
        [
            "clean", 
            "unclean", 
            "polite", 
            "impolite"
        ], 
        [
            "on", 
            "in", 
            "to", 
            "at"
        ], 
        [
            "if", 
            "so", 
            "when", 
            "while"
        ], 
        [
            "take", 
            "put", 
            "work", 
            "stand"
        ], 
        [
            "also", 
            "either", 
            "both", 
            "all"
        ], 
        [
            "contest", 
            "hospital", 
            "agreement", 
            "film"
        ], 
        [
            "reported", 
            "wrote", 
            "put", 
            "held"
        ], 
        [
            "ill", 
            "injured", 
            "amazing", 
            "interesting"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "B", 
        "B", 
        "A", 
        "B", 
        "C", 
        "B", 
        "C", 
        "A", 
        "D", 
        "A", 
        "D", 
        "C", 
        "B"
    ], 
    "source": "middle960"
}