{
    "article": "As an exchange student, I have been staying in a host family in Beijing for the past five months. The parents are  _  in their mid-30s and the son just turned 5. In exchange for room and board, I teach their son  _  . Like in many of the other Chinese families, he's an only child. And though he has  hundreds of  plastic trucks and boxes full of crayons, I don't know  _  he has the time to play. When he's not in the kindergarten, he's taking after-school classes. On the weekends, the boy goes to more classes. He has one day off--Sunday. Compared to his schedule, I feel like my childhood was  _  a waste of time. I learned how to climb trees and draw cartoons. I wasn't learning Chinese at his age. But he and lots of other children are learning English. Both his parents dream that he will have  _  jobs, higher pay, and bigger houses. The boy seems to take no interest  _  learning English. He doesn't need a teacher, but a playmate. He is,  after all  , only 5. When I think about my life as a 5-year-old, I know for sure I wasn't half as  _  as he is. In the evening, when his parents  _  him to speak with me in English, he gets  _  . He lies on the floors, hides under the table and climbs on the furniture. When he finally stops  moving  , and starts talking, it isn't in English, but it isn't in Chinese,  either  . He speaks in his own language. He  _  not be a very good student, but I'm not a great teacher. I just want to be his big brother  _  can speak in gibberish with him and help draw trucks, robots or spiders.", 
    "options": [
        [
            "both", 
            "all", 
            "either", 
            "none"
        ], 
        [
            "drawing", 
            "Chinese", 
            "English", 
            "playing"
        ], 
        [
            "when", 
            "what", 
            "where", 
            "that"
        ], 
        [
            "hardly", 
            "never", 
            "usually", 
            "almost"
        ], 
        [
            "more", 
            "fewer", 
            "better", 
            "worse"
        ], 
        [
            "with", 
            "in", 
            "for", 
            "on"
        ], 
        [
            "busily", 
            "busiest", 
            "busier", 
            "busy"
        ], 
        [
            "make", 
            "push", 
            "have", 
            "let"
        ], 
        [
            "frustrated", 
            "relaxed", 
            "pleased", 
            "injured"
        ], 
        [
            "can", 
            "may", 
            "must", 
            "need"
        ], 
        [
            "who", 
            "whom", 
            "whose", 
            "which"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "A", 
        "D", 
        "C", 
        "B", 
        "D", 
        "B", 
        "A", 
        "B", 
        "A"
    ], 
    "source": "middle685"
}