{
    "article": "In Singapore, many middle school students spend a lot of time on their studies. Many of them try their best  to get  good marks in the exams. They have a lot of homework every day, and the exam is a big headache. In their mind, good  _  is the ticket to success in the future. Singaporean students study hard, but they have a lot of fun after class. Do you want to know what  _  they like to do after class? They can  take part in  all kinds of sports and games, music and dance, hiking and rock-climbing. They are also very active in community service. In their free time, most students like to listen to pop music. Hollywood movies are very popular with them. They also like movies  made  in Hong Kong and Singapore because they understand them very well. Some students  _  their free time surfing the Internet,  _  e-mails to their friends and playing computer games.  _  they also go to shopping centers and big bookstores. They are really good places to  _  . So as a middle school student, living in Singapore is not easy, but it is  _  . Dear students, what about your school life? Please write something about it.", 
    "options": [
        [
            "memory", 
            "health", 
            "friend", 
            "education"
        ], 
        [
            "jobs", 
            "activities", 
            "choices", 
            "abilities"
        ], 
        [
            "pay", 
            "spend", 
            "cost", 
            "take"
        ], 
        [
            "sending", 
            "receiving", 
            "playing", 
            "getting"
        ], 
        [
            "Never", 
            "Sometimes", 
            "Hardly", 
            "Seldom"
        ], 
        [
            "relax", 
            "stop", 
            "travel", 
            "walk"
        ], 
        [
            "boring", 
            "difficult", 
            "colorful", 
            "hard"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "B", 
        "A", 
        "B", 
        "A", 
        "C"
    ], 
    "source": "middle816"
}