{
    "article": "During my high school time, I often wondered why I had to sit beside such a strange guy. He always had a pair of glasses as _  as the bottom of a beer bottle on his nose. Being a rather plain boy, Freeman never dresses neatly. He had thousands of bad  _  ----sucking fingers, eating pieces of paper and biting pencil ends, to name a few.\nUnfortunately, both of us were interested in reading  _ . When we came to this field,  _  seemed to have no end. We often put aside all the other homework to read a new novel and, of course, tried our best to win the arguments  between us. I couldn't agree more that we must be born rivals  and I was quite certain that he felt  the same .\nSoon after, Freeman and I were both to  enter  a writing competition. Besides being interested, I  also  thought it was an opportunity to  _  him and let him admire me. So I made a good  _  for it. But things didn't go as well as I'd thought. It turned out that Freeman won the first prize  _  I only got the second. I felt so  _  that I just wanted to run away as soon as he came into my sight,  _  I was afraid he'd be proud enough to make fun of me. To my great  _ , he said nothing about the competition but _  talking with me about a new book as usual. After a while, I couldn't help asking what he thought of the  _  and his answers really impressed me a lot. \"Compared to winning a prize, the process  of writing is more enjoyable,\" he said lightly.\nFrom that day on, I gradually came to like my deskmate.", 
    "options": [
        [
            "clear", 
            "thin", 
            "cool", 
            "thick"
        ], 
        [
            "names", 
            "habits", 
            "hobbies", 
            "interests"
        ], 
        [
            "papers", 
            "magazines", 
            "novels", 
            "newspapers"
        ], 
        [
            "discussion", 
            "work", 
            "study", 
            "job"
        ], 
        [
            "help", 
            "win", 
            "beat", 
            "attack"
        ], 
        [
            "plan", 
            "speech", 
            "preparation", 
            "decision"
        ], 
        [
            "when", 
            "because", 
            "while", 
            "though"
        ], 
        [
            "ashamed", 
            "happy", 
            "angry", 
            "excited"
        ], 
        [
            "and", 
            "but", 
            "so", 
            "because"
        ], 
        [
            "joy", 
            "disappointment", 
            "happiness", 
            "surprise"
        ], 
        [
            "avoided", 
            "kept", 
            "wanted", 
            "stopped"
        ], 
        [
            "book", 
            "result", 
            "question", 
            "writing"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "C", 
        "A", 
        "C", 
        "C", 
        "C", 
        "A", 
        "D", 
        "D", 
        "B", 
        "B"
    ], 
    "source": "middle400"
}