{
    "article": "World Book Day falls on April 23 every year. It was set up by UNESCO   in 1955 to encourage people, especially teenagers, to find the pleasure of _ .\nMany countries celebrate World Book Day. On that day in the UK, millions of students can buy _ of special price, much  higher  than usual in any bookstore. It has been done every year since 1998. World Book Day is also celebrated in China. Premier Wen Jiabao does lots of reading _ he's very busy. On World Book Day 2009, he _ people to do more reading. He suggested that young people should spend more time reading. \"Books can't change the world, but people can change the world by changing _ through reading,\" he said. Reading can benefit   people in any way . Reading _ us become more knowledgeable and more intelligent. . Reading _ us with information about other culture and places of the world. When we read, we may find many _ that we don't understand.We would have to use our brain  to think about them or do more reading to find out the answers. The more we read, the more we know. The more we know, the  _  we become. Reading is also one of the most important ways to learn a foreign language _ English. We all know that we can't learn everything at school, for example, the ways English people are speaking and writing today.\n\"Reading makes a full man.\" Books, magazines, newspapers and other kinds of reading materials can help to know more about the outside world and perfect us. Therefore , it is necessary for us to form the habit of reading every day.", 
    "options": [
        [
            "listening", 
            "speaking", 
            "reading", 
            "writing"
        ], 
        [
            "clothes", 
            "dictionaries", 
            "computers", 
            "books"
        ], 
        [
            "because", 
            "though", 
            "through", 
            "when"
        ], 
        [
            "allowed", 
            "ordered", 
            "encouraged", 
            "introduced"
        ], 
        [
            "ourselves", 
            "yourselves", 
            "themselves", 
            "itself"
        ], 
        [
            "help", 
            "helps", 
            "helped", 
            "helping"
        ], 
        [
            "shares", 
            "gets", 
            "opens", 
            "provides"
        ], 
        [
            "things", 
            "thing", 
            "something", 
            "anything"
        ], 
        [
            "Outstanding", 
            "prettier", 
            "cleverer", 
            "Outgoing"
        ], 
        [
            "like", 
            "at", 
            "about", 
            "towards"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "B", 
        "C", 
        "C", 
        "B", 
        "D", 
        "A", 
        "C", 
        "A"
    ], 
    "source": "middle796"
}