{
    "article": "It was Friday. Andy Barton was in a bad mood . At six o'clock his  _  programme, \"Travel with us\", was on TV. Andy liked to get home in  _  for that. But then, just as he was leaving his office a little earlier , a customer rang up with a few complaints for the next fifteen minutes. \"I can  _  get home in time if I hurry,\" Andy told himself as he  _  out of the office. As he drove off in his car, he  _  that he was almost out of petrol . \"I'll have to stop at Fenton's\", Andy thought. He  _  Fenton's because it was a self-service petrol station. \"You do all the work yourself, but you pay  the same  for the petrol,\" he used to complain. At Fenton's, the pump was not working properly and it  _  much time to get petrol. So when Andy got home, it was already two minutes past six. Just then the phone rang. \"Shall I answer it?\" Andy thought. He tried to  _  his attention on the programme and forget the phone. But it kept ringing and finally he picked it up. \"Mr Barton?\"  a voice  said. \"Fenton's Garage here.\"\"Fenton's?\" Andy said. \"Why, I was at your place only a few minutes ago, getting some petrol. Did I  _  something behind or what?\" \"No, you didn't, Mr Barton.\" And the voice went on. \"That's just the  _  ! You went off without paying for your petrol, you  _  ! Now normally, when that happens, we ring up the police. But Luckily I knew you and I know it was a  _  .\" \"I'm really very sorry,\" Andy said. \"Oh, that's all right, Mr Barton. But could you  _  round now and pay for your petrol? And please hurry! We close at half past six!\"", 
    "options": [
        [
            "favourite", 
            "funny", 
            "popular", 
            "lovely"
        ], 
        [
            "chance", 
            "time", 
            "seat", 
            "spirit"
        ], 
        [
            "surely", 
            "obviously", 
            "normally", 
            "still"
        ], 
        [
            "stepped", 
            "climbed", 
            "looked", 
            "rushed"
        ], 
        [
            "observed", 
            "noticed", 
            "thought", 
            "suggested"
        ], 
        [
            "hated", 
            "liked", 
            "meant", 
            "promised"
        ], 
        [
            "cost", 
            "spent", 
            "took", 
            "spared"
        ], 
        [
            "draw", 
            "pay", 
            "fix", 
            "force"
        ], 
        [
            "lose", 
            "leave", 
            "forget", 
            "destroy"
        ], 
        [
            "trouble", 
            "worry", 
            "excuse", 
            "reason"
        ], 
        [
            "remember", 
            "see", 
            "do", 
            "drive"
        ], 
        [
            "mistake", 
            "joke", 
            "trick", 
            "truth"
        ], 
        [
            "look", 
            "come", 
            "show", 
            "turn"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "D", 
        "D", 
        "B", 
        "A", 
        "C", 
        "C", 
        "B", 
        "A", 
        "B", 
        "A", 
        "B"
    ], 
    "source": "middle2117"
}