{
    "article": "On the first day of school our teacher let us know someone. Looking out, we found an old woman appeared at the door. She said, \"Hi, my name is Susan, I'm seventy years old.\" While we were  _  what made her take this challenge at her age, she said with a smile, \"I/m here to meet a rich husband, get  _  , have two children and travel together. \"Hearing this, all of us laughed. \"In fact,\" she went on, \" I always  _  of having a college education, and now I'm getting one!\" After class we had chocolate and milk together. We became good  _  . I often listened to this \"time machine\" as she shared her study with me. At the end of the term we invited Susan to give us a  _  . When she was stepped up to the front, suddenly she found she took the wrong paper. She felt a little frustrated and said, \"I'm sorry. I'm so nervous that I can't get my ready talk back , so I have to tell you  _  I know. \"In her speech she told us, \"We don't stop playing as we are old, we grow old because we stop playing. The secret of staying  _  , being happy and getting success is that we should laugh and find something  _  every day. I think there is a great  _  between growing old and growing up. I am seventy now. If I lie in bed for one full year and never do anything, I'll become seventy - one. Since anybody can grow older, my idea is to grow up by always finding the chance in change. Growing older can't be avoided , growing up can be  _  , It's never too late to be all you can be possible. \" During the four years' study, it was so easy for Susan to make friends wherever she went. In the end, the wonderful woman got a college degree.", 
    "options": [
        [
            "finding", 
            "getting", 
            "wanting", 
            "wondering"
        ], 
        [
            "married", 
            "worried", 
            "excited", 
            "relaxed"
        ], 
        [
            "liked", 
            "made", 
            "knew", 
            "dreamed"
        ], 
        [
            "teachers", 
            "friends", 
            "students", 
            "neighbours"
        ], 
        [
            "lesson", 
            "present", 
            "talk", 
            "story"
        ], 
        [
            "which", 
            "how", 
            "what", 
            "why"
        ], 
        [
            "old", 
            "young", 
            "clear", 
            "awake"
        ], 
        [
            "natural", 
            "difficult", 
            "interesting", 
            "possible"
        ], 
        [
            "difference", 
            "chance", 
            "pleasure", 
            "confidence"
        ], 
        [
            "noticed", 
            "chosen", 
            "thought", 
            "mentioned"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "D", 
        "B", 
        "C", 
        "C", 
        "B", 
        "C", 
        "A", 
        "B"
    ], 
    "source": "middle971"
}