{
    "article": "Why am I bringing a 10-pound (4.5kg) pumpkin upstairs? Why am I washing it? Why am I cutting it with a big _ ? Why am I carving   a Jack O'Lantern?\nOctober 31 is _ . During this holiday kids _ on people's doors asking for sweets. There are orange and black things in the houses. Jack O'Lanterns are one of these things! People carve them out of empty _ .\nA lot of houses don't carve Jack O'Lanterns. They just have fake   _ . It's _ to buy a fake one, and a fake Jack O'Lantern doesn't go _ .\nNot me! I am going to make the _ thing. I am going to carve a face on a pumpkin!\nThe first thing for me to do is to _ the pumpkin. It has lots of dirt on it. Then I have to cut open the top and take out the inside.\nThis is not easy. It takes two hours to _ out the inside with a big knife. I _ the seeds, as they can be eaten. I cut three triangles   in the side. Two triangles will be the eyes, and the other is a nose. At the _ I cut out a mouth. I am so _ of my work. I take it outside.\nThree days later, the inside goes gray. A few days after that, the thing is black. The pumpkin is going bad! By Halloween, the Jack O'Lantern will be _ ! I should have got a fake one.", 
    "options": [
        [
            "scissor", 
            "knife", 
            "spoon", 
            "fork"
        ], 
        [
            "Easter", 
            "Thanksgiving", 
            "Halloween", 
            "Christmas"
        ], 
        [
            "knock", 
            "shut", 
            "hit", 
            "paint"
        ], 
        [
            "pumpkins", 
            "watermelons", 
            "potatoes", 
            "stones"
        ], 
        [
            "thing", 
            "things", 
            "one", 
            "ones"
        ], 
        [
            "different", 
            "easy", 
            "difficult", 
            "unusual"
        ], 
        [
            "away", 
            "bad", 
            "wrong", 
            "by"
        ], 
        [
            "real", 
            "true", 
            "correct", 
            "right"
        ], 
        [
            "cut", 
            "carve", 
            "wash", 
            "weigh"
        ], 
        [
            "pick", 
            "look", 
            "empty", 
            "find"
        ], 
        [
            "plant", 
            "collect", 
            "save", 
            "keep"
        ], 
        [
            "top", 
            "left", 
            "bottom", 
            "right"
        ], 
        [
            "glad", 
            "proud", 
            "angry", 
            "confident"
        ], 
        [
            "broken", 
            "gone", 
            "dead", 
            "lost"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "A", 
        "D", 
        "B", 
        "B", 
        "A", 
        "C", 
        "C", 
        "D", 
        "C", 
        "B", 
        "B"
    ], 
    "source": "middle1564"
}