{
    "article": "The Read family comes to a new big city, but Mrs. Read's son, Bob is not happy. He doesn't have anyone to play with. \"Don't _ !\" says his mother, \"You will soon make friends here.\" One morning, there is a _ at the door. Bob's mother, Mrs. Read, opens it. There, stands a woman with brown hair. It is Mrs. Miller. She comes to borrow some _ . She wants to _ cakes. Mrs. Read gives her two. In the afternoon, there is another knock at the door, Mrs. Read opens it and sees a boy _ there. \" My name is Jack Miller,\" he days, \"My mother sends you this cake and the two eggs.\" \"Well, thank you, Jack.\" says Mrs. Read, \" Come in   and meet my son Bob.\" Look ! Bob and Jack are having cake and milk. They are playing football. Now they are  _ ! Jack says, \"I'm glad you live next door.\" Bob says , \" I must thank your mother for coming to _ eggs. \" Jack laughs and tells Bob, \"My mother doesn't want the two eggs, but she wants to make friends _ your mother. \" Bob says, \"That's a funny way to make friends. It's a(n) _ way, too. It can work!\" Only if you're willing to make friends can you always find some ways!", 
    "options": [
        [
            "worry", 
            "afraid", 
            "excite", 
            "interest"
        ], 
        [
            "shout", 
            "cry", 
            "knock", 
            "bark"
        ], 
        [
            "cakes", 
            "desks", 
            "milk", 
            "eggs"
        ], 
        [
            "cook", 
            "pay", 
            "ask", 
            "make"
        ], 
        [
            "lifting", 
            "sitting", 
            "standing", 
            "lying"
        ], 
        [
            "classmates", 
            "enemies", 
            "friends", 
            "brothers"
        ], 
        [
            "lend", 
            "borrow", 
            "give", 
            "take"
        ], 
        [
            "into", 
            "to", 
            "after", 
            "with"
        ], 
        [
            "easy", 
            "difficult", 
            "foolish", 
            "bad"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "D", 
        "D", 
        "C", 
        "C", 
        "B", 
        "D", 
        "A"
    ], 
    "source": "middle958"
}