{
    "article": "Dear Jenny, How's it going? Are you busy with your study these days? I've been back at school  _  nearly four weeks. I'm very glad to tell you that great  _  have taken place in our school this term. First of all, we're asked to \"clear our plates\" when having our meals and say  _  to wasting. Some of us used to order more than what we could eat. That was a big waste of food. Now we need to  _  the food we order. We should also stop wasting in some other ways. For example, we should turn off the lights when we  _  the classroom. And our school has opened up some fields for us to learn how to grow vegetables. Each class is given a small garden and our class has decided to grow some tomatoes and beans( ) in our  _  time. I think that'll be very interesting. Maybe I'll be able to  _  you some beans we've grown by ourselves next time! What's more, we have only two classes in the afternoon  _  we have more time for after-school activities. I'm one of the traffic safety volunteers in our school. After school, we take turns to go to the streets near our school and ask people to  _  the traffic rules. I think we are having a different school life now! Please write back soon and tell  _  more about your school. Yours, Wang Wei", 
    "options": [
        [
            "for", 
            "on", 
            "at", 
            "in"
        ], 
        [
            "things", 
            "interests", 
            "lessons", 
            "changes"
        ], 
        [
            "hello", 
            "yes", 
            "thanks", 
            "no"
        ], 
        [
            "clean", 
            "finish", 
            "cook", 
            "pay"
        ], 
        [
            "reach", 
            "leave", 
            "open", 
            "build"
        ], 
        [
            "busy", 
            "sad", 
            "happy", 
            "free"
        ], 
        [
            "plant", 
            "buy", 
            "lend", 
            "send"
        ], 
        [
            "because", 
            "so", 
            "before", 
            "when"
        ], 
        [
            "break", 
            "make", 
            "follow", 
            "think"
        ], 
        [
            "him", 
            "her", 
            "me", 
            "you"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "D", 
        "B", 
        "B", 
        "D", 
        "D", 
        "B", 
        "C", 
        "C"
    ], 
    "source": "middle230"
}