{
    "article": "I sat with my friend in a well-known coffee shop. As we enjoyed our coffee, a man entered and sat down beside us. He called the waiter and ordered, \"Two cups of coffee, _ of them there on the wall.\" We heard this with great _ and saw that he was served with one cup of coffee but he paid for two. As soon as he left, the waiter _ put a piece of paper on the wall saying \"A Cup of Coffee\". While we were still there, two other men had two cups of coffee but paid for three. _ , the waiter did the same thing. It seemed that this was usual at this place. However, it was something strange for us. Since we had nothing to do with the _ , we finished our coffee, paid and left.\nAfter a few days, we again had a _ to go to this coffee shop. While we were enjoying our coffee, a man entered. The way this man was dressed did not match the _ of this coffee shop. As he seated himself, he looked at the wall and said, \"One cup of coffee from the wall.\" The waiter served coffee to this man with the same _ . The man had his coffee and left without paying. The waiter took off a piece of paper from the _ and threw it in the dust bin. Now there was no _ for us. The great kindness for the people in need shown by the people of this town filled up our eyes with tears.", 
    "options": [
        [
            "both", 
            "neither", 
            "one", 
            "none"
        ], 
        [
            "joy", 
            "interest", 
            "effort", 
            "fear"
        ], 
        [
            "quickly", 
            "suddenly", 
            "wisely", 
            "properly"
        ], 
        [
            "Instead", 
            "Again", 
            "Indeed", 
            "Anyway"
        ], 
        [
            "shop", 
            "waiter", 
            "matter", 
            "men"
        ], 
        [
            "hurry", 
            "time", 
            "wish", 
            "chance"
        ], 
        [
            "style", 
            "standard", 
            "furniture", 
            "colour"
        ], 
        [
            "respect", 
            "courage", 
            "result", 
            "custom"
        ], 
        [
            "board", 
            "table", 
            "bill", 
            "wall"
        ], 
        [
            "choice", 
            "clue", 
            "doubt", 
            "hope"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "A", 
        "B", 
        "C", 
        "D", 
        "B", 
        "A", 
        "D", 
        "C"
    ], 
    "source": "middle1580"
}