{
    "article": "A game of catch is simply two people throwing a ball back and forth . It seems a little _ and many people may not be interested in it. The two people are close enough to talk, but too far to touch. They might have baseball gloves, or they  might use their hands.\nIn fact, playing catch is part of _ practice--to make you get used to using a ball and glove. But any American kid will teach you it's much more than that. Playing catch is a time for kids to _ with your father. It's a time when there's _ to worry about except catching a ball. It's a time when words move as seamlessly  as the ball itself, back and forth, easy and relaxing. It's an excuse to _ time together.\nBecause baseball is an American sport, and a big part of being American, playing catch is kind of an all-American dad activity. In the suburbs , most people have backyards -- not _ enough to play baseball in, but just big enough for a game of  catch. Those who have no _ can play in the street or in the park.\nWhen adults are asked to talk about the good _ of their dads, many of them will say something about playing catch. Why?  Probably because dads are usually very _ . A catch game is a time that is only for one thing. This is a time when a kid has her dad's _ . There is no work, no phone and no other people around to take your dad away from you. For the time that it takes to play a game of catch, your dad is all yours.", 
    "options": [
        [
            "interesting", 
            "boring", 
            "amazing", 
            "exciting"
        ], 
        [
            "basketball", 
            "baseball", 
            "football", 
            "volleyball"
        ], 
        [
            "fight", 
            "compare", 
            "have", 
            "be"
        ], 
        [
            "nothing", 
            "something", 
            "everything", 
            "anything"
        ], 
        [
            "waste", 
            "save", 
            "spend", 
            "forget"
        ], 
        [
            "small", 
            "large", 
            "clean", 
            "tidy"
        ], 
        [
            "time", 
            "money", 
            "yards", 
            "friends"
        ], 
        [
            "jobs", 
            "achievement", 
            "education", 
            "memories"
        ], 
        [
            "busy", 
            "brave", 
            "strict", 
            "kind"
        ], 
        [
            "help", 
            "worry", 
            "courage", 
            "attention"
        ]
    ], 
    "answers": [
        "B", 
        "B", 
        "D", 
        "A", 
        "C", 
        "B", 
        "C", 
        "D", 
        "A", 
        "D"
    ], 
    "source": "middle1152"
}