{
    "article": "\"Mommy,  look!\" cried my daughter,  Darla,  pointing to a chicken hawk in the air.\n\"Uh huh, \" I answered,  driving,  lost in thought about the timetable of my day.\n _ filled her face.\n\"What's the matter,  sweetheart?\" I asked.\n\"Nothing, \" my seven-year-old daughter said. The moment was gone.\nDinner,  baths and phone calls _ the hours until bedtime.\n\"Come on,  Darla,  time for bed!\" She raced past me up the stairs. Tired,  I kissed her and tucked her in.\n\"Mom,  I forgot to give you something!\" she said.\n\"Give it to me in the morning.\" I said. My _ was gone. I could hardly stay cool.\n\"You won't have time in the morning!\" she talked back quickly.\n\"I'll take time, \" I answered. Sometimes no matter how hard I tried,  time was never enough.\nShe wasn't ready to _ up yet. \"No,  you won't! It will be just like today when I told you to look at the chicken hawk. You didn't _ listen to what I said.\"\nI was too tired to argue; she hit too _ to the truth. \"Good night!\" I shut her door in anger.\nLater though,  her gray-blue eyes filled my vision as I thought about how little time we really had until she was grown and gone. My husband asked me what was going on and I told him.\n\"Maybe she was not asleep yet. Why don't you _ ?\" he said.\nI followed his advice, _ it was my own idea. I opened her door gently. In Darla's hand I could see her paper all crumpled   up. She had torn into small pieces a big red heart with a poem she had written titled,  \"Why I Love My Mother?\"\nWhy I Love My Mother\nAlthough you're busy, and you work so hard,\nYou always take time to play with me,\nI love you Mommy,\nBecause I am the biggest part of your busy day!\nTears filled my eyes. When I softly touched her face,  she awakened from a dreamless sleep and asked,  \"Why are you _ ,  Mommy?\"\n\"You ARE the most important part of my busy day!\"\nShe smiled and then went back to sleep,  not really understanding how strongly I  _ what I said.", 
    "options": [
        [
            "Disappointment", 
            "Worries", 
            "Fear", 
            "Enjoyment"
        ], 
        [
            "cost", 
            "filled", 
            "lasted", 
            "took"
        ], 
        [
            "belief", 
            "attitude", 
            "attention", 
            "patience"
        ], 
        [
            "give", 
            "build", 
            "call", 
            "clear"
        ], 
        [
            "just", 
            "even", 
            "yet", 
            "almost"
        ], 
        [
            "heavily", 
            "badly", 
            "close", 
            "hard"
        ], 
        [
            "watch", 
            "exam", 
            "test", 
            "check"
        ], 
        [
            "realizing", 
            "thinking", 
            "wishing", 
            "guessing"
        ], 
        [
            "crying", 
            "laughing", 
            "shouting", 
            "touching"
        ], 
        [
            "considered", 
            "expressed", 
            "inferred", 
            "meant"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "D", 
        "A", 
        "B", 
        "C", 
        "D", 
        "C", 
        "A", 
        "D"
    ], 
    "source": "middle1391"
}