{
    "article": "A young woman was driving alone through the country. It was getting dark and raining. Suddenly she saw an old woman by the side of the road, holding her hand out as if  she needed a lift .\n\"I can't _ her out in this weather,\" the woman said to herself, so she stopped the car and opened the door.\n\"Do you want a lift?\" she asked. The old woman nodded and climbed into the car. After a while, she said to the old woman, \"Do you wait for a long time?\" The old woman shook her head. \"Strange,\" thought the young woman. She tried again, \"Bad weather for the time _ year,\" she said. The old woman nodded. Although  the driver tried some more, the lady said _ except  for a nod of the head or something else.\nThen the young woman _ the lady's hands, they were very large and with thick hair. Suddenly, she knew the lady was a _ ! She stopped the car. \"I can' t see that mirror  _ ,\" she said, \"Please clean it for me, will you?\" The lady nodded and opened the door.\nAs soon as the lady was out of the car, the woman drove off quickly. When she got to the next village, she _ . She found that the old lady left a handbag behind. She picked it up and opened it. She gave out a deep breath . Inside the bag was a gun !", 
    "options": [
        [
            "throw", 
            "leave", 
            "make", 
            "let"
        ], 
        [
            "out", 
            "off", 
            "in", 
            "of"
        ], 
        [
            "nothing", 
            "anything", 
            "something", 
            "everything"
        ], 
        [
            "searched", 
            "knew", 
            "saw", 
            "looked"
        ], 
        [
            "boy", 
            "girl", 
            "woman", 
            "man"
        ], 
        [
            "quickly", 
            "clearly", 
            "carefully", 
            "slowly"
        ], 
        [
            "feared", 
            "slept", 
            "stood", 
            "stopped"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "A", 
        "C", 
        "D", 
        "B", 
        "D"
    ], 
    "source": "middle446"
}