{
    "article": "Pets are a part of people's life. If you are like most people  _  have pets, you care for them as if they were your children. Meeting their needs is a(n)  _  part of your day, because you want them to have everything they need. One thing they need but cannot tell you about is  _  . Many pet  _  put on animals' music because this helps their pets to feel  _  when they are gone. Most people are  at work  throughout the day, leaving their pets  _  at home. To make your pets feel comfortable and safe, you could try putting on music before you  leave  the house. You might have to  change  music to see what type works for your pet. If you just want to keep your pet calm, you will need to play  _  music instead of rock or hip-hop music, which might  _  your pet. Also, you need to know that different pets act  differently  to music. Hard rock music has also been found to work  _  to calm some pets, as well as piano music.  _  piano music works well on most animals, it works best on cats. Playing music is also a great idea for people with  _  pets. They can have such a difficult time getting used to their new environment that they need all the help.", 
    "options": [
        [
            "which", 
            "who", 
            "whom", 
            "whose"
        ], 
        [
            "small", 
            "difficult", 
            "Important", 
            "unimportant"
        ], 
        [
            "food", 
            "money", 
            "music", 
            "interest"
        ], 
        [
            "owners", 
            "scientists", 
            "shops", 
            "projects"
        ], 
        [
            "sadder", 
            "angrier", 
            "worse", 
            "better"
        ], 
        [
            "aloud", 
            "awake", 
            "alone", 
            "asleep"
        ], 
        [
            "noisy", 
            "hard", 
            "loud", 
            "soft"
        ], 
        [
            "interest", 
            "annoy", 
            "worry", 
            "entertain"
        ], 
        [
            "badly", 
            "well", 
            "hard", 
            "closely"
        ], 
        [
            "Though", 
            "Until", 
            "Because", 
            "Since"
        ], 
        [
            "big", 
            "old", 
            "little", 
            "new"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "C", 
        "A", 
        "D", 
        "C", 
        "D", 
        "B", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "middle1904"
}