{
    "article": "Once upon a time, there was a little boy named Rakesh, he studied and lived in a boarding school . Every night he jumped over the wall and played outside. He _ returned before dawn   and lay on his bed again, so no one knew that Rakesh went out at _ .\nOne night as usual, Rakesh found everyone asleep. He decided to play outside again. He went into his teacher--Mrs. Green's room _ and saw her sleeping. Then Rakesh walked out towards the wall. Near the wall, there was a ladder in the bushes, he hid it there. He took out the ladder and he climbed up it, then jumped over the wall. _ at that time his teacher was awake and saw him going out. _ got up and took away the ladder from the wall. A few hours later, Rakesh returned. In the dark, he tried to climb _ from the wall. Sadly, there was no ladder, instead, Mrs. Green was standing where the ladder was and waited for him. Rakesh was very _ to be punished  , but to his surprise, she just helped Rakesh to get onto the ground, said, \"Rakesh, at least _ a warm coat with you when you go out at night.\"\nMrs. Green's kindness made Rakesh know his own faults. He apologized   and never went out at night again. It is the _ lesson that he has ever had.", 
    "options": [
        [
            "never", 
            "always", 
            "seldom", 
            "sometimes"
        ], 
        [
            "daytime", 
            "weekends", 
            "night", 
            "noon"
        ], 
        [
            "loudly", 
            "quietly", 
            "happily", 
            "quickly"
        ], 
        [
            "And", 
            "But", 
            "So", 
            "Because"
        ], 
        [
            "He", 
            "They", 
            "She", 
            "It"
        ], 
        [
            "up", 
            "down", 
            "out", 
            "in"
        ], 
        [
            "afraid", 
            "glad", 
            "sorry", 
            "surprised"
        ], 
        [
            "buy", 
            "bring", 
            "take", 
            "borrow"
        ], 
        [
            "worst", 
            "best", 
            "farthest", 
            "Smallest"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "B", 
        "B", 
        "C", 
        "B", 
        "A", 
        "C", 
        "B"
    ], 
    "source": "middle2114"
}