{
    "article": "When I was young, I always helped my grandfather in the fields. As I worked beside him, he  _  to tell a story about a man named Joe, and his wife, who moved to a new farm with their three sons. They were setting into the new place  _  a nearby farmer told Joe that there was gold in the earth. Joe was very  _  , and told his sons about it. They began to dig in one corner, and they got to the end of the field. At the same time, Joe thought he would  _  some crops where the earth had been  _  . The plants included corn, tomatoes, potatoes, etc. His sons continued to dig through the soil, made up their mind to find the gold. Since  _  soil was being turned, Joe could plant more crops. Joe had never farmed before, but it had always been his  _  . As different crops came ready to be harvested, Joe started to  _  that there were more vegetables than he and his family could ever  _  . One of Joe's neighbors suggested that he  set up  a vegetable shop. Joe and his wife did that very thing. They called it Joe and Family Vegetable. Joe even had to leave some crops in the fields,  _  he had more than enough to supply the vegetable shop. This went on for years, and Joe and his wife became quite  _  from their little vegetable shop. They were even able to  _  their sons to college. Remember the beginning of the story, when Joe was told by his new neighbor that there was gold in the land? Well, the truth is, Joe's  _  of the English language was less than perfect. His new neighbor friend actually meant that his land had rich  _  . So you can see where the concept of gold comes from.", 
    "options": [
        [
            "feared", 
            "agreed", 
            "used", 
            "failed"
        ], 
        [
            "while", 
            "as", 
            "when", 
            "after"
        ], 
        [
            "happy", 
            "disappointed", 
            "angry", 
            "calm"
        ], 
        [
            "harvest", 
            "plant", 
            "water", 
            "feed"
        ], 
        [
            "controlled", 
            "burned", 
            "destroyed", 
            "turned"
        ], 
        [
            "more", 
            "most", 
            "much", 
            "few"
        ], 
        [
            "job", 
            "problem", 
            "pity", 
            "dream"
        ], 
        [
            "realize", 
            "promise", 
            "relate", 
            "regret"
        ], 
        [
            "feed", 
            "sell", 
            "plant", 
            "eat"
        ], 
        [
            "now", 
            "though", 
            "so", 
            "because"
        ], 
        [
            "careful", 
            "rich", 
            "alone", 
            "cheerful"
        ], 
        [
            "bring", 
            "take", 
            "send", 
            "make"
        ], 
        [
            "understanding", 
            "knowledge", 
            "thinking", 
            "skills"
        ], 
        [
            "mud", 
            "gold", 
            "soil", 
            "material"
        ]
    ], 
    "answers": [
        "C", 
        "C", 
        "A", 
        "B", 
        "D", 
        "A", 
        "D", 
        "A", 
        "D", 
        "D", 
        "B", 
        "C", 
        "A", 
        "C"
    ], 
    "source": "middle1968"
}