{
    "article": "At that time, I was a teacher of a primary school. One day, my students were going to have a class, but Duane still _ there.\nDuane was a clever and lovely boy, but he didn't have a happy family. His mother liked drinking and hardly had time to look after him. Thinking that maybe he had a bad night, I walked over to ask what was the matter. As he looked at me, I could see he seemed _ .\n\"Mrs Brown, don't you want to open my gift?\" he asked. \"I put it on your _ .\"\nAs I looked at my desk, I found a small box covered with colorful paper. _ I had only been a teacher for three months, I had learned how to _ a student to explain a picture, but now, a gift. So I asked Duane to tell me about the gift. Duane said that inside the box I would find two good gems  . When I opened the box, I was _ that there were two beer caps in it. Duane told me that they were two earrings  . He found that I never _ earrings and wanted me to have some pretty ones.\nI cried. One of my _ was hurt when I was young. I never wore earrings because I didn't want people to notice my _ ear.\nSchool years come and go, but the \"earrings\" will never fail to warm my heart.", 
    "options": [
        [
            "slept", 
            "stood", 
            "lay", 
            "ran"
        ], 
        [
            "excited", 
            "tired", 
            "worried", 
            "disappointed"
        ], 
        [
            "chair", 
            "desk", 
            "bed", 
            "sofa"
        ], 
        [
            "Although", 
            "If", 
            "As", 
            "Since"
        ], 
        [
            "order", 
            "invite", 
            "encourage", 
            "teach"
        ], 
        [
            "scared", 
            "sad", 
            "surprised", 
            "calm"
        ], 
        [
            "made", 
            "wore", 
            "sold", 
            "carried"
        ], 
        [
            "ears", 
            "eyes", 
            "hands", 
            "legs"
        ], 
        [
            "big", 
            "beautiful", 
            "small", 
            "ugly"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "B", 
        "A", 
        "C", 
        "C", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "middle2206"
}