{
    "article": "The word \"sharp\" can be  _  to describe many different things in your home, classroom, and places of work. In this chapter, the writer  talks about  sharp pencils, meaning pencils with a very fine  _  .The writer does not like dull pencils. . We can also use \"sharp\" to describe the blades of knives. Knives also have points. We can use \"sharp\" to describe a  _  kind of point, such as the sharp points of kitchen and steak knives. Scissors have blades, too, and we can describe these blades as sharp or dull. Furthermore, the points of scissors are  _  sharp or rounded spending on the kind of scissors. Some tools, such as saws, scrapers, and garden tools, also have blades. We can use the words \"sharp\" and \"dull\" to describe the blades of these tools, too. Sharp knives, scissors, and tools are  _  to use. They cut things easily and quickly, without effort. \"Sharp\" can be used to describe the edges of furniture and  _  some containers. For example, the edge of a table or desk can be  _  .In addition; we can describe the edge of  _  open can as sharp. The top of a can is sometimes sharp  enough  to cut your hand. A piece of  _  from a broken jar or bottle is ordinarily very sharp.  Finally  we sometimes use \"sharp\" to describe people. A person who appears sharp is very well  _  .A person who is sharp, on the other hand, is intelligent, smart, and  quick to  learn and understand. To summarize, \"sharp\" can be used to describe many kinds of  objects  that have blades, points, and edges. When we used it to describe people, it can mean nice looking, well dressed, or intelligent. It is an expensive word because it can be used in many different ways.", 
    "options": [
        [
            "written", 
            "used", 
            "seen", 
            "taken"
        ], 
        [
            "sharp", 
            "color", 
            "point", 
            "edge"
        ], 
        [
            "some", 
            "any", 
            "only", 
            "certain"
        ], 
        [
            "either", 
            "neither", 
            "too", 
            "very"
        ], 
        [
            "difficult", 
            "easy", 
            "interesting", 
            "clean"
        ], 
        [
            "for", 
            "with", 
            "of", 
            "at"
        ], 
        [
            "seen", 
            "sharp", 
            "smooth", 
            "hard"
        ], 
        [
            "an", 
            "a", 
            "the", 
            "/"
        ], 
        [
            "news", 
            "glass", 
            "information", 
            "advice"
        ], 
        [
            "prepared", 
            "dressed", 
            "mannered", 
            "served"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "D", 
        "A", 
        "B", 
        "C", 
        "B", 
        "A", 
        "B", 
        "B"
    ], 
    "source": "middle864"
}