{
    "article": "The Lake\nThe day when Robert was born was the happiest day of my life. Unfortunately my wife decided she no longer wanted to be married to me. My little boy and I had to part, only getting to see each other every other weekend.\nOne day, I decided to go fishing with my son, who was about 5 years old, at a nearby lake. We arrived at the lake early. Getting out of the car, we brought out all of the fishing equipment and our life jackets and the cooler that had our tasty lunch in it. I could just _ the day in my mind in hopes that it would never end. We both went out onto the dock and I thought, \"Do I put his life jacket on first or load the boat first?\" I saw him skipping rocks on the water, so I decided to load the boat first.\nI was just finishing up when I heard the splash. I turned and looked quickly expecting to see Robert _ standing there, but I did not see him anywhere. I jumped into the water to save my son immediately. I searched and searched but found him nowhere. I came up for a breath hoping to see him above water, now wondering how I could find him in the murky water. I finally decided to go all the way to the bottom and _ around, not coming up until I found him.\nFinally, there on the bottom he was, his arms wrapped around the wooden pole that holds up the dock. I brought him to the _ and put him on the bank. While both of us were coughing and spitting out water, I just hugged him and was _ that I had found him in time.\nWhen things finally calmed down, I asked one simple question, \"Robert, why were you _ onto that pole on the bottom of the lake?\" He looked at me with the most innocent and loving eyes and simply replied, \"I was waiting for you, Daddy. I knew you would come to _ me.\"\nI thought that I could not be any _ or any madder at the same time and I just told him, \"I sure do love you, sweetheart.\" He replied, \"I love you too, Dad.\"\nThere is no amount of money or cars or jobs or any material thing that could replace being loved and _ someone so much. I am lucky to have the ability to love on such a high level, and the ability to forgive on the same level.", 
    "options": [
        [
            "picture", 
            "enjoy", 
            "show", 
            "spend"
        ], 
        [
            "carefully", 
            "happily", 
            "safely", 
            "quietly"
        ], 
        [
            "walk", 
            "look", 
            "hear", 
            "feel"
        ], 
        [
            "surface", 
            "centre", 
            "front", 
            "corner"
        ], 
        [
            "thoughtful", 
            "regretful", 
            "hopeful", 
            "thankful"
        ], 
        [
            "jumping", 
            "holding", 
            "stepping", 
            "pointing"
        ], 
        [
            "call", 
            "awake", 
            "save", 
            "remind"
        ], 
        [
            "funnier", 
            "prouder", 
            "sadder", 
            "cooler"
        ], 
        [
            "missing", 
            "touching", 
            "loving", 
            "changing"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "D", 
        "A", 
        "D", 
        "B", 
        "C", 
        "B", 
        "C"
    ], 
    "source": "middle1914"
}