{
    "article": "When I was in the sixth grade, one day my teacher asked our class to think about the question \"What does 'doing the right thing' mean to you?\" over the weekend. We could talk to our parents or anyone else we thought might have a good answer.  _  Monday, we were to hand in an essay on it, and be prepared to live up to our  _  . The entire weekend, I was trying to  come up with  something that would impress my teacher and be easy to live by. I talked to my parents, called my grandmother and asked my neighbor. Everyone had good answers, but I didn't feel like I could live up to them. On Sunday afternoon, my parents said they were going to my Aunt Cindy's house. That usually  _  that I would have to entertain my four-year-old cousin Andrea  _  my parents visited. I found a Disney movie for Andrea, and then I sat down and started to write my essay. It was due the next morning and this was my last  _  . Soon I felt a pair of eyes on me. It was Andrea. \"What are you doing?\" Andrea asked. \"I have to write an essay about what 'doing the right thing' means to me.\" I answered. Andrea laughed. Could this smart four-year-old  _  know the answer? \"That's easy,\" she said. \"Doing the right thing means being nice to your family and friends. Never lie. Eat lots of fruits and vegetables. Take a bath when you're  _  . And never put rocks in your mouth.\" I stared with great  _  at my little cousin. Then I jumped up and gave her the biggest hug. Not only had Andrea answered a very tough question for me, but I could easily live by  _  of her answers. All I had to do was to be nice, not to lie, to keep myself clean and healthy, and never put rocks in my mouth. So when I wrote my essay, I  _  the story about Andrea and how she had answered my question. Two weeks later, my teacher returned everyone's essays. I  _  an A+ along with a little note my teacher had written at the top: \"Always do the right thing and give Andrea an A+, too!\"", 
    "options": [
        [
            "By", 
            "Over", 
            "About", 
            "For"
        ], 
        [
            "answers", 
            "plans", 
            "advice", 
            "information"
        ], 
        [
            "left", 
            "meant", 
            "decided", 
            "explained"
        ], 
        [
            "since", 
            "because", 
            "while", 
            "before"
        ], 
        [
            "task", 
            "chance", 
            "step", 
            "choice"
        ], 
        [
            "quickly", 
            "normally", 
            "seriously", 
            "possibly"
        ], 
        [
            "dirty", 
            "tired", 
            "sleepy", 
            "unhappy"
        ], 
        [
            "pride", 
            "fear", 
            "surprise", 
            "worry"
        ], 
        [
            "any", 
            "all", 
            "some", 
            "none"
        ], 
        [
            "read", 
            "found", 
            "included", 
            "returned"
        ], 
        [
            "prepared", 
            "expected", 
            "introduced", 
            "received"
        ]
    ], 
    "answers": [
        "A", 
        "A", 
        "B", 
        "C", 
        "B", 
        "D", 
        "A", 
        "C", 
        "B", 
        "C", 
        "D"
    ], 
    "source": "middle912"
}