{
    "article": "As I look back on it now, I realize it was kind of silly of me to be so worried when Daddy was really just late. I waited every night for Daddy whom I followed around everywhere. That day, I stood at my  _  place by the door, waiting for his return from work. After standing there for a while, I began to  _  where Daddy was. I ran into the kitchen and asked Mummy  _  ,\"When is Daddy coming? \" \" Soon, honey, \"Mummy replied distractedly because she was following a difficult recipe(cookbook) for dinner. I ran back to the door for I knew that Daddy was coming and that I wasn't standing there for nothing, I began to read the words from my favorite books. Tired of that, I went back to the kitchen to ask Mummy again but  _  I could open my mouth, she handed me a My little Pony coloring book. She said: \"I'm busy, Daniel. Go and  _  a pretty picture and I'll hang it on the fridge. \" I went back to the door, put my book and crayons down, then went to get my mini chair to sit in. After a while, the  _  became a pink-and-purple artistic wonder. Soon I  _  with relief as I heard the sound of the garage door  _  and Daddy's car driving in. I heard him turn off the engine and open and close his car door. The next thing I knew was that the door opened and there stood Daddy. I stood up and  held out  my arms . I hugged him tightly and whispered, \"I love you\". As I sit at the computer finishing this story, I know Daddy will be home soon. I still  _  when he's late. I still go to greet him when he arrives. And I still tell him I love him.", 
    "options": [
        [
            "own", 
            "usual", 
            "favorite", 
            "strange"
        ], 
        [
            "think", 
            "understand", 
            "wonder", 
            "search"
        ], 
        [
            "hopefully", 
            "thoughtfully", 
            "politely", 
            "sadly"
        ], 
        [
            "when", 
            "as", 
            "until", 
            "before"
        ], 
        [
            "color", 
            "make", 
            "draw", 
            "paint"
        ], 
        [
            "book", 
            "picture", 
            "fridge", 
            "chair"
        ], 
        [
            "smiled", 
            "cried", 
            "laughed", 
            "called"
        ], 
        [
            "shaking", 
            "opening", 
            "shutting", 
            "breaking"
        ], 
        [
            "mind", 
            "realize", 
            "doubt", 
            "worry"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "D", 
        "A", 
        "B", 
        "A", 
        "B", 
        "D"
    ], 
    "source": "middle1492"
}