{
    "article": "Last week, students at Rosie Bridge School worked hard to make their English Week very successful.\nThere _ a lot of activities including an English book fair in the library and a treasure hunt. _ students put on an English play. Other students took part in an English singing competition.\nA speaking competition was also _ . The students had to speak on a topic in English _ two minutes.\nHenry was the winner and we spoke to him. \"I' m so happy that I _ ,\" he said. \"I advise people to speak slowly. _ they want to be good public speakers, they'd better speak clearly and _ .\"\nWe also spoke to several other students about English Week. One of _ was Amy.\n\"I really enjoyed English Week. It gave me a chance to learn new _ . In my opinion, every school should have an English Week. It's well _ doing,\" she said.\nOn the last day of English Week, the head teacher gave a _ to the whole school. He gave students some suggestions on _ to improve their English. \"You should communicate in English with your friends whenever you _ . You should read English books and magazines, and watch English television _ . Above all, you should enjoy English!\" he said.", 
    "options": [
        [
            "are", 
            "were", 
            "is", 
            "was"
        ], 
        [
            "Some", 
            "No", 
            "All", 
            "Few"
        ], 
        [
            "playing", 
            "played", 
            "holding", 
            "held"
        ], 
        [
            "on", 
            "at", 
            "for", 
            "by"
        ], 
        [
            "did", 
            "won", 
            "lost", 
            "had"
        ], 
        [
            "Although", 
            "Since", 
            "Until", 
            "If"
        ], 
        [
            "confidently", 
            "quietly", 
            "quickly", 
            "patiently"
        ], 
        [
            "us", 
            "you", 
            "them", 
            "others"
        ], 
        [
            "abilities", 
            "words", 
            "friends", 
            "books"
        ], 
        [
            "enough", 
            "known", 
            "dressed", 
            "worth"
        ], 
        [
            "speech", 
            "decision", 
            "task", 
            "help"
        ], 
        [
            "where", 
            "how", 
            "whether", 
            "when"
        ], 
        [
            "must", 
            "need", 
            "should", 
            "can"
        ], 
        [
            "programmes", 
            "parts", 
            "stars", 
            "stations"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "D", 
        "C", 
        "B", 
        "D", 
        "A", 
        "C", 
        "B", 
        "D", 
        "A", 
        "B", 
        "D", 
        "A"
    ], 
    "source": "middle1170"
}