{
    "article": "Have you heard of the term \"etiquette\" And do you know that etiquette is not only a useful word  but also  very useful to understand? Etiquette is not the same in every culture  _  in every situation. For example, standing very close to the person you are talking with is quite common in some Asian countries. However; if you do this in Europe, some  _  eople might feel  _  .Even in China, we all know that etiquette is not the same in all situations. Perhaps we think that talking loudly in our own homes is fine, but there are other places where talking loudly is  not allowed  .For example ,most people would agree that talking loudly in a library, a museum, or a movie theater is  _  .Even if you are with your friends, it is better to keep your voice  _  in public places. In fact, we should also  try  not to cough or sneeze loudly in public. If we see someone  _  the rules of etiquette, we may politely give them some suggestions. Perhaps one of the most polite ways  is to  ask someone, Would you mind doing this or Would you mind not doing that. For example, if someone cuts  in front of  you in a line, you could ask them, Sorry, would you mind  _  the line? If someone is smoking on the bus you could ask, Excuse me, could you please  put out  that cigarette? People don't usually like  to be criticized  , so we have to be careful how we do this. Although rules of etiquette can often be different, some rules are the same almost everywhere in the world! For example,  dropping litter  is almost never allowed. If you see someone you know doing this, you can ask them, Would you mind picking it up?", 
    "options": [
        [
            "or", 
            "but", 
            "as", 
            "and"
        ], 
        [
            "Asian", 
            "American", 
            "European", 
            "African"
        ], 
        [
            "comfortable", 
            "uncomfortable", 
            "happy", 
            "excited"
        ], 
        [
            "polite", 
            "rude", 
            "impossible", 
            "Common"
        ], 
        [
            "off", 
            "Small", 
            "loud", 
            "down"
        ], 
        [
            "following", 
            "breaking", 
            "obeying", 
            "broken"
        ], 
        [
            "waiting", 
            "jumping", 
            "cutting", 
            "joining"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "B", 
        "B", 
        "D", 
        "B", 
        "D"
    ], 
    "source": "middle1215"
}