{
    "article": "Do you remember who gets angry because you forget to tidy up your room before going out? Do you remember who feels  _  with your dress from head to feet? This person is  _  your boss nor your friend. It's funny that you have to  _  to her even though you sometimes don't like to hear anything she has said. It's our mother, a great  _  in the world to us. I always  _  my mother if we have a \"long time no see\". But this kind of missing is always quieted down by  _  because I come back home for comfort and  _  but mum always puts more pressure on me. Of course, I know she  _  about me too much and just has a lot of words to tell me. But the  _  turns to be pressure. On the other hand, I hurt her and make her feel lonely even though I am  _  her. Then what can we do? This problem is really hard to deal with. I think not  _  I have this problem. Here are my ideas. When we find there are some unhappy things going to  _  , shall we just stop for 30  _  ? Give me a chance to rest in your arms and we sing a childish song together just like when I was  _  ? I need your love indeed but without telling me to do as you wish me to. And then let's go out for a walk hand in hand. Tell me what's in your  _  gently and slowly. I will feel better if you don't just pour them out.", 
    "options": [
        [
            "dissatisfied", 
            "uncertain", 
            "untrue", 
            "dishonest"
        ], 
        [
            "never", 
            "either", 
            "neither", 
            "none"
        ], 
        [
            "belong", 
            "listen", 
            "change", 
            "follow"
        ], 
        [
            "advisor", 
            "teacher", 
            "instructor", 
            "woman"
        ], 
        [
            "write", 
            "miss", 
            "love", 
            "cheer"
        ], 
        [
            "arguments", 
            "works", 
            "helps", 
            "talks"
        ], 
        [
            "money", 
            "support", 
            "relaxation", 
            "advice"
        ], 
        [
            "thinks", 
            "worries", 
            "plans", 
            "manages"
        ], 
        [
            "description", 
            "condition", 
            "care", 
            "mind"
        ], 
        [
            "against", 
            "beyond", 
            "among", 
            "beside"
        ], 
        [
            "only", 
            "myself", 
            "alone", 
            "except"
        ], 
        [
            "break", 
            "happen", 
            "discover", 
            "appear"
        ], 
        [
            "hours", 
            "days", 
            "seconds", 
            "weeks"
        ], 
        [
            "stronger", 
            "younger", 
            "cooler", 
            "cleverer"
        ], 
        [
            "heart", 
            "pocket", 
            "diary", 
            "life"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "B", 
        "D", 
        "B", 
        "A", 
        "C", 
        "B", 
        "C", 
        "D", 
        "A", 
        "B", 
        "C", 
        "B", 
        "A"
    ], 
    "source": "middle1211"
}