{
    "article": "My uncle John used to live in a beautiful little house by the sea in Atlantic City. I say he \"used to\" live there  _  he doesn't live there any more. He was killed two years ago. Uncle John wrote novels. He not only  _  his job, but also made a lot of money doing it. When he died, he had $ 60 million in the bank. After Uncle John's death, I came to stay in his house for a while. I had been there for two days when  _  a message on the screen of the old computer. I was very surprised, because I thought the computer had been  turned off  . The message said, \"You have new  _  ! \" When I read it, I thought it looked like the  _  of a novel. \"This looks interesting,\" I thought. \"It must be  _  one of Uncle John's friends.\" I decided I should make an answer to the e-mail to tell him or her that Uncle John was  _  . However, the computer would not let me  _  . Every day for the next three weeks, more e-mail kept arriving. I printed  _  of all of them. The story was about Jane Winterbourne, a young writer working on her first novel. She sent her novel to Jack Tanner, an old writer and asked him to  _  her to publish it. However, he cheated her, and published the novel himself -- pretending that he had  _  it. The novel was very  _  . Tanner made a lot of money, and bought himself a house by the sea in Atlantic City. It was then that I realized that \"Jack Tanner\" and \"Jane Winterbourne\" were  _  names. \"Jack was  _  to be Uncle John.\"", 
    "options": [
        [
            "so", 
            "because", 
            "though", 
            "once"
        ], 
        [
            "lost", 
            "finished", 
            "changed", 
            "enjoyed"
        ], 
        [
            "sent", 
            "noticed", 
            "read", 
            "typed"
        ], 
        [
            "information", 
            "post", 
            "mail", 
            "business"
        ], 
        [
            "picture", 
            "story", 
            "end", 
            "beginning"
        ], 
        [
            "like", 
            "about", 
            "from", 
            "to"
        ], 
        [
            "dead", 
            "sick", 
            "out", 
            "busy"
        ], 
        [
            "play", 
            "reply", 
            "watch", 
            "stop"
        ], 
        [
            "copies", 
            "pieces", 
            "parts", 
            "covers"
        ], 
        [
            "teach", 
            "help", 
            "show", 
            "refuse"
        ], 
        [
            "missed", 
            "corrected", 
            "written", 
            "bought"
        ], 
        [
            "new", 
            "expensive", 
            "important", 
            "successful"
        ], 
        [
            "false", 
            "true", 
            "long", 
            "beautiful"
        ], 
        [
            "pointed", 
            "spelt", 
            "meant", 
            "called"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "B", 
        "C", 
        "D", 
        "C", 
        "A", 
        "B", 
        "A", 
        "B", 
        "C", 
        "D", 
        "A", 
        "C"
    ], 
    "source": "middle2154"
}