{
    "article": "It was getting dark. Paul looked out of the window and signed  . Dad said he could come home by 5:30, but it was almost 7:00. Even if Dad came back, it wouldn't be much fun playing  _  in the dark. Paul walked into his room and threw his baseball into the corner. He tried to do some homework, but couldn't.\nThe phone rang at about 8:00. It was Dad: \"Paul, I'm   _  , but I couldn't play baseball with you tonight. I have to finish my work at the office. Maybe we can play this weekend. Oh no. How about next weekend....\"\nPaul couldn't understand why Dad was so  _  . He threw himself into the sofa and soon fell asleep. His book was still opened to the first page.\nThe next day at school, Paul didn't hand in his homework and  _  a test. Mrs. Green, his teacher, asked him to stay after school. \"Paul, you didn't do your homework.You didn't pass the test and only got a D. This isn't like you. What's wrong?\"\nPaul just sat there  _  . \"Paul, if you don't want to talk, I will. I know that something's worrying with you, but you have to get it out. You need to tell someone.\"\nAs Paul walked home, he thought of what Mrs. Green said. Maybe he didn't do his homework because he wanted to get his dad's  _  . He knew Mrs. Green was right. He decided to take her advice.\nWhen Paul got home, he  _  his dad. But there was no answer. Then it went to voicemail  . Paul began talking: \"Dad, I can't play with you next weekend. I've got lots of problems with my homework. Also, I really don't want to spend another day looking out of the window and waiting. Whenever you  _  our plans, Dad, it hurts me. It's not too late to rebuild our relationship, but we have to start small. Maybe you can help me with my  _  sometime. Dad, I love you.\"\nAs Paul ended the call, he felt much relaxed. He didn't know whether his dad would be different, but it didn't matter. He himself  _  . He expressed his feelings to the right person. He had a clear head as he was doing his homework that evening.", 
    "options": [
        [
            "baseball", 
            "cards", 
            "chess", 
            "toys"
        ], 
        [
            "lucky", 
            "sorry", 
            "surprised", 
            "pleased"
        ], 
        [
            "famous", 
            "helpful", 
            "lazy", 
            "busy"
        ], 
        [
            "made", 
            "missed", 
            "failed", 
            "chose"
        ], 
        [
            "cheerfully", 
            "comfortably", 
            "hopefully", 
            "quietly"
        ], 
        [
            "attention", 
            "message", 
            "praise", 
            "trust"
        ], 
        [
            "saw", 
            "thanked", 
            "called", 
            "greeted"
        ], 
        [
            "prepare", 
            "break", 
            "follow", 
            "question"
        ], 
        [
            "choice", 
            "homework", 
            "speech", 
            "decision"
        ], 
        [
            "regretted", 
            "complained", 
            "insisted", 
            "changed"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "D", 
        "C", 
        "D", 
        "A", 
        "C", 
        "B", 
        "B", 
        "D"
    ], 
    "source": "middle999"
}