{
    "article": "\"Hi! John.\" Mary ran towards me with a bright smile, saying, \"I'm going to have a dance performance tonight. I hope you'll come. Here is the ticket. Don't forget!\" Then she  _  \"What? Dance? Is that  _  ?\" I asked myself. Mary was not such kind of girl. She was quite common one. I had never seen her wearing colorful clothes. In fact, she really did not know  _  to dress up. What a terrible thing! \"I should go to, I must go to.\" I thought. I arrived at the hall with the ticket, found my seat and sat down. Her performance was the seventh one. I knew I would have a  _  time before her turn, for I had no sense of art,  _  her performance was worth watching, no matter how long I would wait. Time went  _  , I tried my best not to fall asleep. Just then, came the words, \"Let's welcome the next exciting dance - Latin!\" Hearing this, I opened my eyes as large as possible,  _  to lose anything. Wearing a golden and shiny skirt, Mary appeared. She danced with a sweet smile, looking like a pretty butterfly flying ... I could  _  believe my eyes. After all the performance ended, I  waited for  her at the gate. \"Hi!\" She stood in front of me with her crystal shoes. \"How do you feel?\" \"Fantastic!\" I answered. \"Ha, ha. I knew it would be.\" She could not hide her excitement, laughing  _  At that time, I realized that every girl has a pair of special shoes which are like the crystal shoes of Cinderella.", 
    "options": [
        [
            "came", 
            "jumped", 
            "left", 
            "moved"
        ], 
        [
            "possible", 
            "lucky", 
            "funny", 
            "careful"
        ], 
        [
            "why", 
            "where", 
            "when", 
            "how"
        ], 
        [
            "great", 
            "short", 
            "hard", 
            "relaxing"
        ], 
        [
            "or", 
            "so", 
            "but", 
            "and"
        ], 
        [
            "quickly", 
            "slowly", 
            "safely", 
            "easily"
        ], 
        [
            "hoping", 
            "fearing", 
            "planning", 
            "hating"
        ], 
        [
            "seriously", 
            "hardly", 
            "nearly", 
            "certainly"
        ], 
        [
            "as", 
            "like", 
            "for", 
            "at"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "C", 
        "C", 
        "B", 
        "B", 
        "B", 
        "B"
    ], 
    "source": "middle1325"
}