{
    "article": "A smiling face at the store I need to get some things to clean the house this weekend, so I left for a local store. While walking around, I realized that I didn't smile at  _  . That was out of my character. I almost always smile at strangers in the  _  that it may make them a bit happier. But in that special moment, I was thinking of what had  _  me earlier in the day, not really in the mood to smile. When I went to check out my things, I met with a very  _  line. People were buying Christmas gifts. To shorten the first line, a second register opened up. I  _  turned to it. After a few moments, I began to  _  that all the people before me had lots of things to check out. I wasn't  _  any longer, so I returned to the first line. After a short while, all the people in the second line checked out. I was still standing in the  _  line. At last, it was my  _  to check out. I found that the man behind the register seemed so happy! He greeted me  _  a big smile. \"  How  nice it is to see a smiling face in this store!\" I said. He  _  to me, \"I love to smile, because you never know what people are going through.\" At that moment, he made me think of  _  . Something in me changed, and we began talking about  _  -- about how it goes a long way. There was no one behind me, so we talked and laughed for a while. What a gift it is, to be  cheered up  by this kind young man! I suddenly had all the time in the world.", 
    "options": [
        [
            "someone", 
            "anyone", 
            "nobody", 
            "none"
        ], 
        [
            "suggestion", 
            "plan", 
            "hope", 
            "decision"
        ], 
        [
            "pleased", 
            "worried", 
            "relaxed", 
            "treated"
        ], 
        [
            "long", 
            "short", 
            "boring", 
            "interesting"
        ], 
        [
            "simply", 
            "easily", 
            "slowly", 
            "quickly"
        ], 
        [
            "remember", 
            "forget", 
            "doubt", 
            "notice"
        ], 
        [
            "polite", 
            "nervous", 
            "patient", 
            "silent"
        ], 
        [
            "first", 
            "second", 
            "third", 
            "last"
        ], 
        [
            "turn", 
            "dream", 
            "duty", 
            "courage"
        ], 
        [
            "in", 
            "on", 
            "to", 
            "with"
        ], 
        [
            "shouted", 
            "answered", 
            "replied", 
            "cried"
        ], 
        [
            "himself", 
            "myself", 
            "yourself", 
            "herself"
        ], 
        [
            "sadness", 
            "unhappiness", 
            "carelessness", 
            "kindness"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "B", 
        "A", 
        "D", 
        "D", 
        "C", 
        "A", 
        "A", 
        "D", 
        "C", 
        "B", 
        "D"
    ], 
    "source": "middle734"
}