{
    "article": "When I was a teenager growing up in France, I wanted to leave school and have my own life. The only way I could  _  this was to work in the local paper factory in my town, or get married. I was very nervous when I told my  _  I wanted to leave school. I thought he would say, \"  _  You are going to college .\" I was very  _  when he said, \"OK. Let's go to the paper factory.\" Two days later,  _  took me to the factory. I imagined everyone to be friends  _  together and having fun. I even imagined there would be music and singing. I  _  I had watched too many movies as a teenager. When we  arrived at  the factory gate, my father spoke to the guard and one minute later we were  _  . I walked around the factory looking at the building, the workers, and listening to the noise. It was  _  . I ran back to my father and said, \"I want to go home.\" He asked me, \"What do you think of the  _  ?\" \"Too bad,\" I answered. \"And marriage is even  _  !\" he said. I went back to school the next day thinking about studying hard  _  I could get into a good college. I  _  studying English so I decided to major in languages at college. Thanks to my father and our  _  to the paper factory, I now work at the United Nations and my father is very proud of me. I married a very good man and my life is much better than it would have been working in the factory!", 
    "options": [
        [
            "say", 
            "do", 
            "receive", 
            "find"
        ], 
        [
            "teacher", 
            "friend", 
            "father", 
            "husband"
        ], 
        [
            "Yes!", 
            "No!", 
            "Really?", 
            "OK?"
        ], 
        [
            "angry", 
            "tired", 
            "nervous", 
            "surprised"
        ], 
        [
            "he", 
            "she", 
            "it", 
            "they"
        ], 
        [
            "working", 
            "studying", 
            "singing", 
            "farming"
        ], 
        [
            "guess", 
            "mean", 
            "say", 
            "hope"
        ], 
        [
            "outside", 
            "inside", 
            "back", 
            "away"
        ], 
        [
            "terrible", 
            "wonderful", 
            "funny", 
            "special"
        ], 
        [
            "workers", 
            "guard", 
            "building", 
            "factory"
        ], 
        [
            "better", 
            "harder", 
            "worse", 
            "easier"
        ], 
        [
            "but", 
            "if", 
            "so", 
            "or"
        ], 
        [
            "enjoyed", 
            "stopped", 
            "disliked", 
            "minded"
        ], 
        [
            "way", 
            "idea", 
            "plan", 
            "trip"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "B", 
        "D", 
        "A", 
        "A", 
        "A", 
        "B", 
        "A", 
        "D", 
        "C", 
        "C", 
        "A", 
        "D"
    ], 
    "source": "middle78"
}