{
    "article": "Oxfam Trailwalker has been one of Hong Kong's biggest fund-raising events since 1981. It was known _ Trailwalker before. It is _ by Oxfam Hong Kong to raise money for helping poor people in Hong Kong and other parts of Asia and Africa. Trailwalker is held _ November every year. People over eighteen can group themselves into a team of four and join this charity walk.\nOxfam Trailwalker is a tough hike because you have to finish walking a 100-kilometre trail within 48 hours. It means you may have to walk for two days and nights without sleep. The trailwalkers have to walk _ eight country parks and over twenty hills and mountains.\nIt is _ excellent chance for people to learn team spirit. All the team members must plan everything together _ the event. You need to _ together to finish the hike because only the team's finishing time will be recorded. It is necessary for you to support and help each other before and during the event.\nYou should plan _ you are going to carry during the walk. You cannot carry everything with you, so it is useful to have support teams to bring you food and drinks. Warm and dry clothes are also necessary to keep you comfortable during the walk. Each team must raise at least HK$6500.\nThe money is used to help help poor people and to support development projects.\nOf course, the walk _ is not easy-going up hills, without sleep and with tired bodies. It is necessary that you start training a few months before the walk. Why not try your best to help people in need? This will be an experience you will never forget.", 
    "options": [
        [
            "as", 
            "for", 
            "of", 
            "like"
        ], 
        [
            "organize", 
            "organized", 
            "organizes", 
            "organizing"
        ], 
        [
            "in", 
            "on", 
            "at", 
            "for"
        ], 
        [
            "pass", 
            "cross", 
            "past", 
            "through"
        ], 
        [
            "a", 
            "an", 
            "the", 
            "\\"
        ], 
        [
            "after", 
            "when", 
            "before", 
            "while"
        ], 
        [
            "run", 
            "jump", 
            "climb", 
            "walk"
        ], 
        [
            "what", 
            "how", 
            "when", 
            "why"
        ], 
        [
            "it", 
            "its", 
            "itself", 
            "it's"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "A", 
        "D", 
        "B", 
        "C", 
        "D", 
        "A", 
        "C"
    ], 
    "source": "middle2155"
}