{
    "article": "One spring afternoon, many years ago, I went to pick up my mother from work. I got there a little early so I parked the car by the roadside and waited for her.\nAs I looked outside  the car window,  I saw a little boy, around two years old, running  freely on the grass as his mother  _  from a short distance . The boy had a big smile on his face as if he had just been set free out of  _ . The boy would then fall to the grass,    _  up quickly, even without looking back at his mother, run as  _  as he could again, still with a smile  on his face, as if nothing had happened.\nAt that moment, I thought to myself, \"Why aren't most adults this way?\" Most adults, when they fall down ,make a big deal out of it and don't even  _  a second try for fear of failure .\nHowever, with kids, when they fall down, they don't consider their falling down as failure, instead, they treat it as a  _ experience. They try again and again until they  _ . The answer must be that they have not connected \"falling down\" with the word \"failure\". As a _ , they are not discouraged in any way, Also they  _  think to themselves that it's quite OK to fall down and that it's not wrong to so . In other words,  they  _  themselves to make mistakes, so they remain energetic.\nI was deeply impressed by the boy's persistence and the manner in which he did.", 
    "options": [
        [
            "watched", 
            "noticed", 
            "searched", 
            "supported"
        ], 
        [
            "park", 
            "school", 
            "prison", 
            "home"
        ], 
        [
            "hold", 
            "get", 
            "end", 
            "pick"
        ], 
        [
            "well", 
            "long", 
            "fast", 
            "soon"
        ], 
        [
            "make", 
            "provide", 
            "practice", 
            "discover"
        ], 
        [
            "learning", 
            "running", 
            "teaching", 
            "falling"
        ], 
        [
            "progress", 
            "improve", 
            "achieve", 
            "succeed"
        ], 
        [
            "decision", 
            "result", 
            "reason", 
            "matter"
        ], 
        [
            "hardly", 
            "perfectly", 
            "probably", 
            "nearly"
        ], 
        [
            "allow", 
            "let", 
            "make", 
            "get"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "B", 
        "C", 
        "A", 
        "A", 
        "D", 
        "B", 
        "C", 
        "A"
    ], 
    "source": "middle39"
}