{
    "article": "On the morning of April 20th, we had class silently in the classroom. Suddenly the broadcasting station  of our school went on the air. The headmaster told us the bad  _  that a student named Tong Kai in junior 2 was seriously ill and needed an operation  at once. It would  _  one hundred thousand yuan. It was impossible for his family to pay  so much  money. So the headmaster called on _  to do something to help Tong Kai.\nThe news soon spread over the campus . Everyone was  _  about his illness. From that day on, the teachers and students began to  give away  money to him. We were not rich, but all of us would try our best to help him. The money we have collected was not enough for Tong Kai's operation, but we did what we could. Then some kind people knew this. They gave him a hand,  too . We all hoped that Tong Kai would get well soon and came back to study with us. In only three days, they received ten thousand in all.\n _  the help of many schoolmates, teachers and other kind people, Tong got enough money and was operated on successfully. After that he said , \"I thought I was the most  _  person in the world\", but now I think just the opposite. I live with thousands of  kind people. I'll face life bravely.\" While saying these words, he couldn't keep back his tears.\nWhat a warm big family our world is!", 
    "options": [
        [
            "advice", 
            "suggestion", 
            "news", 
            "information"
        ], 
        [
            "cost", 
            "spend", 
            "pay", 
            "take"
        ], 
        [
            "nobody", 
            "somebody", 
            "someone", 
            "everyone"
        ], 
        [
            "happy", 
            "worried", 
            "crazy", 
            "excited"
        ], 
        [
            "Without", 
            "Under", 
            "With", 
            "In"
        ], 
        [
            "lucky", 
            "unlucky", 
            "important", 
            "unluckily"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "B", 
        "C", 
        "B"
    ], 
    "source": "middle151"
}