{
    "article": "I watched as my little brother was caught in the act. He was sitting in the corner of the living room, a  _  in one hand and my father's hymnbook in the other. As my father walked into the room, my brother cowered slightly . He sensed that he had done something  _  . Form a distance I could see that he had  _  my father's new hymnal and scribbled in it. Now looking at my father fearfully, we  _  waited for his punishment. My father  picked up  his book, looked at it, and then sat down without saying a word.He was a clergyman and for him, books were knowledge. And yet he  _  his children. What he did next was unbelievable. Instead of punishing my brother, he sat down,  _  the pen from my brother's hand, and then wrote in the book himself, alongside the scribbles John had made: \"John's work, 1959,  _  2.\" How many times have I looked into your beautiful face and into your warm eyes looking up at me and  _  God for the one who has now scribbled in my new hymnal. You have made the book sacred , as have your brother and sister. \"Wow,\" I thought. \"This is punishment?\" The years and the books came and went. Our family  _  what all families go through and perhaps a little bit more. But we  _  knew our parents loved us and that one of the proofs of their love was the hymnal by the piano. Dad taught us about  _  really matters in life: people, not objects; tolerance , not judgment; love, not anger. Now I, too, am a father. But unlike my father, I do not wait for daughters  _  to take books from my bookshelf and scribble in them. From time to time I take one down, and give it to one of my  _  to scribble in. and as I look at their artwork, I think about my father and the  _  he taught me.", 
    "options": [
        [
            "book", 
            "pen", 
            "knife", 
            "toy"
        ], 
        [
            "wrong", 
            "special", 
            "dangerous", 
            "different"
        ], 
        [
            "dropped", 
            "read", 
            "borrowed", 
            "opened"
        ], 
        [
            "all", 
            "both", 
            "either", 
            "each"
        ], 
        [
            "hated", 
            "needed", 
            "loved", 
            "disliked"
        ], 
        [
            "moved", 
            "took", 
            "brought", 
            "borrowed"
        ], 
        [
            "old", 
            "birthday", 
            "aged", 
            "named"
        ], 
        [
            "thanked", 
            "asked", 
            "respected", 
            "pleased"
        ], 
        [
            "spent", 
            "experienced", 
            "supported", 
            "afforded"
        ], 
        [
            "ever", 
            "sometimes", 
            "never", 
            "always"
        ], 
        [
            "what", 
            "why", 
            "which", 
            "who"
        ], 
        [
            "quickly", 
            "secretly", 
            "carefully", 
            "suddenly"
        ], 
        [
            "children", 
            "sisters", 
            "brothers", 
            "parents"
        ], 
        [
            "skills", 
            "rules", 
            "lessons", 
            "subjects"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "D", 
        "B", 
        "C", 
        "B", 
        "C", 
        "A", 
        "B", 
        "D", 
        "A", 
        "B", 
        "A", 
        "C"
    ], 
    "source": "middle1823"
}