{
    "article": "You may not think that having a good family is a problem. But for me, it was. I had to  _  the problem of being the youngest.\nWe live in a small town of Pennsylvania, US. There are three of us girls: Amanda, Theresa and me, the youngest. People would say things to me like \"Your sisters are so pretty! You're really _ like them.\" That made me sad.\nAt school, all of my teachers had taught my sisters. On the first day of school, they would always say, \"Oh, the youngest of the three!  _ you're just like your sisters. They are such wonderful students,\" People always compared me with my sisters, _ I would compare myself with them, too. I began to work hard to be _ 1ike them. What my sisters did, I did, too. And I did even more.  At last ,I became drum major of our school's band . Both Amanda and Theresa had been drum majors. I became editor of the school's newspaper; Theresa had been the editor two years before.\nBut last year, Amanda and Theresa left  school . Now I'm by myself at junior high. Everyone _ me, because I'm the drum major and the newspaper's editor. Now I don't feel like a Smith girl any more -I feel like myself. I'm _ of doing all of the same great things that my sisters did. And the _ thing I did was learn to stop comparing myself with them.", 
    "options": [
        [
            "cover", 
            "face", 
            "solve", 
            "check"
        ], 
        [
            "something", 
            "anything", 
            "everything", 
            "nothing"
        ], 
        [
            "think", 
            "wish", 
            "hope", 
            "agree"
        ], 
        [
            "so", 
            "but", 
            "as", 
            "because"
        ], 
        [
            "ever", 
            "very", 
            "more", 
            "most"
        ], 
        [
            "supports", 
            "protects", 
            "encourages", 
            "knows"
        ], 
        [
            "tired", 
            "proud", 
            "careful", 
            "afraid"
        ], 
        [
            "first", 
            "last", 
            "best", 
            "Worst"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "C", 
        "A", 
        "C", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "middle1693"
}