{
    "article": "The situation seemed hopeless. From the first day he entered my junior-high classroom, Willard P. Franklin lived in his own  _  , shutting out his classmates and me, his teacher. I tried to build a  _  relationship with him but he showed no interest. Even a \"Good Morning Willar\" received only a grunt that couldn't be  _  . Willard was a loner who seemed to have no hope or need to break silence. Shortly after the Thanksgiving holiday, we received the news of the annual Christmas collection of money for the less  _  people in our school district. \"Christmas is a season of  _  ,\" I told my students. \"There are a few students in the school who might not have a happy holiday season.  _  donating our Christmas collection, you will help buy food, clothing and toys for these needy people. We start the collection tomorrow.\" When I called for the donations the next day, I discovered that  _  everyone had forgotten, except Willard P. Franklin. The boy dug deep into his pants pockets  _  he walked up to my desk. Carefully, he  _  two coins into the small box. \"I don't need milk for lunch,\" he said  _  . For a moment, just a moment, he smiled . Then he turned and walked back to his desk. That night, after school, I took our  _  to the school principal. I couldn't  _  sharing the incident that had taken place. \"I may be wrong, but I believe Willard might be getting ready to become a part of the world around him,\" I told the principal. \"Yes, I believe it is  _  for him to get out of his own world,\" he nodded. \"And I think we can do something to have him  _  a bit of his world with us. I just received a  _  of the poor families in our school who most need help through the Christmas collection. Here, take a look at it.\" As I read, I discovered Willard P. Franklin and his family were the top names on the list.", 
    "options": [
        [
            "class", 
            "school", 
            "world", 
            "home"
        ], 
        [
            "equal", 
            "simple", 
            "friendly", 
            "common"
        ], 
        [
            "seen", 
            "heard", 
            "found", 
            "discovered"
        ], 
        [
            "poor", 
            "good", 
            "sad", 
            "rich"
        ], 
        [
            "giving", 
            "getting", 
            "buying", 
            "receiving"
        ], 
        [
            "By", 
            "With", 
            "For", 
            "On"
        ], 
        [
            "mostly", 
            "hardly", 
            "almost", 
            "simply"
        ], 
        [
            "while", 
            "after", 
            "before", 
            "as"
        ], 
        [
            "threw", 
            "dropped", 
            "brought", 
            "changed"
        ], 
        [
            "angrily", 
            "quietly", 
            "patiently", 
            "sadly"
        ], 
        [
            "students", 
            "classmates", 
            "teachers", 
            "donations"
        ], 
        [
            "keep", 
            "enjoy", 
            "stop", 
            "finish"
        ], 
        [
            "hopeless", 
            "hopeful", 
            "difficult", 
            "impossible"
        ], 
        [
            "compare", 
            "begin", 
            "mix", 
            "share"
        ], 
        [
            "list", 
            "note", 
            "message", 
            "letter"
        ]
    ], 
    "answers": [
        "C", 
        "C", 
        "B", 
        "D", 
        "A", 
        "A", 
        "C", 
        "D", 
        "B", 
        "B", 
        "D", 
        "C", 
        "B", 
        "D", 
        "A"
    ], 
    "source": "middle2288"
}