{
    "article": "When Sandy was a little girl, she liked keeping pets. She had many books about animals and many pictures of animals on the walls of her bedroom. She often said that she would work in a  _  when she grew up. Most of Sandy's pets were quiet small--parrots, cats, dogs and so on. But one day she met something quite  _  . That afternoon, Sandy's mother was surprised to see a big animal with long hair in the kitchen. He  _  ) called Jim had run away from the zoo. \"I found him in the city square,\" Sandy said. \"He seemed so  _  . I talked to him. We became friends at once and he followed me home.\" \"Well, you know you  can't  keep him,\" her mother said. \"You must send him back to the zoo. You'd better phone the police.\" Soon a  _  came and also a truck from the zoo.  Nobody  was angry with Sandy when she told her story. The policeman knew Sandy loved animals. And the zookeeper said, \"Thank you for your kindness. I can see Jim likes you,  _  we need to take him back.\" Sandy agreed. She hugged Jim and said that she would go and see him  at the weekends  These days Sandy has stopped collecting  _  , but you can still find her with her friend Jim at the zoo on Saturdays and Sundays.", 
    "options": [
        [
            "hospital", 
            "zoo", 
            "school", 
            "supermarket"
        ], 
        [
            "small", 
            "long", 
            "short", 
            "big"
        ], 
        [
            "wore", 
            "made", 
            "sold", 
            "lent"
        ], 
        [
            "easy", 
            "hard", 
            "difficult", 
            "lonely"
        ], 
        [
            "teacher", 
            "policeman", 
            "student", 
            "friend"
        ], 
        [
            "and", 
            "but", 
            "or", 
            "so"
        ], 
        [
            "clothes", 
            "glasses", 
            "animals", 
            "fruit"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "A", 
        "D", 
        "B", 
        "B", 
        "C"
    ], 
    "source": "middle266"
}