{
    "article": "It was a school sports meeting. My foot still hadn't healed from earlier injury. I had  _  whether I should attend the meeting. Bui finally l was standing at starting line, ready for the 3000-meter run. \"Ready....set....\"the gun popped and we all _ 0ff.A few ,minutes later. When I saw the other girls running ahead of me, I felt very ashamed  as I fell farther and farther behind.\"Hooray!\"shouted the crowd.1t was the _  cheer I had ever heard at a  meeting. The first-place runner was two laps ahead of me when she crossed the finishing line. \"Maybe I should _  out.\"I thought as I moved on along the track. However, I made up my mind to keep running for the last two laps in the race. I ran in  _  and decided not to take part in the race next year. \"It won't be worth even if my foot has healed,\"I thought.\nWhen I got to the finishing line. I heard _ cheer. louder than the one\nI'd heard earlier. I turned around and sure enough the boys were preparing for their race. I said to myself. \"They must be cheering for the boys.\"\n1 was leaving _ when several girls came up to me. \"Wow. you've got courage!\"one of them told me.\"Courage? I've  just lost a race!\"I thought.\"I would have  _ up on the first lap if I were you,\" said one girl. \"AII of us were cheering for you. Did you hear us?\" After hearing these words. I suddenly regained  _ .I decided to stick with stick next year. I realized strength and courage aren't always measured in medals and victories, but in the difficulty we overcome .The strongest people are not always the people who _ ,but the people who don't give up when they fail.", 
    "options": [
        [
            "imagined", 
            "suggested", 
            "doubted", 
            "expected"
        ], 
        [
            "rushed", 
            "jumped", 
            "got", 
            "took"
        ], 
        [
            "worst", 
            "earliest", 
            "loudest", 
            "shortest"
        ], 
        [
            "help", 
            "point", 
            "check", 
            "drop"
        ], 
        [
            "order", 
            "pain", 
            "fear", 
            "surprise"
        ], 
        [
            "another", 
            "either", 
            "other", 
            "some"
        ], 
        [
            "proudly", 
            "nervously", 
            "pleasantly", 
            "silently"
        ], 
        [
            "given", 
            "caught", 
            "cheered", 
            "speeded"
        ], 
        [
            "energy", 
            "hope", 
            "success", 
            "opportunity"
        ], 
        [
            "argue", 
            "win", 
            "challenge", 
            "complain"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "C", 
        "D", 
        "B", 
        "A", 
        "D", 
        "A", 
        "B", 
        "B"
    ], 
    "source": "middle1581"
}