{
    "article": "The only survivor of a shipwreck   was washed up onto a small lonely island. He prayed crazily for God to _ him, and every day he kept a close watch on the endless sea. No matter how hard he wished or how much he thought about leaving this _ , it's no use because ships did not often come down thiscoast.There was nothing he could do, except struggling to survive on his own. With great effort, he finally _ to build a little house out of driftwood to protect him from hot sun and terrible storms, and to _ his possessions. But then one day, after searching for food, he arrived home to find his little house on fire, the dark smoke rolling up to the sky. The worst had happened, everything was lost.\n\"God, how could you do this to me!\" he cried _ Early the next day, however, he was awakened by the sound of a ship that was heading towards the island. It had come to save him.\n\"How did you know I was here?\" asked the tired man in surprise. \"We saw your _ signal.\" the captain replied.\nIt is easy to get _ when things are going bad. But we shouldn't lose _ , because if God\nclosed a door in front of you, there must be a _ opened for you. Go ahead and stay _ . We can make it.", 
    "options": [
        [
            "visit", 
            "save", 
            "concern", 
            "respect"
        ], 
        [
            "island", 
            "country", 
            "city", 
            "town"
        ], 
        [
            "managed", 
            "continued", 
            "afford", 
            "offered"
        ], 
        [
            "get", 
            "take", 
            "send", 
            "store"
        ], 
        [
            "hardly", 
            "angrily", 
            "happily", 
            "cheerfully"
        ], 
        [
            "smoke", 
            "voice", 
            "colour", 
            "light"
        ], 
        [
            "pleased", 
            "ashamed", 
            "embarrassed", 
            "discouraged"
        ], 
        [
            "way", 
            "heart", 
            "weight", 
            "balance"
        ], 
        [
            "window", 
            "wall", 
            "fence", 
            "roof"
        ], 
        [
            "wrong", 
            "correct", 
            "negative", 
            "positive"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "A", 
        "D", 
        "B", 
        "A", 
        "D", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "middle2242"
}