{
    "article": "On a snowy evening, a rich lady was standing by the road. She was very worried. Her _ broke down. Just then a poor man named Robert came. He was on his way back  _ from work as usual.\nThe lady wondered, \"Is the man going to _ me? He looks very cold and hungry.\" But to her surprise, he _ and said with a smile, \"Can I help you, madam?\"\nAfter forty _ , the car was at last fixed by Robert. The lady wanted to pay him.\n\"No, that' s _ , madam,\" he said. \" I was just helping someone in _ . If you really want to pay me back, I hope when you find someone needs help, you should give him a hand.\"\nA few minutes later, the lady _ a shabby  house by the road. She remembered Robert's words,  _  she stopped.\nThe hostess  warmly asked her in. The lady could see that was a _ family and that they need help. When the hostess was making tea in the kitchen, the lady _ 500 dollars on a table and went away _ .\nRobert came home later than before, thinking how _ their life was. His wife was pregnant and the baby would be born the next month but there was not _ money. His wife went up to him, gave him a kiss and said softly, \"Don't worry, dear! Everything is going to be all right. A _ has helped us out.\"\nLet's always be ready to help others because helping others is helping ourselves.", 
    "options": [
        [
            "bike", 
            "car", 
            "truck", 
            "bus"
        ], 
        [
            "factory", 
            "shop", 
            "office", 
            "home"
        ], 
        [
            "help", 
            "save", 
            "punish", 
            "eat"
        ], 
        [
            "ran", 
            "agreed", 
            "stopped", 
            "left"
        ], 
        [
            "days", 
            "hours", 
            "minutes", 
            "years"
        ], 
        [
            "something", 
            "anything", 
            "everything", 
            "nothing"
        ], 
        [
            "picture", 
            "rain", 
            "danger", 
            "need"
        ], 
        [
            "saw", 
            "heard", 
            "smelt", 
            "felt"
        ], 
        [
            "so", 
            "if", 
            "because", 
            "since"
        ], 
        [
            "terrible", 
            "sad", 
            "poor", 
            "rich"
        ], 
        [
            "threw", 
            "forgot", 
            "gave", 
            "left"
        ], 
        [
            "quietly", 
            "noisily", 
            "gently", 
            "sadly"
        ], 
        [
            "exciting", 
            "interesting", 
            "hard", 
            "happy"
        ], 
        [
            "many", 
            "enough", 
            "some", 
            "few"
        ], 
        [
            "friend", 
            "relative", 
            "stranger", 
            "classmate"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "A", 
        "C", 
        "C", 
        "D", 
        "D", 
        "A", 
        "A", 
        "C", 
        "D", 
        "A", 
        "C", 
        "B", 
        "C"
    ], 
    "source": "middle2107"
}