{
    "article": "I have always wanted to share this story because it is one of the things that I will remember for my whole life. And I'm sure the other person feels the same. We had a new teacher in my middle school World History class. She was very nice and excited to see us. She told a story about her  _  fighting in a war and brought a picture of him. After about fifteen  _  of her talking, the class started talking softly to each other  because  they were getting bored. Looking  _  , she asked \"So, you guys don't really want to hear any more?\" No one dared to say \"no\" to her loud  except  one kid. He said, \"No, not really!\"  _  a disrespectful way. Some kids were a little  _  and thought that it was rather rude. I felt really bad for this teacher. No one should be  _  in such a disrespectful manner. Therefore, near the end of the class I went up and said  _  to her for the guy's rude behavior. I told her I had been listening, and even though I may not really like  _  , I was grateful to her for sharing her story. I asked her  _  about her father and asked to see the picture of him. We had a very nice, sincere conversation about her father. The teacher was touched. She thanked me for coming up and actually treating her with the respect that she deserved. I felt at full peace with  _  knowing that I did the right thing and I was super happy that I made her day. Even though I didn't really care for history, I  _  listened, and I hope that others in different situations will do the same. Listening means a lot to the people sharing; it really  _  . If I had just left the class without saying a word, I would have felt very  _  and would have a constant reminder, probably to this day, that justice was not served and I had left a person in their time of need.", 
    "options": [
        [
            "father", 
            "husband", 
            "uncle", 
            "brother"
        ], 
        [
            "hours", 
            "minutes", 
            "seconds", 
            "days"
        ], 
        [
            "hurt", 
            "funny", 
            "proud", 
            "worried"
        ], 
        [
            "in", 
            "with", 
            "on", 
            "by"
        ], 
        [
            "interested", 
            "excited", 
            "pleased", 
            "shocked"
        ], 
        [
            "treated", 
            "considered", 
            "blamed", 
            "taught"
        ], 
        [
            "thanks", 
            "goodbye", 
            "sorry", 
            "hello"
        ], 
        [
            "geography", 
            "art", 
            "music", 
            "history"
        ], 
        [
            "nothing", 
            "little", 
            "less", 
            "more"
        ], 
        [
            "me", 
            "myself", 
            "I", 
            "mine"
        ], 
        [
            "ever", 
            "even", 
            "still", 
            "seldom"
        ], 
        [
            "means", 
            "makes", 
            "is", 
            "does"
        ], 
        [
            "happy", 
            "guilty", 
            "lucky", 
            "empty"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "A", 
        "A", 
        "D", 
        "A", 
        "C", 
        "D", 
        "D", 
        "B", 
        "C", 
        "D", 
        "B"
    ], 
    "source": "middle589"
}