{
    "article": "When I was young,my father told me that little acts of kindness may give one great happiness. Since then I have always tried to help people in  _  . One hot summer afternoon, I was  _  down the highway to New York when another car suddenly  _  into my lane . My car was in the far right lane,so it ran onto the roadside. As a(n)  _  driver,I moved my car quickly and skillfully back onto the highway without causing any accident. I was  _  with that driver,but I thought that he just did not pay attention to the lane change, and he  _  did not do that on purpose .The car ran away  _  after cutting me off. Very soon it disappeared from sight. After a while,I came around a curve and found the  _  car. The driver was walking along the roadside. He was an elderly man and looked  _  . As there was no telephone nearby and the nearest services were twenty miles away, I decided to  _  and see what the problem was. The man's car had a flat tire . Although he had another tire,he had nothing to work with. I decided to  _  him. I changed the tire for him and allowed him to sit in my air-conditioned car while I did it. Fifteen minutes later,I  _  the work. I was hot and tired,but I really felt  _  after an act of kindness to the man who had earlier  _  my car run off the road. You can really enjoy great  _  from kindness acts, so always lend your hands to others in trouble.", 
    "options": [
        [
            "need", 
            "school", 
            "danger", 
            "summer"
        ], 
        [
            "walking", 
            "riding", 
            "running", 
            "driving"
        ], 
        [
            "fell", 
            "jumped", 
            "came", 
            "climbed"
        ], 
        [
            "new", 
            "experienced", 
            "frightened", 
            "cheerful"
        ], 
        [
            "unhappy", 
            "interested", 
            "kind", 
            "friendly"
        ], 
        [
            "even", 
            "certainly", 
            "almost", 
            "simply"
        ], 
        [
            "quickly", 
            "quietly", 
            "politely", 
            "carefully"
        ], 
        [
            "new", 
            "red", 
            "same", 
            "other"
        ], 
        [
            "excited", 
            "relaxed", 
            "surprised", 
            "worried"
        ], 
        [
            "stay", 
            "search", 
            "stop", 
            "hide"
        ], 
        [
            "give", 
            "train", 
            "help", 
            "encourage"
        ], 
        [
            "began", 
            "finished", 
            "took", 
            "continued"
        ], 
        [
            "good", 
            "sorry", 
            "angry", 
            "shy"
        ], 
        [
            "kept", 
            "made", 
            "watched", 
            "heard"
        ], 
        [
            "friendship", 
            "success", 
            "excitement", 
            "happiness"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "C", 
        "B", 
        "A", 
        "B", 
        "A", 
        "C", 
        "D", 
        "C", 
        "C", 
        "B", 
        "A", 
        "B", 
        "D"
    ], 
    "source": "middle1017"
}