{
    "article": "Grandma was busy cooking in the kitchen and Sera was always to be here for dinner. There were many photographs of past and present  _  members and many other old things on her grandma's table. Among them, she especially loved the large clay pot . It was beautiful, painted in many colours. \"May I hold it?\" asked Sera. \"Yes, but please be  _  . It is very old.\" Grandma picked up the pot with gentle hands, gave it to Sera, and then went into the kitchen. Sera decided to sit on the sofa. The sofa was a few feet  _  her. She went backward.  _  a toy truck was there. The truck rolled away when Sera stepped on it. She fell back onto the sofa. The clay pot  _  out of her hands and up into the air! It landed on the floor. Sera could hear the clay crack . \"No, no!\" she cried. She heard grandma's footsteps coming toward her. How could she face her grandma now? \"It's not so  _  , Sera,\" Grandma said. \"Come on. You can repair the pot.\" \"Let me tell you a story about that pot.\" Grandma pointed to another crack in the pot. Sera had never  _  it before. \"My grandma made this crack when she was about your age,\" said grandma. \"She was carrying it back to the village  _  it fell onto the road. It had been full of  _  , so she got all wet!\" She pointed to another crack. \"This crack came when I dropped the pot on a big boat that brought  _  here from Canada,\" said grandma smiling. Sera laughed and held up the pot. She could see now how each crack had become part of the colourful design--and part of her family's story.", 
    "options": [
        [
            "school", 
            "family", 
            "team", 
            "village"
        ], 
        [
            "helpful", 
            "useful", 
            "careful", 
            "peaceful"
        ], 
        [
            "behind", 
            "beside", 
            "under", 
            "above"
        ], 
        [
            "Suddenly", 
            "Amazingly", 
            "Unluckily", 
            "Surprisingly"
        ], 
        [
            "picked", 
            "threw", 
            "dropped", 
            "flew"
        ], 
        [
            "bad", 
            "safe", 
            "late", 
            "easy"
        ], 
        [
            "known", 
            "watched", 
            "heard", 
            "noticed"
        ], 
        [
            "when", 
            "until", 
            "if", 
            "unless"
        ], 
        [
            "sand", 
            "water", 
            "salt", 
            "sugar"
        ], 
        [
            "we", 
            "our", 
            "us", 
            "ours"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "C", 
        "D", 
        "A", 
        "D", 
        "A", 
        "B", 
        "C"
    ], 
    "source": "middle2325"
}