{
    "article": "Leaving high school, I had to choose a career path--medicine or business--before college started in three months, but I couldn't decide. Both my uncles suggested I work for a month in a _ followed by a month in a hospital before I could know what to do. It seemed like a good idea.\nThen near the end of two months, I began thinking about my two _ . The bank had offered better working conditions. The hospital was full of excitement, but the training was hard. It seemed that the choices of _ was going to run out.\nThe Last day of my work at the hospital, I was _ home when I saw a boy hit by a bus and lie in the road as the bus run away. _ stopped. I know if the boy stayed there, he would die very soon. So, without help, I lifted him into my car.\nThe next day, I went to see him. His family were sitting around his bed. The doctor introduced me as \"the person who saved the boy's life\". Everyone got up, with _ smiles on their faces. The mother held my hands to her face, repeating again and again, \"See, you are an angel!\"\nWhat a feeling this was, to help save the life of another person! _ , I knew I wanted to do for the rest of my life. I went to college for my medical studies.\nWe may spend a lot of time wondering about what _ to take in our lives, but sometimes you don't really have to worry about your _ decisions. They are made for you by some quality  in you--by what you're _ to do when necessary.", 
    "options": [
        [
            "team", 
            "company", 
            "garden", 
            "laboratory"
        ], 
        [
            "uncles", 
            "hobbies", 
            "colleges", 
            "experiences"
        ], 
        [
            "business", 
            "education", 
            "career", 
            "subject"
        ], 
        [
            "running", 
            "riding", 
            "staying", 
            "driving"
        ], 
        [
            "All", 
            "Few", 
            "Nobody", 
            "Someone"
        ], 
        [
            "gentle", 
            "weak", 
            "pleasant", 
            "grateful"
        ], 
        [
            "Luckily", 
            "Probably", 
            "Immediately", 
            "Quietly"
        ], 
        [
            "path", 
            "action", 
            "interest", 
            "advice"
        ], 
        [
            "big", 
            "personal", 
            "quick", 
            "fair"
        ], 
        [
            "free", 
            "afraid", 
            "ready", 
            "careful"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "A", 
        "D", 
        "C", 
        "D", 
        "C", 
        "A", 
        "A", 
        "C"
    ], 
    "source": "middle1075"
}