{
    "article": "Friends play an important role in our life. Most people hope that their friends will always be there. They  _  friendship to last forever.  _  , even the best friendship can end. As time goes by, many friendships end because of a(n)  _  in personality or way of life. The friendship slowly loses importance and finally  _  . Tommy wrote, \"I didn't even know the friendship was over until I caught myself thinking of Alan as a former friend.\" Peter explained. \"We  _  seeing each other less and less. The friendship was just over.\" Sometimes friendships  break off  suddenly from a disagreement or move to another place. Alice said, \"The end of our friendship was a gradual thing. I moved from one side of the city to the other. Since then we  _  made a phone call. We met less and less. At last our friendship ended.\" Jack said, \" When I moved to Seattle after college, our friendship died. Both of us were always  _  with new jobs, so we didn't keep  _  touch with each other. Our friendship was so dead that I didn't call him  even if  I went home.\" Yet the biggest problem to a friendship is change. Lillian Rubin in her book Just Friends say, \"Generally it's  _  that friends will accept each other if they both remain what they were when they met, or change in similar directions. If they change or grow in different ways, the friendship most likely  will be  lost.\" No matter why, when, or how friendships end, there is always  _  pain of loss. When nothing can be  _  to keep the friendship, it is important to forget the pain. Then move on  to build  new friendships. May new friendships bring you pleasure and happiness!", 
    "options": [
        [
            "hope", 
            "expect", 
            "decide", 
            "prefer"
        ], 
        [
            "Unfortunately", 
            "Luckily", 
            "Then", 
            "So"
        ], 
        [
            "interest", 
            "experience", 
            "change", 
            "Suggestion"
        ], 
        [
            "forgets", 
            "disappears", 
            "appears", 
            "improves"
        ], 
        [
            "finished", 
            "practiced", 
            "continued", 
            "started"
        ], 
        [
            "often", 
            "seldom", 
            "always", 
            "never"
        ], 
        [
            "struggling", 
            "satisfying", 
            "pleased", 
            "fed"
        ], 
        [
            "at", 
            "by", 
            "on", 
            "in"
        ], 
        [
            "strange", 
            "true", 
            "false", 
            "impossible"
        ], 
        [
            "little", 
            "some", 
            "any", 
            "no"
        ], 
        [
            "thought", 
            "checked", 
            "carried", 
            "done"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "B", 
        "D", 
        "B", 
        "A", 
        "D", 
        "B", 
        "B", 
        "D"
    ], 
    "source": "middle426"
}