{
    "article": "One summer evening I was sitting by the open window, reading a good novel. I was so interested in the story I was reading that I didn't _ that it was getting dark. When I realized that it was too dark for me to read _ , I put the book down and got up to turn on the light. Just then I heard someone _ , \"Help! Help!\" It seemed to come from the trees at the end of the yard. I looked out but it was too dark to see anything clearly. Almost immediately I heard the cry again. It sounds like a child, but I could not _ what someone would be doing in our backyard, unless one of my neighbor's children had climbed a tree and had not been able to get down .\nI decided that I should go out and have a look in the yard, just in case someone was in trouble With a flashlight and a stick in my hands, I went out into the yard. Once again I heard the cry and this time there was no doubt that it came from the trees at the far end of the yard. \"Who is there?\" I called out as I walked across the yard towards the trees. But there was no _ . With the help of my flashlight, I _ all over that end of the yard, including the branches of the trees. There was no _ of anybody or anything. I came to the conclusion that my _ made fun of me, probably nothing is happening there.\nI had to go back into the house and sat down to read my book again. Not long after that, I was _ by the loud cry of \"Help! Help!\" This time it was from right behind me! I dropped my book and jump up. There, sitting on the table was my neighbor's large green and red _ .", 
    "options": [
        [
            "mind", 
            "expect", 
            "notice", 
            "hope"
        ], 
        [
            "quietly", 
            "noisily", 
            "quickly", 
            "easily"
        ], 
        [
            "laughing", 
            "talking", 
            "speaking", 
            "shouting"
        ], 
        [
            "choose", 
            "imagine", 
            "question", 
            "understand"
        ], 
        [
            "noise", 
            "sound", 
            "voice", 
            "answer"
        ], 
        [
            "cut", 
            "searched", 
            "touched", 
            "beat"
        ], 
        [
            "seat", 
            "sign", 
            "place", 
            "kind"
        ], 
        [
            "imagination", 
            "brother", 
            "neighbor", 
            "dog"
        ], 
        [
            "encouraged", 
            "told", 
            "called", 
            "frightened"
        ], 
        [
            "cock", 
            "chicken", 
            "parrot", 
            "hen"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "D", 
        "B", 
        "D", 
        "B", 
        "B", 
        "A", 
        "D", 
        "C"
    ], 
    "source": "middle651"
}