{
    "article": "No family wants its home to catch fire, but it's good to plan for a fire just in case . Talk with your family about  _  to do if a fire starts.  Everyone  should have a plan for getting out of the house. Be sure to choose a safe place to  _  after everyone gets away from the fire. What should you do  _  there is a fire? First,  _  people know about the fire. Yell the word \"fire\". Knock on the walls with your hands. Then  _  the door of your room. If the door is warm, don't open it. If it's cool, open it just enough to  look out  . If you see fire or much smoke, close the door fast. If you can't see fire or smoke, you can go out of the door. Shut the  _  behind you. That will slow down the fire. Now find a  _  out. Stay away from the smoke. The air is the  _  near the floor. So it  may  be the safest to crawl when you leave the house. If you can't leave your room, close your door. Cover the crack under the door  _  clothing. Then open the window or  _  the glass with a chair. Crawl out, of the window  _  .If the window is high off the ground,  _  jump! Wave a towel out of the window, and yell for help. When you get out of the house, run to the place where you and your family chose to meet.", 
    "options": [
        [
            "how", 
            "when", 
            "what", 
            "where"
        ], 
        [
            "visit", 
            "sleep", 
            "stand", 
            "meet"
        ], 
        [
            "unless", 
            "if", 
            "because", 
            "as"
        ], 
        [
            "let", 
            "teach", 
            "want", 
            "ask"
        ], 
        [
            "look", 
            "hear", 
            "feel", 
            "smell"
        ], 
        [
            "window", 
            "door", 
            "house", 
            "room"
        ], 
        [
            "way", 
            "trip", 
            "time", 
            "plan"
        ], 
        [
            "best", 
            "worst", 
            "thinnest", 
            "least"
        ], 
        [
            "by", 
            "in", 
            "of", 
            "with"
        ], 
        [
            "clean", 
            "wash", 
            "break", 
            "make"
        ], 
        [
            "happily", 
            "loudly", 
            "excitedly", 
            "carefully"
        ], 
        [
            "can't", 
            "don't", 
            "not", 
            "no"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "B", 
        "A", 
        "C", 
        "B", 
        "A", 
        "A", 
        "D", 
        "C", 
        "D", 
        "B"
    ], 
    "source": "middle1103"
}