{
    "article": "The world of out-of-doors is full of secrets. And they are so interesting that quite a lot of people are busy studying them. All around us are birds, animals, trees and flowers. The facts about how they  _  and grow are as interesting as anything could be. Do you know that one of the great Presidents of the USA spent hours and hours  _  birds? A businessman who lives near New York city became so  _  in insects that he began to collect them. He now has more than one thousand different kinds carefully  _  in glass boxes. Come then with me, and I will help you find some of nature's secrets. Let us go  _  through the woods and fields. Here we shall find now a rabbit tells the other rabbits that there is danger. We shall  _  a mother bear and her young ones as they look for  _  and get ready for winter sleep. We shall watch bees dancing in the air to let other bees know  _  they can find food. I will show you many other interesting things, but the thing that I can  _  you is to keep your eyes and ears  _  when you go out of doors. Nature tells her secrets only to people who look and listen carefully.", 
    "options": [
        [
            "bear", 
            "live", 
            "speak", 
            "fly"
        ], 
        [
            "studying", 
            "eating", 
            "learning", 
            "finding"
        ], 
        [
            "friendly", 
            "carefully", 
            "busy", 
            "interested"
        ], 
        [
            "locked", 
            "kept", 
            "put", 
            "filled"
        ], 
        [
            "near", 
            "quickly", 
            "quietly", 
            "politely"
        ], 
        [
            "hear", 
            "follow", 
            "catch", 
            "help"
        ], 
        [
            "food", 
            "fruit", 
            "vegetables", 
            "water"
        ], 
        [
            "how", 
            "why", 
            "where", 
            "when"
        ], 
        [
            "make", 
            "pass", 
            "give", 
            "teach"
        ], 
        [
            "closed", 
            "open", 
            "safe", 
            "clean"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "D", 
        "B", 
        "C", 
        "B", 
        "A", 
        "C", 
        "D", 
        "B"
    ], 
    "source": "middle765"
}