{
    "article": "I was once a fat girl . I weighed 336 pounds and looked as big as my fridge. I was never worried about it. But one day I had a medical examination . The _ told me that I was having heart trouble. It _ me up. I began to feel nervous. Then I decided to do something!\nIn a year and five months, I _ 104 pounds. What a great thing I did ! I didn't have any expensive food, medical treatment or camp-style exercise. What was the secret to my _ ?\nFirst I looked through the Internet for do-it-yourself _ that people could follow on losing weight. Of course I saw countless ads which try to get me to buy their products. But I bought nothing. The only thing I did was to change my bad _ . The following are what I have done. You can try these. Stop drinking something with too much sugar in it. _ sweet cakes. Eat green vegetables. Use only vegetable oil. Never eat after 6:30 pm. Also, do light exercise for 15 to 20 minutes five days a week.\nThen I kept doing what I should do. People sometimes say,\"You don't need to tell me _ to do. I know it already!\"But the fact is that knowing what to do and doing what you know are totally _ . The important thing is to know what to do and then just keep doing it..", 
    "options": [
        [
            "doctor", 
            "friend", 
            "mother", 
            "teacher"
        ], 
        [
            "gave", 
            "cheered", 
            "dressed", 
            "woke"
        ], 
        [
            "borrowed", 
            "lent", 
            "lost", 
            "got"
        ], 
        [
            "happiness", 
            "success", 
            "kindness", 
            "richness"
        ], 
        [
            "advice", 
            "news", 
            "food", 
            "medicine"
        ], 
        [
            "grades", 
            "look", 
            "wish", 
            "habits"
        ], 
        [
            "Accept", 
            "Bring", 
            "Refuse", 
            "Make"
        ], 
        [
            "how", 
            "what", 
            "why", 
            "whether"
        ], 
        [
            "easy", 
            "difficult", 
            "similar", 
            "different"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "C", 
        "B", 
        "A", 
        "D", 
        "C", 
        "B", 
        "D"
    ], 
    "source": "middle805"
}