{
    "article": "I had worked that day, as a nurse. Now I faced the dirty supper dishes. I wanted to  _  why Jimmy hadn't phoned as usual to say \"Good night\" to Bob and Tom. \"Maybe Daddy's  _  working on an accident,\" I said to Bob. \"Go to  _  now. You'll see him in the morning.\" Soon there was a knock at the door. \"There  _  be something wrong with your phone,\" my neighbor told me. \"The City Police Station wants you to  _  .\" I went into the living room and dialed. Then I  _  the words every police wife fears : \"Your husband has been hurt.\" When I reached the hospital, my heart sank . The entrance was jammed with TV-news trucks. In the  _  I saw Jimmy's best friend, Smith. \"Just tell me -is he alive ?\" I asked. Smith  _  and didn't answer. Then I found my younger sister, Mandy. \"He's  _  .\" she told me, and we began to cry together. Later, Smith told me  _  had happened. In the morning, when my little Bob asked, \"Where's Daddy?\" I  _  him into my arms and tried to explain. \"A bad man  _  Daddy last night.\" I said. \"Daddy can't come home any more. He's in heaven now.\" My son looked at me, his blue eyes  _  the picture of trust . \"Do they have  _  in heaven ?\" he asked. \"Can I call him ?\" \"No, Bob, Daddy still loves you, but Daddy can't  _  \".", 
    "options": [
        [
            "know", 
            "understand", 
            "remember", 
            "guess"
        ], 
        [
            "busy", 
            "never", 
            "sure", 
            "often"
        ], 
        [
            "play", 
            "study", 
            "sleep", 
            "wait"
        ], 
        [
            "must", 
            "need", 
            "can", 
            "will"
        ], 
        [
            "rest", 
            "call", 
            "work", 
            "stay"
        ], 
        [
            "saw", 
            "remember", 
            "heard", 
            "wrote"
        ], 
        [
            "room", 
            "crowd", 
            "truck", 
            "station"
        ], 
        [
            "forgot", 
            "turned", 
            "returned", 
            "understood"
        ], 
        [
            "dangerous", 
            "fine", 
            "afraid", 
            "gone"
        ], 
        [
            "how", 
            "where", 
            "when", 
            "what"
        ], 
        [
            "pulled", 
            "pushed", 
            "sent", 
            "held"
        ], 
        [
            "saw", 
            "beat", 
            "hurt", 
            "caught"
        ], 
        [
            "drawing", 
            "showing", 
            "looking", 
            "enjoying"
        ], 
        [
            "food", 
            "language", 
            "phones", 
            "TVs"
        ], 
        [
            "work", 
            "talk", 
            "sleep", 
            "rest"
        ]
    ], 
    "answers": [
        "A", 
        "A", 
        "C", 
        "A", 
        "B", 
        "C", 
        "B", 
        "B", 
        "D", 
        "D", 
        "A", 
        "C", 
        "B", 
        "C", 
        "B"
    ], 
    "source": "middle1436"
}