{
    "article": "Maddy Cullen became a heroine last month. Thanks to her quick thinking, she and Dave Lewis were saved from danger in the _ .\nMaddy and Dave went to the Scottish Highlands with a group from the Music Now Festival. In the afternoon, the group went _ on the lake, but Maddy and Dave went hang-glider  instead. Unfortunately, above the famous lake Loch Ness, the hang-glider flew into a sudden storm and knocked on a mountain out of _ . Both Maddy and Dave jumped off the hang-glider before it crashed down . They dropped safely in the mountains. But Dave couldn't walk because his right leg was badly injured. He and Maddy had to stay in the mountains and waited for rescuers. They had no food or water, so they were hungry, thirsty and _ . They felt very worried before the sun set. Then Maddy had a very good idea. She collected many stones and formed a large sign \"SOS\" on the ground so that pilots in the helicopter could find them _ .\nMeanwhile, group leader Rob Townsend was also worried when he found Maddy and Dave didn't sail with them. There were no public _ anywhere nearby. He had to walk a long way to  call the police to look for the missing teenagers. A few minutes later, a police helicopter flew over Loch Ness, and the pilot saw Maddy's message from above easily. Dave and Maddy were _ up and flown to hospital in Inverness quickly.\nA week ago, Maddy spoke to a reporter from the newspaper. \"We were very _ when the helicopter arrived,\" she said. \"The police told Dave not to move and they carried him into the helicopter. They asked us to put on dry clothes and _ some hot soup to us. They were great.\"\n\"It was all because of me,\" Dave said. \"Rob told us to wear walking boots, and he told us not to leave the group. But I did not listen. I was very silly.\"\nThe police _ . On its radio news, they asked walkers in the Highlands to follow instructions carefully and not to take any adventures.", 
    "options": [
        [
            "forest", 
            "sea", 
            "mountains", 
            "lake"
        ], 
        [
            "sailing", 
            "fishing", 
            "skating", 
            "swimming"
        ], 
        [
            "sight", 
            "trouble", 
            "control", 
            "date"
        ], 
        [
            "alone", 
            "sad", 
            "calm", 
            "cold"
        ], 
        [
            "silently", 
            "easily", 
            "simply", 
            "carefully"
        ], 
        [
            "telephones", 
            "libraries", 
            "websites", 
            "bicycles"
        ], 
        [
            "given", 
            "put", 
            "woken", 
            "picked"
        ], 
        [
            "excited", 
            "confused", 
            "frustrated", 
            "scared"
        ], 
        [
            "shared", 
            "offered", 
            "cooked", 
            "provided"
        ], 
        [
            "insisted", 
            "agreed", 
            "considered", 
            "suggested"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "C", 
        "D", 
        "B", 
        "A", 
        "D", 
        "A", 
        "B", 
        "B"
    ], 
    "source": "middle574"
}