{
    "article": "How many plastic bags do you use every day?  _  there any chance for us to live without them? What can we do to have  _  plastic pollution? A performance in Hangzhou makes people  think  more about the overuse of plastic bags in our lives. In front of a supermarket in Hangzhou , five volunteers  wore  white plastic bags and walked around and through the crowd. The performance  called on  people to use more cloth bags  instead of  plastic ones. Some of the plastic bags worn by the performers were collected from customers in two food markets and  the others  were collected by 700 students from a middle school. On that day, when leaving the food markets, customers were told to hand over  _  plastic shopping bags.  Hundreds of  plastic bags were collected in two hours. \" If we do  _  about it, the earth will be eaten up by white pollution. And  human beings  will become 'plastic men',\"said one of the performers. \"How can you breathe in  so many  plastic bags?\" A  40-year-old  woman asked one performer.\"How can the earth breathe  _  there are too many plastic bags?\"the performer answered. Starting in June 2008,plastic bags were  no longer  given for free in supermarkets,shopping malls or food markets all over the country. People are called on to use cloth bags when they go shopping.", 
    "options": [
        [
            "Are", 
            "Were", 
            "Is", 
            "Was"
        ], 
        [
            "few", 
            "much", 
            "fewer", 
            "less"
        ], 
        [
            "helpful", 
            "unnecessary", 
            "useful", 
            "necessary"
        ], 
        [
            "nothing", 
            "anything", 
            "something", 
            "everything"
        ], 
        [
            "until", 
            "because", 
            "if", 
            "unless"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "B", 
        "A", 
        "C"
    ], 
    "source": "middle739"
}