{
    "article": "All over the world people swim for fun. Swimming is enjoyed by people of  _  ages, from the very young to the very old. There are many places for people to swim in swimming pools. Many schools, hotels and clubs have swimming pools. Some people have pools of  their own  in their yards. Swimming is one of  the best  forms of exercise. It can  _  hearts and bodies strong. It can also help blood circulate . Handicapped people can keep their bodies in better condition by swimming  _  they can't enjoy sports.  _  is a good idea for parents to see to it that their children learn to swim  _  an early age. So their children will  _  it for the rest of their lives. There are many rules for water safety. These rules can help save not only your life  but also  the life of a friend. First of all, know  how to swim  . Many schools  _  swimming lessons to children. Adults can learn to swim at public pools.  Another  rule to remember is never to swim  _  . Always swim with a friend and know  where that person is  in the water at all times. It is best to swim  _  in safe places if you are beginners. If every one learned to swim and obeyed the rules for water safety, most drawing could be avoided.", 
    "options": [
        [
            "all", 
            "any", 
            "som", 
            "both"
        ], 
        [
            "help", 
            "let", 
            "make", 
            "show"
        ], 
        [
            "though", 
            "as", 
            "so", 
            "until"
        ], 
        [
            "That", 
            "There", 
            "This", 
            "It"
        ], 
        [
            "over", 
            "during", 
            "at", 
            "on"
        ], 
        [
            "learn", 
            "enjoy", 
            "stop", 
            "know"
        ], 
        [
            "have", 
            "take", 
            "give", 
            "make"
        ], 
        [
            "alone", 
            "yourself", 
            "lonely", 
            "together"
        ], 
        [
            "nearly", 
            "hardly", 
            "almost", 
            "only"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "A", 
        "D", 
        "C", 
        "B", 
        "C", 
        "A", 
        "D"
    ], 
    "source": "middle65"
}