{
    "article": "In 1608 an Englishman named Thomas Coryate traveled in Italy. He liked the country and  _  down everything interesting. But he found one thing  _  interesting than the others. In his diary Thomas wrote: \"  _  the Italians eat meat, they use small forks. They do not eat with their hands because, as they say, people do not always have  _  hands.\" Before he went back to England, Thomas Coryate bought a few  _  . At home Thomas had a dinner party to show the forks to his friends. When the steak was brought out, he took out a fork and wanted to  _  the steak as the Italians did in Italy. His friends were  _  when they saw this, He told them what the fork was. They all said that Italians were very strange people because the fork was not easy to use at all. Thomas Coryate tried to prove that his friends were  _  , so he began to show that it was easy to use the fork. But the first  _  of meat he took with the fork fell to the floor. His friends began to  _  at him and he had to take the fork away. People in England began to use forks only fifty years later.", 
    "options": [
        [
            "broke", 
            "wrote", 
            "went", 
            "calmed"
        ], 
        [
            "less", 
            "much", 
            "even", 
            "more"
        ], 
        [
            "Why", 
            "When", 
            "Which", 
            "Where"
        ], 
        [
            "clean", 
            "big", 
            "dirty", 
            "safe"
        ], 
        [
            "knives", 
            "dishes", 
            "forks", 
            "plates"
        ], 
        [
            "use", 
            "eat", 
            "make", 
            "cut"
        ], 
        [
            "worried", 
            "bored", 
            "tired", 
            "surprised"
        ], 
        [
            "honest", 
            "correct", 
            "wrong", 
            "clever"
        ], 
        [
            "piece", 
            "kilo", 
            "pound", 
            "packet"
        ], 
        [
            "scream", 
            "look", 
            "shout", 
            "laugh"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "B", 
        "A", 
        "C", 
        "B", 
        "D", 
        "C", 
        "A", 
        "D"
    ], 
    "source": "middle394"
}