{
    "article": "When you sit and watch TV hour after hour, do you ever think of what it may be doing to your health? More and more children are becoming overweight and near-sighted  _  they spend too much time in front of the TV. Also, they are growing less and less creative because watching TV doesn't  _  any active thought. Last week, the TV-Turnoff Organization began its ninth TV-Turnoff  _  in the USA. The Organization encourages people to play games, read books, lie under a tree, talk to family members and friends  instead of  watching TV. American school children  _  , on average , 1000 hours a year watching TV--more time than they spend in school. That's too much, said the doctors  _  organized this year's TV-Turnoff Week. Doctors said that the  _  children watch television, the more overweight they may become. The food children eat while they watch the television makes this weight  _  more serious. To keep mentally and physically healthy, children need to take exercise, talk with friends and family, read, and  _  the world around them. Could you go a week without television? It might be  _  for many TV lovers, but why not give it a try?", 
    "options": [
        [
            "because", 
            "until", 
            "whether", 
            "though"
        ], 
        [
            "find", 
            "need", 
            "lose", 
            "know"
        ], 
        [
            "Day", 
            "Week", 
            "Month", 
            "Year"
        ], 
        [
            "cost", 
            "spend", 
            "use", 
            "do"
        ], 
        [
            "whom", 
            "whose", 
            "which", 
            "who"
        ], 
        [
            "later", 
            "fewer", 
            "longer", 
            "less"
        ], 
        [
            "problem", 
            "question", 
            "thing", 
            "lesson"
        ], 
        [
            "explore", 
            "invent", 
            "find", 
            "make"
        ], 
        [
            "easy", 
            "happy", 
            "dangerous", 
            "difficult"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "B", 
        "B", 
        "D", 
        "C", 
        "A", 
        "A", 
        "D"
    ], 
    "source": "middle343"
}