{
    "article": "We are living a fast life. It seems that everything has to be fast, for example, _ food, fast Internet, fast roads, fast money. Every day we try to get things done _ , but there are some moments that we have to slow down and enjoy our lives.\nWe are always _ every day. I have to work eight hours or more a day at my full-time job. When I get home, it's always over seven o'clock. I make an effort  to _ something. I try to find a bit of time for my hobby--writing. I hardly ever write and work _ weekends. Those are my days to try to recharge  and reduce the stress from my work. I sleep on the sofa during the day, _ some beer in the open air or go out for a picnic if the weather is nice.\nWhat I'm trying to say is this: if you don't take some time to slow down once in a while  and _ your life, it will pass you by. You can be unhealthy both in body and mind if you don't take the time to relax. So this weekend, don't make any _ . Just get up on Saturday morning _ your body says it's time to get up. Make some coffee, step outside and get _ fresh morning air, turn on the radio and prepare yourself for nothing.", 
    "options": [
        [
            "good", 
            "fast", 
            "slow", 
            "cold"
        ], 
        [
            "specially", 
            "seriously", 
            "directly", 
            "quickly"
        ], 
        [
            "busy", 
            "happy", 
            "free", 
            "sad"
        ], 
        [
            "drink", 
            "buy", 
            "write", 
            "say"
        ], 
        [
            "with", 
            "except", 
            "in", 
            "on"
        ], 
        [
            "eat", 
            "drink", 
            "take", 
            "get"
        ], 
        [
            "spend", 
            "share", 
            "enjoy", 
            "relax"
        ], 
        [
            "plans", 
            "mistakes", 
            "noises", 
            "sentences"
        ], 
        [
            "but", 
            "when", 
            "or", 
            "so"
        ], 
        [
            "any", 
            "many", 
            "no", 
            "some"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "A", 
        "C", 
        "D", 
        "B", 
        "C", 
        "A", 
        "B", 
        "D"
    ], 
    "source": "middle1"
}