{
    "article": "Once there was a girl who could do everything she wanted in the world. All she had to do was to choose _ and focus on it. So one day she sat down and began to paint. When she finally finished painting, she looked proudly at her _ and smiled.\nIt was clear that she was _ . And she knew it, too. But a few moments after she finished painting, she got anxious and quickly stood up. _ she thought that there was so much more in the world to see and do, and she would face so many _ . If she finally decided to do something else with her life, then all the time she _ painting would be a waste. So she looked at her work for the last time, and walked out of the door.\nShe had to choose another thing to reach a higher goal. Should she practice medicine? Or _ buildings? Or teach children? She was quite _ .\nTwenty-five years later, the girl began to cry. Because she _ she had been walking for so long, and that over the years she hadn't done anything _ at all. She learned that life isn't about possibility. Anything is possible. The truth of _ is to get down on one thing, but does not aim too high and changes the goal freely.\nThe girl was no longer a girl. She knew _ she wanted exactly. So she bought some painting materials and began to paint. She smiled and kept on painting through day and night, because she had finally made a decision. And there was _ some time left to enjoy the magic that life is all about.", 
    "options": [
        [
            "something", 
            "anything", 
            "everything", 
            "nothing"
        ], 
        [
            "action", 
            "course", 
            "lesson", 
            "work"
        ], 
        [
            "powerful", 
            "talented", 
            "athletic", 
            "peaceful"
        ], 
        [
            "Although", 
            "If", 
            "Unless", 
            "Because"
        ], 
        [
            "hobbies", 
            "tips", 
            "choices", 
            "ideas"
        ], 
        [
            "spent", 
            "took", 
            "paid", 
            "cost"
        ], 
        [
            "climb", 
            "clean", 
            "find", 
            "design"
        ], 
        [
            "disappointed", 
            "confused", 
            "excited", 
            "surprised"
        ], 
        [
            "remembered", 
            "realized", 
            "suggested", 
            "expected"
        ], 
        [
            "meaningful", 
            "humorous", 
            "frightened", 
            "pleasant"
        ], 
        [
            "problem", 
            "life", 
            "time", 
            "path"
        ], 
        [
            "who", 
            "what", 
            "which", 
            "that"
        ], 
        [
            "yet", 
            "already", 
            "still", 
            "ever"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "B", 
        "D", 
        "C", 
        "A", 
        "D", 
        "B", 
        "A", 
        "D", 
        "B", 
        "B", 
        "C"
    ], 
    "source": "middle872"
}