{
    "article": "There once was a group of frogs who wanted to hold a running competition. The goal was to reach the top of a very high  _  . A big crowd of animals stood around the tower to  _  the race and cheer on the runners. The race began... Actually,  no one  in the crowd really believed that the frogs would reach the top of the tower. You heard statements such as: \"Oh, way too difficult!!\" \"They will never make it to the top.\" \"Not a chance that they will succeed. The tower is too high!\" The frogs began to fall down, one by one, except for those  _  were climbing higher and higher. The crowd  _  to shout, \"It is too difficult!!! No one will make it!\" More frogs got tired and  gave up  . But one continued higher and higher. This one wouldn't give up!  _  the end, everyone else had given up climbing the tower. Except for the one who, after a big effort, was the only one who reached the top! Then all of  the other  frogs really wanted to know how this frog was able to do it. A running frog asked the frog  _  he had found the strength to reach the goal. It turned out... That the winner was  _  .", 
    "options": [
        [
            "building", 
            "mountain", 
            "tower", 
            "bridge"
        ], 
        [
            "look", 
            "watch", 
            "find", 
            "notice"
        ], 
        [
            "that", 
            "who", 
            "whom", 
            "which"
        ], 
        [
            "continued", 
            "wanted", 
            "stopped", 
            "needed"
        ], 
        [
            "At", 
            "In", 
            "By", 
            "For"
        ], 
        [
            "how", 
            "if", 
            "what", 
            "when"
        ], 
        [
            "blind", 
            "excited", 
            "worried", 
            "deaf"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "B", 
        "A", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "middle1616"
}