{
    "article": "Johnny Sylvester, eleven years old, was in hospital. Several days before,  _  he was playing in a football game, he  _  and his head hit the ground. The doctors believed that he might never get well. \"He seems to have  given up  hope. So medicine won't help. Perhaps he needs something else,\" said one of the doctors. \"When I visit Johnny, all he ever says is that he would like to meet Babe Ruth.\" To meet Babe Ruth, of course, was not possible. Babe Ruth was as important a man in America as the president  _  , and he was the most famous baseball player in the game. The next day, Johnny's father  _  to tell Babe Ruth about the story of Johnny on the phone. Twenty-four hours  _  that, in walked Babe Ruth. Young Johnny couldn't believed it really was the Babe. Babe Ruth sat down at Johnny's bedside and said, \" Now listen, kid, you've got to get well. I've  _  you a new American League baseball. You must start throwing it.\" Johnny said  _  , and his eyes were in admiration at the great man. For Johnny this was the beginning of a new life, once he thought he would never see. To the surprise of his doctors, young Sylvester went out of the hospital on his own  _  a few weeks later. He was also able to live a healthy life------- all because of the  _  of Babe Ruth.", 
    "options": [
        [
            "while", 
            "when", 
            "before", 
            "after"
        ], 
        [
            "fell", 
            "stopped", 
            "ran", 
            "jumped"
        ], 
        [
            "him", 
            "himself", 
            "he", 
            "his"
        ], 
        [
            "tried", 
            "managed", 
            "improved", 
            "decided"
        ], 
        [
            "though", 
            "since", 
            "after", 
            "before"
        ], 
        [
            "fetched", 
            "caught", 
            "taken", 
            "brought"
        ], 
        [
            "nothing", 
            "anything", 
            "everything", 
            "something"
        ], 
        [
            "shoes", 
            "legs", 
            "feet", 
            "socks"
        ], 
        [
            "reply", 
            "present", 
            "photo", 
            "success"
        ]
    ], 
    "answers": [
        "A", 
        "A", 
        "B", 
        "B", 
        "C", 
        "D", 
        "A", 
        "C", 
        "B"
    ], 
    "source": "middle577"
}