{
    "article": "Have you ever taken a tour of a zoo? If so, it's likely that the person who led you through the zoo helped you to learn a lot about the _ .\nAmelia Rinas is a high school student who lives in Ohio. One day Amelia _ the Cleveland Metroparks Zoo. The moment she saw the gorillas there, she felt _ about them. She wondered if they were getting the right foods.\nAmelia read all she could about gorillas and learned what they like to _ . Then she started a\"gorilla garden\". She grows the fruits and vegetables that gorillas love to eat. Some of those foods are tomatoes, carrots, and strawberries. Amelia works with other volunteers in her community who use their _ time to help Amelia and the gorillas. When they take the food to the zoo, the gorillas are thrilled. They look so excited!\nWho is responsible for Amelia's interest in animals? Amelia is a member of Roots & Shoots. Its members are young people who run after animals and the environment. They helped Amelia understand that animals need our care, too. The slogan on the Roots & Shoots Website is\"Inspire, take action, make a difference. \"These words tell _ the group is all about. The group urges kids and grown-ups, including parents and teachers, to do what they can to make a _ where they live.\nWhen interviewed about her project, Amelia said, \"I joined Roots & Shoots _ I wanted to make a difference in the world. \"\nThere are many _ to make a difference in the world. Amelia Rinas' gorilla garden has helped make gorillas happier and healthier.", 
    "options": [
        [
            "gardens", 
            "foods", 
            "plants", 
            "animals"
        ], 
        [
            "opened", 
            "bought", 
            "visited", 
            "started"
        ], 
        [
            "bored", 
            "tired", 
            "worried", 
            "relaxed"
        ], 
        [
            "eat", 
            "bite", 
            "fight", 
            "kick"
        ], 
        [
            "paid", 
            "last", 
            "extra", 
            "lost"
        ], 
        [
            "when", 
            "what", 
            "how", 
            "where"
        ], 
        [
            "living", 
            "mistake", 
            "note", 
            "difference"
        ], 
        [
            "because", 
            "but", 
            "though", 
            "unless"
        ], 
        [
            "ways", 
            "mysteries", 
            "courses", 
            "inventions"
        ]
    ], 
    "answers": [
        "D", 
        "C", 
        "C", 
        "C", 
        "C", 
        "B", 
        "D", 
        "C", 
        "C"
    ], 
    "source": "middle2259"
}