{
    "article": "In today's world we are constantly surrounded by technology. It's true that technology makes our lives easier. _ , more and more scientists point out that we need to give ourselves a break, otherwise we put ourselves at the  _  of developing hundreds of health problems. When students are free from school in summer, why not do something that doesn't involve _ ?\nTo start _ , you could learn a new skill. There are hundreds of possibilities: crafts, cooking, learning a musical instrument _ a new sport. Perhaps you feel like  learning how to knit, so you can have a new jumper for the autumn. You could use your free time to learn something new and perhaps it'll lead to an exciting opportunity in the future.\nIf you just feel like  _ , why not go to a beach? Take along your favourite book and relax on the sand, or go for a walk _  the coastline.\nLittle things, like _ yourself to complete a crossword or a Sudoku  , are a great place to begin with. You could even get involved in the latest popular game: adult colouring books! Colouring is considered to be the most surprising therapy that helps solve stress of modern life.\nNext time you find yourself _ , try something new! You might surprise yourself and find a hidden talent within you; you might also make new friends along the way as well.", 
    "options": [
        [
            "However", 
            "Moreover", 
            "So", 
            "Although"
        ], 
        [
            "trouble", 
            "risk", 
            "problem", 
            "question"
        ], 
        [
            "school", 
            "technology", 
            "science", 
            "health"
        ], 
        [
            "for", 
            "at", 
            "about", 
            "with"
        ], 
        [
            "as", 
            "while", 
            "or", 
            "but"
        ], 
        [
            "relaxing", 
            "reading", 
            "walking", 
            "going"
        ], 
        [
            "across", 
            "along", 
            "around", 
            "over"
        ], 
        [
            "challenging", 
            "advising", 
            "forcing", 
            "choosing"
        ], 
        [
            "aimless", 
            "careless", 
            "endless", 
            "useless"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "B", 
        "D", 
        "C", 
        "A", 
        "B", 
        "A", 
        "A"
    ], 
    "source": "middle1185"
}