{
    "article": "I started to love running at a young age. I loved to race my father and my sister around the backyard. I wished I could run in the Olympics and win lots of medals.\nOne day my mother saw  an advertisement  for a race in a newspaper. \"Would you be interested in  _  part in this race ? \"  she asked me, pointing to the advertisement.\n\"Yes, of course.\" I answered.\nI  _  the next few days practicing for my big race. My sister set up a table in the backyard so she could  _  me water and time ..\nOn the day of the race, just before the race , my  _  said to me , \" Don't use up all your energy at the beginning of the race. You need to have energy  _  you can run much faster at the end. \"\nThe race  _ . Following Dad's words, I didn't run as fast as I could. Then the other runners started passing me, which made me feel  _ . I began to feel tired, and I started slowing down and breathing   _  .\nJust at that moment I heard, \"  Come on , Kelly! You can do it ! Don't give up . keep running!\" Out of the comer of the corner of my eye I saw Dad running beside me around the outside or the track .\nI took a  _  breathe and tried my best to go on running. I didn't win the race. I came fifth, but I felt like a  _ . I had done my best, and I hadn't given up.\nLater, as I thought about the race, I felt thankful that my dad had _  left my side. He always encourages me when I  feel like  giving up. He runs alongside me through my life. I'll  _  my dad's words forever, \"Never give up. You can be a winner, even if you lose.\"", 
    "options": [
        [
            "choosing", 
            "entering", 
            "taking", 
            "watching"
        ], 
        [
            "spent", 
            "cost", 
            "paid", 
            "took"
        ], 
        [
            "buy", 
            "carry", 
            "fill", 
            "offer"
        ], 
        [
            "teacher", 
            "mum", 
            "dad", 
            "sister"
        ], 
        [
            "because", 
            "so", 
            "since", 
            "but"
        ], 
        [
            "began", 
            "finished", 
            "reached", 
            "stopped"
        ], 
        [
            "proud", 
            "happy", 
            "nervous", 
            "hopeful"
        ], 
        [
            "easier", 
            "harder", 
            "shorter", 
            "longer"
        ], 
        [
            "deep", 
            "easy", 
            "free", 
            "lazy"
        ], 
        [
            "player", 
            "winner", 
            "soldier", 
            "runner"
        ], 
        [
            "already", 
            "yet", 
            "once", 
            "never"
        ], 
        [
            "forget", 
            "remember", 
            "talk", 
            "Write"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "C", 
        "B", 
        "A", 
        "C", 
        "B", 
        "A", 
        "B", 
        "D", 
        "B"
    ], 
    "source": "middle1375"
}