{
    "article": "A poor girl was selling flowers in the street  on  Christmas Eve. Her parents were ill, so she  had to  get money for food. It was very cold. The girl felt cold and hungry. She stopped  in front of  a beautiful house. The girl knocked  _  the door and a man came out. She asked  _  he needed some flowers. The man said he didn't want  _  . She left the house and felt tired. She sat down at the  _  of a tall wall. She looked  at  the flowers. 'Ihe flowers  _  very nice. She suddenly had an unusual feeling. She felt she became light,  _  slowly she began to fly into the sky. She  _  higher and higher and at last she found herself on the clouds. A group of people were coming to meet her. At the head of them  _  her granny. She welcomed her and asked her why she didn't  stay at home  .The girl told her that she had to  sell flowers  to get money became her parents were badly ill. Granny told her  not to worry  and gave her lots of beautiful clothes and delicious food. The girl laughed  _  . It snowed  _  hat night. The girl died  _  a smile on her face.  At the same time  , people in the beautiful house began to sing Christmas songs and  enjoyed themselves  .", 
    "options": [
        [
            "at", 
            "to", 
            "in", 
            "for"
        ], 
        [
            "what", 
            "why", 
            "if", 
            "when"
        ], 
        [
            "some", 
            "any", 
            "nothing", 
            "something"
        ], 
        [
            "head", 
            "foot", 
            "top", 
            "middle"
        ], 
        [
            "feels", 
            "felt", 
            "smelt", 
            "smells"
        ], 
        [
            "and", 
            "but", 
            "so", 
            "or"
        ], 
        [
            "went", 
            "got", 
            "looked", 
            "flew"
        ], 
        [
            "has", 
            "was", 
            "had", 
            "were"
        ], 
        [
            "happy", 
            "happier", 
            "happiest", 
            "happily"
        ], 
        [
            "heavily", 
            "heavy", 
            "largely", 
            "strongly"
        ], 
        [
            "had", 
            "has", 
            "with", 
            "without"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "B", 
        "B", 
        "C", 
        "A", 
        "D", 
        "B", 
        "D", 
        "A", 
        "C"
    ], 
    "source": "middle2270"
}