{
    "article": "In some science fiction movies, people in the future have their own robots. These robots are just like humans. They help with the housework and do the most _ jobs.\nSome scientists believe that there will be such robots in the future. However, they agree it may take hundreds of years. Scientists are now trying to make robots look like people and  do  the same things as us. Japanese companies have already made robots walk and dance. This kind of robots will also be fun to watch.\nBut robot scientist James White disagrees. He thinks that it will be _ for a robot to do the same things as a person.  For example , it's easy for a child to wake up and know where he or she is. Mr. White thinks that robots won't be able to do this. But other scientists disagree. They think that robots will be able to talk to people  _ 25 to 50 years.\nRobot scientists are not just trying to make robots look like people. For example, there are already robots  working  in factories. These robots look more like huge arms. They do simple jobs over and over again. People would not like to do such jobs and would get bored. But robots will   _  get bored.\nIn the future, there will be more robots everywhere, and humans will have less work to do. New robots will have many different  _ . Some will look like humans, and others might look like _ . After an earthquake, a snake robot could help look for people under buildings. That may not seem possible now, but computers, space rockets and even electric toothbrushes seemed impossible a hundred years ago. We never know what will happen in the future!", 
    "options": [
        [
            "unpleasant", 
            "pleasant", 
            "bored", 
            "interesting"
        ], 
        [
            "easy", 
            "possible", 
            "exciting", 
            "hard"
        ], 
        [
            "after", 
            "before", 
            "about", 
            "in"
        ], 
        [
            "no", 
            "ever", 
            "never", 
            "always"
        ], 
        [
            "names", 
            "colours", 
            "sizes", 
            "shapes"
        ], 
        [
            "turtles", 
            "snakes", 
            "frogs", 
            "spiders"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "D", 
        "C", 
        "D", 
        "B"
    ], 
    "source": "middle1746"
}