{
    "article": "I did very badly at school. My headmaster thought I was _ and when I was 14 he said, \"You're never going to be _ but a failure.\"\nAfter five years of _ jobs, I fell in love with a very nice middle-class girl. It was the best thing that could have happened to me. I _ I wanted to do something positive with my life because I wanted to prove to her that what people said about me was _ . Especially her mother, who had said to me, \"Let's _ it, you've failed at everything you've ever done.\" So I tried hard with my _ and went to college. My first novel  came out while I was at college.\nAfter college I taught during the  _ in high schools and attended evening classes at London University, where I got a degree in history. I became a lecturer at a college and was thinking of giving up that job to write full time _ I was offered a part-time job at Leeds University. I began to feel proud of myself --here was a working--class boy who'd _ school early, now teaching at the university.\nMy writing career took off when I discovered my own style. Now I'm rich and famous , have been on TV, and met lots of film stars. _ what does it mean? I just wish all the people that have put me down had _ : \"I believe in you. You'll succeed.\"", 
    "options": [
        [
            "bright", 
            "useless", 
            "simple", 
            "hopeful"
        ], 
        [
            "anything", 
            "something", 
            "everything", 
            "nothing"
        ], 
        [
            "low", 
            "poor", 
            "good", 
            "useful"
        ], 
        [
            "agreed", 
            "decided", 
            "planned", 
            "told"
        ], 
        [
            "wrong", 
            "right", 
            "stupid", 
            "faulty"
        ], 
        [
            "see", 
            "know", 
            "understand", 
            "face"
        ], 
        [
            "experiment", 
            "practice", 
            "writing", 
            "composition"
        ], 
        [
            "day", 
            "night", 
            "month", 
            "year"
        ], 
        [
            "while", 
            "if", 
            "when", 
            "or"
        ], 
        [
            "left", 
            "attended", 
            "changed", 
            "graduated"
        ], 
        [
            "And", 
            "But", 
            "However", 
            "Well"
        ], 
        [
            "praised", 
            "said", 
            "answered", 
            "advised"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "B", 
        "B", 
        "A", 
        "D", 
        "C", 
        "A", 
        "C", 
        "A", 
        "B", 
        "B"
    ], 
    "source": "middle1003"
}