{
    "article": "A goal for life Do you have a goal for life? What is it? Do you want to become a great writer, a famous singer or just become a rich person? A survey  _  that in modern society , most people choose practical  _  such as \"making money to buy a house and a car,\" \"making one's life better\" or \"finding a good job\". Wang You  _  in a small company in Nanjing 3 years ago. The job was good and he didn't need to work on Saturday or Sunday.  _  he felt the work wasn't exciting at all and the life was  _  . So he gave up his job and went to Beijing in February, 2009. When he  _  in Beijing, he had his new goal as finding a good job. Now more and more people want to live a  _  life. This shows that the society is making progress and people's life goals have become more practical. One researcher says, \"Everybody  _  his or her own life goal. If one man is poor, his life goal will be to make more money. If one man doesn't  _  a diploma , studying hard to get a diploma will become his life goal. And if one man doesn't have  _  , his life goal will be to look for smiles and kindness. If one man has no life goal, he will waste his lifetime.\"", 
    "options": [
        [
            "saw", 
            "advised", 
            "had", 
            "showed"
        ], 
        [
            "jobs", 
            "causes", 
            "goals", 
            "results"
        ], 
        [
            "worked", 
            "took", 
            "made", 
            "got"
        ], 
        [
            "Because", 
            "But", 
            "Or", 
            "And"
        ], 
        [
            "boring", 
            "important", 
            "famous", 
            "interesting"
        ], 
        [
            "got", 
            "arrived", 
            "reached", 
            "went"
        ], 
        [
            "better", 
            "faster", 
            "longer", 
            "funnier"
        ], 
        [
            "gives", 
            "finds", 
            "comes", 
            "has"
        ], 
        [
            "leave", 
            "get", 
            "find", 
            "give"
        ], 
        [
            "money", 
            "work", 
            "love", 
            "Exercise"
        ]
    ], 
    "answers": [
        "D", 
        "C", 
        "A", 
        "B", 
        "A", 
        "B", 
        "A", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "middle1640"
}