{
    "article": "A farmer found a wounded eagle   in his fielD. He was so _ that he took it home and cleaned its wounds .After that he placed it outside in the yard, in the hope that it _ get well soon.\nStrangely enough, the eagle soon got used to the _ of all the chickens in the yarD. It learned to _ from side to side like chickens, and eat happily from a trough  .For many years, the eagle _ his new life on the farm.\nThen one day, one of the farmer's friends pointed to the playing eagle and asked, \" _ is that eagle acting like a chicken?\" The farmer told him what had _ , and the friend felt quite _ .\nWhat a pity!\" said the frienD. \"It should fly in the sky instead of living here!\" He picked up the eagle, and _ it into the air.The eagle was _ , and cried loudly.Then it just fell down on the ground.\nThat night, the friend could hardly sleep as he remembered the chicken-like eagle.The next morning, he headed back to the farm for another _ .This time he carried the eagle to the _ of a nearby mountain.\nWhen he stood at the highest place of the mountain, he looked into its eyes and shouted, \"Don't you understand? You weren't made to live like a chicken!\" As he _ the eagle up, he made sure it was facing into the bright _ of the rising sun.Then he _ tossed   the bird into the sky.This time the eagle opened his wings, and disappeared into the clouds.", 
    "options": [
        [
            "polite", 
            "brave", 
            "kind", 
            "proud"
        ], 
        [
            "would", 
            "should", 
            "must", 
            "need"
        ], 
        [
            "food", 
            "sounds", 
            "water", 
            "habits"
        ], 
        [
            "walk", 
            "sleep", 
            "talk", 
            "drink"
        ], 
        [
            "missed", 
            "enjoyed", 
            "lost", 
            "forgot"
        ], 
        [
            "When", 
            "Why", 
            "How", 
            "What"
        ], 
        [
            "suffered", 
            "experienced", 
            "happened", 
            "found"
        ], 
        [
            "puzzled", 
            "sorry", 
            "amazed", 
            "worrying"
        ], 
        [
            "pulled", 
            "moved", 
            "took", 
            "threw"
        ], 
        [
            "frightened", 
            "guilty", 
            "excited", 
            "angry"
        ], 
        [
            "drink", 
            "meeting", 
            "rest", 
            "try"
        ], 
        [
            "top", 
            "foot", 
            "center", 
            "side"
        ], 
        [
            "tied", 
            "put", 
            "filled", 
            "held"
        ], 
        [
            "sight", 
            "light", 
            "space", 
            "shape"
        ], 
        [
            "easily", 
            "hardly", 
            "politely", 
            "powerfully"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "A", 
        "B", 
        "B", 
        "C", 
        "B", 
        "D", 
        "A", 
        "D", 
        "A", 
        "D", 
        "B", 
        "D"
    ], 
    "source": "middle1503"
}