{
    "article": "Learning Chinese may seem difficult to foreigners outside China.  However  , Daisy Raffan, an  _  girl in Britain, hopes to bring the language to the young people.Daisy has  set up  an online learning website to teach the language to as  _  people as possible all over the world.  _  China's fast development in the world, Daisy thinks  _  important for people to learn the language sooner rather than later.Daisy has  _  Putonghua since the age of five.Two years ago, after she decided to pass on what she had learned, this teenager  came up with  the idea for the website, kids Chinese club.com.She said, \"People are afraid to learn Putonghua.One of the main reasons is that they think it's an  _  language to learn, but I have had fun  _  it.And I hope what have done is easy and fun.\"Her  _  offers a series of lessons, which are videos of Daisy teaching a group of students on topics from greetings and numbers to Chinese culture. Daisy's website has  _  the support of several important persons--the teenager  _  she has received a letter praising her work from Gordon Brown, who is the British Prime Minister . She said, \"I wrote to him and told him what I was doing and got a letter  _  .He said that what I was doing was a really good  _  .I thought it was amazing.I was excited that someone so important was supporting what we're doing.\"", 
    "options": [
        [
            "5-year-old", 
            "18-year-old", 
            "8-year-old", 
            "28-year-old"
        ], 
        [
            "much", 
            "few", 
            "many", 
            "little"
        ], 
        [
            "As", 
            "When", 
            "With", 
            "But"
        ], 
        [
            "this", 
            "that", 
            "it", 
            "/"
        ], 
        [
            "taught", 
            "learnt", 
            "drew", 
            "talked"
        ], 
        [
            "impossible", 
            "interesting", 
            "excellent", 
            "easy"
        ], 
        [
            "telling", 
            "learning", 
            "writing", 
            "speaking"
        ], 
        [
            "e-mail", 
            "magazine", 
            "essay", 
            "website"
        ], 
        [
            "won", 
            "made", 
            "given", 
            "beaten"
        ], 
        [
            "wonders", 
            "asks", 
            "doubts", 
            "says"
        ], 
        [
            "in", 
            "back", 
            "down", 
            "up"
        ], 
        [
            "girl", 
            "design", 
            "idea", 
            "person"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "C", 
        "C", 
        "B", 
        "A", 
        "B", 
        "D", 
        "A", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "middle8"
}