{
    "article": "Have you ever had a dream to make your home a happier place? Maybe there are some points you can follow.\nSometimes you don't think your parents are fair to you. When you want to dress  _  a modern way, your mum doesn't  _  you wearing a mini-skirt. When you are making phone calls to friends, they ask  _  you are speaking to a boy or a girl. Sometimes it seems that you're not as close to your parents as you used to be. How can you  _  close again?\nClosing the gap by American writer Jay McGraw gives advice on how to have a better relationship with your  _ . He gives ways to help you  understand  your parents. When you think, \"my parents don't want me to have any fun,\" that usually means your parents want you to be  _ .  _  parents and children have needs. They need to feel they are important and loved. You should  _  your parents your needs, and find out what  theirs  are. Then, you can think of a way to make all of you happy. He gives you some ideas:\nMake time to  _ . You could talk about your school life and your plans for the future.  _  a diary. This is to help you understand more about yourself and your feelings; Show your parents  you're growing up . Wash your  _  and help clean the house. Your parents will feel that you are no longer a little child.\nIf you follow these, you will be able to break down the  _  between your parents and yourself.", 
    "options": [
        [
            "with", 
            "in", 
            "of", 
            "by"
        ], 
        [
            "hate", 
            "mind", 
            "like", 
            "enjoy"
        ], 
        [
            "what", 
            "that", 
            "whether", 
            "why"
        ], 
        [
            "go", 
            "look", 
            "become", 
            "come"
        ], 
        [
            "friends", 
            "teachers", 
            "children", 
            "parents"
        ], 
        [
            "safe", 
            "dangerous", 
            "angry", 
            "sad"
        ], 
        [
            "All", 
            "Not", 
            "Neither", 
            "Both"
        ], 
        [
            "speak", 
            "say", 
            "tell", 
            "talk"
        ], 
        [
            "talk", 
            "write", 
            "think", 
            "play"
        ], 
        [
            "Write", 
            "Have", 
            "Keep", 
            "Read"
        ], 
        [
            "hands", 
            "face", 
            "socks", 
            "clothes"
        ], 
        [
            "doors", 
            "walls", 
            "windows", 
            "floors"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "C", 
        "C", 
        "D", 
        "A", 
        "D", 
        "C", 
        "A", 
        "C", 
        "D", 
        "B"
    ], 
    "source": "middle1558"
}