{
    "article": "The children of migrant workers who have remained in their hometowns while their parents work in the cities are known  _  the \"left-behind children\" in China. During the summer vacation, a lot of these children  have to  travel afar, often to a remote city and only for a short visit to see their  _  . But meeting their parents doesn't mean these children are going to enjoy a enjoyable summer  _  Many of their parents are  _  migrant workers who spend all day building houses or selling vegetables on the market. Most of these children are aged between 6 and 12, so leaving them home alone is not a safe choice. And sending the left-behind children to the summer camp or taking them to amusement parks may  _  a lot of money, so even when these children visit their beloved parents,  most  of them just spend the holiday watching TV or going to the library. Also, many parents choose to take their children with them even when they are working. Going to a summer school where they can have a safe place to either study or play is a good choice for migrant worker parents  _  it saves money.  _  , many of the summer schools are already too crowded because the number of children of migrant workers is too  _  . And more summer schools for children of migrant workers are needed.", 
    "options": [
        [
            "at", 
            "for", 
            "as", 
            "to"
        ], 
        [
            "children", 
            "friends", 
            "families", 
            "parents"
        ], 
        [
            "weekend", 
            "weekday", 
            "holiday", 
            "vacations"
        ], 
        [
            "shy", 
            "successful", 
            "busy", 
            "serious"
        ], 
        [
            "pay", 
            "spend", 
            "take", 
            "cost"
        ], 
        [
            "but", 
            "although", 
            "unless", 
            "because"
        ], 
        [
            "However", 
            "But", 
            "Instead", 
            "While"
        ], 
        [
            "many", 
            "much", 
            "small", 
            "Big"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "C", 
        "C", 
        "D", 
        "D", 
        "A", 
        "D"
    ], 
    "source": "middle1605"
}