{
    "article": "Today's young people are taking a more active part in online activities. Although the Internet can be  _  for students to collect information and communicate with their friends, teachers and parents are becoming more and more  _  about the unhealthy web content in the bar. They think that the birth of \"Harm-free Internet Bars\" is  an important  step to  _  teenagers. It was Sunday afternoon and there were not many  _  seats left in the Feiyu Internet Bar. A few  _  were found playing  online games  A person of the bar was walking around  _  Internet users' online activities. \"My job is to find anyone who is looking at  _  websites and then  _  them from doing so,\" he said. \"This is a  _  of the 'Harm-free Internet Bar' project\". Feiyu, a famous Internet bar in Beijing is among the first 19 to  _  the harm-free Internet bar club. In order to help start a better  environment  or teenagers' online activities, China's Communist Youth League has brought out the program named \"Harm-free Internet Bar for Teens\". But while teachers and parents  worry about  the \"harm-free Internet bars\",  _  do many school students think of them?", 
    "options": [
        [
            "successful", 
            "useful", 
            "hopeful", 
            "interesting"
        ], 
        [
            "amazed", 
            "excited", 
            "frightened", 
            "worried"
        ], 
        [
            "prevent", 
            "stop", 
            "ask", 
            "protect"
        ], 
        [
            "comfortable", 
            "empty", 
            "single", 
            "clean"
        ], 
        [
            "teachers", 
            "students", 
            "parents", 
            "officers"
        ], 
        [
            "watching", 
            "looking", 
            "seeing", 
            "finding"
        ], 
        [
            "interesting", 
            "healthy", 
            "unknown", 
            "harmful"
        ], 
        [
            "stop", 
            "tell", 
            "make", 
            "encourage"
        ], 
        [
            "work", 
            "program", 
            "room", 
            "place"
        ], 
        [
            "join", 
            "help", 
            "open", 
            "keep"
        ], 
        [
            "how", 
            "why", 
            "what", 
            "whether"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "D", 
        "B", 
        "B", 
        "A", 
        "D", 
        "A", 
        "B", 
        "A", 
        "C"
    ], 
    "source": "middle456"
}