{
    "article": "Language is colourful. There are many  _  with heart. One of them is to \"lose your heart\" to someone. When that  _  , you have fallen in love.  _  if the person who \"won your heart\" does not love you, you are  _  to have a \"broken heart.\" In your  _  , you think that the person you loved is \"hard-hearted,\" and in fact, has a \"heart of stone.\" You may decide to \"pour out your heart\" to a friend. Telling someone about your personal  _  can often make you feel better. If your friend does not  _  to understand how painful your broken heart is, you may ask her to \"have a heart.\" You are asking your friend to show some sympathy for your  _  . Your friend \"has her heart in the right place\" if she says she is sorry for  _  you feel. If your friend says, \"My heart bleeds for you\", she means the  _  . She is a cold-hearted person who does not really  care about  your situation. When you are feeling  _  , \"your heart is in your mouth.\" You might say, for example, that your heart was in your mouth when you asked a bank to lend you some money to  pay for  a new house. If that bank says  _  to you, do not \"lose heart.\" Be \"strong-hearted.\" Sit down with the banker and have a \"heart to heart\" talk. Be open and honest about your situation. The bank may have a \"change of heart\" and agree to lend you the money. Then you could  _  worrying and \"put your heart at rest.\"", 
    "options": [
        [
            "articles", 
            "letters", 
            "expressions", 
            "words"
        ], 
        [
            "happens", 
            "rises", 
            "has", 
            "takes"
        ], 
        [
            "Then", 
            "And", 
            "But", 
            "So"
        ], 
        [
            "ready", 
            "sure", 
            "excited", 
            "surprised"
        ], 
        [
            "happiness", 
            "sadness", 
            "kindness", 
            "sickness"
        ], 
        [
            "health", 
            "effort", 
            "problems", 
            "honour"
        ], 
        [
            "need", 
            "decide", 
            "seem", 
            "refuse"
        ], 
        [
            "situation", 
            "location", 
            "direction", 
            "lifestyle"
        ], 
        [
            "what", 
            "how", 
            "which", 
            "when"
        ], 
        [
            "same", 
            "right", 
            "opposite", 
            "familiar"
        ], 
        [
            "angry", 
            "sorry", 
            "satisfied", 
            "afraid"
        ], 
        [
            "bye", 
            "hello", 
            "no", 
            "thanks"
        ], 
        [
            "stop", 
            "keep", 
            "practice", 
            "continue"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "C", 
        "B", 
        "B", 
        "C", 
        "C", 
        "A", 
        "B", 
        "C", 
        "D", 
        "C", 
        "A"
    ], 
    "source": "middle1667"
}