{
    "article": "Before Father's Day, I found my father was unhappy because he was out of work. I decided to cheer him up by buying him a special Father's Day gift.\nOne day after school I _ to the Agins which was known for fashions and styles. I told Agins that I was looking for a Father's Day present.\n\" Do you think he'd like a _ ?\" she asked. \"I think he might.\" I told her.\nShe took out a Swiss watch and I told her that would like it.\n\" How much money do you have?\" she asked.\n\" _ dollars.\" I replied.\n\"You're so lucky!\" she told me. \"It's only $11. You still have $1 for the _ . \" She packed the watch and I thanked for my business, and I rode off home with the gift under my arm.\nWhen my father opened the gift, he asked _ . \"Where did you get it?\"\n\"I bought it at the Agins. I cost me $11.\" I said. My father was shocked into silence.\nMany years later, I did learn that the watch was worth several hundred dollars, _ I appreciated  how wonderful Agins had been to me. I always felt _ that I never had chance to thank her.\n\"What really amazes me to this day...my daughter.\" My father said, \"Letting you have the watch for 11 dollars was _ enough. But the fact that she let you leave the store with a dollar for the card was a touch  of _ . I'll never forget it.\"", 
    "options": [
        [
            "drove", 
            "took", 
            "rode", 
            "started"
        ], 
        [
            "watch", 
            "bike", 
            "purse", 
            "card"
        ], 
        [
            "Thirteen", 
            "Twelve", 
            "Eleven", 
            "One"
        ], 
        [
            "card", 
            "store", 
            "gift", 
            "style"
        ], 
        [
            "sadly", 
            "amazedly", 
            "excitedly", 
            "angrily"
        ], 
        [
            "or", 
            "but", 
            "and", 
            "so"
        ], 
        [
            "regretful", 
            "thankful", 
            "careful", 
            "useful"
        ], 
        [
            "believable", 
            "able", 
            "unbelievable", 
            "unable"
        ], 
        [
            "help", 
            "regret", 
            "cry", 
            "kindness"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "B", 
        "A", 
        "B", 
        "D", 
        "A", 
        "C", 
        "D"
    ], 
    "source": "middle1076"
}