{
    "article": "There was once a young man who began to feel self-satisfied after some small achievements. One day, the young man took a walk with a  _  man from the town. On the way the young man was bragging about himself,  _  the wise man didn't say a word. When they  got to  a peak , the wise man asked, \"Look down. What do you see ?\" \"I see trees, farmland, houses and people as  _  as ants working in the fields,\" the young man said. \"What do you feel?\" the wise man asked. \"Everything is  _  me. I feel I rule the world,\" the young man answered. The wise man said  _  . After a minute, he asked the young man to look  _  \"What do you see this time?\" the wise man asked. \"I see  _  flying around high mountains, the white clouds on the mountains and the  _  sky above the white clouds,\" the young man answered. Then he asked the wise man's  _  . \"I feel small and powerless,\" the wise man answered . \"A person who knows to look upward can  _  understand his position . When a person knows the blue sky is always overhead, he won't be so  _  as to believe he rules over the world or other people.\" The young man felt foolish for his  _  . From then on ,  _  he began to feel as if the world owed him something, he looked up at the sky and remembered  _  small he really was. Try to look upward when you feel too good about yourself.", 
    "options": [
        [
            "busy", 
            "lazy", 
            "wise", 
            "hard-working"
        ], 
        [
            "if", 
            "but", 
            "so", 
            "or"
        ], 
        [
            "fat", 
            "light", 
            "small", 
            "strong"
        ], 
        [
            "below", 
            "above", 
            "between", 
            "against"
        ], 
        [
            "everything", 
            "anything", 
            "something", 
            "nothing"
        ], 
        [
            "up", 
            "down", 
            "out", 
            "after"
        ], 
        [
            "monkeys", 
            "tigers", 
            "chicks", 
            "birds"
        ], 
        [
            "red", 
            "blue", 
            "green", 
            "black"
        ], 
        [
            "ways", 
            "name", 
            "feelings", 
            "address"
        ], 
        [
            "badly", 
            "angrily", 
            "hardly", 
            "clearly"
        ], 
        [
            "clever", 
            "smart", 
            "silly", 
            "useful"
        ], 
        [
            "pride", 
            "success", 
            "luck", 
            "smell"
        ], 
        [
            "whatever", 
            "whenever", 
            "wherever", 
            "however"
        ], 
        [
            "why", 
            "where", 
            "how", 
            "what"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "C", 
        "A", 
        "D", 
        "A", 
        "D", 
        "B", 
        "C", 
        "D", 
        "C", 
        "A", 
        "B", 
        "C"
    ], 
    "source": "middle1133"
}