{
    "article": "Monty Robert's father was a horse trainer. As a child, Monty often went from one farm to  another  with his father. Sometimes they didn't have enough money to  pay for  food, but Monty still kept hoping to own a  _  farm. When he was in school, his teacher asked him to write a paper  _  what he wanted to be and do when he grew up. He wrote a seven-page paper  talking about  his dream of having a horse farm one day. He  _  drew a picture of a horse farm in the paper. The next day he handed  _  in to his teacher. Two days later, he got his paper back. On the front page was a large red \"F\" with some words \"See me after class.\"  _  the boy did and asked his teacher, \"Why did I get an F?\" The teacher said, \"This dream will not  come true  for a young boy like you.  _  a horse farm needs a lot of money. You have to buy the land. You have to pay for a lot of things. There is no way you could ever do it.\" Then the teacher added, \"If you write this paper again with a  _  dream, I will give you a good grade.\" After school he thought about it  _  . At last, he decided to hand in the same paper, making  _  changes at all. He wrote, \"You can keep the F and I'll keep my  _  .\" Many years later, Monty had his own 200 acres horse farm. His dream came true. So don't let  _  take away your dreams. Follow your dreams, no matter what they are.", 
    "options": [
        [
            "horse", 
            "chicken", 
            "pig", 
            "flower"
        ], 
        [
            "in", 
            "at", 
            "about", 
            "off"
        ], 
        [
            "ever", 
            "even", 
            "never", 
            "over"
        ], 
        [
            "them", 
            "farm", 
            "it", 
            "picture"
        ], 
        [
            "Or", 
            "So", 
            "But", 
            "And"
        ], 
        [
            "Owning", 
            "Drawing", 
            "Asking", 
            "Writing"
        ], 
        [
            "difficult", 
            "high", 
            "bad", 
            "simple"
        ], 
        [
            "easily", 
            "hard", 
            "heavily", 
            "hardly"
        ], 
        [
            "any", 
            "some", 
            "all", 
            "no"
        ], 
        [
            "horse", 
            "land", 
            "dream", 
            "paper"
        ], 
        [
            "anyone", 
            "everyone", 
            "someone", 
            "none"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "B", 
        "C", 
        "D", 
        "A", 
        "D", 
        "B", 
        "D", 
        "C", 
        "A"
    ], 
    "source": "middle1364"
}