{
    "article": "John loved basketball. One day, as he was walking to a basketball game, he dreamed about playing basketball for the college team the next year. Suddenly a car hit him and he was thrown three meters  _  . John woke up in a hospital room. When the doctor told him that both his legs were broken, he knew his college basketball  _  was over. John did what the doctors told him, but it  didn't work  .When he left the hospital, John was sent to a rehab center . A week  _  he arrived there, he met Sunny Chen. Sunny used to be a coach .His legs were badly hurt in a skating accident. Though he couldn't move his legs, Sunny became the coach of a basketball team called the Suns. It was an on-wheelchair basketball team, because  _  on the team played from a wheelchair .Sunny invited John to  _  the game. John played badly, but for the  _  time since the accident, he stopped feeling sorry for himself. After becoming a part of the Suns, John improved quickly. Basketball was like medicine for him. John was much  _  than before. When John became unhappy, Sunny was there to comfort him. The day before John  left  the center, he had dinner with Sunny. He asked Sunny how he could be so happy even with his broken legs. Sunny  _  and said, \"It's really quite easy. When you keep your face to the sun, the shadows will fall behind.\"", 
    "options": [
        [
            "away", 
            "from", 
            "out", 
            "in"
        ], 
        [
            "game", 
            "dream", 
            "team", 
            "coach"
        ], 
        [
            "until", 
            "when", 
            "before", 
            "after"
        ], 
        [
            "somebody", 
            "anybody", 
            "everybody", 
            "nobody"
        ], 
        [
            "join", 
            "show", 
            "study", 
            "watch"
        ], 
        [
            "next", 
            "last", 
            "first", 
            "early"
        ], 
        [
            "worse", 
            "better", 
            "busier", 
            "smarter"
        ], 
        [
            "smiled", 
            "shouted", 
            "cried", 
            "turned"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "D", 
        "C", 
        "A", 
        "C", 
        "B", 
        "A"
    ], 
    "source": "middle1125"
}