{
    "article": "Why exercise?\nYou've probably heard countless times how exercise is \"good for you\". But did you know that it can _ help you feel good? Exercise plays a key role in _ healthy. It can strengthen the bones, heart, lungs and muscles. It can also _  the stress and help you sleep better. Experts suggest that teenagers should get 60 minutes or more of physical _ each day. Here are some of the reasons:\nExercise benefits every part of the body, _ the mind. Exercising causes body to produce chemicals that can _ a person feel more peaceful and happier. It can _ help some people who have mild mental diseases. _ exercising can help you look better. People who exercise burn more energy and look _ than those who don't.\nIn fact, exercise helps people lose _ and lower the risk of some diseases. Exercising to maintain   a healthy weight decreases a _ risk of developing certain diseases. These diseases, which used to be found mostly in adults, are becoming more common in teenagers.\nExercise can help a person age well. This _ not seem important now, but your body will thank you later. Studies have found that weight-bearing exercise, such as jumping, running and walking, can help people keep their _ strong.\nYou may not feel like doing exercise regularly, but why not do it due to the above mentioned reasons from now on?", 
    "options": [
        [
            "quietly", 
            "actually", 
            "recently", 
            "quickly"
        ], 
        [
            "staying", 
            "helping", 
            "giving", 
            "looking"
        ], 
        [
            "keep", 
            "reply", 
            "refuse", 
            "reduce"
        ], 
        [
            "homework", 
            "activity", 
            "experiment", 
            "language"
        ], 
        [
            "except", 
            "plus", 
            "during", 
            "including"
        ], 
        [
            "help", 
            "ask", 
            "tell", 
            "teach"
        ], 
        [
            "already", 
            "also", 
            "afterwards", 
            "almost"
        ], 
        [
            "Although", 
            "Because", 
            "Unless", 
            "And"
        ], 
        [
            "fatter", 
            "slimmer", 
            "taller", 
            "shorter"
        ], 
        [
            "energy", 
            "weight", 
            "happiness", 
            "experience"
        ], 
        [
            "people's", 
            "person's", 
            "humans'", 
            "mankind's"
        ], 
        [
            "should", 
            "must", 
            "may", 
            "need"
        ], 
        [
            "hands", 
            "bones", 
            "mouths", 
            "feet"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "D", 
        "B", 
        "D", 
        "A", 
        "B", 
        "D", 
        "B", 
        "B", 
        "B", 
        "C", 
        "B"
    ], 
    "source": "middle2232"
}