{
    "article": "For five months l walked past a homeless man on my way to work. He was  _  his late twenties, a little older than me. Every time I saw him I wanted to do something to  _  him. Then, one day, I finally walked to him. I introduced myself first and then I offered him two  _  .I said, \"I could either give you a laptop, and teach you how to write computer code, or give you $100 in cash.\" He was surprised, but I could see there was  _  in his eyes. He wasn't sure what coding is so I  _  that it's the language of computer programs. He told me his name was Leo, and accepted my offer. I agreed every day for two months to  _  him for an hour. I do believe in the power of  _  . I was home-schooled by my mother, herself a software engineer, and she planted in me the joy of learning. By the age of 12,I had  set up  my own business designing websites and had earned $3,000. I was sure that  _  Leo learned how to write computer code, it could be a way for him to turn things around. Later, I've learnt that Leo became homeless after he  _  his job in 2011.I hope Leo will be offered a job one day after he has learnt how to write computer code.", 
    "options": [
        [
            "at", 
            "in", 
            "with", 
            "on"
        ], 
        [
            "educate", 
            "surprise", 
            "help", 
            "protect"
        ], 
        [
            "rights", 
            "duties", 
            "choices", 
            "decisions"
        ], 
        [
            "joy", 
            "worry", 
            "suffering", 
            "sadness"
        ], 
        [
            "imagined", 
            "explained", 
            "proved", 
            "shouted"
        ], 
        [
            "show", 
            "teach", 
            "guide", 
            "search"
        ], 
        [
            "love", 
            "competition", 
            "imagination", 
            "education"
        ], 
        [
            "unless", 
            "though", 
            "before", 
            "if"
        ], 
        [
            "lost", 
            "found", 
            "refused", 
            "got"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "C", 
        "A", 
        "B", 
        "B", 
        "D", 
        "D", 
        "A"
    ], 
    "source": "middle168"
}