{
    "article": "Every time I lost a tooth I would put it under my pillow at night. The next morning when I woke up, I would find two coins replacing my  _  . Then I'd wonder about the tooth fairy all day. \"Mom, where do you think the tooth fairy lives? What does she do with the teeth she  _  ?\" My mom said she didn't know. She only knew that the tooth fairy took the tooth away while we were  _  and left some money under our pillow.  _  I wanted to find out. So I think it was a  _  thing when I lost another tooth. The plan was to stay up all night and ask the tooth fairy when she showed up. That night I lay  _  in my bed, feeling sleepy as the night went on. Moments later, I felt that  someone  was close to me. Through my half-opened  _  , I didn't see her face, but I knew it was the tooth fairy. I watched her run out of my room. After she left, I immediately felt my pillow. There were two coins under it. I hadn't  _  felt my pillow move. As I got older, I learned from my teacher that there was no tooth fairy in the world. Then one night my mom came into my room to see me. The moonlight was bright that night and it shone  _  my window right on her face. Right then I knew the tooth fairy was exactly my mom.", 
    "options": [
        [
            "pillow", 
            "tooth", 
            "money", 
            "book"
        ], 
        [
            "steals", 
            "collects", 
            "buys", 
            "makes"
        ], 
        [
            "working", 
            "playing", 
            "sleeping", 
            "talking"
        ], 
        [
            "Or", 
            "And", 
            "But", 
            "So"
        ], 
        [
            "good", 
            "bad", 
            "terrible", 
            "real"
        ], 
        [
            "quietly", 
            "noisily", 
            "happily", 
            "carefully"
        ], 
        [
            "ears", 
            "eyes", 
            "mouth", 
            "nose"
        ], 
        [
            "already", 
            "just", 
            "even", 
            "ever"
        ], 
        [
            "across", 
            "by", 
            "along", 
            "through"
        ]
    ], 
    "answers": [
        "B", 
        "B", 
        "C", 
        "C", 
        "A", 
        "A", 
        "B", 
        "C", 
        "D"
    ], 
    "source": "middle747"
}