{
    "article": "A little boy invited his mother to the teacher-parent meeting of his school. This would be the first  _  that his classmates and teachers met his mother.she was a beautiful woman,  _  there was a big scar on her right face. The boy never asked his mom why or how she got the scar. He didn't want her to go to his school. However, his mother said she would go. At the meeting, the boy was surprised to see other people having a good talk with his mother. But he felt  _  for his mother's face and sat in a chair  far from  his mother. Just then he heard a talk between his mother and his teacher. \"  _  did you get the scar on your face, Madam?\" the teacher asked. The mother said, \"When my son was a baby, his room caught fire one day. Everyone was  _  scared to get into his room, but I did. When I was running to his bed, something fell down and I put  _  over my son trying to help him. The next morning, when I woke up, I found I was in the hospital. The doctor told me someone had sent us there.\" She touched her right face, \"I have never felt sorry about what I did for my son. You see, he is strong, and  _  now.\" Hearing that, the little boy  _  and ran to his mother with tears in his eyes. He put his  _  around his mother and stayed with her for all day.", 
    "options": [
        [
            "day", 
            "week", 
            "time", 
            "year"
        ], 
        [
            "But", 
            "And", 
            "Though", 
            "Because"
        ], 
        [
            "glad", 
            "sorry", 
            "excited", 
            "tired"
        ], 
        [
            "Which", 
            "How", 
            "When", 
            "Where"
        ], 
        [
            "such", 
            "as", 
            "so", 
            "too"
        ], 
        [
            "we", 
            "myself", 
            "my", 
            "mine"
        ], 
        [
            "health", 
            "healthy", 
            "healthier", 
            "healthily"
        ], 
        [
            "saw", 
            "thought", 
            "left", 
            "cried"
        ], 
        [
            "hands", 
            "arms", 
            "legs", 
            "feet"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "B", 
        "B", 
        "D", 
        "B", 
        "B", 
        "D", 
        "B"
    ], 
    "source": "middle1670"
}