{
    "article": "\"Where is the university?\" This is a question that many visitors to Cambridge ask. But no one can give them a  _  answer, for there is no wall to be found  _  the university. The university is the city. You can find classroom buildings,  _  , museums and offices of the university all over the city. And most of its members are the students and  _  of the thirty-one colleges. Cambridge was already a  _  town long before the first students and teachers arrived 800 years ago. It grew up by the river Granta, and the river was once  _  the Cam. A  _  was built over the river as early as 875. So the town got its name \"Cambridge\". In the fourteenth and fifteenth centuries more and more land was used for college buildings. The town grew much  _  in the nineteenth century after the opening of the railway in 1845. Cambridge became a  _  in 1951 and now it has a population of over 100,000. Many young students in other countries  _  to study at Cambridge. Thousands of people from all over the world come to visit the university town. It has become a famous place all around the world.", 
    "options": [
        [
            "true", 
            "clear", 
            "right", 
            "real"
        ], 
        [
            "around", 
            "in", 
            "near", 
            "by"
        ], 
        [
            "cinemas", 
            "parks", 
            "zoos", 
            "libraries"
        ], 
        [
            "parents", 
            "farmers", 
            "workers", 
            "teachers"
        ], 
        [
            "interesting", 
            "usual", 
            "developing", 
            "old"
        ], 
        [
            "said", 
            "called", 
            "spoken", 
            "talked"
        ], 
        [
            "bridge", 
            "building", 
            "station", 
            "house"
        ], 
        [
            "smaller", 
            "slower", 
            "faster", 
            "cleaner"
        ], 
        [
            "city", 
            "college", 
            "university", 
            "country"
        ], 
        [
            "stop", 
            "hate", 
            "hope", 
            "need"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "D", 
        "C", 
        "B", 
        "A", 
        "C", 
        "A", 
        "C"
    ], 
    "source": "middle1149"
}