{
    "article": "When I was eight years old, my family moved from Edinburgh to London because Father started a new job here. It was hundreds of miles away from my grandmother, so we sometimes spend spent hours _ to Edinburgh to visit her when we missed her terribly.\nGranny never had much. She didn't have _ things, or live in a nice house, but I could feel with my _ that she loved us deeply, especially when my world was turned upside down _ my mother and father divorced  two years later.\nI still remember those little things. Granny allowed me to sit on top of her _ table, getting me to dip  my fingers in the sugar bowl or _ from her coffee cup. Granny had a fancy bottle high on a shelf. One day after her death. I received a box. To my surprise, I found the _ inside. She remembered once I had asked her for it.\nGranny _ her pennies in a glass jar. She could have used those pennies herself but she kept _ for my brother Tommie and me. And I was always excited to _ the pennies between my brother and me. \" One of you, one of me.\" I would repeat _ the jar was empty. I don't remember how much we got on our visits, but I know that's _ she loved us and cared about us when we were far away from her. So if I am _ enough to find a penny lying on the ground one day, I am sure it is just the one from Granny in heaven.\nThose childhood memories have never gone away from me. Instead, they still give me warm feelings through the years. A granny's _ stays with a grandchild as long as he needs it. You know, love is just like that.", 
    "options": [
        [
            "hiking", 
            "running", 
            "driving", 
            "walking"
        ], 
        [
            "normal", 
            "expensive", 
            "cheap", 
            "old"
        ], 
        [
            "life", 
            "heart", 
            "idea", 
            "thought"
        ], 
        [
            "because", 
            "unless", 
            "while", 
            "before"
        ], 
        [
            "bedroom", 
            "garden", 
            "bathroom", 
            "kitchen"
        ], 
        [
            "fill", 
            "eat", 
            "use", 
            "drink"
        ], 
        [
            "bottle", 
            "box", 
            "bowl", 
            "cup"
        ], 
        [
            "used", 
            "found", 
            "saved", 
            "lost"
        ], 
        [
            "them", 
            "it", 
            "her", 
            "us"
        ], 
        [
            "store", 
            "offer", 
            "divide", 
            "provide"
        ], 
        [
            "if", 
            "as", 
            "although", 
            "until"
        ], 
        [
            "what", 
            "how", 
            "when", 
            "where"
        ], 
        [
            "patient", 
            "sad", 
            "lucky", 
            "bored"
        ], 
        [
            "interest", 
            "love", 
            "smile", 
            "mind"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "B", 
        "A", 
        "D", 
        "D", 
        "A", 
        "C", 
        "A", 
        "C", 
        "D", 
        "B", 
        "C", 
        "B"
    ], 
    "source": "middle1949"
}