{
    "article": "Jack is an English teacher at a college. He moved to New York City  _  all the members of his family. Jack is an excellent teacher, so we've all  _  him very much since he left. It was not long before Jack came back to North Carolina for a short  _  . The teachers and students held a small party for him. At the party, people walked around and  _  with each other. I certainly would not give up that good chance to learn English. So I tried to think of all kinds of topics to talk with Grace, another  _  teacher. Just before I was about to run out of my topics, suddenly I  _  Jack say to others loudly, \"I dig New York!\" I immediately asked Grace, \"Is it really difficult to find a  _  work since he is such a good teacher?\" Grace didn't seem to  _  what I said, \"Why do you think that?\" she asked. \"Haven't you heard him say that he is digging New York? Is he building an underground passage ?\" I asked. When she finally realized what I meant, Grace laughed to tears. She then asked us whether we  _  the meaning of \"I dig New York.\" All of  _  shook heads and said no. So Grace asked Jack to explain it to us. It turns out that \" I dig New York.\" means \"I love New York.\" in American slang . Though few people say that now, we still hear it from time to time.", 
    "options": [
        [
            "after", 
            "with", 
            "of", 
            "in"
        ], 
        [
            "missed", 
            "loved", 
            "liked", 
            "thought"
        ], 
        [
            "trip", 
            "holiday", 
            "talk", 
            "visit"
        ], 
        [
            "talked", 
            "spoke", 
            "helped", 
            "danced"
        ], 
        [
            "Chinese", 
            "English", 
            "maths", 
            "music"
        ], 
        [
            "heard", 
            "listened", 
            "made", 
            "told"
        ], 
        [
            "teacher", 
            "job", 
            "work", 
            "book"
        ], 
        [
            "busy", 
            "free", 
            "heavy", 
            "easy"
        ], 
        [
            "knew", 
            "got", 
            "thought", 
            "heard"
        ], 
        [
            "her", 
            "them", 
            "you", 
            "us"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "D", 
        "A", 
        "B", 
        "A", 
        "B", 
        "C", 
        "C", 
        "D"
    ], 
    "source": "middle1653"
}