{
    "article": "Once again, I had run away and really did not know why. I walked out of the gate to go to school and then kept _ . I had just turned eleven years old the week before. It was almost dark; I was tired, scared, cold, and all alone. I had not eaten all day and was afraid to turn _  into the police.\nAs darkness fell, I made my way over to the city park _  on Park Street. I entered the darkened area and sat down on one of the wooden benches.\"Well, hello, young man.\" A voice came from _ me. I jumped, almost falling off the park bench. I could feel my heart beating in the side of my neck. I could _ catch my breath. I looked back and saw a woman standing behind me in the shadows. She found I was _  because of feeling cold, so she took off her large scarf and covered it _  my shoulders. Looking into my eyes, she _  me if I need something to eat. After I said \"yes\", she held out her hand and told me to take the very letter _ I was unable to see to the store owner. I looked at her outstretched arm but saw _  in her hand. However, I reached out  my hands slowly, acting as though I was taking something from her hand.\nI came to a store with a _  sitting behind a counter. I opened the door, very slowly I held out my hand which has nothing in it toward her. I watched her face to see if she might think I was crazy or something else. _ , she immediately turned and walked to the back of the store for the food I need. After that, I walked out into the street and headed back to the park where the old woman was. \"Can I have the letter so I can be magic too?\" I asked. Without replying to me,  _ she told me the persons who wanted to help others in need would never need the magic letter any more. With these words, she stood up, kissed me on the forehead, removed the large scarf from my shoulders and disappeared into the darkness.", 
    "options": [
        [
            "jumping", 
            "running", 
            "walking", 
            "hiking"
        ], 
        [
            "himself", 
            "myself", 
            "themselves", 
            "yourselves"
        ], 
        [
            "finding", 
            "having", 
            "laying", 
            "lying"
        ], 
        [
            "before", 
            "beside", 
            "behind", 
            "after"
        ], 
        [
            "nearly", 
            "almost", 
            "also", 
            "hardly"
        ], 
        [
            "breathing", 
            "speaking", 
            "shaking", 
            "running"
        ], 
        [
            "above", 
            "around", 
            "in", 
            "beside"
        ], 
        [
            "asked", 
            "told", 
            "talked", 
            "said"
        ], 
        [
            "where", 
            "that", 
            "what", 
            "who"
        ], 
        [
            "everything", 
            "something", 
            "nothing", 
            "anything"
        ], 
        [
            "boy", 
            "policeman", 
            "man", 
            "woman"
        ], 
        [
            "Amazingly", 
            "Naturally", 
            "Happily", 
            "Luckily"
        ], 
        [
            "so", 
            "instead", 
            "however", 
            "Though"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "D", 
        "C", 
        "D", 
        "C", 
        "B", 
        "A", 
        "B", 
        "C", 
        "D", 
        "A", 
        "B"
    ], 
    "source": "middle1839"
}