{
    "article": "Protecting wild animals is our duty. Because wild animals are important to us. They live with us on the earth together. If there are no animals on the earth, we will not live on,  _  . So we should take good care  _  them to help us live a healthy life.  _  some people still don't realize the  _  of protecting wild animals. They often kill wild animals for food or for money. Every day there are many wild animals being  _  . So lots of wild animals have died out . We can't see them any more. Today the number of wild animals  _  becoming smaller and smaller. If we don't protect them, they will all die out. If this goes on, there will be no animals left on the earth.  _  , more and more people have begun to do many things to help protect wild animals. They ask people  to stop  killing wild animals. They get people to know that protecting wild animals is one of the most important things. Now many countries have made  _  laws to protect wild animals. Now that wild animals are so important to man, we should do our  _  to protect them and it means human beings can make friends with animals and get on well with them.", 
    "options": [
        [
            "too", 
            "also", 
            "neither", 
            "either"
        ], 
        [
            "of", 
            "off", 
            "for", 
            "from"
        ], 
        [
            "And", 
            "But", 
            "Or", 
            "Although"
        ], 
        [
            "necessary", 
            "importantly", 
            "importance", 
            "important"
        ], 
        [
            "killed", 
            "killing", 
            "kills", 
            "kill"
        ], 
        [
            "was", 
            "were", 
            "are", 
            "is"
        ], 
        [
            "Lucky", 
            "Unlucky", 
            "Luckily", 
            "Unluckily"
        ], 
        [
            "much", 
            "few", 
            "some", 
            "any"
        ], 
        [
            "well", 
            "good", 
            "better", 
            "best"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "B", 
        "C", 
        "A", 
        "D", 
        "C", 
        "C", 
        "D"
    ], 
    "source": "middle969"
}