{
    "article": "At lunchtime, Bonnie and Ruth sat together like they always did at school. Ruth and Bonnie were best friends and best friends always sat together for lunch. They  _  sandwiches, cupcakes and almost everything. But today things were  _  . Bonnie looked upset, and Ruth did not know why. \"Why are you sad today, Bonnie?\" Ruth asked. \"Because my daddy  _  his job yesterday,\" she said. \"And we may have to move. My mom and dad are very unhappy and they always argue. I am  _  . What is going to happen to us?\" Bonnie's news made Ruth very sad, too. What would school be like  _  Bonnie? What could she do to help her friend? When Ruth went home she told her mom the bad  _  . \"What can I do to help?\" she asked. \"I'm not sure, Ruth,\" said her mother sadly. Ruth thought and thought. She thought while she ate supper and she thought while she did homework. She even thought when she brushed her teeth before going to bed. \"What can I do?\" she  _  . The next day was Saturday and Ruth woke up very early. She dressed and ate a quick breakfast,  _  went to find her friends. They all decided to  _  together to help Bonnie. They pulled weeds, played with babies and walked dogs. They even put on a Talent show in Ruth's backyard. All the adults paid one dollar to watch the  _  sing and dance and do magic tricks. After the performance, the children  _  their money. They had made three hundred dollars! Ruth's mom took them to the grocery store and they bought food, soap, paper towels, and all kinds of things that a person might need. When they left the store they went to Bonnie's house and each of the children  _  carried a bag to the door, rang the doorbell and ran away quickly. They had so much fun with  _  secret surprise! They knew it would make Bonnie very happy. Ruth felt happy too,  because  she had helped her friend. She knew it wasn't much, but all she needed to do was to show her friend that she cared  _  . I think Bonnie got the message, don't you?", 
    "options": [
        [
            "found", 
            "cooked", 
            "shared", 
            "bought"
        ], 
        [
            "same", 
            "good", 
            "right", 
            "different"
        ], 
        [
            "changed", 
            "lost", 
            "enjoyed", 
            "got"
        ], 
        [
            "worried", 
            "lonely", 
            "disappointed", 
            "surprised"
        ], 
        [
            "to", 
            "with", 
            "for", 
            "without"
        ], 
        [
            "story", 
            "result", 
            "news", 
            "report"
        ], 
        [
            "dreamt", 
            "answered", 
            "talked", 
            "wondered"
        ], 
        [
            "so", 
            "then", 
            "after", 
            "before"
        ], 
        [
            "work", 
            "study", 
            "help", 
            "think"
        ], 
        [
            "parents", 
            "actors", 
            "students", 
            "children"
        ], 
        [
            "counted", 
            "saved", 
            "sent", 
            "spent"
        ], 
        [
            "slowly", 
            "quietly", 
            "seriously", 
            "patiently"
        ], 
        [
            "their", 
            "his", 
            "her", 
            "its"
        ], 
        [
            "helped", 
            "cared", 
            "understood", 
            "realized"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "B", 
        "A", 
        "D", 
        "C", 
        "D", 
        "B", 
        "A", 
        "D", 
        "A", 
        "B", 
        "A", 
        "B"
    ], 
    "source": "middle1061"
}