{
    "article": "I cannot believe that it is already 2014! Where did 2013 go? I guess the saying is true: Time flies when you are having  _  I am going back to the USA soon, but I can't  _  my good friends in Nanjing. One of my favourite  _  of 2013 in Nanjing was going boating in Xuanwu Lake Park with my friends. We usually did this during the summer months  _  it's warm, sunny and you don't need to wear thick coats or long jeans like you do in the winter time. My friends and I would usually  _  at Xuanwu Gate at 8:00 am on Sundays. We would often play for  _  and then walk over to the bus station to take a bus to The Confucius Temple. When we got there, my favourite thing  to eat  was the Chinese food, such as rice dumplings, smelly tofu and so on. Even though I love summer, winter has so many fun things to do, too.  _  I love most about winter time are the Christmas Trees in Xinjiekou. People  _  the trees with many shiny lights and they were so beautiful and lovely. And I also got to meet a young man who  _  up as Father Christmas around the trees. He was giving out presents or colourful boxes full of sweets. Good bye, my Chinese friends. Happy Spring Festival!", 
    "options": [
        [
            "lessons", 
            "meals", 
            "fun", 
            "money"
        ], 
        [
            "remember", 
            "forget", 
            "record", 
            "change"
        ], 
        [
            "friends", 
            "movies", 
            "memories", 
            "jokes"
        ], 
        [
            "because", 
            "so", 
            "if", 
            "after"
        ], 
        [
            "attend", 
            "discuss", 
            "get", 
            "meet"
        ], 
        [
            "days", 
            "years", 
            "months", 
            "hours"
        ], 
        [
            "When", 
            "What", 
            "Where", 
            "Why"
        ], 
        [
            "painted", 
            "repaired", 
            "kept", 
            "decorated"
        ], 
        [
            "put", 
            "filled", 
            "dressed", 
            "chose"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "C", 
        "A", 
        "D", 
        "D", 
        "B", 
        "D", 
        "C"
    ], 
    "source": "middle143"
}