{
    "article": "You feel tired and you have no energy. You can't breathe out of your nose and your throat hurts. Don't be afraid you have probably just got a  _  . Every year, many kids experience this sick feeling. Some kids have up to eight colds every year. So, what  _  is a cold? Well, a cold is an infection . It affects  _  nose, ears and throat and makes you feel sick and weak. It's very  _  to catch a cold. When someone sneezes or coughs near you, bacteria travel through the air and  _  your body and then make you sick. Also, if you touch your nose or eyes after touching something that has bacteria on it,  _  a door or your desk at school, you can get a sick. Some of the symptoms of a cold  _  a fever, a sore throat and a cough. If you sneeze, or if your nose is runny and your  _  are watery, you've probably got a cold. Most people who have got a cold feel very tired and don't have much  _  to do anything. A cold is not a pleasant thing to  _  .However, there are some things you can do to feel  _  .You should have hot drinks  _  you've got a sore throat and cough. You should eat healthy foods and get a lot of rest so your body can be strong enough to  _  your sold. If you've got a fever, or if you aren't feeling better within a few days, you should visit your  _  and take some medicine. A cold can be frustrating  _  just remember that there are many things you can do to feel better and get stronger. Take care of your body and stay healthy.", 
    "options": [
        [
            "cough", 
            "headache", 
            "fever", 
            "cold"
        ], 
        [
            "exactly", 
            "nearly", 
            "clearly", 
            "firstly"
        ], 
        [
            "my", 
            "your", 
            "its", 
            "their"
        ], 
        [
            "difficult", 
            "necessary", 
            "easy", 
            "helpful"
        ], 
        [
            "build", 
            "find", 
            "feel", 
            "enter"
        ], 
        [
            "like", 
            "on", 
            "behind", 
            "with"
        ], 
        [
            "take", 
            "catch", 
            "turn", 
            "include"
        ], 
        [
            "legs", 
            "arms", 
            "eyes", 
            "ears"
        ], 
        [
            "energy", 
            "money", 
            "time", 
            "air"
        ], 
        [
            "do", 
            "make", 
            "pass", 
            "experience"
        ], 
        [
            "worse", 
            "better", 
            "colder", 
            "hotter"
        ], 
        [
            "until", 
            "so", 
            "if", 
            "unless"
        ], 
        [
            "fight", 
            "keep", 
            "have", 
            "get"
        ], 
        [
            "parent", 
            "doctor", 
            "friend", 
            "teacher"
        ], 
        [
            "but", 
            "then", 
            "and", 
            "or"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "B", 
        "C", 
        "D", 
        "A", 
        "D", 
        "C", 
        "A", 
        "D", 
        "B", 
        "C", 
        "A", 
        "B", 
        "A"
    ], 
    "source": "middle499"
}