{
    "article": "The Sweetest Sight\nI was in the most beautiful city in the world, yet I only wanted home.\nIt was an amazing week for my husband and me--the trip of a lifetime. Months ago, when my\nhusband told me that he would have a meeting in London. I expressed my _ to go to Europe\ntogether with him. Then we asked his mother to look after our two children and started off.\nDuring the week's time, _ visited London and Paris as much as we could, Big Ben, the Louver and so on. All these were beautiful places we expected to see before. We really enjoyed ourselves.\nOn our last night in Paris, _ we enjoyed the night view  of the Eiffel Tower, my husband\ncalled home. His mother _ the phone. In a second, my husband's face fell and he looked so worried. I could feel something _ happened.\n\"What's wrong?\" I asked.\nHe didn't answer and continued to listen. A few minutes later, he said _ to me that Tony, our seven-year-old son, had fallen off his bike and _ his leg. He must be sent to hospital at once.\nAt that moment, Paris suddenly lost its charm .\n\"I don't want to be here! I shouldn't be here! I should be home _ my kids!\"\nWe hurried back to our hotel and then to the airport ...\nFinally, we got home. We rushed into our children's bedroom. Seeing our two children, I suddenly realized the truth: there is no _ sight in the world than your children's faces that greet you at home.", 
    "options": [
        [
            "question", 
            "wish", 
            "step", 
            "place"
        ], 
        [
            "he", 
            "she", 
            "we", 
            "they"
        ], 
        [
            "after", 
            "since", 
            "though", 
            "because"
        ], 
        [
            "shouted", 
            "finished", 
            "wrote", 
            "answered"
        ], 
        [
            "ugly", 
            "useful", 
            "right", 
            "bad"
        ], 
        [
            "hardly", 
            "clearly", 
            "sadly", 
            "truly"
        ], 
        [
            "danced", 
            "broken", 
            "thrown", 
            "opened"
        ], 
        [
            "toward", 
            "with", 
            "under", 
            "from"
        ], 
        [
            "quieter", 
            "richer", 
            "sweeter", 
            "wider"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "D", 
        "D", 
        "C", 
        "B", 
        "B", 
        "C"
    ], 
    "source": "middle167"
}