{
    "article": "There was an old pear tree in a man's garden.  In the past  , the tree fruited every year, so the man would get many pears. But now, the tree  got old  . There were no more pears for the man. So the ungrateful man decided to cut the tree down. When he walked to the tree with an axe in his hand, the tree said to him, \"Please don't cut me down. I  have brought  so many pears for you in the past years. Now I only have a short time to live.\" \"I'm sorry. I have to do so, \" The man said, \" I need something to make a chair. \" Then he began to wave his axe. At the moment, a bird  in the old tree  said to him, \" Don't cut it down.  Every time  you go out and your wife feels lonely, she will come out to the garden and sit under the tree to enjoy its cool shade , and I sing songs to make her  _  . We give much pleasure to your wife when you are away from home.\" The man didn't listen to the bird and drove it away. When he was about to cut the tree, some bees flew out of it and said, \" Listen! If you agree not to kill this tree, we will give you delicious  _  every day. Would you please  _  the tree with us? \" The man got moved. He said, \" You are so kind to the tree,  _  it has become old. Now I see I shouldn't cut it down. It has done so much to me and my wife. Let the tree stay here, and let the bird continue to sing songs here. \"  _  these word, the man left. And the old tree lived there to its last day.", 
    "options": [
        [
            "happier", 
            "happily", 
            "happiness", 
            "happy"
        ], 
        [
            "food", 
            "fruit", 
            "honey", 
            "pears"
        ], 
        [
            "leave", 
            "let", 
            "make", 
            "get"
        ], 
        [
            "because", 
            "so", 
            "although", 
            "however"
        ], 
        [
            "In", 
            "With", 
            "By", 
            "For"
        ]
    ], 
    "answers": [
        "D", 
        "C", 
        "A", 
        "C", 
        "B"
    ], 
    "source": "middle279"
}