{
    "article": "The phone rang once twice--then someone picked it up. \"You got the wrong number!\" a man's voice said before the line went _ .\nBut I called again. \"I said you got the wrong number!\" came the voice. Once more the phone clicked in my _ .\nHow could he know I had a wrong number? So I tried a _ time. The man said, \"Is that you again?\" \"Yeah, it's me.\" I answered. \"I wonder how you knew I had the wrong number before I even said nothing.\" \"None of my business. You _ it out!\" He hung up the phone again.\nI sat there for a short time and then called the man back. \"Have you come up with it yet?\" he asked. \"The only thing I can think of is ... _ ever calls you.\" \"You got it!\" The phone died for the fourth time.\nI rang him again. \"Well I thought maybe I should be the first to say hello to you.\" He began to laugh and told me, \"My name is Adolf Meth. I'm 88 years old and I haven't had so many wrong numbers in one day in 20 years\" We both _ . We talked for ten minutes. Adolf had no family, no friends, just like me. Everyone he had been _ to had died.\nSince then we became phone friends. We called each other almost every day. And I told him about my life and my _ . On one phone about a disagreement that I'd had with my boss, I told him, \"I think I should have it out with him.\"\nAdolf said, \"Let things _ down. When you get as old as I am you find out that time takes care of a lot. If things get _ , and then you can talk to him.\"\n\"You know,\" he said softly one day, \"I'm talking to you just the way I'd talk to a boy _ my own. I always wanted a family--and children.\"\nOne morning I received a call to tell me he had died the night before. With tears in eyes I heard him asking _ I wanted to call him again and again. \"Because you _ to me, Adolf...because I was your friend.\" I whispered, \"I didn't get the wrong number at all. I got you.\"", 
    "options": [
        [
            "busy", 
            "dead", 
            "bad", 
            "wrong"
        ], 
        [
            "heart", 
            "mind", 
            "head", 
            "ear"
        ], 
        [
            "third", 
            "second", 
            "first", 
            "fourth"
        ], 
        [
            "keep", 
            "put", 
            "speak", 
            "work"
        ], 
        [
            "nobody", 
            "somebody", 
            "everybody", 
            "who"
        ], 
        [
            "joked", 
            "agreed", 
            "laughed", 
            "smiled"
        ], 
        [
            "pleased", 
            "friendly", 
            "known", 
            "close"
        ], 
        [
            "questions", 
            "worries", 
            "problems", 
            "answers"
        ], 
        [
            "cool", 
            "get", 
            "calm", 
            "turn"
        ], 
        [
            "less", 
            "more", 
            "worse", 
            "better"
        ], 
        [
            "on", 
            "in", 
            "of", 
            "for"
        ], 
        [
            "how", 
            "when", 
            "why", 
            "whether"
        ], 
        [
            "mattered", 
            "meant", 
            "preferred", 
            "Answered"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "A", 
        "D", 
        "A", 
        "C", 
        "D", 
        "C", 
        "A", 
        "C", 
        "C", 
        "C", 
        "A"
    ], 
    "source": "middle1852"
}