{
    "article": "A large cat arrived at a farm where many mice lived. None of them dared go outside for fear of being  _  by the cat. The mice decided to hold a  _  to find a way of stopping themselves from being in danger. One day, when the cat was out, mice of all ages  _  into the meeting room. \"Let's build a big trap ,\"one mouse suggested. When this idea was  _  ,another said, \"What about poisoning her?\" But  _  knew where to buy the poison. One young mouse, whose mother had become the cat's food, angrily said, \"Let's cut her teeth, so she can do no more harm.\" But the meeting did not accept his  _  . At last, one mouse,  _  than the rest, jumped onto a table. Waving a bell, he called for silence, \"Be quiet!We'll tie this bell to the cat's tail , so we'll always know  _  she is!We'll have  _  to escape, and the slower and weaker mice will hear her coming and be able to  _  !\" Hearing the words, everyone got  _  and they congratulated him on his good idea. \"We'll tie it so tightly that it will never drop off!\" \"She'll never be able to walk  _  again!Why, the other day, she suddenly appeared right in front of me!Just imagine...\" However, the clever mouse said, \"We must  _  who is going to tie it on her tail.\" There was not a sound in the room. Nobody was  _  enough to put the plan into action. The meeting ended without any decision being made. It's often very  _  to have good ideas, but putting them into practice is much more difficult.", 
    "options": [
        [
            "trained", 
            "taught", 
            "caught", 
            "invited"
        ], 
        [
            "party", 
            "test", 
            "game", 
            "meeting"
        ], 
        [
            "rushed", 
            "swam", 
            "flew", 
            "stepped"
        ], 
        [
            "supported", 
            "discussed", 
            "accepted", 
            "refused"
        ], 
        [
            "everybody", 
            "nobody", 
            "somebody", 
            "anybody"
        ], 
        [
            "present", 
            "reason", 
            "idea", 
            "excuse"
        ], 
        [
            "younger", 
            "longer", 
            "thinner", 
            "cleverer"
        ], 
        [
            "where", 
            "what", 
            "how", 
            "who"
        ], 
        [
            "experience", 
            "power", 
            "time", 
            "space"
        ], 
        [
            "shout", 
            "watch", 
            "stay", 
            "hide"
        ], 
        [
            "worried", 
            "excited", 
            "surprised", 
            "tired"
        ], 
        [
            "gladly", 
            "quickly", 
            "quietly", 
            "directly"
        ], 
        [
            "believe", 
            "learn", 
            "imagine", 
            "decide"
        ], 
        [
            "honest", 
            "brave", 
            "rich", 
            "old"
        ], 
        [
            "easy", 
            "difficult", 
            "strange", 
            "important"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "A", 
        "D", 
        "B", 
        "C", 
        "D", 
        "A", 
        "C", 
        "D", 
        "B", 
        "C", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "middle1607"
}