{
    "article": "An elderly man had collapsed while crossing the street; an ambulance rushed him to the hospital. There the man repeatedly called for his son. From a letter  _  in his pocket, a nurse learned that his son was a Marine .They found the young man .He rushed to the airport in order to reach his dying father. It was mid- evening when the young man walked into the hospital. A nurse took the tired,  _  man to the bedside. \"Your son is here,\" she repeated the words before the  patient's  eyes opened. He only dimly saw the young man in Marine uniform standing nearby. He reached out his hand. The Marine  _  the old man's hand with a messsage of love and encouragement. Night are long in  hospitals  , but all the night the young man sat there, holding the father's hand and offering words of hope and strength. The nurse suggested the young Marine to rest for a while. He  _  . Now and then, she heard him say a few gentle words. The dying man said nothing, only held tightly to his son through most of the night. It was dawn when the patient died.  _  the nurse said something to comfort him, the Marine asked her, \"Who was that man?\" \"Your father.\" she answered  _  . \"No, he wasn't,\" he replied. \"I never saw him before in my life.\" \"Why didn't you say something when I took you to him?\" the nurse asked. \"I knew immediately there'd been a(n)  _  , but I also knew he needed his son, and his son just wasn't here. When I realized he was too sick to  _  whether or not I was his son, I guessed he really needed me. So I stayed.\"", 
    "options": [
        [
            "found", 
            "written", 
            "received", 
            "sent"
        ], 
        [
            "excited", 
            "serious", 
            "anxious", 
            "puzzled"
        ], 
        [
            "shook", 
            "hold", 
            "waved", 
            "cleaned"
        ], 
        [
            "agreed", 
            "liked", 
            "refused", 
            "continued"
        ], 
        [
            "After", 
            "While", 
            "if", 
            "Before"
        ], 
        [
            "happily", 
            "surprisingly", 
            "luckily", 
            "excitedly"
        ], 
        [
            "answer", 
            "excuse", 
            "solution", 
            "mistake"
        ], 
        [
            "tell", 
            "speak", 
            "talk", 
            "say"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "B", 
        "C", 
        "D", 
        "B", 
        "D", 
        "A"
    ], 
    "source": "middle1755"
}