{
    "article": "Sometimes it is impossible to deliver all the mail that arrives at the post office. Perhaps there is an _ mailing address and there is no return address. The post office cannot just throw away the mail, so it becomes \"dead mail\". Dead mail is _ to one of the U.S. Post Service's in Atlanta, New York, and San Francisco. Seventy-five million pieces of mail can be put in these offices in one year.\nThere the workers of the dead mail offices have _ ways to deal with all of these pieces of dead mail. First of all, they look for something _ that can help them deliver the mail; they open packages, expecting that something _ will show where the package came from or is going to. Dead mail will also be listed on a computer so that people can call in and check to see if a missing thing is there on the screen. However, all of this mail cannot simply be _ forever; there is just too much of it. When a lot of dead mail comes together, the dead mail offices hold public auctions  . Every three months, some people who are _ are invited to the offices with objects  found in dead mail packages and they are sold to the _ bidder  .", 
    "options": [
        [
            "impatient", 
            "important", 
            "unclear", 
            "inactive"
        ], 
        [
            "sent", 
            "returned", 
            "lent", 
            "sold"
        ], 
        [
            "no", 
            "several", 
            "silly", 
            "cruel"
        ], 
        [
            "waste", 
            "expensive", 
            "useful", 
            "new"
        ], 
        [
            "funny", 
            "inside", 
            "useless", 
            "outside"
        ], 
        [
            "kept", 
            "put", 
            "bought", 
            "borrowed"
        ], 
        [
            "bored", 
            "interested", 
            "worried", 
            "satisfied"
        ], 
        [
            "cheapest", 
            "cleverest", 
            "highest", 
            "Easiest"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "B", 
        "C", 
        "B", 
        "A", 
        "B", 
        "C"
    ], 
    "source": "middle1418"
}