{
    "article": "The smell of coffee wakes me. I run into the kitchen . There Pa is! Pa lifts me onto his shoulders. Ma says, \"I'm going to bake a _ . Go down to the cellar , Jimmy, and bring me that jar of apples from the shelf.\" That's the last jar---the _ we've been saving and saving to welcome Pa home.\nI take down the jar carefully and put both my hands around it. I can _ Pa and Ma laughing upstairs. I hurry up the steps. I take the steps two at a time but my\n _ catches on the middle one. The jar slips  through my fingers and _ on the floor. Bits of apple fly everywhere.\n\"Are you hurt?\" Ma comes _ . I look at her face. \"Go on upstairs now. Don't cut your feet.\" I want her to be _ at me, but that's all she says. Upstairs, Pa wipes my eyes. \"Never mind, son, _ accidental happens.\" I bury my face in Pa's old jacket. I wish I hadn't hurried.\nMa comes back. She kisses my cheek. \"Now out of the kitchen,\" Ma says. \"I'm going to _ a special sugar pie, and it doesn't need apples.\"\nPa and I go out. I show him the place _ I caught a rabbit. He measures me against the back door and _ a new notch  with his knife. I've grown a whole half-inch _ he's been away. \"Pa, are you home to stay now?\" I ask him.\n\"Not yet, son. Got to _ till times get better. And they will. The sun will shine, rain will fall, and things will grow the way they're supposed to.\"\n\"I'll look over Ma while you're gone, Pa.\"\n\"I know you will, son.\"", 
    "options": [
        [
            "cake", 
            "biscuit", 
            "cookie", 
            "pie"
        ], 
        [
            "it", 
            "one", 
            "that", 
            "this"
        ], 
        [
            "see", 
            "feel", 
            "hear", 
            "smell"
        ], 
        [
            "foot", 
            "hand", 
            "eye", 
            "finger"
        ], 
        [
            "opens", 
            "stays", 
            "breaks", 
            "stops"
        ], 
        [
            "quietly", 
            "quickly", 
            "slowly", 
            "politely"
        ], 
        [
            "excited", 
            "mad", 
            "pleased", 
            "satisfied"
        ], 
        [
            "something", 
            "anything", 
            "everything", 
            "nothing"
        ], 
        [
            "buy", 
            "send", 
            "find", 
            "make"
        ], 
        [
            "which", 
            "where", 
            "when", 
            "what"
        ], 
        [
            "makes", 
            "cuts", 
            "puts", 
            "gets"
        ], 
        [
            "since", 
            "until", 
            "before", 
            "when"
        ], 
        [
            "start", 
            "stop", 
            "wait", 
            "leave"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "C", 
        "A", 
        "C", 
        "B", 
        "B", 
        "C", 
        "D", 
        "B", 
        "B", 
        "A", 
        "C"
    ], 
    "source": "middle2142"
}