{
    "article": "One day, a teacher was speaking to a group of students about how to plan their time.He gave an example that those students would never _ .\nHe pulled out a wide jar   and put it on the table.He also took out several rocks and _ put them into the jar one at a time.When no more rocks would be fit inside, he asked. \"Is this jar full?\"\nEveryone in the class shouted. \"Yes.\" The teacher replied. \"Really?\" He pulled out a box of small stones.He dumped  some in and _ the jar.The stones went down into the spaces _ the big rocks.He then asked the group once more, \"Is this jar full?\"\n\"Probably not,\" one of them answered.\"Good!\" he replied.He brought out a glass of sand and dumped the sand into the jar and it went into all of the spaces _ .Once more he asked the question,\"Is this jar full?\"\n\"No!\" the class started.Once again he saiD. \"Good!\" Then he poured a cup of water in _ the jar was full.\nThen he asked. \"What is the key point here?\" One student put up his hand and saiD. \"The key point here is that even if you are _ , you can still plan everything well if you try really hard!\"\n\"No,\" the teacher replied. \"that's not the point.The point is if you don't put the big rocks in _ , you'll never get them in.What are the 'big rocks' in your _ ? Time with your loved ones, your education, or your dreams?\nRemember to put these big rocks in first, or you'll _ get them in at all.\"", 
    "options": [
        [
            "listen", 
            "take", 
            "like", 
            "forget"
        ], 
        [
            "strongly", 
            "loudly", 
            "carelessly", 
            "carefully"
        ], 
        [
            "threw", 
            "broke", 
            "shook", 
            "hit"
        ], 
        [
            "into", 
            "in", 
            "among", 
            "under"
        ], 
        [
            "added", 
            "made", 
            "offered", 
            "left"
        ], 
        [
            "before", 
            "until", 
            "after", 
            "when"
        ], 
        [
            "excited", 
            "happy", 
            "free", 
            "busy"
        ], 
        [
            "first", 
            "later", 
            "immediately", 
            "finally"
        ], 
        [
            "study", 
            "family", 
            "education", 
            "life"
        ], 
        [
            "soon", 
            "never", 
            "even", 
            "ever"
        ]
    ], 
    "answers": [
        "D", 
        "D", 
        "C", 
        "C", 
        "D", 
        "B", 
        "D", 
        "A", 
        "D", 
        "B"
    ], 
    "source": "middle1806"
}