{
    "article": "Venice Film Festival is considered to be the oldest film festival in the world. The first Venice Film Festival was  _ in Italy in 1932. It was 14 years earlier than the first Cannes Film Festival in France.\nAt the first Venice Film Festival, there were no judges  and no  _  at all. Only a list of good films was chosen by the public. At the  _  festival, prizes started to be given. The prize of the festival was the Golden  _ . The lion is a symbol of the ancient republic of Venice.\n _ the Venice Film Festival was first held, the government has wanted to hold it every year. But from 1938 to 1942 the festival was destroyed  because of  special reasons. Also, from 1940 to 1942, the festival was not held in Venice, so it was considered to have been  _ during that time. In 1946, the festival became active again. Now the festival becomes more and more  _ . Each of the editors in the world wants to have a seat in this festival.\nVenice Film has  _  a great opportunity for people around the world. They can learn about other countries' culture by watching films. Many movie makers send their  _  to the festival and some of them hope to win the Lion Award.", 
    "options": [
        [
            "watched", 
            "held", 
            "played", 
            "said"
        ], 
        [
            "prizes", 
            "winners", 
            "hosts", 
            "stars"
        ], 
        [
            "first", 
            "second", 
            "third", 
            "fourth"
        ], 
        [
            "Tiger", 
            "Fox", 
            "Lion", 
            "Elephant"
        ], 
        [
            "Since", 
            "And", 
            "So", 
            "Before"
        ], 
        [
            "sent", 
            "dropped", 
            "brought", 
            "stopped"
        ], 
        [
            "interesting", 
            "beautiful", 
            "important", 
            "comfortable"
        ], 
        [
            "bought", 
            "offered", 
            "got", 
            "caught"
        ], 
        [
            "songs", 
            "actors", 
            "movies", 
            "musicians"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "B", 
        "C", 
        "A", 
        "D", 
        "C", 
        "B", 
        "C"
    ], 
    "source": "middle345"
}