{
    "article": "As a single parent of four children, money was always tight .It was Christmas time, and although there wasn't money for a lot of gifts, we planned to celebrate with a family party . But the big excitement for the kids was the fun of Christmas  _  They planned weeks ahead of time , asking  each other  what they wanted for Christmas. luckily, I have saved $120 for  _  to share by all five of us . The big  _  arrived. I gave each kid a twenty-dollar bill and  _  them to look for gifts of about four dollars each. Then everyone scattered . We had two hours to shop. Then we would  _  back at the \"Santa's Workshop.\" Driving home, everyone was in high Christmas spirits  _  my younger daughter, Tina, who was unusual  _  . She had only one small, flat bag with a few candies--fifty-cent candies! I was so angry, but I didn't say anything  _  we got home. I called her into my bedroom and closed the door,  _  to be angry again. This is what he told me: \" I was looking  _  thinking of what to buy , and I  _  to read the title cards on the 'Giving Trees.' One was for a little girl, four years old. And all she  _  for Christmas was a doll .So I took the card off the tree and  _  the doll for her. We have so much and she doesn't have anything.\" I never felt so  _  as I did that day.", 
    "options": [
        [
            "shopping", 
            "travelling", 
            "parties", 
            "greetings"
        ], 
        [
            "toys", 
            "clothes", 
            "presents", 
            "bills"
        ], 
        [
            "day", 
            "chance", 
            "times", 
            "tree"
        ], 
        [
            "forced", 
            "reminded", 
            "invited", 
            "begged"
        ], 
        [
            "draw", 
            "stay", 
            "move", 
            "meet"
        ], 
        [
            "including", 
            "besides", 
            "except", 
            "regarding"
        ], 
        [
            "quiet", 
            "excited", 
            "happy", 
            "ashamed"
        ], 
        [
            "since", 
            "after", 
            "while", 
            "until"
        ], 
        [
            "waiting", 
            "ready", 
            "hoping", 
            "afraid"
        ], 
        [
            "out", 
            "over", 
            "forward", 
            "around"
        ], 
        [
            "forgot", 
            "stopped", 
            "failed", 
            "hated"
        ], 
        [
            "wanted", 
            "did", 
            "got", 
            "played"
        ], 
        [
            "made", 
            "searched", 
            "bought", 
            "found"
        ], 
        [
            "angry", 
            "rich", 
            "patient", 
            "bitter"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "A", 
        "B", 
        "D", 
        "C", 
        "A", 
        "D", 
        "B", 
        "D", 
        "B", 
        "A", 
        "C", 
        "B"
    ], 
    "source": "middle1096"
}