{
    "article": "My friend Mr. Smith is a famous doctor and has a hospital. So he has enough money to  _ all over the world. And he's been to a lot of places of interest. He likes to  play with  children and has a lot of little friends. They often ask him to tell them all kinds of funny things he  _ . It makes them happy and his room is always full of children when he's free.\nIt was my little son's seventh birthday yesterday. The boy wanted to invite    his old friend Mr. Smith to the party. He  _ Mr. Smith for himself and tol d him about it. The doctor accepted his invitation  _ . At half past seven the boy was waiting for his coming at the gate.  as soon as  he saw his car, he ran towards him. Mr. Smith came on time, with a nice present in his hand. After dinner the children sat around the traveler and asked him to tell them some funny stories. Mr. Smith agreed and his stories made them  _ again and again. At last he told them the funniest story. He said, \"Once I reached a city  _  a foggy   day. The fog was the thickest in the world ...\"\n\"Please wait a  _ , Mr. Smith,\" said my son. \"it's said that the fog in London is the thickest in the world.\"\n\"You're  _ , my clever boy,\"  said the funny doctor. \"The city had much fog that day ...\" \"What was it, then?\" the boy couldn't wait to ask again.\n\"The fog was so thick that I couldn't see it at all,\" the funny doctor said with a smile.", 
    "options": [
        [
            "work", 
            "fight", 
            "live", 
            "travel"
        ], 
        [
            "read", 
            "wrote", 
            "thought", 
            "saw"
        ], 
        [
            "knew", 
            "caught", 
            "taught", 
            "called"
        ], 
        [
            "sadly", 
            "happily", 
            "surprised", 
            "interested"
        ], 
        [
            "think", 
            "laugh", 
            "cry", 
            "fear"
        ], 
        [
            "with", 
            "in", 
            "at", 
            "on"
        ], 
        [
            "moment", 
            "day", 
            "week", 
            "year"
        ], 
        [
            "sorry", 
            "sad", 
            "wrong", 
            "right"
        ]
    ], 
    "answers": [
        "D", 
        "D", 
        "D", 
        "B", 
        "B", 
        "D", 
        "A", 
        "D"
    ], 
    "source": "middle326"
}