{
    "article": "Years ago, while I lived in England, part of my college task was to help the children with special needs. I was chosen to  _  in a school with disabled children. The teacher asked me to  look after  Nancy, a ten-year-old girl. One of  _  hands could not move. At her school the teachers would think it was an achievement(,)  _  she was able to put on her own coat. But I saw more in her. She had always wanted to put a string  _  the hole of a key. For the 5 years Nancy was in the school, the teachers always  _  to help her, but always ended up doing all the work for her. I knew Nancy could do  _  , so I encouraged her to do something herself. At first Nancy often failed and got very  _  . Sometimes I wanted to give up too.  _  , after a week Nancy was able to do  _  she had wanted to alone for so many years. Her teachers cried  with joy  when they saw the thing she was able to do with just some encouragement. Disabled people should  _  be told they can't do this or that. With just some encouragement they can do it. The look  _  that girl's face when she was able to do it herself meant  the sun  to me. I hope everyone will encourage people to do all they want by themselves  instead of  telling them they can't do it.", 
    "options": [
        [
            "read", 
            "study", 
            "work", 
            "visit"
        ], 
        [
            "his", 
            "her", 
            "my", 
            "your"
        ], 
        [
            "before", 
            "through", 
            "if", 
            "until"
        ], 
        [
            "through", 
            "across", 
            "over", 
            "into"
        ], 
        [
            "failed", 
            "refused", 
            "agreed", 
            "tried"
        ], 
        [
            "less", 
            "more", 
            "nothing", 
            "anything"
        ], 
        [
            "excited", 
            "pleased", 
            "unsafe", 
            "unhappy"
        ], 
        [
            "And", 
            "However", 
            "But", 
            "So"
        ], 
        [
            "which", 
            "that", 
            "what", 
            "how"
        ], 
        [
            "never", 
            "always", 
            "often", 
            "sometimes"
        ], 
        [
            "of", 
            "in", 
            "on", 
            "at"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "C", 
        "A", 
        "D", 
        "B", 
        "D", 
        "B", 
        "C", 
        "A", 
        "C"
    ], 
    "source": "middle1575"
}