{
    "article": "I walked into the Huddle House Restaurant in Brunswick, Georgia and sat down at the table. I picked up the menu and was to order something for breakfast. \"Excuse me,\" suddenly a soft voice came into my ear. I looked up and  _  a nice-looking woman standing before me. \"Is your name Roger?\"  _  asked. \"Yes, \" I answered, feeling rather confused as I had never seen her before. \"My name's Barbara and my  _  is Tony,\" she said, pointing to a middle-aged man sitting alone at the table by the window. He was  _  and weak. \"Tony White, from Landon School in Jacksonville, Florida.\" She added. I looked at that man for a few seconds  _  I didn't recognize him. \"I'm really sorry. The name doesn't ring the bell , \"I said. She walked back, began  _  with her husband and once in a while I saw her turn around and look directly at me. I ordered breakfast and a cup of  _  , sitting there, trying to remember who this Tony was. \"I  _  know him, \" I thought to myself. \"He recognizes me for some reason.\" I picked up the coffee cup. Suddenly it came to me like a flash of lightning. \"Tony, the bully , the bad boy!\" I could  _  believe my eyes. \"Jesus! He's so thin now. Not the big boy that I  _  from back in 1977.\" Everything came up to my mind. The time this  _  boy had made fun of my big ears in front of the girls in my class, and the time this big bully had pushed me against the walls in the hallway just to make himself  look like  a big man to all other students. \"I am sorry, Roger,\" Tony rolled by me in the wheelchair, being pushed by his wife, raising his thin trembling hand. \"I am so sorry for  _  that I did to you.\" \"I'm...I'm er...\" I didn't know  _  to say to him. A few months later, I received a letter from Barbara. Tony was  _  . Tony had been a fireman and had been seriously wounded in a task. How I regretted for not saying something to him but I no longer had the chance!", 
    "options": [
        [
            "heard", 
            "saw", 
            "felt", 
            "told"
        ], 
        [
            "you", 
            "we", 
            "he", 
            "she"
        ], 
        [
            "husband", 
            "father", 
            "brother", 
            "son"
        ], 
        [
            "fat", 
            "thin", 
            "strong", 
            "young"
        ], 
        [
            "but", 
            "and", 
            "or", 
            "so"
        ], 
        [
            "listening", 
            "writing", 
            "talking", 
            "playing"
        ], 
        [
            "tea", 
            "juice", 
            "coffee", 
            "milk"
        ], 
        [
            "needn't", 
            "need", 
            "mustn't", 
            "must"
        ], 
        [
            "hardly", 
            "really", 
            "almost", 
            "always"
        ], 
        [
            "protect", 
            "remember", 
            "love", 
            "miss"
        ], 
        [
            "clever", 
            "shy", 
            "bad", 
            "friendly"
        ], 
        [
            "everything", 
            "nothing", 
            "something", 
            "anything"
        ], 
        [
            "when", 
            "why", 
            "what", 
            "where"
        ], 
        [
            "healthy", 
            "dead", 
            "famous", 
            "blind"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "A", 
        "B", 
        "A", 
        "C", 
        "C", 
        "D", 
        "A", 
        "B", 
        "C", 
        "A", 
        "C", 
        "B"
    ], 
    "source": "middle1687"
}