{
    "article": "A wise man was walking from one town to another with a few of his followers, and they happened to pass a lake. So they stopped there to _ for a while, and the wise man said to one of his followers, \"I am very _ . Could you please get me some water from the lake?\"\nThe follower walked to the _ as the wise man requested. Some people were washing clothes in the water, and right at that moment, several bikes started crossing the lake. In addition , the water became very muddy at once.\nThen the follower _ . He told the wise man that the water was very muddy and not _ to drink.\nAfter they had rested for about half an hour, the wise man again asked the _ follower to go back to the lake and get him some water to drink. As requested, the follower went to the lake. This time he found that all the mud had gone down to the _ . The water in the lake was very clear and looked fit to drink. So he _ his water bottle and took it to the wise man.\nThe wise man took the water bottle and drank, then looked up at the follower. \"See what you did to make the water _ ?\" he said. \"You let it be for a _ while and the mud settled down on its own, so that you could get some clear drinking water. Your mind can also be like that lake when it is _ by something. If you just let it be and give _ a little time, it will most likely settle down on its own _ putting in any effort at all to calm it.\"\nSo we should find some time to calm down when we are stressed or angry next time.", 
    "options": [
        [
            "rest", 
            "look", 
            "watch", 
            "see"
        ], 
        [
            "hungry", 
            "thirsty", 
            "happy", 
            "sad"
        ], 
        [
            "lake", 
            "town", 
            "bottle", 
            "bikes"
        ], 
        [
            "refused", 
            "required", 
            "returned", 
            "replied"
        ], 
        [
            "fit", 
            "able", 
            "important", 
            "interesting"
        ], 
        [
            "different", 
            "same", 
            "other", 
            "left"
        ], 
        [
            "top", 
            "left", 
            "bottom", 
            "right"
        ], 
        [
            "got", 
            "finished", 
            "reached", 
            "filled"
        ], 
        [
            "dirty", 
            "clear", 
            "fresh", 
            "sweet"
        ], 
        [
            "year", 
            "month", 
            "day", 
            "while"
        ], 
        [
            "broken", 
            "left", 
            "disturbed", 
            "given"
        ], 
        [
            "him", 
            "it", 
            "me", 
            "us"
        ], 
        [
            "without", 
            "through", 
            "after", 
            "like"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "A", 
        "D", 
        "A", 
        "B", 
        "C", 
        "D", 
        "B", 
        "D", 
        "C", 
        "B", 
        "A"
    ], 
    "source": "middle1079"
}