{
    "article": "One afternoon, Grandpa wanted to bet me a big bag of popcorn that I didn't have as many true friends as I thought.  I _ the bet happily. However,1 wasn't sure _ Icould test whether my schoolmates were true friends or not.\nThe next day, _ I went to school, Grandpa walked towards me and it seemed that he was carrying something in his hand. But I could see _ there. Grandpa said, \"Take it. It's a(n) _ chair.  Because it's invisible ,it will be _ for you to sit on it. However, if you can sit on it _ ,you can use the chair's magic power to tell who your true friends are. \"\nThen I took the strange invisible chair to school.  At break I _ everyone to stand in a circle ,and put myself in the middle, with the _ .\"Look! Something amazing is coming.\" I said, and then tried sitting on the chair.  Of course, I _ and fell to the ground. Everyone had a very good _ .  I kept trying to sit on the magic chair again an again. _ ,I made it.  This time l was hovering in mid-air. Then I really experienced the _ that Grandpa had ever talked about. Looking around, I saw George, Lucas and Diana _ me up, while some of my schoolmates did nothing but make fun of me.\nI was quite _ to Grandpa. It was he who helped me test who my true friends were.\nThat evening, we four true friends went to see Grandpa and had a great time eating popcorn.", 
    "options": [
        [
            "accepted", 
            "started", 
            "received", 
            "made"
        ], 
        [
            "where", 
            "why", 
            "how", 
            "when"
        ], 
        [
            "after", 
            "as", 
            "until", 
            "before"
        ], 
        [
            "something", 
            "nothing", 
            "anything", 
            "everything"
        ], 
        [
            "important", 
            "comfortable", 
            "special", 
            "expensive"
        ], 
        [
            "difficult", 
            "funny", 
            "different", 
            "dangerous"
        ], 
        [
            "carefully", 
            "slowly", 
            "quickly", 
            "successfully"
        ], 
        [
            "warned", 
            "asked", 
            "refused", 
            "promised"
        ], 
        [
            "chance", 
            "popcorn", 
            "friend", 
            "chair"
        ], 
        [
            "lost", 
            "missed", 
            "rushed", 
            "jumped"
        ], 
        [
            "laugh", 
            "cry", 
            "noise", 
            "whisper"
        ], 
        [
            "Finally", 
            "Immediately", 
            "Next", 
            "Indeed"
        ], 
        [
            "fun", 
            "magic", 
            "pleasure", 
            "trouble"
        ], 
        [
            "picking", 
            "giving", 
            "holding", 
            "cheering"
        ], 
        [
            "fair", 
            "kind", 
            "helpful", 
            "grateful"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "D", 
        "B", 
        "C", 
        "A", 
        "D", 
        "B", 
        "D", 
        "B", 
        "A", 
        "A", 
        "B", 
        "D", 
        "D"
    ], 
    "source": "middle1011"
}