{
    "article": "Mr. Smith gave his wife 10 pounds for her birthday--ten pretty new pound notes. The day after her birthday, Mrs. Smith went _ . She waited for a bus, got on it and sat down next to an old _ . After a while, she noticed that the old lady's handbag was open. Inside it, she _ a roll of pound notes exactly like the ones her husband had given her. She _ looked into her own bag--the notes were gone! Mrs. Smith was _ that the old lady had stolen them. She thought she should call the police. But she disliked getting other people into _ , so she decided to take back the money from the old lady's handbag and say _ more about it. She looked around the bus to make sure nobody was watching. Then she carefully put her hand into the old lady's _ , took the notes, and put them in her own bag.\nWhen she got home that evening, she showed her husband the beautiful hat she had bought.\n\" _ did you pay for it?\" he asked.\n\"With the money you gave me for my birthday, of course.\" she replied.\n\"Oh? What's that, then?\" he asked, as he pointed to a roll of ten pound notes on the table.", 
    "options": [
        [
            "swimming", 
            "shopping", 
            "fishing", 
            "hiking"
        ], 
        [
            "man", 
            "farmer", 
            "lady", 
            "friend"
        ], 
        [
            "saw", 
            "took", 
            "stole", 
            "put"
        ], 
        [
            "successfully", 
            "safely", 
            "hardly", 
            "quickly"
        ], 
        [
            "sure", 
            "happy", 
            "proud", 
            "patient"
        ], 
        [
            "danger", 
            "safety", 
            "trouble", 
            "anger"
        ], 
        [
            "something", 
            "anything", 
            "nothing", 
            "everything"
        ], 
        [
            "hand", 
            "bag", 
            "pocket", 
            "clothes"
        ], 
        [
            "How", 
            "Where", 
            "What", 
            "When"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "D", 
        "A", 
        "C", 
        "C", 
        "B", 
        "A"
    ], 
    "source": "middle1611"
}