{
    "article": "In some western schools ,some kids need to repeat a grade in school. This means if you're in the  _  grade, you have to do the third grade again next year  instead of  moving on to the fourth grade. Repeating a grade can be a(n)  _  thing, though, because you get another chance to complete your schoolwork. For example, a kid might have  _  reading. Other kids might have been  _  and absent for a long time, so they missed a chance to learn  _  they needed to learn. If it's you who  _  repeat a grade, you might be thinking, \"Is everyone really moving on without me?\" Repeating a grade might make you sad, angry, or  _  . It can be stressful. You might be upset  _  you won't be in class with all of your friends. You might feel  _  about repeating a grade. You may think that people are talking about you or  laughing at  you. You can be really hurt if someone makes fun of  _  about repeating a grade. Try talking  _  your mum or dad, a teacher, or a friend advisor when you're having these feelings. School can be hard work, but there are strategies you can learn to help it go a little  _  for you. Set a goal for yourself and  keep  working toward it bit by bit. Ask for help if you need it, and you'll get there!", 
    "options": [
        [
            "first", 
            "second", 
            "third", 
            "fourth"
        ], 
        [
            "wrong", 
            "right", 
            "easy", 
            "difficult"
        ], 
        [
            "trouble", 
            "fun", 
            "practice", 
            "secret"
        ], 
        [
            "ill", 
            "afraid", 
            "healthy", 
            "silly"
        ], 
        [
            "much", 
            "everything", 
            "none", 
            "anything"
        ], 
        [
            "can", 
            "can't", 
            "must", 
            "mustn't"
        ], 
        [
            "neither", 
            "all", 
            "each", 
            "both"
        ], 
        [
            "so", 
            "because", 
            "but", 
            "though"
        ], 
        [
            "shy", 
            "excited", 
            "happy", 
            "afraid"
        ], 
        [
            "himself", 
            "him", 
            "yourself", 
            "you"
        ], 
        [
            "with", 
            "for", 
            "about", 
            "against"
        ], 
        [
            "worse", 
            "better", 
            "later", 
            "earlier"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "A", 
        "A", 
        "B", 
        "C", 
        "D", 
        "B", 
        "A", 
        "D", 
        "A", 
        "B"
    ], 
    "source": "middle610"
}