{
    "article": "I've finally become a big brother! It was quite an exciting day, but something _ happened while Mum was going to give a birth in the delivery room . I was waiting _ the delivery room when a _ came up to me and asked in a soft voice, \" Hello, I _ your leg. Could you please tell me how it has influenced you?\" Her question got me thinking. I got my man-made leg _ doctors had to amputate(cut off ) my left leg after a road accident. Not many people have asked me _ my life is going without the leg. Then, the lady dropped her _ and looked at the floor and said, \"My son just had an accident and the doctor says he has to have his leg cut off. \"\nI felt sad for her and wanted to _ something to cheer her up. In my mind, I _ for the right words to say. After what seemed like a long time, finally I said, \"Auntie, your son won't have a _ . He'll feel different but you can teach him that difference is special.\" I told _ how Mum always encouraged me to continue learning and to be independent. I also said _ that I had learned to do many things that other ' _ ' people might find difficult. I've swum, cycled and even taken part in marathons.\nThe lady smiled and thanked me. As she waved goodbye to me, I heard my newborn sister _ in the delivery room! I thought to myself: What an unusual day, with an unusual question from a _ .", 
    "options": [
        [
            "usual", 
            "unusual", 
            "happy", 
            "unhappy"
        ], 
        [
            "in", 
            "out", 
            "inside", 
            "outside"
        ], 
        [
            "lady", 
            "nurse", 
            "girl", 
            "patient"
        ], 
        [
            "saw", 
            "regarded", 
            "noticed", 
            "realized"
        ], 
        [
            "after", 
            "before", 
            "unless", 
            "until"
        ], 
        [
            "what", 
            "how", 
            "where", 
            "whether"
        ], 
        [
            "feet", 
            "legs", 
            "body", 
            "head"
        ], 
        [
            "speak", 
            "read", 
            "say", 
            "write"
        ], 
        [
            "waited", 
            "searched", 
            "looked", 
            "asked"
        ], 
        [
            "problem", 
            "secret", 
            "question", 
            "chance"
        ], 
        [
            "she", 
            "myself", 
            "her", 
            "him"
        ], 
        [
            "quickly", 
            "surprisingly", 
            "quietly", 
            "proudly"
        ], 
        [
            "weak", 
            "normal", 
            "strong", 
            "special"
        ], 
        [
            "crying", 
            "laughing", 
            "talking", 
            "shouting"
        ], 
        [
            "teacher", 
            "friend", 
            "stranger", 
            "relative"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "A", 
        "C", 
        "A", 
        "B", 
        "D", 
        "C", 
        "B", 
        "A", 
        "C", 
        "D", 
        "B", 
        "A", 
        "C"
    ], 
    "source": "middle544"
}