{
    "article": "Reading is very important to children. It can  _  the way children think. Books can help children improve their skills and learn more about the world. However, choosing the right book for a child isn't an easy job. If we choose a book that is too easy, the child won't get a challenge, and he or she will make  _  progress in reading. If we choose a book that is too difficult, the child can  _  his or her interest and even stop reading. The following are a few  _  on how to choose the right book for your child. First,  _  buying a book, open it and have your child read a page of it. When he or she meets a few new words, ask him or her to raise a finger. If the child raises five fingers before he or she  _  the page, it means the book is too difficult. On the other hand, if the child raises no finger after reading the whole page  _  , the book is probably too easy. Usually, raising two or three fingers means that the book is  _  for your child! Second, choose books that can  _  your child's attention. Most children like books that have many pictures and everyday things in their lives. Thirdly, choose books  _  small essays or stories. These kinds of books will give children some time to rest as they read them.", 
    "options": [
        [
            "mention", 
            "influence", 
            "suggest", 
            "break"
        ], 
        [
            "many", 
            "much", 
            "little", 
            "few"
        ], 
        [
            "lose", 
            "get", 
            "show", 
            "take"
        ], 
        [
            "advice", 
            "information", 
            "question", 
            "suggestions"
        ], 
        [
            "until", 
            "after", 
            "before", 
            "unless"
        ], 
        [
            "collects", 
            "finishes", 
            "organizes", 
            "buys"
        ], 
        [
            "slowly", 
            "quietly", 
            "heavily", 
            "quickly"
        ], 
        [
            "expensive", 
            "cheap", 
            "important", 
            "perfect"
        ], 
        [
            "catch", 
            "describe", 
            "stop", 
            "change"
        ], 
        [
            "to", 
            "with", 
            "for", 
            "in"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "D", 
        "C", 
        "B", 
        "D", 
        "D", 
        "A", 
        "B"
    ], 
    "source": "middle1441"
}