{
    "article": "Is global warming killing the Maldives? The Maldives is one of the most beautiful countries in the world. Every year, millions of  _  go there to enjoy the wonderful scenery. And in recent years, more and more people would like to visit it,  _  ? Because the little island country is  in trouble  . If global warming  _  , say scientists, the country will go down into the ocean within 100 years. That means the Maldives  _  have disappeared by 2100. The Maldives  _  in the Indian Ocean. It is the  _  country on earth--its highest point is only 2.4m above sea level.  Because of  Greenhouse gas emissions , global temperature and sea levels will rise  _  9cm and 88cm by 2100. If scientists are  _  , most of the Maldives will be covered with water in years. Last October, Maldivian President Mohamed Nasheed and his cabinet held the world's first underwater cabinet meeting to make the world  _  the terrible results from global warming to their own country. In December, he  _  at the 2009 United Nations Climate Change Conference in Copenhagen, trying to ask for help from the world for  _  country. The president even has a  _  to buy a new homeland and move his country and people to a new place. The Moldavian government has been doing all it can to fight the  _  . But the fate of the islands is in the world's hands. No one wants to see this little island country disappear from the world.", 
    "options": [
        [
            "scientists", 
            "tourists", 
            "presidents", 
            "doctors"
        ], 
        [
            "Who", 
            "How", 
            "Why", 
            "When"
        ], 
        [
            "disappears", 
            "happens", 
            "misses", 
            "continues"
        ], 
        [
            "can", 
            "should", 
            "might", 
            "must"
        ], 
        [
            "lives", 
            "lies", 
            "jumps", 
            "arrives"
        ], 
        [
            "highest", 
            "high", 
            "lowest", 
            "low"
        ], 
        [
            "both", 
            "from", 
            "during", 
            "between"
        ], 
        [
            "wrong", 
            "correct", 
            "helpful", 
            "dangerous"
        ], 
        [
            "get", 
            "guess", 
            "realize", 
            "expect"
        ], 
        [
            "served", 
            "spoke", 
            "worked", 
            "sang"
        ], 
        [
            "his", 
            "their", 
            "its", 
            "your"
        ], 
        [
            "task", 
            "problem", 
            "plan", 
            "notice"
        ], 
        [
            "tourists", 
            "place", 
            "island", 
            "sea"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "B", 
        "C", 
        "B", 
        "C", 
        "D", 
        "B", 
        "C", 
        "B", 
        "A", 
        "C", 
        "D"
    ], 
    "source": "middle329"
}