{
    "article": "About a week ago, when I was playing basketball at our local park, I noticed a small group of boys picking on a smaller, skinner boy. They were  _  him names and even pushed him to the ground and kicked dirt in his face.  _  I saw that, I walked over to the group. I stepped  _  them and the smaller boy, and asked them politely what this boy had done worthy of  _  they were doing to him. One of the boys replied,\"He's weird.\"At that, I asked one of the boys if he thought his friend was weird, and the  _  was\"No.\"So, I asked another boy what the word\"weird\"  _  , and he said,\"Different.\"That was my cue . I told them that everyone is  _  , and that they all looked just as different to the other boy as he did to them. They all stood  _  for a moment, and then the most amazing thing happened. One of the boys helped the small boy off the ground and then said sorry to him. He  _  to let him play with them. I thanked the boy for being so  _  . As I looked around, I realized that there were dozens of other people at the park  _  no one else had stopped to help this boy. I felt happy that the boy was strong enough to stand up against his friends to  _  someone in need, but I felt sad that  no one  else had even taken a second look. I hope that my action helped them  _  that they could have made a difference with a little  _  , and maybe next time they will be the one who choose to help.", 
    "options": [
        [
            "giving", 
            "making", 
            "calling", 
            "telling"
        ], 
        [
            "When", 
            "Before", 
            "If", 
            "Though"
        ], 
        [
            "against", 
            "between", 
            "beside", 
            "with"
        ], 
        [
            "how", 
            "why", 
            "whom", 
            "what"
        ], 
        [
            "guess", 
            "sign", 
            "problem", 
            "answer"
        ], 
        [
            "read", 
            "proved", 
            "meant", 
            "wrote"
        ], 
        [
            "different", 
            "free", 
            "important", 
            "strong"
        ], 
        [
            "angrily", 
            "silently", 
            "carefully", 
            "happily"
        ], 
        [
            "refused", 
            "expected", 
            "offered", 
            "prepared"
        ], 
        [
            "proud", 
            "clever", 
            "honest", 
            "patient"
        ], 
        [
            "or", 
            "so", 
            "and", 
            "but"
        ], 
        [
            "help", 
            "stop", 
            "love", 
            "remember"
        ], 
        [
            "decide", 
            "realize", 
            "suggest", 
            "agree"
        ], 
        [
            "energy", 
            "practice", 
            "knowledge", 
            "effort"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "B", 
        "D", 
        "D", 
        "C", 
        "A", 
        "B", 
        "C", 
        "C", 
        "D", 
        "A", 
        "B", 
        "D"
    ], 
    "source": "middle2320"
}