{
    "article": "One day at the end of the class, a wise teacher told each of her students to  _  a plastic bag and a bag of potatoes to school. The next day she told her students: \"From today on, for every person you don't like in your lives, you can choose a potato, write the person's name and the date  _  it and then put it in the plastic bag.\" Day after day, some of the students' bags were very  _  . They were then told to carry this bag with them everywhere they went for a week. They would put it inside their quilts  at night  , on the seats when sitting in a car or on a bus , and next to their desks at school. The days carrying the bag around with them  _  students get to know what a weight they were carrying in their minds. They had to pay attention to it all the time  so that  they wouldn't forget it. As time passed by, the potatoes went bad and  _  nasty . They all tired to get rid of them. Too often we think of tolerance as a gift to  other  people, and it clearly is for ourselves! If we choose to keep our sadness and hatred in our  _  , we will have to carry them around all our lives. Do you think you have got  _  from the wise teacher and what she asked her students to do?", 
    "options": [
        [
            "take", 
            "bring", 
            "put", 
            "show"
        ], 
        [
            "in", 
            "at", 
            "on", 
            "with"
        ], 
        [
            "heave", 
            "strong", 
            "light", 
            "big"
        ], 
        [
            "kept", 
            "made", 
            "asked", 
            "allowed"
        ], 
        [
            "sounded", 
            "tasted", 
            "smelt", 
            "felt"
        ], 
        [
            "hands", 
            "eyes", 
            "stomachs", 
            "hearts"
        ], 
        [
            "anything", 
            "nothing", 
            "somebody", 
            "Anybody"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "B", 
        "C", 
        "D", 
        "A"
    ], 
    "source": "middle526"
}