{
    "article": "I was now five, and still I showed no much interest in things except with my toes . I could not look after myself,  _  my father took care of me. I used to lie on my back all the time in the kitchen. I was  _  , imprisoned in a world of my own, unable to communicate with others. Then, suddenly, it happened on the afternoon of a cold December day. All the family were gathered round the big kitchen fire. Mona and Paddy were drawing funny animals, using a bright piece of yellow chalk. It was the chalk that  _  me so much. I had never seen anything like it before. Suddenly, I wanted to do what my sister was doing. Then without thinking or knowing exactly what I was doing, I  _  out and took the chalk out of my sister's hand, with my left foot. It is a puzzle to many people as well as to  _  . I held the chalk tightly between my toes and made a wild scribble with it on the board. Next moment I stopped, not knowing what to do with the chalk next, hardly knowing how it  _  there. Then I looked up and realized that everyone was looking at me  _  . My mother came in. Her eyes looked from my face down to my  _  , then she took another piece of chalk from Mona, and drew the single letter \"A\" on the floor in front of me. \"Copy that, Christy.\" She said. I tried to do the same action, but I  _  . \"Try again, Chris.\" she whispered in my ear. I tried another two more times. I drew one side of the letter, then the other. It looked ugly, but I  _  to make it finally. I had done it! True! I couldn't speak with my mouth, but now I would speak through something more  _  than spoken words. That one letter was my  _  to a new world, my key to mental freedom.", 
    "options": [
        [
            "and", 
            "for", 
            "so", 
            "though"
        ], 
        [
            "lost", 
            "lonely", 
            "tired", 
            "weak"
        ], 
        [
            "troubled", 
            "worried", 
            "reminded", 
            "interested"
        ], 
        [
            "dropped", 
            "set", 
            "checked", 
            "reached"
        ], 
        [
            "you", 
            "me", 
            "it", 
            "them"
        ], 
        [
            "got", 
            "stuck", 
            "worked", 
            "arrived"
        ], 
        [
            "angrily", 
            "sadly", 
            "silently", 
            "carefully"
        ], 
        [
            "hand", 
            "neck", 
            "foot", 
            "leg"
        ], 
        [
            "froze", 
            "forgot", 
            "fell", 
            "failed"
        ], 
        [
            "tried", 
            "managed", 
            "offered", 
            "decided"
        ], 
        [
            "lasting", 
            "interesting", 
            "moving", 
            "surprising"
        ], 
        [
            "dream", 
            "tool", 
            "gift", 
            "road"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "D", 
        "D", 
        "B", 
        "A", 
        "C", 
        "C", 
        "D", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "middle1696"
}