{
    "article": "Senior high school life is a very new experience. Li Ruomeng, 16, a Senior 1 student at Shanghai No 8 High School, thinks that he has become more responsible  _  he began to study in an all-boys class. Li is studying in one of the first all-boys classes in Shanghai. The classes were started  _  September, 2012. Besides common subjects  such as  math and English, the all-boys classes take some special courses. They've learned how to stay safe in earthquakes and fires. Li is looking forward to courses in the mountains. \"That  _  be exciting and useful. I can't wait to see if I can live by  _  From eight months of study, the students have got a lot from  special courses  and also made progress in their studies. But there are still some worries that boys in the class may be  _  to get on with girls. Lu Qisheng, the school's headmaster, doesn't agree with that. \"The boys told me they have more ways to get on with  _  ,\" Lu told China Daily. \"One boy goes to next-door classes to  _  girls stories, while another likes to show girls how to dance.\" The school is planning  to start  four more all-boys classes this September. \"What we try to do is to help boys do their best and achieve their greatest potential ,\" Lu said.", 
    "options": [
        [
            "until", 
            "after", 
            "since", 
            "when"
        ], 
        [
            "at", 
            "in", 
            "on", 
            "for"
        ], 
        [
            "can't", 
            "must", 
            "may", 
            "shouldn't"
        ], 
        [
            "itself", 
            "themselves", 
            "myself", 
            "yourself"
        ], 
        [
            "clever", 
            "friendly", 
            "happy", 
            "afraid"
        ], 
        [
            "parents", 
            "classmates", 
            "teachers", 
            "girls"
        ], 
        [
            "tell", 
            "say", 
            "speak", 
            "talk"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "B", 
        "C", 
        "D", 
        "D", 
        "A"
    ], 
    "source": "middle2211"
}