{
    "article": "A little boy named Harry became very ill. He had to lie in bed all day, unable to move. He spent his days feeling  _  and blue. There wasn't much he could do except look out of the  _  . Time passed, and his illness frustrated him. Until one day he saw a strange  _  in the window. It was a penguin eating a sausage sandwich. The penguin got in  _  the open window, and said \"good afternoon\" to Harry, turned around, and  _  quickly. Of course, Harry was very  _  . He was still trying to work out what had happened. Outside his window he saw a monkey busy blowing up a balloon . At first Harry asked himself  _  that could possibly be, but after a while, as more and more crazy-looking  _  appeared outside the window, he couldn't help  _  and found it hard to stop. An elephant jumped on a stone, or a dog wore a pair of glasses and acted in a  _  way. The little boy didn't tell anyone about this. Those strange characters ended up putting joy back in his heart, and in his body. Before long, his health had  _  so much that he was able to go back to school again. There he told his classmates all that he had  _  . While he was talking to his best friend, he saw  _  coming out of his friend's school bag. Harry asked his friend what it was, and he was so insistent that  _  his friend had to show him what was in the bag. There, inside, were all the things that his best friend had been using to try to  cheer up  the little boy! And from that day on, Harry always did his best to make sure that no one felt sad and alone.", 
    "options": [
        [
            "happy", 
            "sad", 
            "excited", 
            "cool"
        ], 
        [
            "roof", 
            "hole", 
            "window", 
            "wall"
        ], 
        [
            "photo", 
            "painting", 
            "sign", 
            "shape"
        ], 
        [
            "above", 
            "below", 
            "over", 
            "through"
        ], 
        [
            "left", 
            "slept", 
            "flew", 
            "drove"
        ], 
        [
            "annoyed", 
            "surprised", 
            "bored", 
            "tired"
        ], 
        [
            "what", 
            "which", 
            "when", 
            "where"
        ], 
        [
            "people", 
            "students", 
            "children", 
            "characters"
        ], 
        [
            "crying", 
            "laughing", 
            "running", 
            "coughing"
        ], 
        [
            "funny", 
            "rude", 
            "dull", 
            "strict"
        ], 
        [
            "grown", 
            "improved", 
            "increased", 
            "developed"
        ], 
        [
            "acted", 
            "heard", 
            "experienced", 
            "dreamed"
        ], 
        [
            "something", 
            "anything", 
            "nothing", 
            "everything"
        ], 
        [
            "quickly", 
            "suddenly", 
            "immediately", 
            "finally"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "D", 
        "D", 
        "A", 
        "B", 
        "A", 
        "D", 
        "B", 
        "A", 
        "B", 
        "C", 
        "A", 
        "D"
    ], 
    "source": "middle1433"
}