{
    "article": "Two years ago, Martin was a \"problem child\" and he often caused a lot of trouble. But he didn't usually give his mother much trouble. However, after his father's death, Martin's life became much more  _  . His mother didn't have enough money to  _  for his education. To do this, she had to work hard, and so she was not often at home with him. His mother looked after him as  _  as she could, but Martin still caused problems. He was not interested in  _  and he was often in trouble with the police. Luckily, his mother was very patient, and didn't give up trying to help him. In the end, she made a difficult decision: to send him to a boys' boarding school . But Martin  _  it very much. One day, he told his head teacher he wanted to leave the  _  The head teacher said it was necessary for Martin to talk with his  mother  . So Martin called his mother. To his surprise, this phone call changed his life. \"  It  was really what I needed,\" he said later. \"My mother helped me to understand how much she had given me. She also told me that my father was watching me,  _  he had died, and he would always be proud of everything good I did. I realized that after my father died, I was  _  to be alone, and I tried to make my mother pay more attention to me.\" Martin has really changed, and he is now a  _  student in his class. How was he able to change? His mother's love helped  _  to feel good about himself. As Martin says it's very important for parents to be there for their children.", 
    "options": [
        [
            "careful", 
            "beautiful", 
            "difficult", 
            "wonderful"
        ], 
        [
            "pay", 
            "ask", 
            "look", 
            "wait"
        ], 
        [
            "fast", 
            "well", 
            "soon", 
            "good"
        ], 
        [
            "eating", 
            "playing", 
            "fighting", 
            "studying"
        ], 
        [
            "had", 
            "liked", 
            "hated", 
            "took"
        ], 
        [
            "room", 
            "library", 
            "street", 
            "school"
        ], 
        [
            "if", 
            "than", 
            "although", 
            "because"
        ], 
        [
            "nice", 
            "glad", 
            "afraid", 
            "careful"
        ], 
        [
            "bad", 
            "good", 
            "healthy", 
            "lazy"
        ], 
        [
            "it", 
            "me", 
            "her", 
            "him"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "B", 
        "D", 
        "C", 
        "D", 
        "C", 
        "C", 
        "B", 
        "D"
    ], 
    "source": "middle595"
}