{
    "article": "When I was in Grade Three, I was chosen to the heroine in the school play. For weeks my mother helped me  _  my lines , But once on stage. Every word disappeared  _  my head. My teacher asked me to change  _  and be the narrator. Although I didn't tell my mother  _  had happened that day, she  _  my unhappiness and asked if I wanted to take a walk in the yard. It was a lovely  _  day. It was warm. In the yard all the flowers came out. We could see lots of dandelions dancing among the colorful flowers. How beautiful they were! I watched my mother carelessly bend down by some flowers. \"I think I am going to  dig up  all the useless grass. \" She said. \"But I like dandelions,\" I said, \"All flowers are  _  -- even dandelions\". My mother looked at me  _  . \"Yes, every flower shines in its own way, doesn't it?\" she said. I nodded. \"So that is  _  of people, too. \" She added. She had guessed my  _  . I started to cry and told her the truth. \"You will be a great narrator. \" She said. Then she told me  how much  I loved to read stories to her when I was in Grade 1. Over the next few  _  I learned to take pride in the role. The big day finally  _  . A few minutes before the play, my teacher came over to me. \"Your mother asked me to give this to you,\" she said, passing me a dandelion. After the play, I took the flower home, laughing that I was perhaps  the only  person who would keep such a common dandelion.", 
    "options": [
        [
            "write", 
            "practice", 
            "train", 
            "provide"
        ], 
        [
            "from", 
            "in", 
            "on", 
            "over"
        ], 
        [
            "names", 
            "character", 
            "roles", 
            "lines"
        ], 
        [
            "which", 
            "when", 
            "that", 
            "what"
        ], 
        [
            "sensed", 
            "touched", 
            "reached", 
            "heard"
        ], 
        [
            "spring", 
            "summer", 
            "autumn", 
            "winter"
        ], 
        [
            "perfect", 
            "lively", 
            "attractive", 
            "natural"
        ], 
        [
            "sadly", 
            "carelessly", 
            "surprisingly", 
            "happily"
        ], 
        [
            "kind", 
            "good", 
            "true", 
            "suitable"
        ], 
        [
            "worry", 
            "stress", 
            "nervousness", 
            "pain"
        ], 
        [
            "days", 
            "weeks", 
            "months", 
            "years"
        ], 
        [
            "went", 
            "came", 
            "ran", 
            "appeared"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "D", 
        "A", 
        "A", 
        "C", 
        "D", 
        "C", 
        "D", 
        "B", 
        "B"
    ], 
    "source": "middle1694"
}