{
    "article": "Children all around the world are familiar with fairy tales ,such as \"The Little Mermaid\", \"The Princess and the Pea\" and \"The Emperor's new clothes\". The colourful characters from the stories made us laugh and  _  throughout our childhood. The stories are the  _  of Danish writer Hans Christian Anderson. He was born into a poor family in Odense, Denmark, on April 2, 1805. His early life was not  _  . His father was a shoemaker and his mother a washerwoman. He  _  very little education. As a child he was very emotional and was  _  at for being feminine and tall. In 1816 his father died and Anderson was forced to go out to work, first in a tailor's shop and then at a tobacco factory. At the age of 14 Anderson moved to Copenhagen to start a  _  as a singer and actor. He struggled for three years  _  he had to leave the theater when his voice broke in 1822.  Afterwards  , Anderson went to a grammar school. Having done well, he was allowed to go to Copenhagen University in 1828. He began to publish his fairy tales in1835.They  came out  in small volumes until his death. Anderson lived a hard life, but he tried to make people laugh in all his stories. He wrote because he didn't want children to have a sad childhood as he did. The works  _  Anderson famous all over the world , but he was still a lonely man. He never married and his friends were the people who paid for his work. Anderson passed away on August 4, 1875 at the age of 70. His home in Odense is now a museum and thousands of people visit it every year.", 
    "options": [
        [
            "tell", 
            "speak", 
            "smile", 
            "cry"
        ], 
        [
            "discoveries", 
            "inventions", 
            "creations", 
            "feelings"
        ], 
        [
            "hard", 
            "easy", 
            "excited", 
            "bad"
        ], 
        [
            "bought", 
            "found", 
            "received", 
            "lost"
        ], 
        [
            "spoken", 
            "talked", 
            "smiled", 
            "laughed"
        ], 
        [
            "career", 
            "hobby", 
            "performance", 
            "trip"
        ], 
        [
            "since", 
            "after", 
            "until", 
            "still"
        ], 
        [
            "found", 
            "brought", 
            "made", 
            "let"
        ]
    ], 
    "answers": [
        "D", 
        "C", 
        "B", 
        "C", 
        "D", 
        "A", 
        "C", 
        "C"
    ], 
    "source": "middle1783"
}