{
    "article": "For several years, Americans have enjoyed teleshopping-watching TV and buying things by phone. Now teleshopping is starting in Europe. In some  _  countries, people can turn on their  _  and shop for clothes, jewelry, food, toys and  many other  things. Teleshopping is becoming popular in Sweden.  For example  , the biggest Swedish company sellsdifferent kinds of things on TV in fifteen European countries, and in one year, it makes $10million. In France, there are two teleshopping channels, and the French  _  about $ 20 milliona year in buying things through those channels. In Germany,  _  last year teleshopping was only possible on one channel for one hour every day. Then the government allowed more teleshopping. Other channels can  open  for telebusiness, including the largest American teleshopping company and a 24-hour teleshopping company. German  _  are hoping these will help them sell more things. Some people like teleshopping because it allows them to do their shopping without  going out  . With all the traffic problems in cities, going shopping is not an easy thing. But at the same time, other Europeans  _  like this new way of buying things. They call  _  \"junk on the air.\" Many Europeans usually worry about the quality of the things  for sale  on TV. They think high quality is the most important thing, and they don't believe they can be sure about the quality of the things  on TV  . The need of high quality means that European teleshopping companies will have to be  different from  the American companies. They will have to be more careful about  the quality  of the things they sell. They will also have to work harder to sell things that the buyers cannot touch or see by themselves.", 
    "options": [
        [
            "European", 
            "Asian", 
            "American", 
            "African"
        ], 
        [
            "lights", 
            "switches", 
            "radios", 
            "TVs"
        ], 
        [
            "takes", 
            "cost", 
            "spends", 
            "spend"
        ], 
        [
            "to", 
            "Until", 
            "unless", 
            "by"
        ], 
        [
            "people", 
            "women", 
            "businessmen", 
            "officials"
        ], 
        [
            "still", 
            "Don't", 
            "even", 
            "wont"
        ], 
        [
            "teleshopping", 
            "TV", 
            "radio", 
            "telephone"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "D", 
        "D", 
        "C", 
        "B", 
        "A"
    ], 
    "source": "middle1671"
}