{
    "article": "China's Olympic 110m hurdles(110)gold medalist and former world record holder Liu Xiang announced his retirement on Tuesday, April 7.Liu Xiang started his way of _ a hurdle player at the age of 13.And 19 years later he has to retire because of his _ foot injury.\nAs one of the best athletes  in China, Liu Xiang won the gold medal in the 110m hurdles at the 2004 Athens Olympic Games, becoming the first man Olympic champion in athletics in China. Later in 2006, Liu Xiang set the new world 110m hurdles record of 12.88 seconds in Lausanne, Switzerland. _ at 2008 Beijing Olympic Games, Liu Xiang gave up the race of 110m hurdles because his feet hurt badly before the race. In 2012, Liu Xiang _ the competition again for the same reason at London Olympics. Although Liu Xiang tried to overcome his injury and come back to competition, he did not succeed in making it and finally _ to end his sports career  officially at the age of 32.\nIn the announcement of his retirement, Liu Xiang showed his thanks _ his family, coaches and friends. He said he thanked all the support he had when he won or lost given by them, and the support has always encouraged him to carry on, _ big the challenge is.\nLooking back at Liu Xiang's sports career, he has made great achievements in the event of 110m hurdles. He is a World Record Holder, World Champion and Olympic Champion. He is truly the pride of Chinese. As for the future, Liu Xiang plans to make his contribution to the youth sports development and join in more activities that allow him to connect more with children in mountain areas. As said by himself, \"Everyone has something that he wants to do. I have made a clear _ for the coming years. I believe _ I want to do is something that is simple. Even if it's not big, I am sure that it can make a real difference.\"", 
    "options": [
        [
            "getting", 
            "becoming", 
            "going", 
            "making"
        ], 
        [
            "harmful", 
            "ill", 
            "serious", 
            "badly"
        ], 
        [
            "But", 
            "Although", 
            "Instead", 
            "While"
        ], 
        [
            "took", 
            "had", 
            "missed", 
            "won"
        ], 
        [
            "liked", 
            "kept", 
            "decided", 
            "began"
        ], 
        [
            "with", 
            "to", 
            "on", 
            "around"
        ], 
        [
            "wherever", 
            "whenever", 
            "whatever", 
            "however"
        ], 
        [
            "mistake", 
            "mind", 
            "plan", 
            "living"
        ], 
        [
            "what", 
            "how", 
            "anything", 
            "nothing"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "C", 
        "C", 
        "B", 
        "D", 
        "C", 
        "A"
    ], 
    "source": "middle737"
}