{
    "article": "Hundreds of years ago in a small town, a moneylender lent a lot of money to a poor man. The moneylender , who was old and ugly,  _  the poor man's beautiful daughter. So he came up with an idea. He said the poor man didn't need to return the money to him  _  he could marry his daughter. Both the man and his daughter were  _  . The moneylender then told them that he would put a small  _  stone and a small white stone into an empty bag. The girl would have to  _  one. If she took the black stone , she would become the moneylender's  _  and her father's debt would be let go. If she picked the white stone, she didn't need to marry him and her father's debt would  _  be let go. Her father would be put into prison if she refused to pick a stone. As they talked, the moneylender picked up two stones. As he did that, the girl  _  that he had put two black stones in the bag. He then asked the girl to pick her stone from the bag. The girl thought for a while and then had an idea. She put her hand into the bag and took out a stone.  Without  looking at it, she let it fall onto the path where it  _  became lost among all the other stones. \" Oh how  _  I was!\" She said, \"But never  _  . If you look into the bag for the one that is left, you will be able to  _  which stone I picked.\" This  _  tells: Sometimes we can think about things in a  _  way. Most difficult problems do have an solution.", 
    "options": [
        [
            "pleased", 
            "attracted", 
            "loved", 
            "saw"
        ], 
        [
            "if", 
            "unless", 
            "so", 
            "but"
        ], 
        [
            "bored", 
            "frightened", 
            "relaxed", 
            "excited"
        ], 
        [
            "pink", 
            "red", 
            "black", 
            "yellow"
        ], 
        [
            "show", 
            "damage", 
            "check", 
            "choose"
        ], 
        [
            "daughter", 
            "cousin", 
            "wife", 
            "friend"
        ], 
        [
            "again", 
            "still", 
            "never", 
            "hardly"
        ], 
        [
            "said", 
            "feared", 
            "thought", 
            "noticed"
        ], 
        [
            "usually", 
            "surprisingly", 
            "immediately", 
            "slowly"
        ], 
        [
            "worried", 
            "clever", 
            "careless", 
            "lucky"
        ], 
        [
            "laugh", 
            "mind", 
            "cry", 
            "complain"
        ], 
        [
            "tell", 
            "explain", 
            "ask", 
            "arrange"
        ], 
        [
            "saying", 
            "story", 
            "news", 
            "man"
        ], 
        [
            "careful", 
            "funny", 
            "different", 
            "normal"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "B", 
        "C", 
        "D", 
        "C", 
        "B", 
        "D", 
        "C", 
        "C", 
        "B", 
        "A", 
        "B", 
        "C"
    ], 
    "source": "middle522"
}