{
    "article": "The old man walked slowly into the restaurant. His poor jacket, patched trousers, and worn - out shoes made him stand out from the usual Saturday morning breakfast crowd. With the help of his walking - stick, he walked toward a _ by the window. A young waitress named Mary watched him and ran over to him, and said, \"Here, sir. Let me give you a _ with that chair.\"\nWithout saying a word, he smiled and nodded a thank - you. She pulled the chair away from the table. And then she helped him move in front of the chair, and get _ seated with his walking - stick against the table. In a soft, clear voice he said, \"Thank you, Miss.\" \"You're welcome, sir.\" she replied. \"My name is Mary. I'll be back in a moment. If you need anything , just wave at me!\"\n _ he had finished a hearty meal, Mary brought him the change from his ticket, helping him up from his chair and out from behind the table. She _ him his walking - stick, and walked with him to the door. Holding the door open for him, she said, \"Come back and see us, sir!\" He said softly with a smile, \"You are very kind!\" When Mary went to clean his table, she was greatly _ .Under his plate she found a business card and a$100 bill! The note read--\"dear Mary, I respect you very much, and you respect yourself too. It shows by the way you _ others. You have found the secret of happiness. Your kind gestures will shine through those who meet you.\"\nThe man she had waited on was the _ of the restaurant, This was the first time that she, or any of her workmates had ever seen him in person.", 
    "options": [
        [
            "waiter", 
            "manager", 
            "door", 
            "table"
        ], 
        [
            "menu", 
            "dish", 
            "hand", 
            "bill"
        ], 
        [
            "comfortably", 
            "angrily", 
            "unhappily", 
            "excitedly"
        ], 
        [
            "After", 
            "Until", 
            "Unless", 
            "While"
        ], 
        [
            "made", 
            "took", 
            "got", 
            "handed"
        ], 
        [
            "bored", 
            "frightened", 
            "surprised", 
            "pleased"
        ], 
        [
            "chat", 
            "treat", 
            "deal", 
            "communicate"
        ], 
        [
            "customer", 
            "friend", 
            "owner", 
            "cleaner"
        ]
    ], 
    "answers": [
        "D", 
        "C", 
        "A", 
        "A", 
        "D", 
        "C", 
        "B", 
        "C"
    ], 
    "source": "middle1190"
}