{
    "article": "While Henry was getting ready for work one Friday morning, he announced to his wife that he finally decided to ask his boss for a pay raise. All day Henry doubted  _  Mr Stevenson would refuse or not. The thought of walking into Stevenson's office made Henry  _  at the knees. Later in the afternoon he finally had the  _  to do that. To his great joy, the ever-frugal  Stevenson agreed. What great happiness the  _  gave Henry!\nHenry arrived home wearing a smile on his face. His wife, May, prepared a nice meal  _  his favourite dishes. At once he  _  someone in his office had told her about it. Next to his plate he found a  _ . It read, \"Congratulations, my love! I'm so proud of you. I've prepared this dinner to  _  just how much I love you.\" He read it and thought how lovely May was.\nAfter dinner, Henry was on his way to the kitchen when he saw a second card on the floor. He picked it up. It read, \"Don't worry about not getting the raise! You're well worth one! I've prepared this dinner to show just how much I love you  _  you didn't get it.\" Tears  in eyes, Henry now knew May's support for him didn't  _  on his success at work.", 
    "options": [
        [
            "when", 
            "how", 
            "that", 
            "whether"
        ], 
        [
            "strong", 
            "weak", 
            "happy", 
            "pleased"
        ], 
        [
            "thought", 
            "energy", 
            "courage", 
            "strength"
        ], 
        [
            "praise", 
            "award", 
            "reward", 
            "raise"
        ], 
        [
            "as", 
            "including", 
            "beyond", 
            "except"
        ], 
        [
            "supposed", 
            "understood", 
            "confirmed", 
            "remembered"
        ], 
        [
            "letter", 
            "note", 
            "mail", 
            "notice"
        ], 
        [
            "show", 
            "mark", 
            "mean", 
            "remind"
        ], 
        [
            "until", 
            "although", 
            "whenever", 
            "since"
        ], 
        [
            "carry", 
            "keep", 
            "depend", 
            "hold"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "C", 
        "D", 
        "B", 
        "A", 
        "B", 
        "A", 
        "B", 
        "C"
    ], 
    "source": "middle1349"
}