{
    "article": "I was in my parked car, holding a book and reading. Once in a while I looked up, watching the people passing by. When I raised my  _  again, I saw an old lady with a large bag walking slowly towards my car. The bag seemed not only to make her steps  _  , but also make her out of breath. She looked tired and I thought she must be more than 70 years old. She stopped and put a hand out to rest  _  it, gently (,) closed her eyes and took a deep breath. Was there a way I could do something? I tried to keep my body still while my mind  _  for answers. However, because of my careless head movement, she noticed me, and she  _  moved her hand away from the car. I picked up a bottle of water at once, gently opened the door and offered the bottle to her. She  looked at  me, and then shook her head and walked away. I was so  _  with myself. I should have been more careful not to move. Instead of  _  ,) the old lady's  _  moment of rest. I was feeling blue. Just at that moment, I saw the lady coming back again. I opened the door and patted the  _  next to me. She sat down, opened her bag and offered me a banana. I took it and offered her the bottle of water again. She took it. I ate, she drank and we smiled. She  _  for a couple of minutes. Those minutes brought such quietness to me. Then she took my head in both her hands, made a small kissing  _  I was trying to help someone in distress (,). In turn, I became distressed and she took away my distress and replaced it with quietness.", 
    "options": [
        [
            "hand", 
            "arms", 
            "head", 
            "eyes"
        ], 
        [
            "heavy", 
            "large", 
            "quick", 
            "usual"
        ], 
        [
            "in", 
            "over", 
            "under", 
            "against"
        ], 
        [
            "paid", 
            "cared", 
            "asked", 
            "searched"
        ], 
        [
            "softly", 
            "quickly", 
            "strangely", 
            "thankfully"
        ], 
        [
            "lonely", 
            "angry", 
            "worried", 
            "surprised"
        ], 
        [
            "holding", 
            "taking", 
            "giving", 
            "showing"
        ], 
        [
            "sad", 
            "quiet", 
            "magic", 
            "proud"
        ], 
        [
            "bed", 
            "floor", 
            "chair", 
            "seat"
        ], 
        [
            "slept", 
            "talked", 
            "rested", 
            "listened"
        ], 
        [
            "sound", 
            "voice", 
            "music", 
            "note"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "D", 
        "B", 
        "B", 
        "C", 
        "B", 
        "D", 
        "C", 
        "A"
    ], 
    "source": "middle1631"
}