{
    "article": "The late  Michael Greenberg was known among New York City's homeless as \"Gloves.\" For thirty straight years, he gave warm gloves to the _ .\nEvery day he w The late  Michael Greenberg was known among New York City's homeless as \"Gloves.\"alked to work fast. Like any other businessman, he was wearing a suit and carrying a briefcase  . However, he was _ . In winter, his briefcase always had some gloves. Unlike other New Yorkers, who looked at the ground and hurried down the street, he looked at people around. He would stop when he _ someone with no gloves. He gave them a pair and then he moved on , looking for more people with cold _ .\nOn winter days, Mr. Greenberg gave away gloves. Every payday throughout the year, Mr. Greenberg _ three pairs of gloves and saved them to give them away in winter.\nOver the years he was trying to hide from public attention. People _ him money and advice all the time, though. They even _ he could open up a warehouse  and let people come by and pick them up. However, Michael Greenberg would rather work one-on-one with the homeless. He said, \"It's not so much the gloves, _ telling people they count  .\"\nOnce he was asked, \"Why do you do this?\" He said, \"It runs in the _ . I do this to honor   my father. My father always told me, 'Never deprive   _ of the joy of giving!' A pair of gloves may be a small thing, but it can make a big _ in winter. \"", 
    "options": [
        [
            "old", 
            "busy", 
            "kind", 
            "poor"
        ], 
        [
            "calm", 
            "special", 
            "crazy", 
            "curious"
        ], 
        [
            "helped", 
            "chose", 
            "greeted", 
            "saw"
        ], 
        [
            "hands", 
            "ears", 
            "faces", 
            "eyes"
        ], 
        [
            "borrowed", 
            "sold", 
            "returned", 
            "bought"
        ], 
        [
            "called", 
            "sent", 
            "lent", 
            "showed"
        ], 
        [
            "suggested", 
            "promised", 
            "ordered", 
            "concluded"
        ], 
        [
            "but", 
            "as", 
            "that", 
            "since"
        ], 
        [
            "city", 
            "family", 
            "neighborhood", 
            "company"
        ], 
        [
            "him", 
            "me", 
            "yourself", 
            "themselves"
        ], 
        [
            "difference", 
            "decision", 
            "presentation", 
            "connection"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "D", 
        "A", 
        "D", 
        "B", 
        "A", 
        "A", 
        "B", 
        "C", 
        "A"
    ], 
    "source": "middle1177"
}