{
    "article": "Every year thousands of people get hurt or die when they are crossing the road. Most of these people are old people and children. Old people often get hurt or die because  _  can't see or hear very well. Children usually meet with accidents because they are  _  . They forget to look around  _  they cross the road. How can we lessen traffic accidents? All of us must  _  the traffic rules. For the drivers, they shouldn't drive too fast. If they drive too fast, it will be very difficult to stop the  _  ),it's very important to be careful while they are  _  on the road. Therefore, when we walk  _  the road, we must try to walk along the pavements . We must stop and look  _  ways before crossing the road. Look left first, next look right, and then look left again. Only when we are sure that the road is clear, we can cross it. The right way to cross the road is to walk  _  . It's not safe to walk too slowly or run fast. If people run across the road, they may  fall down  . As teenagers, we should try to help children, old people or blind people to cross the road. The last one is that we should never play in the street.", 
    "options": [
        [
            "we", 
            "they", 
            "he", 
            "them"
        ], 
        [
            "happy", 
            "young", 
            "careless", 
            "sad"
        ], 
        [
            "after", 
            "before", 
            "although", 
            "if"
        ], 
        [
            "obey", 
            "make", 
            "break", 
            "set"
        ], 
        [
            "old", 
            "young", 
            "car", 
            "train"
        ], 
        [
            "walking", 
            "driving", 
            "cleaning", 
            "standing"
        ], 
        [
            "through", 
            "over", 
            "across", 
            "off"
        ], 
        [
            "all", 
            "both", 
            "either", 
            "neither"
        ], 
        [
            "quickly", 
            "slowly", 
            "happily", 
            "safely"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "B", 
        "A", 
        "C", 
        "A", 
        "C", 
        "B", 
        "D"
    ], 
    "source": "middle1062"
}