{
    "article": "Cancy is now with her parents. But she was stolen as a baby on Aug. 4, 1987. \"It's a wonderful feeling. Now I can sleep,\" mother Joy White said after  _  her grown-up daughter over the weekend, \"I never took her picture off my dresser. I never  gave up  looking for her.\" Cancy was not yet a month old  _  she was stolen. She had a  _  and her worried parents took her to hospital. A woman dressed as a  _  got close to Joy White in the emergency room and told her everything would be  _  .Joy went home to rest. When she returned to the hospital ,Cancy was gone.  At the same time  , a girl known as Nejdra grew up in Bridgeport. As a teenager, she began to doubt that she wasn't  _  concerned with the family that  _  her. And she was puzzled that she was  _  able to get a copy of her birth certificate . Finally, she began to do some  _  on the Internet. On a website, she found a photo of a  _  baby named Cancy. The site got in touch with Joy White on Jan.4 and  _  her a baby photo taken by the family who raised Nejdra. \"I was shouting. I was so excited,\"Joy said, \"  As soon as  I saw the picture I said, 'That's my daughter.' I saw myself in her.\" DNA tests  _  Nejdra is Cancy --- the daughter of Joy White and Carl Tyson.\"I already knew in my heart that this was my daughter,\" Tyson said.", 
    "options": [
        [
            "helping", 
            "noticing", 
            "dreaming", 
            "meeting"
        ], 
        [
            "when", 
            "if", 
            "until", 
            "so"
        ], 
        [
            "mistake", 
            "habit", 
            "chance", 
            "fever"
        ], 
        [
            "nurse", 
            "student", 
            "friend", 
            "child"
        ], 
        [
            "special", 
            "attractive", 
            "fine", 
            "exact"
        ], 
        [
            "actually", 
            "always", 
            "simply", 
            "luckily"
        ], 
        [
            "served", 
            "saved", 
            "stole", 
            "raised"
        ], 
        [
            "never", 
            "also", 
            "only", 
            "already"
        ], 
        [
            "homework", 
            "tests", 
            "research", 
            "experiments"
        ], 
        [
            "missing", 
            "smiling", 
            "crying", 
            "singing"
        ], 
        [
            "lent", 
            "showed", 
            "bought", 
            "handed"
        ], 
        [
            "allowed", 
            "suggested", 
            "proved", 
            "wished"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "D", 
        "A", 
        "C", 
        "A", 
        "D", 
        "A", 
        "C", 
        "A", 
        "B", 
        "C"
    ], 
    "source": "middle1113"
}