{
    "article": "Kevin sat at the desk in his study, pencil in hand. He had to write a story for his English class by Friday. \"I don't know what to write about ,\" he complained to his dog, who was asleep at his feet. Kevin was talkative when speaking to his friends, yet he had _ finding words he had to write.\nBy bedtime Kevin had drawn a picture of his dog smiling. He had drawn a tree with its branches  blowing in a high wind. He had also written a _ asking his friend to go to the movies on Saturday. _ he had not written a single word of his story.\nOn Wednesday, Mrs Scott, Kevin's English teacher, asked the class to hand in the first draft  of their stories. Kevin had to turn in the only work that he had--the page with his name, the _ , and the note.\nKevin wasn't _ when Mrs Scott asked him to stay after class the next day. But he was surprised by what _ said to him. \"Kevin, this is a fantastic story--the dog, the movie, the tree in the _ . I can't wait to find out how they all fit together. I think you have the idea of a story there. Look at your note and the pictures and try to see _ a story comes to you.\"\nThat night Kevin sat at his desk, and this was what he wrote: \"One Saturday Tom went to meet his friend at the _ . it looked as if it might rain, so Tom _ his umbrella. Suddenly a big storm blew in. The noise of the wind _ like Tom's dog Spotty. Spotty really hated storms and barked whenever he wanted to be let inside. Then Tom saw Spotty running after him down the busy street, barking. The sound was full of blame . Tom felt _ because he had left Spotty outside. He turned and headed home with Spotty. Tom let Spotty in the door just and the rain started to pour down.\"\nKevin had a story after all. The last thing he did was to write his name _ at the top of the page.", 
    "options": [
        [
            "trouble", 
            "fun", 
            "help", 
            "experience"
        ], 
        [
            "report", 
            "notice", 
            "letter", 
            "note"
        ], 
        [
            "And", 
            "But", 
            "So", 
            "Or"
        ], 
        [
            "photos", 
            "maps", 
            "writings", 
            "drawings"
        ], 
        [
            "cheerful", 
            "surprised", 
            "scared", 
            "satisfied"
        ], 
        [
            "I", 
            "you", 
            "he", 
            "she"
        ], 
        [
            "wind", 
            "rain", 
            "snow", 
            "fog"
        ], 
        [
            "when", 
            "why", 
            "if", 
            "where"
        ], 
        [
            "theatre", 
            "cinema", 
            "bank", 
            "museum"
        ], 
        [
            "carried", 
            "lost", 
            "sold", 
            "hid"
        ], 
        [
            "looked", 
            "felt", 
            "sounded", 
            "acted"
        ], 
        [
            "energetic", 
            "angry", 
            "guilty", 
            "curious"
        ], 
        [
            "smoothly", 
            "proudly", 
            "hurriedly", 
            "properly"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "B", 
        "D", 
        "B", 
        "D", 
        "A", 
        "C", 
        "B", 
        "A", 
        "C", 
        "C", 
        "B"
    ], 
    "source": "middle361"
}