{
    "article": "It all started at the beginning of the ninth grade. Carmen found she couldn't see things  _  all the time. She became very worried, but she hoped  _  would know that. When her mother asked her to see the eye doctor, she didn't  _  . But her mother's mind was made up. Three days later, Carmen got new glasses and instructions from her doctor. \"All of the kids will think I'm silly.\" Carmen said. Her mother  _  and shook her head. \"You look just as beautiful as before,\" she said. But Carmen didn't believe her. The next day, Carmen kept the glasses in her pocket as she walked into the schoolyard. She stood alone away from her friends, feeling  _  . Suddenly, she heard her friend Theresa shout. Carmen ran over to the other girls. \"What's the matter?\" she asked. \"My ring is gone!\" Theresa cried. \"My sister sent it to me from California. It's very  _  and I can 't lose it.\" Carmen and her friends began to  look for  the ring in the grassy area of the playground. Carmen realized that she could do better if she could see better. She took the glasses out and put them on. Everything looked so  _  ! So clear! She looked down at the ground and a bright light caught her  _  . It was the ring. \"Here it is,\" she shouted. She handed it to Theresa. \"Thanks, Carmen,\" she said. \"I  _  thought we'd find it.\" She paused. \"Hey, 1 didn't know you wore glasses. They look great!\" Carmen had forgotten that she was wearing the new glasses. \"Thanks,\" she replied. \"Maybe wearing glasses won't be so bad after all.\" Carmen thought.", 
    "options": [
        [
            "clearly", 
            "carefully", 
            "freely", 
            "quickly"
        ], 
        [
            "everybody", 
            "nobody", 
            "somebody", 
            "anybody"
        ], 
        [
            "explain", 
            "are", 
            "understand", 
            "agree"
        ], 
        [
            "relaxed", 
            "cheered", 
            "smiled", 
            "jumped"
        ], 
        [
            "tired", 
            "unhappy", 
            "afraid", 
            "serious"
        ], 
        [
            "special", 
            "common", 
            "cheap", 
            "heavy"
        ], 
        [
            "new", 
            "dirty", 
            "strange", 
            "different"
        ], 
        [
            "ears", 
            "eyes", 
            "feet", 
            "hands"
        ], 
        [
            "still", 
            "ever", 
            "never", 
            "often"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "D", 
        "C", 
        "B", 
        "A", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "middle1928"
}