{
    "article": "One night,a little before nine o'clock,Dr Johnson was answering a telephone call. He was asked to go and operate on a very sick boy at once.The boy was in a small hospital in Glens Falls,sixty miles _ from Dr Johnson's city--Albany.The boy had hurt himself in a traffic accident. His life was in danger,but his family was _ poor that they couldn't _ the doctor anything, After hearing this ,Dr Johnson started to head to the hospital at once.He thought that he could get to the hospital before 12 o'clock . A few minutes later,the doctor's car had to stop for a red light at a crossing. Suddenly a man in an old black coat opened the door of the car and got in.\n\"Drive on,\"he said,\"I've _ a gun.\"\n\"I'm a doctor,said Johnson.\" \"I'm on my way to a hospital to operate on a very sick...\"\n\"Don't _ ,\"said the man in the old black coat.\"Just drive.\"\nA mile out of the town he ordered the doctor to stop and get out. Then the man drove on _ The road.The doctor stood for a moment in the snow.Half an hour later Dr Johnson found a telephone and called a taxi.At the railway station he learnt that that the next train to Glens Falls would not leave _ 12 o'clock.\nIt was about _ o'clock in the morning when the doctor arrived at the hospital in Glens Falls. \"The boy just _ an hour ago !\" said the nurse. \"I've _ my best. It took me about five hours to come here from my home, because I meet a....\" Suddenly he saw the man in the old black coat, _ his head in his hands.\"Mr Shute,\" said the nurse to the man, \"This is Dr Johnson. He has come all the way from Albany to try to _ your boy.\"", 
    "options": [
        [
            "far", 
            "long", 
            "away", 
            "father"
        ], 
        [
            "very", 
            "that", 
            "too", 
            "so"
        ], 
        [
            "cost", 
            "pay", 
            "spend", 
            "take"
        ], 
        [
            "had", 
            "took", 
            "got", 
            "found"
        ], 
        [
            "say", 
            "speak", 
            "tell", 
            "talk"
        ], 
        [
            "up", 
            "down", 
            "left", 
            "right"
        ], 
        [
            "before", 
            "after", 
            "at", 
            "until"
        ], 
        [
            "two", 
            "three", 
            "four", 
            "five"
        ], 
        [
            "die", 
            "dead", 
            "deadly", 
            "died"
        ], 
        [
            "try", 
            "do", 
            "did", 
            "tried"
        ], 
        [
            "having", 
            "with", 
            "without", 
            "shaking"
        ], 
        [
            "meet", 
            "see", 
            "save", 
            "safe"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "B", 
        "C", 
        "D", 
        "B", 
        "D", 
        "A", 
        "D", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "middle1805"
}