{
    "article": "Bobby was famous for his attempt   to climb the big snowy mountain. He had tried at least thirty times, but had  _  failed. One day, he finally reached the mountain top successfully with old Peeper's help. Peeper was the town optician  ,who gave a hand to his success. It was Peeper who mostly encouraged Bobby to try again. And he gave him a pair of  _  as a gift. He said, \"If it starts clouding over or if your feet start hurting,  put on the glasses. These are special glasses, they'll help you. \"\nBobby accepted the gift happily. When his feet started hurting, he  _  what Peeper had said, and he put on the glasses. The pain was _ , but  with the sunglasses he could clearly see the snow-covered mountain top, so he continued. Later he met with other  _ . The clouds were getting thick and the wind was getting strong. However, he could see the top of the mountain, and  _  got there. He took off the sunglasses and felt very excited standing on the mountain top.\nLater, he noticed thick clouds were around the mountain below. Then he looked carefully at the sunglasses. He found that Peeper had engraved   the snow-covered mountain top  _  the glasses. Peeper understood that  _  Bobby lost sight   of the mountain top, he would lose sight of his dream.  Bobby thanked Peeper for  _  him. Because of him, Bobby got to know that his dream was not impossible, and that it was still there, where it had always been.", 
    "options": [
        [
            "always", 
            "never", 
            "hardly", 
            "ever"
        ], 
        [
            "gloves", 
            "sunglasses", 
            "forks", 
            "hats"
        ], 
        [
            "forgot", 
            "remembered", 
            "heard", 
            "explained"
        ], 
        [
            "terrible", 
            "simple", 
            "common", 
            "natural"
        ], 
        [
            "climbers", 
            "programs", 
            "difficulties", 
            "mistakes"
        ], 
        [
            "firstly", 
            "quietly", 
            "finally", 
            "suddenly"
        ], 
        [
            "at", 
            "on", 
            "over", 
            "behind"
        ], 
        [
            "unless", 
            "though", 
            "if", 
            "until"
        ], 
        [
            "inviting", 
            "visiting", 
            "stopping", 
            "helping"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "B", 
        "A", 
        "C", 
        "C", 
        "B", 
        "C", 
        "D"
    ], 
    "source": "middle530"
}