{
    "article": "Worries about school bus safety have drawn much attention. Now schools in some poor areas are looking  _  some other ways to go to school. In the countryside, students are living in different places. And there isn't enough time for school buses to go around and pick up  _  student. So the most useful way is to let students living in the  _  village take a special school bus which is for them only. And the cost is  _  by their parents and the school. Each bus is asked to carry only five students on the same route every day. Traffic police are also making daily checks to make sure drivers don't carry  _  than 5 students. For a bus like this, the drivers can  _  make any money. So schools pay 300 yuan to drivers every month. The rest comes from the parents' pockets . The roads to the students' homes are rough and sometimes even dangerous,  _  falling rocks and narrow bridges. After spending at least an hour on the road, the students finally make it home.  _  the money for taking a bus has increased and it's not easy for parents to make money, they are glad to know that their children will  get  home safely each day. And they feel happy to see their child enjoy their time at school. But one girl says she's seen the big yellow school  _  on TV, and wonders when she'll ride one of her own.", 
    "options": [
        [
            "at", 
            "up", 
            "for", 
            "through"
        ], 
        [
            "all", 
            "every", 
            "both", 
            "either"
        ], 
        [
            "near", 
            "far", 
            "same", 
            "poor"
        ], 
        [
            "bought", 
            "spent", 
            "paid", 
            "took"
        ], 
        [
            "few", 
            "fewer", 
            "many", 
            "more"
        ], 
        [
            "always", 
            "often", 
            "sometimes", 
            "hardly"
        ], 
        [
            "and", 
            "but", 
            "with", 
            "without"
        ], 
        [
            "Because", 
            "Although", 
            "If", 
            "When"
        ], 
        [
            "desks", 
            "bags", 
            "buses", 
            "bikes"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "C", 
        "C", 
        "D", 
        "D", 
        "C", 
        "B", 
        "C"
    ], 
    "source": "middle1910"
}