{
    "article": "I returned home to spend the holiday with my mom excitedly. I was looking forward to sitting down on the sofa, watching TV and  _  until midnight with her. However, things weren't as I expected. Not long  _  I arrived home, mom got a phone call. One of her friends  _  her to play cards. She gladly accepted the invitation and went at once. I thought she didn't like me. During the following days, I deliberately  _  to speak to her. Whenever she spoke to me, I just stood in silence. But later I began to feel  _  . Sometimes I really wanted to say sorry to her,  _  when I saw her making delicious food or buying me  _  favorite snacks. Maybe she felt sorry for  _  she had done that night. I began to think that I should do something to make the things  _  At the end of the holiday, I began to help with some  _  from making the bed to cleaning the house, I did  _  I could when mom wasn't around. When she returned, she smiled happily. On the  _  day,she insisted on driving me to the bus station. At first we said nothing, then mom said, \"Sorry for that night. You know that you mean  _  than anything to me .\"I couldn't say a word as I tried to  _  back the tears. Before getting on the bus, I finally said sorry to her. Mom smiled, and there were tears  _  her eyes. But I knew they were tears of happiness.", 
    "options": [
        [
            "speaking", 
            "talking", 
            "saying", 
            "telling"
        ], 
        [
            "when", 
            "before", 
            "until", 
            "after"
        ], 
        [
            "told", 
            "asked", 
            "invited", 
            "ordered"
        ], 
        [
            "refused", 
            "started", 
            "liked", 
            "wanted"
        ], 
        [
            "happy", 
            "sad", 
            "surprised", 
            "excited"
        ], 
        [
            "actually", 
            "totally", 
            "especially", 
            "really"
        ], 
        [
            "his", 
            "my", 
            "her", 
            "our"
        ], 
        [
            "what", 
            "when", 
            "why", 
            "that"
        ], 
        [
            "right", 
            "wrong", 
            "busy", 
            "awful"
        ], 
        [
            "homework", 
            "cooking", 
            "housework", 
            "exercise"
        ], 
        [
            "everything", 
            "something", 
            "nothing", 
            "anything"
        ], 
        [
            "first", 
            "next", 
            "third", 
            "final"
        ], 
        [
            "most", 
            "more", 
            "best", 
            "better"
        ], 
        [
            "give", 
            "hold", 
            "return", 
            "get"
        ], 
        [
            "on", 
            "out", 
            "in", 
            "over"
        ]
    ], 
    "answers": [
        "B", 
        "B", 
        "C", 
        "A", 
        "B", 
        "C", 
        "B", 
        "A", 
        "A", 
        "C", 
        "A", 
        "B", 
        "B", 
        "C", 
        "C"
    ], 
    "source": "middle706"
}