{
    "article": "\"Track isn't an _ sport.\" the coach said. \"Are you ready to practice hard every day?\"\n\"Oh, yes. I love running.\" I replied.\n\"Well, that's good,\" the coach said.\" _ starts tomorrow after school.\"\nI was a little nervous about running with mostly older students, but I decided to face my fear.\n\"Welcome to the first day of practice.\" the coach ordered everyone to the bottom of a sand hill. \"Okay.\", he said, \"This is the _ practice we'll do all season. You are going to run up and down the sand hill ten times as fast as you can. If you can't _ it, move to the side.\" We all lined up, legs ready.\n\"Go!\"the coach shouted, and _ we went.\nI considered myself a bit small but strong. Running up that hill, however, was harder than I had imagined it would be. The sand kept falling down under my feet and it was hard to keep balance . I tried _ my feet in deeper, but people kept passing me shouting \"Look out!\" and \"Move off to the side!\"\n\"Don't cry,\" I told myself as tears filled my eyes. I had to step aside. I went home from practice feeling like a(an) _ .\nThat night my dad noticed sad face and asked what was wrong. The story came pouring out. Dad listened quietly and then asked, \"How _ do you want to run?\"\n\"I really want to run,\" I whispered through my tears.\n\"Then, run,\" he said. \"Everyone will respect you if you don't stop and give _ all you have. I know how strong-mined you can be when you set your mind to it.\"\nThe next day the hill looked as hard as it had been the day before, but I had a new attitude and something to _ . \"Go!\" the coach shouted. Several older students ran by me as we started up the hill. I still fell in the sand, and I still wanted to leave every step of the way; but I kept _ slowly and progressively. When I reached the top, I gave a silent cheer and headed back down again. My dad was right. I won _ that day and became a part of the team. On my last time down, everyone clapped and cheered.", 
    "options": [
        [
            "old", 
            "easy", 
            "exciting", 
            "unusual"
        ], 
        [
            "Practice", 
            "Progress", 
            "Class", 
            "Work"
        ], 
        [
            "funniest", 
            "hardest", 
            "safest", 
            "worst"
        ], 
        [
            "get", 
            "find", 
            "make", 
            "follow"
        ], 
        [
            "away", 
            "out", 
            "up", 
            "by"
        ], 
        [
            "fixing", 
            "resting", 
            "shaking", 
            "digging"
        ], 
        [
            "stranger[", 
            "failure", 
            "honor", 
            "hero"
        ], 
        [
            "badly", 
            "quickly", 
            "hard", 
            "well"
        ], 
        [
            "them", 
            "you", 
            "us", 
            "it"
        ], 
        [
            "change", 
            "realize", 
            "learn", 
            "prove"
        ], 
        [
            "climbing", 
            "jumping", 
            "falling", 
            "rushing"
        ], 
        [
            "trust", 
            "praise", 
            "respect", 
            "support"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "B", 
        "C", 
        "C", 
        "D", 
        "B", 
        "A", 
        "D", 
        "D", 
        "D", 
        "C"
    ], 
    "source": "middle11"
}