{
    "article": "Each of us fails from time to time. If we are wise, we accept these failures as a necessary  _  of the learning process. But too often as parents and teachers we deny this same right to our children. We convey  _  by words or by actions that failure is something to be ashamed of, that nothing but  _  performance pleases us.  _  I see a child under this kind of pressure ,I think of Jack. He is a shy, nervous perfectionist. He  _  answered questions--he might be  _  . I try my best to  _  his self-confidence. And I repeatedly  _  God for direction. But  _  changed until midterm, when Mary, a student teacher, came to our classroom. One day we were working with math problems. Jack had copied the problems with care.  _  with his progress, I left the children with Mary .When I returned, Jack was in tears. He'd missed the third problem. At that time, Mary got a box  _  with pencils from the desk we shared. \"Look, Jack ! I've got something to show you.\" she said.\" See these pencils, they belong to Mrs. Green and me. See how the erasers are  _  ? That's because we make mistakes too. But we erase the mistakes and try  _  . That's what you must learn to do, too.\" Jack looked up with  _  Jack gradually believe him that it's all  _  to make mistakes - as long as you erase them and try again.", 
    "options": [
        [
            "life", 
            "part", 
            "game", 
            "show"
        ], 
        [
            "neither", 
            "nor", 
            "either", 
            "or"
        ], 
        [
            "high", 
            "bad", 
            "top", 
            "big"
        ], 
        [
            "When", 
            "While", 
            "As", 
            "Although"
        ], 
        [
            "always", 
            "sometimes", 
            "ever", 
            "seldom"
        ], 
        [
            "right", 
            "wrong", 
            "mistake", 
            "fail"
        ], 
        [
            "start", 
            "set", 
            "establish", 
            "build"
        ], 
        [
            "told", 
            "asked", 
            "said", 
            "spoke"
        ], 
        [
            "something", 
            "nothing", 
            "anything", 
            "everything"
        ], 
        [
            "Kind", 
            "Nice", 
            "Great", 
            "Pleased"
        ], 
        [
            "filled", 
            "full", 
            "deal", 
            "do"
        ], 
        [
            "broke", 
            "new", 
            "good", 
            "worn"
        ], 
        [
            "once", 
            "again", 
            "too", 
            "either"
        ], 
        [
            "disappointment", 
            "sadness", 
            "fear", 
            "love"
        ], 
        [
            "right", 
            "OK", 
            "well", 
            "good"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "C", 
        "A", 
        "D", 
        "B", 
        "D", 
        "B", 
        "B", 
        "D", 
        "A", 
        "D", 
        "B", 
        "D", 
        "A"
    ], 
    "source": "middle1399"
}