{
    "article": "Sometimes we need to remind ourselves that thankfulness is indeed a virtue . William Bennett Thanksgiving Day was coming. The first grade teacher gave her class a fun assignment -- to draw a picture of  _  for which they were thankful. Most of the class might be considered poor, but still many would  _  the holiday with turkey and other traditional food of the season. These, the teacher thought, would be the subject of most of her students' art. And they were. But Douglas made a(an)  _  kind of picture. Douglas was a different kind of boy. He was the teacher's true child of weak and unhappy. As other children played at  _  , Douglas used to stand close by her side. One could only guess at the pain that Douglas felt behind those sad  _  . Yes, his picture was different. When he was asked to draw a picture of something for which he was thankful, he drew a  _  . Nothing else. Just an empty hand. His abstract picture caught the  _  of his classmates. Whose hand could it be? One child guessed it was the hand of a farmer, because farmers  _  turkeys. Another suggested a police officer, because the police protect and  care for  people. Still others guessed it was the hand of God, for God feeds us. And so the discussion went on -- until the teacher almost forgot the young artist  _  . When the children had gone on to other assignments, she stopped at Douglas' desk, bent down, and  _  him whose hand it was. The little boy looked away and murmured, \"It's yours, teacher.\" She recalled the  _  when she had taken his hand and walked with him here or there, as she had the other students. How  _  she had said, \"Take my hand, Douglas, we'll go outside.\" Or, \"Let me show you how to hold your pencil.\" Or, \"Let's do this together.\" Douglas was very  _  for his teacher's hand. Brushing aside a tear, she went on with her work. The story speaks of more than thankfulness. It says something about teachers teaching and parents parenting and friends showing friendship, and how much it means to the Douglases of the world. They might not always say thanks, but they'll remember the hand that  _  out.", 
    "options": [
        [
            "anything", 
            "something", 
            "nothing", 
            "everything"
        ], 
        [
            "congratulate", 
            "spend", 
            "celebrate", 
            "consider"
        ], 
        [
            "good", 
            "interesting", 
            "exciting", 
            "different"
        ], 
        [
            "break", 
            "rest", 
            "desk", 
            "first"
        ], 
        [
            "noses", 
            "hands", 
            "faces", 
            "eyes"
        ], 
        [
            "gift", 
            "person", 
            "hand", 
            "turkey"
        ], 
        [
            "thought", 
            "description", 
            "respect", 
            "imagination"
        ], 
        [
            "raise", 
            "need", 
            "buy", 
            "show"
        ], 
        [
            "himself", 
            "itself", 
            "herself", 
            "themselves"
        ], 
        [
            "said", 
            "asked", 
            "talked", 
            "spoke"
        ], 
        [
            "chances", 
            "forms", 
            "ways", 
            "times"
        ], 
        [
            "much", 
            "many", 
            "often", 
            "long"
        ], 
        [
            "thankful", 
            "helpful", 
            "careful", 
            "beautiful"
        ], 
        [
            "moves", 
            "holds", 
            "reaches", 
            "puts"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "D", 
        "B", 
        "D", 
        "C", 
        "D", 
        "A", 
        "A", 
        "B", 
        "D", 
        "B", 
        "A", 
        "C"
    ], 
    "source": "middle521"
}