{
    "article": "When I was a small boy, something happened to me that made me never put any wild creature in a cage.\nWe lived near a forest, and every evening the mockingbird would come and _ . I decided to catch a young _ and keep it in a cage, and in this way, I would have my own private musician. Then I succeeded in catching one and put it in a cage. At first, the bird was _ , so it fluttered   in the cage. But finally it was used to living in its new home. I felt very excited with myself and looked forward to some beautiful singing.\nOn the second day, the little bird's mother flew to the cage with _ in her mouth. The baby bird ate everything. I was _ to see this. Certainly the mother bird knew how to feed her baby better than I did.\nThe following morning when I went to see my bird, I found it _ on the floor of the cage. I was terribly surprised and sad! What had happened?\nArthur Wayne, a famous biologist, happened to _ my father at that time. After she knew my story, she explained to me, \"A mother mockingbird, finding her young in a cage, will _ bring it poison berries. She thinks it better for her baby to die than to lose _ \nSince then I have never caught any living creature and put it in a cage. All living things have a right to live free.", 
    "options": [
        [
            "dance", 
            "fly", 
            "sing", 
            "jump"
        ], 
        [
            "bird", 
            "boy", 
            "fish", 
            "thief"
        ], 
        [
            "happy", 
            "careful", 
            "active", 
            "afraid"
        ], 
        [
            "water", 
            "food", 
            "songs", 
            "stones"
        ], 
        [
            "worried", 
            "pleased", 
            "bored", 
            "tired"
        ], 
        [
            "alone", 
            "alive", 
            "dead", 
            "sick"
        ], 
        [
            "invite", 
            "visit", 
            "challenge", 
            "introduce"
        ], 
        [
            "never", 
            "seldom", 
            "sometimes", 
            "ever"
        ], 
        [
            "friends", 
            "parents", 
            "freedom", 
            "happiness"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "B", 
        "B", 
        "C", 
        "B", 
        "C", 
        "C"
    ], 
    "source": "middle1620"
}