{
    "article": "Once there was a rich man named Chulong.\nOne day, he was walking in his garden when he saw a strange _ with beautiful features  and sweet voice in a tree. Chulong _ went near the tree and caught the bird, which he thought he could _ and get lots of money.\n\"Don't think about making money through me!\" said the bird, \" _ will buy me, because, in imprisonment  , I lose my beauty and sweet voice.\" Chulong's hope of making money was shattered. He became angry and wanted to _ the bird for the meat.\nThen the _ bird suggested, \"Well, set me free. In return I shall teach you _ simple but useful rules, which can do good to you.\"\nChulong didn't believe the bird at first , and he was afraid that the bird would fly away. However, the bird _ it would keep its word . Chulong wanted to take a risk. He set the bird free and it sat on the branch of a tree. It became _ again.\nChulong asked, \"Now teach me the rules.\" \"Certainly,\" said the bird.\nThen the bird taught Chulong the _ : The first rule is Never believe everything others say. The second rule is Never be sad about something you don't have. The third rule is Never throw away what you have in your hand.\n\"You silly bird,\" shouted Chulong, \"These rules are known to everyone. You _ me.\"\nBut the bird said, \"Today, you had me in your hand, but you threw me away. You believed all that I said. And you are sad about not having me. _ the rules are simple, you have never followed them. Now have you got the _ of the rules? Just sit down and think for a while.\" With these words, the bird flew away and disappeared from his sight.", 
    "options": [
        [
            "cat", 
            "bird", 
            "panda", 
            "monkey"
        ], 
        [
            "proudly", 
            "freely", 
            "slowly", 
            "weakly"
        ], 
        [
            "eat", 
            "study", 
            "draw", 
            "sell"
        ], 
        [
            "Nobody", 
            "Somebody", 
            "Anybody", 
            "Everybody"
        ], 
        [
            "find", 
            "borrow", 
            "smell", 
            "kill"
        ], 
        [
            "busy", 
            "helpful", 
            "clever", 
            "lucky"
        ], 
        [
            "three", 
            "four", 
            "five", 
            "six"
        ], 
        [
            "promised", 
            "remembered", 
            "guessed", 
            "hoped"
        ], 
        [
            "ugly", 
            "beautiful", 
            "lazy", 
            "hard-working"
        ], 
        [
            "songs", 
            "languages", 
            "rules", 
            "skills"
        ], 
        [
            "cheated", 
            "helped", 
            "found", 
            "forgot"
        ], 
        [
            "Until", 
            "Unless", 
            "If", 
            "Although"
        ], 
        [
            "history", 
            "value", 
            "reason", 
            "connection"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "D", 
        "A", 
        "D", 
        "C", 
        "A", 
        "A", 
        "B", 
        "C", 
        "A", 
        "D", 
        "B"
    ], 
    "source": "middle62"
}