{
    "article": "I devote myself to music because of my grandmother. My mom and I lived with my grandparents from the time I was two  _  I was eight. And even then, I was at their house before and after school every day while my mother was at work .\nGrandma loved music. It was she that first  _ Elvis Presley   to me as a very young child,and once I heard his music,I was truly in  _  with it . Most five-year-olds ask for  _  for birthdays, but I wanted Elvis' albums. I would play them non-stop and dance to the music in my grandma's family room though my movement didn't look good.\nGrandma played the piano and  _  me to sing \"America the Beautiful\" and \"Somewhere over the Rainbow\" .Finally I started playing music on the _ , and soon Grandma was  _  for me to take piano lessons from a lady living in the neighborhood. I would come home from school and walk three houses down for my lesson. I  _  took about nine months of lessons, but it was enough to give me a foundation  and allow me to continue to _ myself.\nLast month when I came home to visit Grandma in the hospital, I _ along my guitar with me. She was in a lot of pain, but the music seemed to comfort  her soul. She had me sing some songs and when I started to sing \"Somewhere over the Rainbow\", her weakened  _  joined in with mine for a few lines. That experience was one of the most touching   of my lifetime and one I will certainly cherish  forever. I told her of my music career and she was very  _  and said,\"That's wonderful!\" I continued to play for _ throughout the week when I was at home.\nMy grandma passed away two days ago. In my opinion, part of her will live on through every _ I write or sing in my life.", 
    "options": [
        [
            "unless", 
            "after", 
            "until", 
            "when"
        ], 
        [
            "sent", 
            "left", 
            "remembered", 
            "introduced"
        ], 
        [
            "joy", 
            "love", 
            "agreement", 
            "doubt"
        ], 
        [
            "music", 
            "space", 
            "gifts", 
            "toys"
        ], 
        [
            "taught", 
            "prepared", 
            "allowed", 
            "advised"
        ], 
        [
            "violin", 
            "piano", 
            "guitar", 
            "object"
        ], 
        [
            "asking", 
            "paying", 
            "caring", 
            "looking"
        ], 
        [
            "exactly", 
            "also", 
            "only", 
            "seldom"
        ], 
        [
            "teach", 
            "enjoy", 
            "kill", 
            "face"
        ], 
        [
            "brought", 
            "walk", 
            "came", 
            "went"
        ], 
        [
            "sound", 
            "voice", 
            "body", 
            "mind"
        ], 
        [
            "sad", 
            "calm", 
            "bored", 
            "happy"
        ], 
        [
            "myself", 
            "her", 
            "him", 
            "it"
        ], 
        [
            "book", 
            "article", 
            "song", 
            "e-mail"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "B", 
        "D", 
        "A", 
        "B", 
        "B", 
        "C", 
        "A", 
        "A", 
        "B", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "middle741"
}