{
    "article": "If you get pocket money by babysitting or doing yard work for a neighbor, then you probably know a thing or two about managing money. After all, when you've worked that hard, you don't want to  _  it all on candy. Using your money in the right way or  _  some for the future is important. Once you grow up, your success might depend on how  _  you manage your money. It's easier to start these good  _  when you're young. Meghan Coyle is a business girl who is 12 years old. She has made more than $320 in two years by  _  dogs after school. \"I've been a dog-walker for two years and it's been a lot of  _  .I really enjoyed it. My mother never gave me pocket money, so I had to make money in some other way. Lots of kids don't realize how hard it can be to have a job. It can be hard to keep customers happy. There are some days when it's raining and l would rather be  _  else, but I still go out with a dog,\" Coyle said. \"Start a business that interests you. First, you have to advertise. The  _  and safest way is to talk with neighbors and family friends. After you have the customers, keep your customers happy! Send cards that you make by yourself to them on holidays. That always surprises them. Always be willing to do more than they ask. On holidays, give your customers coupons  so that  they will keep coming back to you for your service or products.\" Is it a good idea to do some work to make pocket money? Now think about it and start your own  _  !", 
    "options": [
        [
            "spend", 
            "cost", 
            "take", 
            "pay"
        ], 
        [
            "wasting", 
            "saving", 
            "borrowing", 
            "spending"
        ], 
        [
            "good", 
            "well", 
            "nice", 
            "wonderful"
        ], 
        [
            "activities", 
            "hobbies", 
            "exercises", 
            "habits"
        ], 
        [
            "feeding", 
            "feed", 
            "walking", 
            "walk"
        ], 
        [
            "pain", 
            "fun", 
            "surprise", 
            "trouble"
        ], 
        [
            "nobody", 
            "nowhere", 
            "somebody", 
            "somewhere"
        ], 
        [
            "luckiest", 
            "loudest", 
            "easiest", 
            "latest"
        ], 
        [
            "way", 
            "business", 
            "company", 
            "Life"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "B", 
        "D", 
        "C", 
        "B", 
        "D", 
        "C", 
        "B"
    ], 
    "source": "middle1142"
}