{
    "article": "Help comes in many different ways and plays an important part in our lives.\nA mother wanted to _ her son to play the piano. She _ tickets to the concert of a great pianist. _ they arrived at the theatre, the mother met a friend. She _ to talk to her friend and didn't notice her son run away.\nAt eight o'clock, the lights began to dim   and the concert was going to _ . The mother was _ looking for the boy. Then, she saw her 6-year-old son on the stage. He was on the piano bench _ Twinkle, Twinkle, Little Star.\nThe mother was very _ . Before she could get her son back, the famous pianist had _ moved to the piano.\n\"Don't move, son. _ playing,\" he said kindly to the boy. The great pianist reached down with his left hand and began filling in the bass   part of the song. Soon, his right _ reached around the other side. They played a _ piece of music. Together, the two impressed people with their music.\nIn all of our lives, we often receive helping hands---some we notice, and others we don't. We also have lots of _ to give helping hands---sometimes we want people to know, and sometimes we don't. Little of _ we all achieve comes without others' help. So, when we receive, we should also give back.", 
    "options": [
        [
            "force", 
            "order", 
            "warn", 
            "encourage"
        ], 
        [
            "bought", 
            "sold", 
            "donated", 
            "raised"
        ], 
        [
            "Because", 
            "Before", 
            "When", 
            "Though"
        ], 
        [
            "enjoyed", 
            "stopped", 
            "continued", 
            "discovered"
        ], 
        [
            "take", 
            "start", 
            "leave", 
            "hold"
        ], 
        [
            "still", 
            "nearly", 
            "also", 
            "recently"
        ], 
        [
            "playing", 
            "singing", 
            "writing", 
            "listening"
        ], 
        [
            "creative", 
            "strong", 
            "energetic", 
            "surprised"
        ], 
        [
            "safely", 
            "slowly", 
            "angrily", 
            "quickly"
        ], 
        [
            "Stop", 
            "Spend", 
            "Keep", 
            "Manage"
        ], 
        [
            "eye", 
            "hand", 
            "ear", 
            "leg"
        ], 
        [
            "difficult", 
            "forgetful", 
            "wonderful", 
            "awful"
        ], 
        [
            "races", 
            "examples", 
            "days", 
            "chances"
        ], 
        [
            "how", 
            "which", 
            "that", 
            "what"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "C", 
        "B", 
        "B", 
        "A", 
        "A", 
        "D", 
        "D", 
        "C", 
        "B", 
        "C", 
        "D", 
        "D"
    ], 
    "source": "middle249"
}