{
    "article": "\"Who would you like to change your life with if possible?\" Last week, we asked many middle school students this question. The following are some of their  _  Zhang Yike, 12 I want to change my life with my friend, Wang Xiaohui. She is studying in England now. She has  _  to many countries, such as the US and France. They are the places I wish to visit. What's more, she  _  much better English than me. If I change my life with her, I can visit many beautiful countries, eat delicious  _  and meet different kinds of people there. Qiu Haoran, 14 I'd like to change my life with my Chinese teacher Miss Zhao. Miss Zhao is a very kind lady. She  _  a lot, so she always has so many  _  stories to tell us. We all like her classes. I also want to be such an excellent teacher and be  _  with my students. Tan Bo, 13 I will change my life with my elder brother. My brother is a college student now. He does have to go to class all the time. He can study  _  he is interested in. And he even has a part-time job to make money. To  _  , all of these sound very interesting. I really want a life  _  this.", 
    "options": [
        [
            "answers", 
            "problems", 
            "questions", 
            "changes"
        ], 
        [
            "gone", 
            "come", 
            "been", 
            "moved"
        ], 
        [
            "says", 
            "speaks", 
            "talks", 
            "tells"
        ], 
        [
            "drink", 
            "air", 
            "food", 
            "water"
        ], 
        [
            "teaches", 
            "knows", 
            "thinks", 
            "asks"
        ], 
        [
            "long", 
            "short", 
            "terrible", 
            "interesting"
        ], 
        [
            "busy", 
            "angry", 
            "popular", 
            "serious"
        ], 
        [
            "that", 
            "which", 
            "who", 
            "what"
        ], 
        [
            "me", 
            "him", 
            "you", 
            "them"
        ], 
        [
            "at", 
            "on", 
            "for", 
            "like"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "B", 
        "C", 
        "B", 
        "D", 
        "C", 
        "D", 
        "A", 
        "D"
    ], 
    "source": "middle1809"
}