{
    "article": "Overhead bridges are found in some parts of Anyue, especially in places _ traffic is heavy and crossing the road is very _ .\nThe purpose of these overhead bridges is to enable pedestrians  to _ road safely. Overhead bridges are used in very much the same way _ zebra crossings. They are more efficient  although less convenient because people have to climb up a long flight of steps. This is  inconvenient especially to old people. When pedestrians are _ a zebra crossing, traffic is held up. This is _ the government has built some overhead bridges to help pedestrians and to keep traffic moving _ the same time.\nThe government of Anyue has spent lots of money in building these bridges. For their own safety, pedestrians _ be encouraged to use them instead of _ their lives by running across the road. Old people, however, may find _ a little difficult to climb up and down the steps, but it is still _ safer than walking across the road with all the danger of moving traffic.\nOverhead bridges serve a very useful purpose. Pedestrians, both old and young, should form a _ of using them, This will prevent unnecessary accidents and loss of life.", 
    "options": [
        [
            "where", 
            "when", 
            "that", 
            "who"
        ], 
        [
            "safe", 
            "danger", 
            "dangerous", 
            "safety"
        ], 
        [
            "crossing", 
            "cross", 
            "crosses", 
            "crossed"
        ], 
        [
            "in", 
            "for", 
            "to", 
            "as"
        ], 
        [
            "useful", 
            "using", 
            "used", 
            "use"
        ], 
        [
            "when", 
            "because", 
            "that", 
            "why"
        ], 
        [
            "at", 
            "to", 
            "for", 
            "in"
        ], 
        [
            "shouldn't", 
            "won't", 
            "should", 
            "might"
        ], 
        [
            "risking", 
            "risk", 
            "risked", 
            "risks"
        ], 
        [
            "this", 
            "that", 
            "them", 
            "it"
        ], 
        [
            "many", 
            "more", 
            "much", 
            "very"
        ], 
        [
            "habit", 
            "hobby", 
            "habits", 
            "hobbies"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "B", 
        "D", 
        "B", 
        "D", 
        "A", 
        "C", 
        "A", 
        "D", 
        "C", 
        "A"
    ], 
    "source": "middle144"
}