{
    "article": "Wang Yani was born in 1975. Even as a baby she loved to draw. Her father was an  _  .Yani wanted to be like him. So she tried to stand like her father as she painted, which made him laugh. One day, Yani painted lines on her faher's painting. He got  _  . At the time she was only two and a half years old. She cried and said, \"I want to  _  like you!\" Her father looked at her without saying anything. He  _  remembered his childhood . He also wanted to draw and paint, but his parents didn't understand. They just got angry. He didn't want to see the same thing happen to his daughter. So he decided to  _  her. With her father's help, Yani soon  made progress  . Her lines became flowers, trees, and animals. Her father took her to parks and zoos to get  _  for her paintings. By the end of six, Yani had made over 4,000 works. Her paintings were very special. People  _  her works. When she was eight, one of her paintings was made into a Chinese postage stamp. Yani became famous when she was young. Her works were  _  in different countries in Asia, Europe and North America,  _  her parents never sold her paintings. She is well-known in the world, and art is still a great joy in her life..", 
    "options": [
        [
            "actor", 
            "athlete", 
            "artist", 
            "engineer"
        ], 
        [
            "angry", 
            "excited", 
            "sad", 
            "interested"
        ], 
        [
            "laugh", 
            "speak", 
            "stand", 
            "paint"
        ], 
        [
            "happily", 
            "clearly", 
            "hardly", 
            "usually"
        ], 
        [
            "help", 
            "stop", 
            "refuse", 
            "miss"
        ], 
        [
            "news", 
            "time", 
            "ideas", 
            "luck"
        ], 
        [
            "hated", 
            "loved", 
            "found", 
            "forget"
        ], 
        [
            "lost", 
            "sold", 
            "bought", 
            "shown"
        ], 
        [
            "and", 
            "but", 
            "so", 
            "or"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "B", 
        "A", 
        "C", 
        "B", 
        "D", 
        "B"
    ], 
    "source": "middle2164"
}