{
    "article": "Susie Sunbeam was not her real name. It was Susan Brown. But everyone called _ Sunbeam, because she had such a sweet, smiling face. She _ took brightness with her wherever she went. Her grandfather first gave her this _ ,and it seemed to fit the little girl so _ that soon it took the place of her own.\nEven when Susie was a baby, she laughed and smiled from morning till night. No one ever heard her cry unless she was _ or hurt. When she had learnt to _ , she loved to go around the house and get things for her mother. In this way , she helped her as much as she could.\nShe loved _ . She would sit by her mother's side for an hour at a time, and ask her many questions. At other times, she would take a new book and read quietly. Susie was always pleasant in her play with other children. She never used a(n) _ word , but tried to do whatever would make her playmates happy.\nOne day, a(n) _ little girl with an old torn dress passed by. Susie heard some children teasing and laughing at her. She at once ran out to the gate, and asked the little girl to come _ .\n\"What are you crying for? \" Susie asked. \"Because they all _ at me.\" she said.\nThen Susie took the little girl into the house. She cheered up the little girl with kind words, and she gave her one of her own best dresses and a good pair of shoes. This brought real _ to the poor child , and she thought that Sunbeam was the _ name for Susan Brown.", 
    "options": [
        [
            "it", 
            "itself", 
            "her", 
            "herself"
        ], 
        [
            "sometimes", 
            "seldom", 
            "never", 
            "always"
        ], 
        [
            "name", 
            "chance", 
            "dress", 
            "book"
        ], 
        [
            "possibly", 
            "clearly", 
            "nicely", 
            "easily"
        ], 
        [
            "happy", 
            "sick", 
            "fine", 
            "busy"
        ], 
        [
            "walk", 
            "say", 
            "read", 
            "write"
        ], 
        [
            "study", 
            "nature", 
            "travel", 
            "sport"
        ], 
        [
            "kind", 
            "unkind", 
            "usual", 
            "unusual"
        ], 
        [
            "honest", 
            "weak", 
            "poor", 
            "rich"
        ], 
        [
            "in", 
            "out", 
            "up", 
            "down"
        ], 
        [
            "look", 
            "point", 
            "shout", 
            "laugh"
        ], 
        [
            "pain", 
            "trouble", 
            "pleasure", 
            "truth"
        ], 
        [
            "wrong", 
            "right", 
            "strange", 
            "common"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "A", 
        "C", 
        "B", 
        "A", 
        "A", 
        "B", 
        "C", 
        "A", 
        "D", 
        "C", 
        "B"
    ], 
    "source": "middle900"
}