{
    "article": "My mother used to say things just to make me _ . Like most teenagers, I thought I knew _ . And what I didn't know, I didn't want to be told . For example, if I said I was going to a movie, my mother would roll her eyes. On my way out, she'd shout: \"You need to slow yourself down before something _ happens! You don't want to learn that the hard way!\" I didn't know what that _ . I thought she just wanted me to stay home.\nMany years later I had three teenagers _ my own. They thought they knew everything. I would say the same things to them _ my mom. That's when I first saw it. My mother wasn't trying to make me stay at home. She was trying to help me.\nWhy do we always have to learn things \"the hard way\"? Why can't we just accept our _ wisdom? It's a good lesson for anyone. Obviously ,I still haven't learned it. Yesterday, I stepped out of the shower when I heard my cell phone _ in the kitchen. Grabbing  a towel, I ran _ the house. I grabbed the phone and hit my left foot against the table. The X-ray showed that I'd broken two toes.\nWe all need to slow ourselves down once in a while, before something bad does it for us. My mother was right about a lot of things. I wish I could have told her.", 
    "options": [
        [
            "mad", 
            "happy", 
            "worried", 
            "warm"
        ], 
        [
            "nothing", 
            "everything", 
            "something", 
            "anything"
        ], 
        [
            "bad", 
            "good", 
            "well", 
            "badly"
        ], 
        [
            "mean", 
            "means", 
            "meant", 
            "meaning"
        ], 
        [
            "at", 
            "in", 
            "on", 
            "of"
        ], 
        [
            "like", 
            "likes", 
            "liked", 
            "liking"
        ], 
        [
            "elder", 
            "elders", 
            "elders'", 
            "elderly"
        ], 
        [
            "ring", 
            "rings", 
            "rang", 
            "ringing"
        ], 
        [
            "over", 
            "on", 
            "through", 
            "across"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "A", 
        "C", 
        "D", 
        "A", 
        "C", 
        "D", 
        "C"
    ], 
    "source": "middle1086"
}