{
    "article": "When I was small, my mum used to give the family something special for meals -- she would make breakfast food for dinner. I still remember one night my mum  _  some bread in front of my dad, something very burnt. I waited to see if anybody noticed. To my surprise, my dad just took his  _  , smiled at my mum and then turned to ask me how my day at school had been. I've  _  what I told him that night.  _  I do remember watching him put some butter on that bread. He  ate it up  as usual, every single bit. After dinner, my mum said  _  to my dad for burning the bread. And I never forget what he said, \"I  _  burnt bread, dear. It doesn't matter at all. \"  Later that night  , I went to kiss Dad good night.I asked him if he really liked his bread burnt. He held me in arms and  _  , \"Your mum worked very hard all day. She's really  _  And you see--a bit of burnt food never hurt anyone!\" Now I know life is not perfect.  _  is perfect, either. As for me, I often forget birthdays or some other special days. But I've learned something  _  over these years. What we really need is the understanding of each other, whether between a husband and wife, a parent and  _  or just between two friends. This is the key to a happy  _  . So don't get angry if the bread gets burnt. Remember,  _  bread never hurt anyone. Be kind to those around you and a happier life will surely come closer to you.", 
    "options": [
        [
            "cooked", 
            "put", 
            "found", 
            "bought"
        ], 
        [
            "glass", 
            "milk", 
            "spoon", 
            "bread"
        ], 
        [
            "decided", 
            "known", 
            "forgotten", 
            "imagined"
        ], 
        [
            "But", 
            "So", 
            "Because", 
            "And"
        ], 
        [
            "hello", 
            "goodbye", 
            "no", 
            "sorry"
        ], 
        [
            "hate", 
            "love", 
            "make", 
            "save"
        ], 
        [
            "shouted", 
            "said", 
            "laughed", 
            "continued"
        ], 
        [
            "tired", 
            "excited", 
            "worried", 
            "interested"
        ], 
        [
            "Everybody", 
            "Anybody", 
            "Nobody", 
            "Somebody"
        ], 
        [
            "important", 
            "difficult", 
            "funny", 
            "easy"
        ], 
        [
            "student", 
            "brother", 
            "sister", 
            "child"
        ], 
        [
            "class", 
            "party", 
            "life", 
            "story"
        ], 
        [
            "burnt", 
            "cheap", 
            "fresh", 
            "cold"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "C", 
        "A", 
        "D", 
        "B", 
        "B", 
        "A", 
        "C", 
        "A", 
        "D", 
        "C", 
        "A"
    ], 
    "source": "middle1060"
}