{
    "article": "Last summer holiday, some students from China spent an unforgettable holiday in different countries. Here is what they said about their _ \nLiu Na, a middle school student, spent her holiday in Thailand. She worked as an elephant helper. She _ two weeks in the Elephant Nature Park in Chiang Mai. She said the founder of the park had saved 28 elephants _ the last ten years. The elephants are now able to live _ in the Nature Park. Some foreign students like me come to feed them, take them for a bath in the river and play with them. With our _ ,the elephants don't do hard work every day. We're so proud of that.\nWang Jiao, another college student from China, stayed in America for a year. \"I taught Chinese in a Confucius Institute  in New York. Nowadays, people all over the world are becoming more and more _  in Chinese language and Chinese culture. So are the Americans.  _ a Chinese, I am happy to tell students what I know about China and Chinese culture. We made dumplings, _ songs of Zhou Jielun and did Taiji together. That was a great experience both for me and for my _ students.\nZhang Liang, a postgraduate  studying in a famous Medical University,  _ in Africa for several months. When he first got there, he was _ to see many people die just because they had no money to see a doctor. Then he _ to help them out. \"When you see children with happy and healthy _ , you will forget your problems!\"\nIf you want to have a meaningful life in other _ , if you want to help the rest of the world, why not give yourself a chance and have a try?", 
    "options": [
        [
            "programs", 
            "differences", 
            "holidays", 
            "discussions"
        ], 
        [
            "cost", 
            "paid", 
            "spent", 
            "took"
        ], 
        [
            "in", 
            "at", 
            "on", 
            "to"
        ], 
        [
            "lonely", 
            "freely", 
            "politely", 
            "quickly"
        ], 
        [
            "way", 
            "luck", 
            "help", 
            "age"
        ], 
        [
            "important", 
            "interested", 
            "popular", 
            "beautiful"
        ], 
        [
            "As", 
            "unless", 
            "if", 
            "Though"
        ], 
        [
            "wrote", 
            "hoped", 
            "put", 
            "sang"
        ], 
        [
            "Chinese", 
            "Japanese", 
            "Australian", 
            "American"
        ], 
        [
            "moved", 
            "played", 
            "grew", 
            "worked"
        ], 
        [
            "bored", 
            "sad", 
            "excited", 
            "angry"
        ], 
        [
            "asked", 
            "disliked", 
            "happened", 
            "decided"
        ], 
        [
            "legs", 
            "hands", 
            "eyes", 
            "faces"
        ], 
        [
            "houses", 
            "countries", 
            "rooms", 
            "cities"
        ]
    ], 
    "answers": [
        "C", 
        "C", 
        "A", 
        "B", 
        "C", 
        "B", 
        "A", 
        "D", 
        "D", 
        "D", 
        "B", 
        "D", 
        "D", 
        "B"
    ], 
    "source": "middle1870"
}