{
    "article": "A group of adults, highly succeeded in their jobs, went to visit their old professor . Soon they began to  _  about the stress in work and life. The professor went to the kitchen and returned  _  a pot of coffee and all kinds of cups--crystal , glass, plastic, some nice looking, some plain looking, some  _  , some cheap. And he told them to help  _  to the coffee. When all the students had a cup of coffee in hand, the professor said, \"I've noticed that all the nice looking expensive cups were  _  up, leaving behind the plain and cheap ones. While it is  _  for you to want only the best for yourselves, that is the cause of your  _  and stress. You know that the cup itself adds no quality to the coffee.  _  you really wanted was coffee, not the cup,  _  you went for the best cups.\" Now think about this: Lifis the coffee, the jobs, money and  _  in society are the cups. They are just  _  to hold and contain life, and the type of cup does not change the quality of our life. Sometimes, by paying  _  only to the cup, we fail to enjoy the coffee that God has  _  us. God gave us the coffee, not the cups. Please enjoy your coffee! The happiest people don't have the best of everything. They just make the  _  of everything. Live simply. Love sincerely. Care deeply. Speak  _  . And leave the rest to God.", 
    "options": [
        [
            "chat", 
            "think", 
            "complain", 
            "discuss"
        ], 
        [
            "for", 
            "at", 
            "in", 
            "with"
        ], 
        [
            "expensive", 
            "usual", 
            "strong", 
            "serious"
        ], 
        [
            "them", 
            "themselves", 
            "him", 
            "everyone"
        ], 
        [
            "mixed", 
            "left", 
            "taken", 
            "accepted"
        ], 
        [
            "normal", 
            "important", 
            "impossible", 
            "necessary"
        ], 
        [
            "thoughts", 
            "failure", 
            "questions", 
            "problems"
        ], 
        [
            "Who", 
            "How", 
            "What", 
            "That"
        ], 
        [
            "and", 
            "but", 
            "so", 
            "or"
        ], 
        [
            "position", 
            "age", 
            "health", 
            "purpose"
        ], 
        [
            "cups", 
            "tools", 
            "bags", 
            "bowls"
        ], 
        [
            "money", 
            "attention", 
            "advantage", 
            "record"
        ], 
        [
            "taught", 
            "provided", 
            "returned", 
            "bought"
        ], 
        [
            "fun", 
            "use", 
            "best", 
            "worst"
        ], 
        [
            "kindly", 
            "sadly", 
            "rudely", 
            "seriously"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "A", 
        "B", 
        "C", 
        "A", 
        "D", 
        "C", 
        "B", 
        "A", 
        "B", 
        "B", 
        "B", 
        "C", 
        "A"
    ], 
    "source": "middle3"
}