{
    "article": "How time flies, our junior high school years are coming to an end. After the big exam,most of us will go to  _  in a senior high school .  _  are we expecting from senior high? We interview some tudents about their plans for future. Now  _  hear what plans some students have for the future. Jerry, 16, from Shanghai, \"I have heard that although Senior 3 is a  _  year, students feel less stressed out in Senior 1 and Senior 2. I hope there'll be time to enjoy  _  , especially tennis. The Tennis Masters Cup will be held in Shanghai. I'm going to volunteer to help out and I'm sure I'll really enjoy it.\" Han Lily, 15, from Zhongshan, \"I really enjoy science. I'm crazy about  _  model planes, although I'm not good at  _  . I'll learn more science in senior high. Anyway, sometimes in the future I'm going to build a super model plane!\" Wan Yang, 17, from Xiamen, \"I hope I can be  _  in senior high school. I'm only 155 cm. I want to be 162 cm.  _  most of the girls in my family don't grow any taller than 160 cm. I hope I'm different.\" Li Fan, 16, from Shenzhen, \"I hope I can make more friends. In senior high, I'll meet different people from different areas. I hope I can learn new things  _  them.\"", 
    "options": [
        [
            "walk", 
            "study", 
            "play", 
            "write"
        ], 
        [
            "When", 
            "How", 
            "What", 
            "Where"
        ], 
        [
            "let's", 
            "it's", 
            "what's", 
            "that's"
        ], 
        [
            "hot", 
            "hard", 
            "light", 
            "kind"
        ], 
        [
            "book", 
            "show", 
            "photo", 
            "sports"
        ], 
        [
            "making", 
            "sitting", 
            "cooking", 
            "cleaning"
        ], 
        [
            "us", 
            "him", 
            "it", 
            "her"
        ], 
        [
            "shorter", 
            "stronger", 
            "thinner", 
            "taller"
        ], 
        [
            "So", 
            "But", 
            "When", 
            "If"
        ], 
        [
            "to", 
            "for", 
            "from", 
            "at"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "B", 
        "D", 
        "A", 
        "C", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "middle85"
}