{
    "article": "It is a thousand kilometers across that desert   . The road is nearly good all the way.\nSometimes there is deep sand. A driver must then put his foot down hard and drive through! There are three small  _  along the way. Tom reached the first place, at 10 p.m. He had his  _  in a little restaurant there. It was a warm night in August. Tom wanted to  _  through the night.\nHe left the restaurant at 11:30 and drove over two hours. There wasn't the moon, but the  _  were wonderful. There was nothing else on the road. Tom thought, 'It's an empty desert. Not a tree. Not a house. Not a man.' He could  _ the endless, white road in the cars' headlights. A million stars looked down on him. It was two o'clock in the morning. Tom stopped the car. He was two hundred kilometers from the  _  town. ' I will light the cooker,' he thought, ' and make some tea.' He got out of the car. He heard some sounds ten or fifteen meters  _ . He could not see anything in the darkness. A man said, ' Good morning. It's a  _  morning, isn't it?' The man came forward, out of the darkness. Tom did not move. Then the man said, ' You're going to  _  some tea, aren't you? I often get a cup of tea at this time. It's two o'clock. Cars always  _  near here at this time. Sometimes I get a meal. Now listen, and I will tell you a story. Then you will give me..'", 
    "options": [
        [
            "cities", 
            "hotels", 
            "villages", 
            "towns"
        ], 
        [
            "tea", 
            "supper", 
            "lunch", 
            "breakfast"
        ], 
        [
            "live", 
            "stay", 
            "drive", 
            "walk"
        ], 
        [
            "trees", 
            "animals", 
            "stars", 
            "clouds"
        ], 
        [
            "see", 
            "ride", 
            "hear", 
            "find"
        ], 
        [
            "home", 
            "other", 
            "next", 
            "last"
        ], 
        [
            "about", 
            "from", 
            "far", 
            "away"
        ], 
        [
            "noisy", 
            "lovely", 
            "sleepy", 
            "sunny"
        ], 
        [
            "eat", 
            "make", 
            "cook", 
            "drink"
        ], 
        [
            "stop", 
            "leave", 
            "meet", 
            "run"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "C", 
        "C", 
        "A", 
        "C", 
        "D", 
        "B", 
        "B", 
        "A"
    ], 
    "source": "middle220"
}