{
    "article": "I had said goodbye to my husband, Joe, so often, but this time was  _  . We now had our first child. After nights of talks, we made the difficult  _  that Joe would go by himself to Alabama for the six-month training course, and I would stay behind with our new son. It was important that I  _  my teaching position near our home at Fort Hood. Also we were part of a strong network of friends  _  I could turn to for help. On Joe's  _  evening at home, I bathed little Joey, got him into his sleeper and was heading to the bedroom when Joe gently touched  _  on the shoulder. Lifting the baby from my arms, he said he wanted to put Joey to bed tonight. They headed down the hall, and I busied myself with meaningless tasks,  _  Joe to turn up from the bedroom within a few minutes. A half hour went by, and  _  he had not come back. Thinking he was having  _  getting our son to fall asleep, I walked quietly to the baby's room and  _  into the dimly-lit room. Sitting in the rocking chair, moving slowly back and forth, was my husband with  _  in his eyes. He was holding our baby in his arms  even though  he had fallen asleep long before. When his pained eyes met mine, he said, \"I just can't put him down.\" That night we stood over Joey's bed, holding each other and saying over and over that we would make it through this leaving and be  _  again soon. Joey is six now, and he has a four-year-old brother named Jack. There have been many goodbyes  _  that night, yet my soldier still fights back tears when it's time to  _  once again in service to his country and give his boys that last, long hug goodbye.", 
    "options": [
        [
            "dangerous", 
            "different", 
            "impossible", 
            "terrible"
        ], 
        [
            "promise", 
            "wish", 
            "suggestion", 
            "decision"
        ], 
        [
            "miss", 
            "keep", 
            "get", 
            "accept"
        ], 
        [
            "whom", 
            "whose", 
            "which", 
            "what"
        ], 
        [
            "first", 
            "next", 
            "other", 
            "last"
        ], 
        [
            "us", 
            "them", 
            "me", 
            "her"
        ], 
        [
            "expecting", 
            "remembering", 
            "agreeing", 
            "allowing"
        ], 
        [
            "again", 
            "still", 
            "then", 
            "ever"
        ], 
        [
            "excuse", 
            "fun", 
            "trouble", 
            "chance"
        ], 
        [
            "moved", 
            "talked", 
            "turned", 
            "looked"
        ], 
        [
            "colors", 
            "tears", 
            "joys", 
            "fears"
        ], 
        [
            "sure", 
            "proud", 
            "alone", 
            "together"
        ], 
        [
            "on", 
            "for", 
            "since", 
            "through"
        ], 
        [
            "visit", 
            "sleep", 
            "leave", 
            "play"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "B", 
        "A", 
        "D", 
        "C", 
        "A", 
        "B", 
        "C", 
        "D", 
        "B", 
        "D", 
        "C", 
        "C"
    ], 
    "source": "middle1398"
}