{
    "article": "One day a mother rat and her babies were out in an open field. They were enjoying  playing  games when suddenly a hungry cat came up to them! She hid  behind  a big tree and then crawled torward through the tall grass until she could almost hear them talk. After the mother rat and her babies knew  what happened  , the cat jumped from her hiding-place and started to run after them. The mother rat and her babies began to run away, they hurried towards their  _  , which was under a pole of large stones. But the baby rats were so  _  that they could not run very  _  . The cat came  closer and closer  . In no time the cat would be upon them. What was to be done? The mother rat stopped running, turned round and faced the cat, shouting \"Bow! Wow! Bowwow!\" just like an angry dog. The cat was  _  surprised and scared that she ran away. The mother rat turned to her babies, \"Now you see how important it is to learn  _  a second language!\" Just then she heard a shout \"Miao! Miao!\" just like the cat ran away just now. \"Oh, the cat's come back. We must escape right now.\" The mother rat called out to her children. \"Haha! It's only a  _  \"said one of her children. \"I have learned a second language.\"", 
    "options": [
        [
            "home", 
            "tree", 
            "mother", 
            "host"
        ], 
        [
            "happy", 
            "tired", 
            "frightened", 
            "hungry"
        ], 
        [
            "quickly", 
            "slowly", 
            "far", 
            "long"
        ], 
        [
            "so", 
            "such", 
            "too", 
            "enough"
        ], 
        [
            "the", 
            "/", 
            "a", 
            "an"
        ], 
        [
            "joke", 
            "rat", 
            "cat", 
            "dog"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "A", 
        "A", 
        "C", 
        "A"
    ], 
    "source": "middle366"
}