{
    "article": "Some people believe that dreams can tell them what will happen in the future. Nobody knows why this is so, but there are many stories about people. The people make their dreams  come true  . One of these people was a man called John Chapman, who lived in Swaffham in England many years ago. John Chapman dreamt that he stood on London Bridge and a man told him how to become rich. John Chapman was a poor man and he needed  _  , so the next day he decided to leave for London.  _  was 100 miles from Swaffham to London. He walked for two days and at last he  _  London Bridge. There were many people on the bridge, but they weren't  _  in John Chapman. No one talked tohim. After three days, John Chapman decided to go home.And before he could do this, a shopkeeper came up to him. \"I am watching you these days,\" he said. \"Are you  waiting for  someone?\" \"Yes,\" said John. \"I had a dream about a man here. He would help me to get much money.\" \"Oh,\" said the shopkeeper. \"You shouldn't believe in dreams.  _  I believe in dreams, I'd be in Swaffham right now. I had a dream a few days ago about a man called John Chapman from Swaffham. He had  _  in his garden, near an old apple tree.\" John Chapman felt  _  by what the shopkeeper said. At once he went home and dug near an old apple tree. He soon found many pieces of gold. He was so happy that he  _  some of the gold to his poor neighbours. What a kind man he was! For the rest of his life, he was a rich man.", 
    "options": [
        [
            "dream", 
            "future", 
            "money", 
            "apple"
        ], 
        [
            "This", 
            "It", 
            "That", 
            "Its"
        ], 
        [
            "reached", 
            "arrived", 
            "got", 
            "went"
        ], 
        [
            "interes", 
            "interests", 
            "interesting", 
            "interested"
        ], 
        [
            "When", 
            "Where", 
            "If", 
            "How"
        ], 
        [
            "money", 
            "apple", 
            "tree", 
            "gold"
        ], 
        [
            "angry", 
            "surprised", 
            "interested", 
            "sad"
        ], 
        [
            "borrowed", 
            "gave", 
            "brought", 
            "got"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "A", 
        "D", 
        "C", 
        "D", 
        "B", 
        "B"
    ], 
    "source": "middle2163"
}