{
    "article": "All living things on the earth need other living things to live with. Nothing lives  _  Sometimes one living thing kills  another  . Each kind of life eats another kind of life  in order to  live, and together they form a food chain . Some food chains are simple, while others are not. But  _  food chains begin with the sun, and all food chains become  _  if one of the links disappears. All life needs sunlight to live on. But only plants can use  sunlight  directly . They make food from sunlight, water, air and so on. Animals can only use the sun's energy  after  it has been changed into food by plants. Some animals feed directly on plants. Others eat smaller animals. Meat-eating animals are only  _  plants indirectly. What about human beings? We are members of many food chains. We eat wheat, rice, vegetables, fruit and so on. We also eat meat and drink milk. But  _  often break up the food chains. They kill wild animals. They also make rivers, lakes and seas dirty. When these rivers, lakes and seas are polluted, the fish in them  _  be eaten. If people eat the fish, they will get strange diseases. Each form of life is linked to all the others. Breaking the links puts all life in danger.", 
    "options": [
        [
            "alone", 
            "lonely", 
            "together", 
            "happily"
        ], 
        [
            "any", 
            "all", 
            "some", 
            "most"
        ], 
        [
            "better", 
            "broken", 
            "stronger", 
            "nicer"
        ], 
        [
            "making", 
            "catching", 
            "eating", 
            "feeding"
        ], 
        [
            "sunlight", 
            "animals", 
            "plants", 
            "people"
        ], 
        [
            "can", 
            "cannot", 
            "must", 
            "needn't"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "B", 
        "C", 
        "D", 
        "B"
    ], 
    "source": "middle586"
}