{
    "article": "John and Henry studied in the same school. John lived in fear of Henry -- every day he gave his lunch money to Henry, but Henry still beat him up. He said that if John told anyone he would beat him up in front of all the other kids in his class. John had to ask his mom for more and more lunch money, but he seemed  _  than ever and came home from school hungry every day. John even cried one day, and a girl told everyone that he was just like a baby and had cried. John was  _  and felt so bad about himself and about school. One day, John met Jimmy, a boy  _  also had to give his lunch money to Henry. John told Jimmy how he  _  bullying , and found that Jimmy felt the same. They finally thought of a good way of dealing with their  _  . The following day, Henry came to John to ask him for his lunch money. \"I don't want to give my money to you,\" said John. \"What?\" Henry shouted. John said  _  , \"I want to have my lunch today, and you, get away !\" \"You want to get beaten up?!\" Just then Henry's fist was hitting John's face, they heard  _  shout, \"Stop!\" Henry was very angry to hear that. He turned around  _  found that his teacher Ms Brown was standing just behind him. He felt very surprised. Jimmy had taken Ms. Brown to John's class and she  _  the bullying with her own eyes. Henry was taken to the head teacher's office.  _  that, he never bullied others again. John and Jimmy helped not only themselves but Henry and other kids.", 
    "options": [
        [
            "better", 
            "thinner", 
            "heavier", 
            "happier"
        ], 
        [
            "embarrassed", 
            "excited", 
            "relaxed", 
            "pleased"
        ], 
        [
            "which", 
            "whom", 
            "who", 
            "/"
        ], 
        [
            "liked", 
            "suggested", 
            "appreciated", 
            "hated"
        ], 
        [
            "accident", 
            "task", 
            "trouble", 
            "friendship"
        ], 
        [
            "strongly", 
            "politely", 
            "sincerely", 
            "fortunately"
        ], 
        [
            "nobody", 
            "anyone", 
            "everybody", 
            "someone"
        ], 
        [
            "but", 
            "and", 
            "or", 
            "however"
        ], 
        [
            "listened", 
            "saw", 
            "looked", 
            "heard"
        ], 
        [
            "Before", 
            "Behind", 
            "After", 
            "Except"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "D", 
        "C", 
        "A", 
        "D", 
        "B", 
        "B", 
        "C"
    ], 
    "source": "middle1026"
}