{
    "article": "After her husband had gone to work, Mrs. Richards sent her children to school and went upstairs to her bedroom. She was too  _  to do any housework that morning,  _  in the evening she was going to an interesting fancy dress party with her husband. What she  wanted to play  was a terrible genie and as she had made that special dress of hers the night before, she was anxious to try it on.  _  the dress was just a big piece of old cloth which was red, green, black and white, it would be very effective to make her like a red genie. After putting it on, Mrs. Richards went downstairs happily. She wanted to find out  _  it would be comfortable to wear. Just as Mrs. Richards was entering the dining-room there was a  _  at the door. She thought that it  _  be the baker. She had told him to come straight in if she  _  to open the door and leave the bread on the kitchen table. Now not wanting to  _  the poor man, Mrs. Richards quickly  _  in the small storeroom under the stairs. She heard the front door open and a man came in. When Mrs. Richards  _  that it was the man from the electricity board who had come to read the meter, she walked out of the hiding-place on a sudden and tried to explain the matter, saying with a smile, \"It's only  _  ! It is not  _  for you to be  _  \" But it was too late. The man let out a sharp cry and jumped back several paces. Then he ran away,  _  the door behind him with great force and noise.", 
    "options": [
        [
            "angry", 
            "ready", 
            "frightened", 
            "excited"
        ], 
        [
            "for", 
            "but", 
            "so", 
            "and"
        ], 
        [
            "Though", 
            "But", 
            "And", 
            "If"
        ], 
        [
            "that", 
            "how", 
            "whether", 
            "when"
        ], 
        [
            "knock", 
            "voice", 
            "man", 
            "baker"
        ], 
        [
            "may", 
            "must", 
            "wouldn't", 
            "couldn't"
        ], 
        [
            "not", 
            "had", 
            "tried", 
            "failed"
        ], 
        [
            "see", 
            "frighten", 
            "help", 
            "scold"
        ], 
        [
            "went", 
            "lay", 
            "appeared", 
            "hid"
        ], 
        [
            "thought", 
            "wondered", 
            "imagined", 
            "realized"
        ], 
        [
            "me", 
            "you", 
            "game", 
            "play"
        ], 
        [
            "good", 
            "necessary", 
            "late", 
            "early"
        ], 
        [
            "off", 
            "here", 
            "afraid", 
            "sorry"
        ], 
        [
            "pushed", 
            "locking", 
            "knocking", 
            "shutting"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "A", 
        "C", 
        "A", 
        "B", 
        "D", 
        "B", 
        "D", 
        "D", 
        "A", 
        "B", 
        "C", 
        "D"
    ], 
    "source": "middle953"
}