{
    "article": "The Clean Your Plate Campaign began on the Internet in January. It suggests people to reduce food waste. Qi Haoran, a  _  from Harbin, was quite busy-- and not just  _  homework over the past winter vacation. Qi made a volunteer group with  _  other classmates to advise people to  _  the Clean Your Plate Campaign. The 11 students went to many  _  and told people the importance of saving food. \"  Excuse me  , do you know that 950 million people around the world still  _  got enough to eat? Please don't waste food.\" They would say this hundreds of times every day. China has experienced serious problems with wasted food for years. CCTV has reported  _  that the food Chinese people waste every year is enough to  _  200 million people for a year. Chinese people are well known for being friendly and warm-hearted to others. Many even think that they lose face  _  their guests have eaten all the food. Luckily, the campaign has got the support of  _  . In a restaurant in Xinjiang, the owner gives the  _  who have eaten all that they ordered a special ticket. People can enjoy a(n)  _  meal when they have 10 tickets. Many people think it's great to enjoy a meal without paying. More than 750 restaurants in Beijing have begun to offer  _  dishes and encourage their guests to take left food home. Did you finish your  _  today? To reduce food waste is a big task, and it needs time. It's important that everyone does their best, just like Qi.", 
    "options": [
        [
            "student", 
            "waiter", 
            "cook", 
            "teacher"
        ], 
        [
            "in", 
            "of", 
            "for", 
            "with"
        ], 
        [
            "nine", 
            "ten", 
            "eleven", 
            "twelve"
        ], 
        [
            "join", 
            "stop", 
            "save", 
            "leave"
        ], 
        [
            "libraries", 
            "museums", 
            "hospitals", 
            "restaurants"
        ], 
        [
            "have", 
            "haven't", 
            "has", 
            "hasn't"
        ], 
        [
            "quietly", 
            "recently", 
            "quickly", 
            "nearly"
        ], 
        [
            "feed", 
            "keep", 
            "grow", 
            "plant"
        ], 
        [
            "unless", 
            "until", 
            "if", 
            "that"
        ], 
        [
            "many", 
            "some", 
            "few", 
            "none"
        ], 
        [
            "waiters", 
            "cooks", 
            "guests", 
            "students"
        ], 
        [
            "free", 
            "cheap", 
            "expensive", 
            "special"
        ], 
        [
            "bigger", 
            "nicer", 
            "worse", 
            "smaller"
        ], 
        [
            "homework", 
            "report", 
            "meal", 
            "waste"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "B", 
        "A", 
        "D", 
        "B", 
        "B", 
        "A", 
        "C", 
        "A", 
        "C", 
        "A", 
        "D", 
        "C"
    ], 
    "source": "middle1339"
}