{
    "article": "The Most Beautiful Filial Piety Youth was held on CCTV-1 _ November 8, 2013. I was deeply moved  by the children's stories. I couldn't help crying during the party. _ they were very young, they did many great things that people can't believe.\nThere is a story about a girl named Huang Feng. She had a happy family at first, _ her father fell off the building when he was working. His spine  was _ and he could not move anymore so he had to lie on the _ every day. Her mother left the poor family at last. To see the doctor, Huang Feng pushed the plate to Shanghai with only 27 yuan. But the doctors had no _ to help her and her father. Huang Feng was really _ and they had to return home. From this year the only 6-year-old lovely girl began to look after her father. To be honest, she felt very tired, but she did not give up . she insisted on  taking care of her father for 10 years. Every day, she turned over for her father and cooked meals at noon early, At the same time. Huang Feng must study every day. So, after washing clothes and cooking meals, she went to school quickly.\nFrom the children's stories, we know they are our heroes  and we should learn from them. We should help our parents do more _ such as cleaning the room, sweeping the floor and so on. We can not make our parents angry. Do you think so?", 
    "options": [
        [
            "in", 
            "on", 
            "at", 
            "about"
        ], 
        [
            "Although", 
            "So", 
            "Until", 
            "But"
        ], 
        [
            "Suddenly", 
            "Luckily", 
            "Unluckily", 
            "Surprise"
        ], 
        [
            "well", 
            "nice", 
            "burnt", 
            "hurt"
        ], 
        [
            "chair", 
            "bed", 
            "floor", 
            "food"
        ], 
        [
            "money", 
            "chances", 
            "ways", 
            "advice"
        ], 
        [
            "happy", 
            "surprised", 
            "excited", 
            "sad"
        ], 
        [
            "homework", 
            "questions", 
            "housework", 
            "suggestions"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "D", 
        "B", 
        "C", 
        "D", 
        "C"
    ], 
    "source": "middle2051"
}