{
    "article": "I enjoy telling stories. To those parents and teachers who _ telling children's stories, I have an important _ -- tell your story seriously. No matter how silly you think it is, _ it is good enough to tell, you should tell it seriously. You should tell the story _ the attitude   of the children towards it. Perhaps I can make it clearer by telling a story.\nA few students of a class had prepared the story of \"The Fisherman and His Wife\". The first girl felt that it was a silly story. She tried to tell it _ , but some parts of it _ her feel ashamed. When she came to the words, \"Oh, man of the sea, come, listen to me. For Alice, my wife ...\" she said them very _ . The next time she came to the same words, she said them so fast and so low that they _ be heard. And when she tried to repeat the words the last time, she could _ go on.\nOf course everybody laughed, but the flavor   of the story was broken.\nNow, it was Kate's turn to tell the _ story. Each of her rising and falling tones   showed her _ attitude to the story. When she repeated the words, \"Oh, man of the sea, come ...\", the whole class could _ the fisherman's feeling.\nThose words may _ silly, but they are important for expressing the fisherman's feeling. If the person who tells the story thinks they are silly, _ can see no flavor at all! So please tell your story seriously.", 
    "options": [
        [
            "forget", 
            "finish", 
            "prefer", 
            "hate"
        ], 
        [
            "mistake", 
            "trouble", 
            "decision", 
            "suggestion"
        ], 
        [
            "so", 
            "until", 
            "if", 
            "although"
        ], 
        [
            "in", 
            "with", 
            "about", 
            "without"
        ], 
        [
            "simply", 
            "well", 
            "badly", 
            "quietly"
        ], 
        [
            "left", 
            "got", 
            "watched", 
            "made"
        ], 
        [
            "slowly", 
            "easily", 
            "quickly", 
            "impolitely"
        ], 
        [
            "need", 
            "needn't", 
            "could", 
            "couldn't"
        ], 
        [
            "hardly", 
            "still", 
            "always", 
            "mostly"
        ], 
        [
            "latest", 
            "oldest", 
            "same", 
            "different"
        ], 
        [
            "negative", 
            "serious", 
            "general", 
            "strange"
        ], 
        [
            "hide", 
            "change", 
            "invent", 
            "imagine"
        ], 
        [
            "sound", 
            "taste", 
            "smell", 
            "feel"
        ], 
        [
            "tellers", 
            "listeners", 
            "singers", 
            "Members"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "C", 
        "B", 
        "B", 
        "D", 
        "C", 
        "D", 
        "A", 
        "C", 
        "B", 
        "D", 
        "A", 
        "B"
    ], 
    "source": "middle479"
}