{
    "article": "A first-grade student whose best friend is battling cancer thought that hours of playing and telling jokes was not enough - he wanted to show his buddy just how he understood the  _  time he was going through. Seven-year-old Vincent Butterfield  _  the only way was to cut off his hair in support of his best friend Zac who lost his hair through chemotherapy . Zac Gossage is receiving treatment but  _  goes to Union Central Elementary School in Missouri every day,  _  that's where he gets to play on the swing with Vincent. Vincent found out that Zac might  _  his hair because of the chemotherapy treatment. So one day, he showed up in the first grade class wearing a  _  . He said to his teacher Mrs. Koester, \"I have a surprise for Zac.\" And he pulled off his cap and other  _  saw that he already had all his hair  _  off. \"I did it just to make Zac feel he's not the only one without any  _  .\" said Vincent.Vincent has also been raising money for his best friend after learning how  _  his chemotherapy treatments are. He asked his mother to make  _  than 20 scarves and gloves. He and his mother  _  them at the price of 10 dollars each, raising over $200 for Zac. The encouragement from Vincent seems to be working. Though Zac is receiving treatments, he has  _  missed any days of school. He knows that Vincent is out on the playground, waiting for him at break. When asked  _  friendship was, Vincent looked at his friend Zac, thought for a(an)  _  and responded,\"It's a beautiful thing.\" Clearly, wisdom doesn't always come with age.", 
    "options": [
        [
            "hard", 
            "exciting", 
            "unpleasant", 
            "pleasant"
        ], 
        [
            "decided", 
            "refused", 
            "agreed", 
            "disliked"
        ], 
        [
            "ever", 
            "never", 
            "just", 
            "still"
        ], 
        [
            "though", 
            "but", 
            "because", 
            "so"
        ], 
        [
            "raise", 
            "add", 
            "lose", 
            "fall"
        ], 
        [
            "mask", 
            "scarf", 
            "glove", 
            "cap"
        ], 
        [
            "teachers", 
            "kids", 
            "parents", 
            "patients"
        ], 
        [
            "pulled", 
            "sent", 
            "cut", 
            "put"
        ], 
        [
            "friends", 
            "money", 
            "clothes", 
            "hair"
        ], 
        [
            "expensive", 
            "successful", 
            "important", 
            "meaningful"
        ], 
        [
            "fewer", 
            "more", 
            "worse", 
            "better"
        ], 
        [
            "made", 
            "donated", 
            "sold", 
            "collected"
        ], 
        [
            "already", 
            "always", 
            "nearly", 
            "hardly"
        ], 
        [
            "how", 
            "what", 
            "where", 
            "which"
        ], 
        [
            "moment", 
            "hour", 
            "morning", 
            "day"
        ]
    ], 
    "answers": [
        "A", 
        "A", 
        "D", 
        "C", 
        "C", 
        "D", 
        "B", 
        "C", 
        "D", 
        "A", 
        "B", 
        "C", 
        "D", 
        "B", 
        "A"
    ], 
    "source": "middle925"
}