{
    "article": "How often do you exercise? A new study found that one third of the kids from 12 to 15 weren't getting enough physical activity. The results were depended on about 800 kids.\nDoctors suggested an hour or more of physical activity every day. According to the _ , only 1 in 4 of the US kids exercised enough.\nFew _ in the survey met the doctors' ideas about physical activity that raises the heart rate and makes people become _ . However, most of those kids said they did less than an hour of exercise the week before. Overall, about 25% _ they got an hour of that kind of hard exercise every day. Kids _ reported they usually did most of the activities outside of school gym class---- _ for boys and running for girls.\nThe study found that _ teens were less active than normal-weight girls and boys. Overweight girls were kind of less active than normal-weight girls, _ levels were similar among overweight and usual-weight boys. The study also said that the obesity rate for children aged 2 to19 _ 17%, or about 12.5 million kids.\n\"There's always room for improvement,\" said Tala Fakhouri, _ was the lead writer of the report. She also said the results provided useful information to help with fitness campaigns such as Let's Move, which was started by the First Lady Michelle Obama in 2010. To encourage kids to eat right and get in shape, the First Lady _ schools and held exercise events. She also called on schools to offer regular _ classes.\nFakhouri suggested kids who got physical education at school may get _ grades. She said schools could do more to help by not cutting rest and giving kids more time for physical activity.", 
    "options": [
        [
            "work", 
            "study", 
            "lesson", 
            "subject"
        ], 
        [
            "adults", 
            "boys", 
            "girls", 
            "kids"
        ], 
        [
            "thinner", 
            "heavier", 
            "stronger", 
            "weaker"
        ], 
        [
            "said", 
            "told", 
            "spoke", 
            "talked"
        ], 
        [
            "too", 
            "also", 
            "hardly", 
            "either"
        ], 
        [
            "chess", 
            "painting", 
            "basketball", 
            "singing"
        ], 
        [
            "overweight", 
            "thin", 
            "tall", 
            "short"
        ], 
        [
            "and", 
            "so", 
            "or", 
            "but"
        ], 
        [
            "were", 
            "was", 
            "had", 
            "did"
        ], 
        [
            "which", 
            "what", 
            "this", 
            "who"
        ], 
        [
            "built", 
            "went", 
            "visited", 
            "travelled"
        ], 
        [
            "English", 
            "gym", 
            "math", 
            "physics"
        ], 
        [
            "less", 
            "lower", 
            "better", 
            "worse"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "C", 
        "A", 
        "B", 
        "C", 
        "A", 
        "D", 
        "B", 
        "D", 
        "C", 
        "B", 
        "C"
    ], 
    "source": "middle46"
}