{
    "article": "I work for a major airline. One afternoon while running through LAX to my plane, I tore one of my nylon socks.  _  , there was a convenience store close to my gate. I knew I could buy a new pair. However, as I waited in line, I  _  that I had no money in my purse. I thought to myself that maybe the store manager would sell me a pair and let me pay her back the next time. I have been inside her store a lot, even though we have never been  _  . When it was my  _  to pay, I showed her my socks and explained that I had no money on me. She laughed and  _  said, \"Take them.\" Well, for whatever reason, two months passed, and I  _  had not paid the money back. Then one day while I was busy doing my usual preflight preparations, a passenger asked me if I would  _  him a newspaper. I went off the airplane and walked to the same convenience store. I was too embarrassed to go inside because I had never paid the money back, and I wasn't carrying my  _  . Then a man with a friendly face came near.  _  he could walk past me, I stopped him and asked him for help. He smiled and said that he would do so gladly but wanted to know why I couldn't do it  _  . He was rather outgoing and kept saying, \"Come on, and tell me.\" I needed a newspaper, so I  gave in  and told him. Suddenly he said, \"Hold on.\" and then took me into his arms quickly and carried me into the store. With his free hand he reached into his pocket and  _  out a five-dollar bill and said to the manager, \"I'd like to pay for the socks this person owes you for and for a newspaper.\" I later learned that this big, gentle man was Rosie Grier, the former L.A. Rams and Hall of Fame football player.", 
    "options": [
        [
            "Probably", 
            "Luckily", 
            "Doubtfully", 
            "Hopefully"
        ], 
        [
            "believed", 
            "thought", 
            "felt", 
            "discovered"
        ], 
        [
            "noticed", 
            "mentioned", 
            "introduced", 
            "required"
        ], 
        [
            "turn", 
            "time", 
            "chance", 
            "duty"
        ], 
        [
            "simply", 
            "seriously", 
            "actively", 
            "hurriedly"
        ], 
        [
            "even", 
            "still", 
            "just", 
            "ever"
        ], 
        [
            "return", 
            "pass", 
            "leave", 
            "buy"
        ], 
        [
            "socks", 
            "package", 
            "purse", 
            "passport"
        ], 
        [
            "After", 
            "Until", 
            "Before", 
            "Unless"
        ], 
        [
            "myself", 
            "himself", 
            "ourselves", 
            "itself"
        ], 
        [
            "handed", 
            "sent", 
            "carried", 
            "pulled"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "C", 
        "A", 
        "A", 
        "B", 
        "D", 
        "C", 
        "C", 
        "A", 
        "D"
    ], 
    "source": "middle2315"
}