{
    "article": "For each of us, life is not easy. So when something unlucky happens, remember to believe in yourself.\nWhen I was in a primary school, I was too _ in French   to pass the exams. I often got \"E\" or \"F\" on my papers. My classmates laughed _ me in class. I was very sad but could do _ . But later a French speech contest changed my life. _ it also changed my views on everything.\nIt was a Wednesday afternoon. My father asked me to take part in French contest.\nIt was a terrible idea! My French grades were _ bad.  \"Don't worry, dear. Believe in yourself and you're sure to _ the contest. \"After that my father and I chose a right topic. Then I worked hard at it. I spent a lot of my free time practicing it again and again in order not to miss a word. Finally, I was very _ in the contest. When my French teacher gave me a call and told me I got the first prize, I could hardly believe my _ . And my father was so excited that he _ say a word.\nThen everything has changed for me. When I do anything, I always believe in myself and try my best to do it well.", 
    "options": [
        [
            "famous", 
            "strong", 
            "weak", 
            "boring"
        ], 
        [
            "at", 
            "to", 
            "in", 
            "for"
        ], 
        [
            "anything", 
            "something", 
            "nothing", 
            "everything"
        ], 
        [
            "But", 
            "And", 
            "So", 
            "Or"
        ], 
        [
            "always", 
            "sometimes", 
            "nothing", 
            "everything"
        ], 
        [
            "pass", 
            "win", 
            "beat", 
            "get"
        ], 
        [
            "successful", 
            "surprised", 
            "sorry", 
            "embarrassed"
        ], 
        [
            "comments", 
            "eyes", 
            "ears", 
            "words"
        ], 
        [
            "must", 
            "mustn't", 
            "could", 
            "couldn't"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "C", 
        "B", 
        "A", 
        "B", 
        "A", 
        "C", 
        "D"
    ], 
    "source": "middle145"
}