{
    "article": "Last week Lu visited England. He stayed with my grandmother. He said it was a strange visit. \"I don't understand, but I  _  your grandmother a lot. When I arrived, I gave her a  _  from Suzhou. She looked in it and asked me to take it back. Then I saw a red spider on the table so I killed it for her and she seemed very  _  Do English people like spiders?\" \"Later we went shopping. Someone was painting a shop  _  , so there was a ladder. Grandmother  _  me walking under it and said I must walk around it. I liked the shops and bought a smart  _  for my father and some new shoes for myself. When we got back, I put the shoes on the table and opened the umbrella to wonder  _  it was all right. Your grandmother came in and  _  \" \"Then I broke a small  _  in the bathroom. Your grandmother's face went white. I felt very sorry. When I left I gave  _  grandmother some flowers. She counted and there were 13. She  didn't like  it. I think she was happy I was going.\" I  _  to Lu, \"My grandmother follows the old customs . You must not give someone an empty purse  _  they will have no money. You must not kill a \"money spider\" or the same will happen. It is very unlucky to walk under a ladder and to put new shoes on the table. A(n)  _  umbrella in a house means someone will die. Breaking a mirror brings seven years' bad luck, and 13 is  _  a very unlucky number. You were really making my grandmother very afraid. \"", 
    "options": [
        [
            "affected", 
            "loved", 
            "frightened", 
            "encouraged"
        ], 
        [
            "pen", 
            "purse", 
            "dress", 
            "handbag"
        ], 
        [
            "honest", 
            "humorous", 
            "happy", 
            "unhappy"
        ], 
        [
            "back", 
            "right", 
            "front", 
            "left"
        ], 
        [
            "stopped", 
            "kept", 
            "insisted", 
            "suggested"
        ], 
        [
            "wallet", 
            "umbrella", 
            "flower", 
            "shirt"
        ], 
        [
            "why", 
            "that", 
            "if", 
            "where"
        ], 
        [
            "laughed", 
            "screamed", 
            "clapped", 
            "cheered"
        ], 
        [
            "bowl", 
            "bottle", 
            "plate", 
            "mirror"
        ], 
        [
            "my", 
            "your", 
            "her", 
            "our"
        ], 
        [
            "shouted", 
            "talked", 
            "told", 
            "explained"
        ], 
        [
            "but", 
            "for", 
            "or", 
            "so"
        ], 
        [
            "open", 
            "closed", 
            "new", 
            "old"
        ], 
        [
            "hardly", 
            "never", 
            "seldom", 
            "also"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "D", 
        "C", 
        "A", 
        "B", 
        "C", 
        "B", 
        "D", 
        "B", 
        "D", 
        "C", 
        "A", 
        "D"
    ], 
    "source": "middle2029"
}