{
    "article": "Once again, I was at a new school. _ was a girl in my class named Paris. That was where the similarities ended.\nI was tall and she was small. I was one of the _ in the class while she was the youngest. My hair was thick, short and ugly while hers was long and beautiful. I couldn't stand her, considering her my _ . But she wanted to be friends.\nOne day, she invited me over and I said yes - I was too _ to say no. Actually, no one had invited me over to _ before. But this girl, who wore the latest fashions, wanted to see me.\nWhen we got to the _ she shared with her sister, she took out a big case of Barbies - which was my next surprise. I had never played with them. But we sat on the floor of a walk-in cupboard _ as we made up crazy stories about the Barbies. That's when we found out that we both wanted to be writers when we were older. We both had wild _ .\nWe had a great time that afternoon. Our jaws   ached from smiling so much. She _ me her outfits, which had mostly come from a designer clothing store. The woman who owned it sometimes used her _ a model for her newspaper ads and gave her clothes in exchange.\nParis charmed the whole neighborhood. The _ owners lent her fashion magazines down the block, the movie theater gave her free passes and the pizza place let her _ free pieces. Soon I was included in her _ world. We slept over at each other's houses and spent every free moment together.\nParis, my first real friend since childhood, helped me get through my tough teenage _ and taught me an amazing thing about making friends: Your \"worst enemy\" can turn out to be your best friend.", 
    "options": [
        [
            "So", 
            "Neither", 
            "Either", 
            "Or"
        ], 
        [
            "oldest", 
            "strongest", 
            "tallest", 
            "smartest"
        ], 
        [
            "leader", 
            "angle", 
            "hero", 
            "enemy"
        ], 
        [
            "surprised", 
            "satisfied", 
            "stressed", 
            "worried"
        ], 
        [
            "study", 
            "play", 
            "chat", 
            "sing"
        ], 
        [
            "kitchen", 
            "balcony", 
            "bedroom", 
            "garden"
        ], 
        [
            "talking", 
            "thinking", 
            "shouting", 
            "laughing"
        ], 
        [
            "instruction", 
            "imagination", 
            "information", 
            "interest"
        ], 
        [
            "sent", 
            "showed", 
            "provided", 
            "passed"
        ], 
        [
            "for", 
            "with", 
            "as", 
            "by"
        ], 
        [
            "supermarket", 
            "museum", 
            "bookshop", 
            "community"
        ], 
        [
            "sell", 
            "have", 
            "borrow", 
            "make"
        ], 
        [
            "magic", 
            "natural", 
            "simple", 
            "funny"
        ], 
        [
            "weeks", 
            "months", 
            "seasons", 
            "years"
        ]
    ], 
    "answers": [
        "A", 
        "A", 
        "D", 
        "A", 
        "B", 
        "C", 
        "D", 
        "B", 
        "B", 
        "C", 
        "C", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "middle1801"
}