{
    "article": "When I was a young child, my parents often told me that a positive heart brought man everything. I didn't understand and wondered why  it t  has such a big influence on a person. And now, although I'm just a middle school student, I'd like to  _  my own opinions on this saying. Once I read a sentence-- \"To make this world a  _  place to live in, rather than the whole world, you'd better change your  _  .\" It made me lost in thought. There are so many things around us that go  _  our will . We can't force life to follow our wishes. The earth won't stop turning  _  we accept it or not. What we can do is just to make ourselves suit the world. I think we should learn to  _  welcome whatever life gives us, the spring sunlight or the winter snowfall, and try to get  _  from it. I have tried to catch every pleasant thing in my life, but I  _  catch most of the pleasant moments, such as being hugged by mother when in fear, being  _  by the teacher when in trouble, being helped by a stranger when  in danger  . I realize that I don't just live alone and that there are others around me I should  think of  . They all pay attention to my growing up, and are proud of my achievements  even though  it is just a little progress. It is their care and love  _  often remind me I live in a warm and happy world. Different people may have different  _  towards life. But there is one rule should be followed and that is to make the world better.", 
    "options": [
        [
            "hold", 
            "make", 
            "get", 
            "show"
        ], 
        [
            "nice", 
            "terrible", 
            "rich", 
            "boring"
        ], 
        [
            "job", 
            "heart", 
            "taste", 
            "smell"
        ], 
        [
            "above", 
            "along", 
            "against", 
            "for"
        ], 
        [
            "whether", 
            "if", 
            "since", 
            "when"
        ], 
        [
            "casually", 
            "politely", 
            "lovely", 
            "warmly"
        ], 
        [
            "friendship", 
            "success", 
            "pleasure", 
            "surprise"
        ], 
        [
            "won't", 
            "can't", 
            "needn't", 
            "mustn't"
        ], 
        [
            "invited", 
            "trained", 
            "cheered", 
            "stopped"
        ], 
        [
            "who", 
            "that", 
            "whom", 
            "what"
        ], 
        [
            "Plans", 
            "habits", 
            "hobbies", 
            "Attitudes"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "B", 
        "C", 
        "A", 
        "D", 
        "C", 
        "B", 
        "C", 
        "B", 
        "D"
    ], 
    "source": "middle689"
}