{
    "article": "My name is Jane Eyre and my parents died when I was a baby. For ten years I lived a _ life with my aunt and cousins who treated me unfriendly. My cousins played jokes on me and my aunt never showed me any _ .The only person who cared about me was the maid , Bessie. One day my cousin John shouted at me: \"You should go and beg, not live with us!\" After fighting with him I was locked in a room, where I  _ for hours crying.\nThings kept the same until a tall gentleman called Mr. Brockehurst came to visit. My aunt told me that I was going to a school  _ by the gentleman. \"Train her to be useful and polite,\" said Aunt. Two days later I left my home.\nAt first my _ at Lowood School was easy. The food was bad and I was often cold but I made\n _ and enjoyed studying. But after an illness killed several students, new owners took over  the school and life improved. Six years later I  _  a teacher and was very happy. But finally I felt that I should explore more of the world and found a job as a private  teacher in a  _ .\nBefore I left Lowood, Bessie came to visit me, she told me that seven years ago my father's brother had come  looking for me but he left again to go abroad. \"He looked like quite a gentleman,\" said Bessie. I wondered if he would ever look for me again.\nMy new life  _ at Thornfield Hall, a large country house,  _ a little girl called Adele. She was the adopted  daughter of the owner of the house, Mr. Rochester. He  _ stayed at Thornfield and  _ my time was mainly spent with Adele and other people. My life was quite happy now although there was something _ about my new home. Often I heard strange sounds come from the top floor of the house.---------Based upon<<Jane Eyre>>", 
    "options": [
        [
            "happy", 
            "long", 
            "sad", 
            "comfortable"
        ], 
        [
            "food", 
            "love", 
            "way", 
            "schooling"
        ], 
        [
            "lived", 
            "stayed", 
            "studied", 
            "beat"
        ], 
        [
            "built", 
            "designed", 
            "owned", 
            "opened"
        ], 
        [
            "food", 
            "life", 
            "book", 
            "study"
        ], 
        [
            "noise", 
            "friends", 
            "mistakes", 
            "faces"
        ], 
        [
            "turned", 
            "met", 
            "became", 
            "found"
        ], 
        [
            "school", 
            "family", 
            "library", 
            "country"
        ], 
        [
            "stopped", 
            "continued", 
            "started", 
            "broke"
        ], 
        [
            "showing", 
            "teaching", 
            "searching", 
            "wanting"
        ], 
        [
            "often", 
            "hardly", 
            "happily", 
            "quietly"
        ], 
        [
            "yet", 
            "so", 
            "still", 
            "though"
        ], 
        [
            "interesting", 
            "good", 
            "important", 
            "strange"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "B", 
        "C", 
        "B", 
        "B", 
        "C", 
        "B", 
        "C", 
        "B", 
        "B", 
        "B", 
        "D"
    ], 
    "source": "middle2165"
}