{
    "article": "Do you like reading stories? Maybe you will answer, \"No, I am not a child any more!\" Yes, children all over the world always love stories.\nChinese children are _ in Monkey King's story. It has been a popular bedtime story in China for many years. In fact, adults also love the story a lot. For them, Monkey King has become a very _ part in the memory of their childhood. The clever and humorous monkey _ the hearts of many Chinese people. British boys and girls all know Alice's Adventures in Wonderland well. As the name shows, it's a story full of dangerous but exciting trips. Children _ , cry and even get frightened  with Alice together while reading the story. Most American kids have read The Adventures of Tom Sawyer, by the famous _ Mark Twain. Everyone likes the brave boy who also has lots of _ . Some scenes  of the story may make your heart go faster, for Tom and his friends meet some very bad men and are usually in danger . Of course in the end, they beat the bad ones.\nYou may also ask me _ I like stories. Yes, I have liked them since I was very young. At that time, I often _ all my pocket money on story books. For me, stories are much more delicious than chocolate! They help me learn a lot. So either young or old, let's enjoy stories.", 
    "options": [
        [
            "bored", 
            "interested", 
            "worried", 
            "surprised"
        ], 
        [
            "unhappy", 
            "comfortable", 
            "forgettable", 
            "unforgettable"
        ], 
        [
            "beats", 
            "wins", 
            "hurts", 
            "breaks"
        ], 
        [
            "laughs", 
            "laughed", 
            "laugh", 
            "laughing"
        ], 
        [
            "writer", 
            "artist", 
            "coach", 
            "member"
        ], 
        [
            "rules", 
            "messages", 
            "competitions", 
            "adventures"
        ], 
        [
            "that", 
            "what", 
            "why", 
            "if"
        ], 
        [
            "paid", 
            "took", 
            "spent", 
            "cost"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "B", 
        "C", 
        "A", 
        "D", 
        "D", 
        "C"
    ], 
    "source": "middle981"
}