{
    "article": "Today, it is a big problem for young graduates to get satisfying jobs. It is said that there are  thousands of  different kinds of jobs in the world. Choosing the right one itself is not easy. \"Finding a job\" is not  the same  as \"choosing a job\". Many young people end up in a job because they are not  _  for it. Sometimes \"Chance\" may  _  a more important part than \"decision\". Here are a few steps to help you think about jobs  _  you might enjoy doing after school or university. First, it is important  to realize  what kind of person you are, which special qualities  _  you outstanding among people and what you are interested in. There is a difference  _  an interest and a skill. If you like  _  and enjoy looking at pictures, that is an interest. But if you can  _  a horse that looks like a horse not a big dog, that is a  _  Then ask yourself a question,\" In the following three areas--skills with people, skills with information and skills with things, which are your  best  skills?\" After  examining  your skills, the next step is research . To  find out  as many different kinds of jobs as possible, go to the library and read books, magazines and newspapers for information. Ask your friends  what they think of  the work they do. Finally, trust your own ideas and your own thinking! It is your own life, just find the job you really enjoy doing.", 
    "options": [
        [
            "suitable", 
            "fitted", 
            "able", 
            "like"
        ], 
        [
            "take", 
            "play", 
            "have", 
            "choose"
        ], 
        [
            "which", 
            "what", 
            "if", 
            "whether"
        ], 
        [
            "helps", 
            "makes", 
            "make", 
            "help"
        ], 
        [
            "both", 
            "between", 
            "from", 
            "either"
        ], 
        [
            "art", 
            "music", 
            "sports", 
            "acting"
        ], 
        [
            "ride", 
            "feed", 
            "draw", 
            "treat"
        ], 
        [
            "success", 
            "skill", 
            "hobby", 
            "fact"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "A", 
        "C", 
        "B", 
        "A", 
        "C", 
        "B"
    ], 
    "source": "middle860"
}