{
    "article": "My stutter had always been much of a problem. I'd had so many specialists for my  _  over the years. As l walked down the hallway to meet a new one, memories popped in my head of how painful being a kid who stutters had been. It  _  hurt. \"Hello! I'm Mrs. Claussen. I hear you're from Texas!\" \"Ye-Ye-Ye-Yes m-m-m-m-m-m-m-aam I am...\"My heart felt like it was pounding through my chest and my hands were dripping wet. I really blew that  _  . \"Well,\" she said with a  _  Smile. 161've always liked Texas.\" She turned out to be the best speech specialist I've ever had, not like those who told me to clap my hands while speaking. She was  _  .She spent the first several weeks just talking to me - asking me all kinds of questions about myself, especially my feelings. And she  _  . She then began to teach me about the speech. Not just about my speech, but about everybody's. I  _  in my old school and was a pretty good tenor , but I learned that the new school's singing group was all filled up. It was such bad news, for I thought that was the one thing I could really do well - and I could do it  _  stuttering. Somehow Mrs. Claussen finally got me in the group. I felt like she really cared about me as a person, not just a speech student. During the next two years, my speech didn't get much better - except with her. When I was in college, things got worse. I once even wondered if I would ever be able to  _  ! It was a very depressing time, and I often felt alone. When I was feeling really sorry for myself, I remembered Mrs. Claussen had told me whether I could  _  my speech was all up to me. She had told me not to fight for perfect speech, just better speech. She was right about that. I finally improved my speech greatly. Many years have passed, but I think of her from time to time, wondering if she had as much  _  0n her other students as she had on me. I like to think that she did. Her name was Mrs. Claussen... and she  _  . I'II never forget her.", 
    "options": [
        [
            "speech", 
            "study", 
            "dream", 
            "fear"
        ], 
        [
            "maybe", 
            "even", 
            "still", 
            "never"
        ], 
        [
            "instruction", 
            "description", 
            "introduction", 
            "presentation"
        ], 
        [
            "shy", 
            "cold", 
            "weak", 
            "kind"
        ], 
        [
            "silent", 
            "simple", 
            "direct", 
            "different"
        ], 
        [
            "cried", 
            "listened", 
            "waited", 
            "stopped"
        ], 
        [
            "sang", 
            "spoke", 
            "played", 
            "clapped"
        ], 
        [
            "against", 
            "besides", 
            "beyond", 
            "without"
        ], 
        [
            "practise", 
            "communicate", 
            "report", 
            "reply"
        ], 
        [
            "train", 
            "share", 
            "change", 
            "follow"
        ], 
        [
            "advice", 
            "influence", 
            "dependence", 
            "action"
        ], 
        [
            "continued", 
            "taught", 
            "agreed", 
            "cared"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "D", 
        "D", 
        "D", 
        "B", 
        "A", 
        "D", 
        "B", 
        "C", 
        "B", 
        "D"
    ], 
    "source": "middle2076"
}