{
    "article": "Though it was only October, my students were already talking about Christmas plans. As days went on, everyone became more _ , waiting for the final school bell. As soon as the bell _ , everyone would run for their coats and go home except David.\nDavid was a small boy in ragged clothes. I had often _ why his mother dressed him so poorly for the cold winter months, without a coat, boots or gloves. But something made David _ . I can still remember he was always _ a smile and liked to help others. He always _ after school to put chairs away and sweep the floor. We _ talked much. He just smiled and asked what else he could do, then thanked me for letting him stay and slowly _ home.\nWeeks passed and it was finally the last day of _ before the holiday began. I smiled happily when the last of them _ out of the door. When I turned around, I saw David _ standing by my desk.\n\"I have something for you,\" he said and _ from behind his back a small box. He asked me to open it quickly. I unwrapped it but saw nothing in it. I looked at David's smiling face and back into the box and said, \"The box is nice, David, but it's _ .\"\n\"Oh no, it isn't,\" said David, \"It's full of love. My mum told me before she died that love is something you can't see or touch unless you know it's there.\"\nTears filled my eyes _ I looked at the proud dirty face which I had _ paid attention to. I never forget the meaning from the little box on my desk. After that Christmas, David and I became good friends", 
    "options": [
        [
            "polite", 
            "serious", 
            "impatient", 
            "calm"
        ], 
        [
            "warned", 
            "rang", 
            "called", 
            "shouted"
        ], 
        [
            "known", 
            "wondered", 
            "realized", 
            "learned"
        ], 
        [
            "strange", 
            "unhappy", 
            "different", 
            "funny"
        ], 
        [
            "treating", 
            "feeling", 
            "wearing", 
            "sharing"
        ], 
        [
            "practised", 
            "forced", 
            "studied", 
            "stayed"
        ], 
        [
            "never", 
            "often", 
            "always", 
            "almost"
        ], 
        [
            "left", 
            "rushed", 
            "turned", 
            "returned"
        ], 
        [
            "school", 
            "year", 
            "education", 
            "program"
        ], 
        [
            "hurried", 
            "jumped", 
            "walked", 
            "jogged"
        ], 
        [
            "carelessly", 
            "sadly", 
            "quietly", 
            "helplessly"
        ], 
        [
            "searched", 
            "found", 
            "lifted", 
            "pulled"
        ], 
        [
            "cheap", 
            "empty", 
            "useless", 
            "expensive"
        ], 
        [
            "when", 
            "until", 
            "though", 
            "because"
        ], 
        [
            "specially", 
            "nearly", 
            "hardly", 
            "carefully"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "B", 
        "C", 
        "C", 
        "D", 
        "C", 
        "D", 
        "A", 
        "C", 
        "C", 
        "D", 
        "B", 
        "A", 
        "C"
    ], 
    "source": "middle827"
}