{
    "article": "This might seem crazy, because many students in the United States do job _ being paid! Yes, they volunteer. And they like it, too! Many girls volunteer to work in hospitals. Other kids volunteer to work at zoos or dog houses where lost _ are kept in even though they don't get paid, they get to _  their days with animals. There's also a Big Brother Foundation in the US. Older kids can  _ younger kids and them with their homework.\nMaybe you don't have the same chances in China to volunteer as kids in the US have. So be creative and try to come up with some ideas! Volunteer to help people in _ way you can think of. You can volunteer to help at a hospital, you can help old people, or you can volunteer to clean up trash on the ground.\n _ volunteer? Because it can give you a good _ .It might help you get a job in the future. Doing volunteer work shows that you care about other _ and you are generous with your time. Bosses like people _ do these things. Volunteering not only helps you in the future, but also makes you feel happier now. Try it! It could be the best improvement to _ vacations.", 
    "options": [
        [
            "with", 
            "without", 
            "have", 
            "has"
        ], 
        [
            "things", 
            "bags", 
            "pets", 
            "money"
        ], 
        [
            "pass", 
            "spend", 
            "take", 
            "cost"
        ], 
        [
            "teach", 
            "hurt", 
            "study", 
            "learn"
        ], 
        [
            "some", 
            "all", 
            "both", 
            "any"
        ], 
        [
            "how", 
            "what", 
            "where", 
            "why"
        ], 
        [
            "money", 
            "job", 
            "time", 
            "experience"
        ], 
        [
            "teenagers", 
            "people", 
            "kids", 
            "adults"
        ], 
        [
            "who", 
            "whom", 
            "which", 
            "where"
        ], 
        [
            "her", 
            "their", 
            "your", 
            "its"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "B", 
        "A", 
        "D", 
        "D", 
        "D", 
        "B", 
        "A", 
        "C"
    ], 
    "source": "middle2035"
}