{
    "article": "If you meet Walker Smith, a 2-year-old boy from Coral Gables, Florida, the  _  thing he will ask you is what kind of car you drive. Walker has been interested in  _  for more than a year, ever  _  the day his father, a car fan, brought home a single matchbox car for him. \"He started to  _  cars from his father, and within a week  _  two, he could name many cars on the road,\" Walker's mother Lynley Smith said. Walker's father often brings home magazines  _  cars. Lynley said, \"So Walker and his father would try to find cars  _  in the magazines we and our friends drove. So they'd find a Saturn and my husband would say 'This is the car  _  mommy drives !' and then they'd look for Saab and say 'This is daddy's !' Before we knew it, he pointed  _  our kinds of cars out on the road.\" So now he knows every car you can  _  ,\" said Lynley, \"including some super fancy cars that you  _  see on the road,\" such as Aston Martins and Lamborghinis. \"We're so  _  to have such a clever baby. Walker can now identify the cars he sees on the road though his  _  isn't always right \"He's not  _  at 'r's, so for example when he sees a Porsche, he calls it a 'Posh'. And when he sees a Ford, he'll call it 'fod',\" said Lynley. When you ask him what he wants to be when he  grows up  , he will say \"Of course a car businessman\". This must be his dream job.", 
    "options": [
        [
            "last", 
            "next", 
            "first", 
            "coming"
        ], 
        [
            "boxes", 
            "toys", 
            "cars", 
            "dolls"
        ], 
        [
            "since", 
            "before", 
            "when", 
            "after"
        ], 
        [
            "learn", 
            "buy", 
            "borrow", 
            "steal"
        ], 
        [
            "and", 
            "or", 
            "but", 
            "nor"
        ], 
        [
            "of", 
            "about", 
            "for", 
            "in"
        ], 
        [
            "excitedly", 
            "angrily", 
            "sadly", 
            "surprisingly"
        ], 
        [
            "what", 
            "that", 
            "who", 
            "where"
        ], 
        [
            "none", 
            "all", 
            "either", 
            "both"
        ], 
        [
            "break", 
            "destroy", 
            "imagine", 
            "repair"
        ], 
        [
            "never", 
            "always", 
            "also", 
            "ever"
        ], 
        [
            "surprised", 
            "disappointed", 
            "bored", 
            "angry"
        ], 
        [
            "spelling", 
            "pronunciation", 
            "imagination", 
            "explanation"
        ], 
        [
            "strict", 
            "angry", 
            "good", 
            "careful"
        ]
    ], 
    "answers": [
        "C", 
        "C", 
        "A", 
        "A", 
        "B", 
        "B", 
        "A", 
        "B", 
        "B", 
        "C", 
        "A", 
        "A", 
        "B", 
        "C"
    ], 
    "source": "middle80"
}