{
    "article": "A young woman in her twenties was sitting on the train, next to her mother. They both looked tired but excited. The young woman was looking _ from the train's window. Suddenly, she shouted: \"Mom, look, the trees are _ us!\" Her voice was so loud that everybody on the train heard.\nMom smiled. But a young couple _ nearby looked at the young woman's childish behavior  with pity. \"Poor young woman. There must be something wrong with her _ .\" they thought.\nA while later, the young woman _ again: \"mom, look! The clouds are running with us!\" Mom smiled again. And she seemed very happy with the young woman's words. _ , the couple couldn't help asking the old woman: \"sorry if we offend you. But _ don't you take your daughter to a good doctor?\"\nThe old woman smiled and said: \"We have just come from a _ \" \"Then you should go to a better one. Because it seems that your daughter's situation hasn't _ ,\" said one of them. They felt so bad for the old woman.\n\"No, in fact ,I'm very happy with the treatment ,\" said the mother, \"My daughter was blind from birth. Today, she is seeing the world for the first time.\"\nEvery person has a story. Don't judge people before you truly know them. The truth might surprise you.", 
    "options": [
        [
            "at", 
            "up", 
            "down", 
            "out"
        ], 
        [
            "under", 
            "before", 
            "behind", 
            "beside"
        ], 
        [
            "sitting", 
            "working", 
            "playing", 
            "walking"
        ], 
        [
            "voice", 
            "mouth", 
            "mind", 
            "eyes"
        ], 
        [
            "called", 
            "shouted", 
            "cried", 
            "spoke"
        ], 
        [
            "Finally", 
            "Exactly", 
            "Nearly", 
            "Possibly"
        ], 
        [
            "how", 
            "where", 
            "when", 
            "why"
        ], 
        [
            "school", 
            "hospital", 
            "park", 
            "station"
        ], 
        [
            "started", 
            "gone", 
            "improved", 
            "refused"
        ]
    ], 
    "answers": [
        "D", 
        "C", 
        "A", 
        "C", 
        "B", 
        "A", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "middle1388"
}