{
    "article": "Mrs. Evans was home from work. She had just gone into the kitchen to make the afternoon tea _ she saw a mouse running around on the kitchen floor. She _ and jumped up on the table. As soon as the mouse had gone, she jumped off from the _ , rushed out of the kitchen, put on her coat, ran out of the house and got on a bus which was going into the town. There she hurried into a shop and _ a large mouse-trap  . She wanted to put an end to this mouse as quickly as possible.\nWhen she got home _ the trap, she realized that she had forgotten to buy any cheese to put in it. She searched everywhere _ there was not any in the house. It was too late to buy any because now all the shops were _ . She wondered what to do. In the end ,  she had a clever idea. She took a pair of scissors and cut a picture of a piece of cheese out of a magazine. Then she put the picture in the trap instead of a piece of cheese.\nThe next _ , Mrs. Evans came down to the cooking room and went straight away to the place where she had put the trap. She wanted to see if her plan had _ .The picture of the cheese had gone and in its place was a picture of a mouse.", 
    "options": [
        [
            "where", 
            "what", 
            "while", 
            "when"
        ], 
        [
            "laughed", 
            "cried", 
            "surprised", 
            "pleased"
        ], 
        [
            "table", 
            "floor", 
            "house", 
            "kitchen"
        ], 
        [
            "asked", 
            "bought", 
            "sold", 
            "left"
        ], 
        [
            "for", 
            "out", 
            "with", 
            "along"
        ], 
        [
            "and", 
            "so", 
            "but", 
            "or"
        ], 
        [
            "open", 
            "closed", 
            "busy", 
            "empty"
        ], 
        [
            "afternoon", 
            "hour", 
            "evening", 
            "morning"
        ], 
        [
            "worked", 
            "took", 
            "changed", 
            "made"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "A", 
        "B", 
        "C", 
        "C", 
        "B", 
        "D", 
        "A"
    ], 
    "source": "middle1953"
}