{
    "article": "I used to live selfishly, I should admit . But one _ changed me.\nI was on my lunch break and had _ the office to get something to eat . On the way, I saw a Busker ,with a hat in front of him. I had some _ in my pocket but I would not give them to him, thinking to myself he would _ use the money to take drugs or drink too much. He _ like that type-young and ragged . But what was I going to spend the money on ? Only to buy a can of Coca-Cola or chocolate! I then realized I had no right to place myself above him just because he was busking.\nI _ and dropped all the coins into his hat, and he smiled at me, I watched for a while. As selfish as it sounds, I looked forward to something more to come from that moment--a feeling of _ or satisfaction, for example. But nothing happened. Disappointedly, I walked off.\"It proved to be a waste of _ ,\"I thought.\nOn my way home at the end of the _ , I saw the busker again and he was packing up . I watched him pick up the hat and walk to a cafe counter. There he poured the total contents into a tin collecting for an earthquake fund-raising event. He was busking for charity!\nNow I donate any _ I have to charity tins and enjoy the feeling of giving.", 
    "options": [
        [
            "time", 
            "moment", 
            "point", 
            "second"
        ], 
        [
            "left", 
            "cleaned", 
            "prepared", 
            "searched"
        ], 
        [
            "chocolates", 
            "coins", 
            "tins", 
            "drugs"
        ], 
        [
            "almost", 
            "only", 
            "rather", 
            "still"
        ], 
        [
            "acted", 
            "looked", 
            "sounded", 
            "smelt"
        ], 
        [
            "waited", 
            "followed", 
            "stopped", 
            "arrived"
        ], 
        [
            "happiness", 
            "sadness", 
            "love", 
            "hate"
        ], 
        [
            "words", 
            "time", 
            "space", 
            "money"
        ], 
        [
            "moment", 
            "day", 
            "break", 
            "event"
        ], 
        [
            "work", 
            "time", 
            "energy", 
            "change"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "B", 
        "B", 
        "B", 
        "C", 
        "A", 
        "D", 
        "B", 
        "D"
    ], 
    "source": "middle813"
}