{
    "article": "A jobless man wanted to apply  for the position of \"office boy\" at Microsoft. The staff manager interviewed him and then gave him a  _ : clean the floor. The man passed it; he cleaned the floor very well.\n\"You are hired ,\" the manager told the man. \"Give me your email address, and I'll send you the form to  fill in . I shall also send you the  _  you should report for the work.\"\nThe man replied, \"I don't have a  _ , or email!\"\n\"I'm sorry,\" said the manager. \"If you don't have email, that means you do not exist . And we cannot  _  persons who do not exsit.\"\nThe man was very  _ . He didn't know what to do. He only had 10 dollars with him. Once that was _ , he wouldn't have any money to buy even food. He went from door to door and  _  the tomatoes in small bags. He doubled his money.\nHe  _  this three times, and returned home with 60 dollars. He realized that he could continue to live this way. He started to go earlier every day, and returned later. He doubled or made even three times his money every day. Soon, he  _  a cart, then a truck. In a very short time, he had his many delivery  trucks.\nFive years later, the man became one of the biggest  _ seller in the country. He started to plan his family's future. He called an insurance  broker, a man who sells insurance. At the end of the  _ , the broker asked him for his email address. The man replied, \"I don't have an email.\"\nHearing that, the broker felt very  _ . \"You don't have email, and yet have succeeded in becoming so  _ . Can you imagine what you could have been if you had email?\" he said aloud. The man thought for a while, and replied, \"an office  _  at Microsoft!\"\nIf you just lost your job or just failed an interview, don't worry, think of the positive ... Good days are on the way and something better will happen to you.", 
    "options": [
        [
            "job", 
            "hand", 
            "chance", 
            "test"
        ], 
        [
            "name", 
            "date", 
            "address", 
            "ticket"
        ], 
        [
            "computer", 
            "screen", 
            "website", 
            "letter"
        ], 
        [
            "believe", 
            "pay", 
            "accept", 
            "refuse"
        ], 
        [
            "pleased", 
            "excited", 
            "embarrassed", 
            "disappointed"
        ], 
        [
            "exchanged", 
            "spent", 
            "wasted", 
            "lost"
        ], 
        [
            "divided", 
            "showed", 
            "kept", 
            "sold"
        ], 
        [
            "repeated", 
            "reminded", 
            "tried", 
            "counted"
        ], 
        [
            "borrowed", 
            "repaired", 
            "received", 
            "bought"
        ], 
        [
            "truck", 
            "insurance", 
            "food", 
            "door"
        ], 
        [
            "introduction", 
            "talk", 
            "business", 
            "story"
        ], 
        [
            "worried", 
            "satisfied", 
            "upset", 
            "surprised"
        ], 
        [
            "clever", 
            "healthy", 
            "rich", 
            "confident"
        ], 
        [
            "boy", 
            "secretary", 
            "cleaner", 
            "head"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "A", 
        "C", 
        "D", 
        "B", 
        "D", 
        "A", 
        "D", 
        "C", 
        "B", 
        "D", 
        "C", 
        "A"
    ], 
    "source": "middle976"
}