{
    "article": "I grew up in a small town. When I was in the third grade, I was chosen to be the  _  in the school play. My mother helped me practice my lines for weeks. But once I stepped onto the stage, I was too nervous to  _  the words. Finally, my teacher asked me to  _  the role to a storyteller. I didn't tell my mother  _  had happened when I went home for lunch that day. She knew that I was  _  from my look. She asked if I wanted to go for a walk in the yard. It was a lovely  _  day and the grass was turning green. We could see a lot of yellow dandelions in the grass. I watched my mother walking towards a dandelion and  _  it up by its roots . \"From now on, we'll have only roses in this garden.\" she said. \"But I like dandelions,\" I said. \"All  _  are beautiful even dandelions!\" \"Yes, every flower gives pleasure in its own way. And that is true of  _  too. Not everyone can be a princess. You will be a beautiful storyteller,\" my mother said, reminding me of how much I  _  to read stories to her. \"The storyteller's part is just as  _  as the part of a princess.\" The big day  _  came. A few minutes before the play, my teacher handed me a  _  . I looked at it and thought of our  lunchtime  talk. It made me  _  . After the play, I took the flower home, and kept it in our family dictionary.", 
    "options": [
        [
            "king", 
            "snowman", 
            "princess", 
            "witch"
        ], 
        [
            "forget", 
            "remember", 
            "find", 
            "write"
        ], 
        [
            "act", 
            "play", 
            "change", 
            "take"
        ], 
        [
            "which", 
            "what", 
            "that", 
            "this"
        ], 
        [
            "energetic", 
            "unhappy", 
            "excited", 
            "dishonest"
        ], 
        [
            "spring", 
            "summer", 
            "autumn", 
            "winter"
        ], 
        [
            "putting", 
            "pulling", 
            "setting", 
            "looking"
        ], 
        [
            "seasons", 
            "rainbows", 
            "flowers", 
            "scenes"
        ], 
        [
            "animals", 
            "plants", 
            "people", 
            "food"
        ], 
        [
            "hated", 
            "loved", 
            "tried", 
            "planned"
        ], 
        [
            "interesting", 
            "common", 
            "important", 
            "cheerful"
        ], 
        [
            "suddenly", 
            "finally", 
            "usually", 
            "slowly"
        ], 
        [
            "rose", 
            "dandelion", 
            "present", 
            "hairclip"
        ], 
        [
            "imaginative", 
            "generous", 
            "confident", 
            "humorous"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "C", 
        "B", 
        "B", 
        "A", 
        "B", 
        "C", 
        "C", 
        "B", 
        "C", 
        "B", 
        "B", 
        "C"
    ], 
    "source": "middle753"
}