{
    "article": "Luke says, \"At first I was shocked that somebody would do such a thing, but then I saw Jenifer's  _  in his hand and knew that I had to do something. I jumped up and started chasing him down the street and calling \"Thief, stop!\" But nobody seemed  _  in stopping him. They were just looking at us, like it was a  _  or something. Luckily, I play soccer for the school team, so I've been training all year round, so I  _  to catch up with him on Third Avenue and knocked him down. Once he was on the  _  I sat on top of him and waited for the police to come. Some people say I shouldn't do that kind of thing  _  I never know what the thief can do to me. But I didn't think about that at the time. I was too  _  .\" However, Jennifer is not the only one who's grateful for Luke's bravery. The police later searched the thief's flat and found over a hundred  _  cell phones and, perhaps more important, an address book full of names of different criminal contacts . Most of the criminals listed in the book have been  _  and the number of phone theft has been fallen in the area. All over the world, phone theft is only one of a number of technology - related crimes that police say are on the rise. Businesspeople have been told to be  _  with their notebook computers. Notebook computers are  another  easy target for criminals. And new police branches are being set up to  deal with  crimes in this field. In the last week alone, the New York Police Department has received over six hundred calls about the  _  crimes. Thanks to Luke's bravery and quick thinking, Jennifer didn't  _  one of those victims, and she knows  _  she's going to thank Luke -- by taking him for another meal at the same Indian restaurant. This time, however, she's going to keep her cell phone in her purse.", 
    "options": [
        [
            "purse", 
            "phone", 
            "head", 
            "face"
        ], 
        [
            "pleased", 
            "frightened", 
            "interested", 
            "excited"
        ], 
        [
            "sport", 
            "movie", 
            "story", 
            "joke"
        ], 
        [
            "managed", 
            "tried", 
            "hoped", 
            "meant"
        ], 
        [
            "floor", 
            "grass", 
            "ground", 
            "bed"
        ], 
        [
            "because", 
            "so", 
            "if", 
            "although"
        ], 
        [
            "nervous", 
            "sad", 
            "brave.", 
            "angry"
        ], 
        [
            "broken", 
            "stolen", 
            "beautiful", 
            "expensive"
        ], 
        [
            "killed", 
            "arrested", 
            "saved", 
            "blamed"
        ], 
        [
            "patient", 
            "careful", 
            "easy", 
            "worried"
        ], 
        [
            "above", 
            "following", 
            "over", 
            "next"
        ], 
        [
            "trouble", 
            "offer", 
            "become", 
            "believe"
        ], 
        [
            "why", 
            "how", 
            "when", 
            "whether"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "B", 
        "A", 
        "C", 
        "A", 
        "D", 
        "B", 
        "B", 
        "B", 
        "A", 
        "C", 
        "B"
    ], 
    "source": "middle2199"
}