{
    "article": "It was Sunday afternoon. My younger brother and I were alone at home. My parents went for a party and asked me to look after my brother. I was doing my homework while my brother was watching TV. Suddenly the doorbell rang. Ding-Dong! My brother thought that it was our parents, so he opened the _ quickly.\nA tall man wearing a black raincoat stood outside. He said that he came to sell books and he _ politely, \"Are your parents at home? \"\nWithout thinking, my brother said, \"No. \"Then the man asked, \"Would you like to _ some storybooks? \"I told him we didn't want to buy. When I wanted to close the door, he suddenly pushed the door very heavily and came into our house. He took out a _ and ordered me to tie up my brother's hands with a rope . I tied up his hands in a special way so my brother could untie _ easily. The man then tied my hands up and locked _ of us in the kitchen. Soon, he went upstairs to look for money. I taught my brother to untie the rope on his hands. He then untied me. I rushed to the telephone to call the police, _ the line was dead. The doors were all locked from the outside. It was lucky that the man _ to lock the kitchen window. So we got out of the house through the kitchen window and went to the _ pay phone to call the police.\nSoon the police came to our house and the man was caught by the police. By that time, my parents had come home. We told them the whole story. My parents were happy that we were not hurt. They told me that we shouldn't open the door to strangers. I learnt a lesson on safety.", 
    "options": [
        [
            "window", 
            "door", 
            "book", 
            "TV"
        ], 
        [
            "asked", 
            "ask", 
            "answered", 
            "answer"
        ], 
        [
            "lend", 
            "borrow", 
            "sell", 
            "buy"
        ], 
        [
            "kiss", 
            "knife", 
            "gift", 
            "pen"
        ], 
        [
            "himself", 
            "Itself", 
            "herself", 
            "themselves"
        ], 
        [
            "most", 
            "some", 
            "both", 
            "all"
        ], 
        [
            "and", 
            "so", 
            "or", 
            "but"
        ], 
        [
            "wanted", 
            "liked", 
            "forgot", 
            "tried"
        ], 
        [
            "farthest", 
            "nearest", 
            "largest", 
            "smallest"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "D", 
        "B", 
        "A", 
        "C", 
        "D", 
        "C", 
        "B"
    ], 
    "source": "middle821"
}