{
    "article": "Do you like travelling? Today, I'll give you some _ about travelling. You should have a good night's sleep _ you travel. If you don't, you will feel tired _ the way. You should take some _ with you. It may be helpful when you feel sick. You should have a meal before travelling. If you _ eat anything, you'll feel hungry. And the food on the train is much more _ .You should listen to the weather report earlier, so you can _ a good plan for your travel. You'd better take a(n) _ with you. It can keep off the sun and the rain. You should pack all your right clothes when you prepare your luggage . If you're going from a hot place to a cold place, you have to _ some warm clothes. You should drink enough water. Don't wait to be _ . You'd better take some water so that you can have a drink when you want to drink. You should write down all the travel _ : departure  and arrival time, bus or train number, your parents' names , address and phone number and so on. You should take a _ . You can take lots of photos when you see beautiful scenery. When you come back, you can show the pictures to your friends. Above all, _ yourself when you are travelling. But please look after yourself and your things carefully.", 
    "options": [
        [
            "idea", 
            "advice", 
            "name", 
            "time"
        ], 
        [
            "before", 
            "after", 
            "while", 
            "as"
        ], 
        [
            "in", 
            "by", 
            "on", 
            "at"
        ], 
        [
            "water", 
            "drink", 
            "food", 
            "medicine"
        ], 
        [
            "not", 
            "won't", 
            "doesn't", 
            "don't"
        ], 
        [
            "difficult", 
            "different", 
            "expensive", 
            "delicious"
        ], 
        [
            "make", 
            "get", 
            "find", 
            "put"
        ], 
        [
            "raincoat", 
            "bag", 
            "box", 
            "umbrella"
        ], 
        [
            "take", 
            "carry", 
            "bring", 
            "have"
        ], 
        [
            "hungry", 
            "sad", 
            "happy", 
            "thirsty"
        ], 
        [
            "kind", 
            "way", 
            "information", 
            "place"
        ], 
        [
            "radio", 
            "TV", 
            "computer", 
            "camera"
        ], 
        [
            "enjoy", 
            "help", 
            "forget", 
            "report"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "D", 
        "D", 
        "C", 
        "A", 
        "D", 
        "A", 
        "D", 
        "C", 
        "D", 
        "A"
    ], 
    "source": "middle549"
}