{
    "article": "Making friends is a skill. Like most skills, it gets better with _ .  If you want to make friends, you must do _ for it. Join a club or a group. Talking with those who like the same things as you do is much _ .\nMany people are  nervous when talking to people.  After all, meeting _ means facing the unknown .  And it's human nature to feel a bit _ about the unknown.\nMost of our fears about dealing with new people come from doubts about ourselves. We _  other people are judging us, finding us too tall or too short, too thin or too fat. But don't forget that they must be feeling the _ way. Try to accept yourself as you are, and try to put the other person at ease. In this way you'll feel comfortable.\nTry to be self-confident even if you don't feel that way when you enter a room full of strangers such as a big hall, walk straight in, look at people in the eye and _ . If you see someone you'd like to say something to, don't wait for the other person to start a conversation. Talk about the things you like and do best. People will be _ in you if there's something good about you.\nThere are many ways to make friends. Just remember, it's hard to make friends if you stay at home alone. It takes _ and effort to develop friendship.", 
    "options": [
        [
            "practice", 
            "money", 
            "girls", 
            "everything"
        ], 
        [
            "nothing", 
            "anything", 
            "something", 
            "everything"
        ], 
        [
            "easy", 
            "easier", 
            "easily", 
            "hard"
        ], 
        [
            "teachers", 
            "strangers", 
            "classmates", 
            "relatives"
        ], 
        [
            "dangerous", 
            "hopeless", 
            "unhappy", 
            "uncomfortable"
        ], 
        [
            "believe", 
            "imagine", 
            "afraid", 
            "find"
        ], 
        [
            "different", 
            "same", 
            "other", 
            "another"
        ], 
        [
            "cry", 
            "laugh", 
            "smile", 
            "speak"
        ], 
        [
            "exciting", 
            "excited", 
            "interesting", 
            "interested"
        ], 
        [
            "time", 
            "hope", 
            "money", 
            "People"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "B", 
        "B", 
        "D", 
        "B", 
        "B", 
        "C", 
        "D", 
        "A"
    ], 
    "source": "middle1994"
}