{
    "article": "The bell for class rang. All the students took out their  _  , waiting for the teacher. Our Chinese teacher, Miss Liu, had told us before that we were going to write a composition  _  class. A minute passed, and another,  _  the teacher didn't appear. We began to wonder what the matter with her was. Was she ill? Or had she forgotten about the class?  _  could tell. Soon some students began to study other subjects, some students began to talk and even made  _  . About ten minutes later, the door opened and Miss Liu  at last  came in, smiling. She didn't say sorry to the class. We felt  a little  angry. The teacher often told us never to be late for class and said it was  _  manners to be late. She also said that if we were late, we should make an apology  either  at once or after class. But now she was late and had kept the whole class waiting for such a long time and didn't even tell us the reason. It was unfair. At this moment, Miss Liu picked up a piece of chalk and  _  \"Teacher IsLate\" on the blackboard and said that was the topic of our composition today. All of us smiled and understood what the teacher meant.", 
    "options": [
        [
            "desks", 
            "seats", 
            "books", 
            "chairs"
        ], 
        [
            "at", 
            "in", 
            "on", 
            "to"
        ], 
        [
            "but", 
            "and", 
            "or", 
            "so"
        ], 
        [
            "Somebody", 
            "Everybody", 
            "Anybody", 
            "Nobody"
        ], 
        [
            "voices", 
            "sounds", 
            "noises", 
            "notes"
        ], 
        [
            "good", 
            "bad", 
            "nice", 
            "fine"
        ], 
        [
            "read", 
            "wrote", 
            "spoke", 
            "said"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "A", 
        "D", 
        "C", 
        "B", 
        "B"
    ], 
    "source": "middle946"
}