{
    "article": "If you have seen the short play \"I've got much money \", you must have been impressed by the way Xiao Shenyang dressed _ . The dress he wore is called the kilt . There is a famous _ in Scotland. It says, \" A man in s kilt is a man and a half.\" This saying shows how _ the kilt is for Scottish people. The kilt is a special dress. Most Scottish men _ it. Why do Scottish men wear _ and what's the history of this special dress?\nIt's said that in the 16thcentury, the Scottish highlands were _ , so the roads were always full of mud . The mud made it very difficult for soldiers to _ around. Slowly people found that the soldiers in kilts could move more _ than those in trousers because kilts were much more flexible . What's more, soldiers could use the kilts on cold nights _ a blanket.\nIn modern times, the kilt stands for Scottish pride. People wear kilts for _ events, weddings and traditional sporting events, for example. But that's not all. The colors of a kilt also show a person's _ history. Each Scottish family has a different pattern. So a Scotsman is wearing not only the national dress of his country, _ the pride of his family.\nToday, fashion designers are trying to make the kilt _ more modern and fashionable to catch more eyes. Besides cloth, the designers are trying some _ materials such as paper and leather .", 
    "options": [
        [
            "himself", 
            "him", 
            "his", 
            "he"
        ], 
        [
            "word", 
            "saying", 
            "sentence", 
            "conversation"
        ], 
        [
            "serious", 
            "important", 
            "comfortable", 
            "interesting"
        ], 
        [
            "sell", 
            "dress", 
            "wear", 
            "make"
        ], 
        [
            "jackets", 
            "shirts", 
            "trousers", 
            "kilts"
        ], 
        [
            "dry", 
            "wet", 
            "wide", 
            "narrow"
        ], 
        [
            "lie", 
            "rest", 
            "move", 
            "sleep"
        ], 
        [
            "slow", 
            "slowly", 
            "quick", 
            "quickly"
        ], 
        [
            "of", 
            "as", 
            "with", 
            "for"
        ], 
        [
            "small", 
            "unimportant", 
            "special", 
            "difficult"
        ], 
        [
            "country", 
            "work", 
            "education", 
            "family"
        ], 
        [
            "but", 
            "and", 
            "or", 
            "yet"
        ], 
        [
            "feel", 
            "smell", 
            "look", 
            "sound"
        ], 
        [
            "other", 
            "another", 
            "others", 
            "else"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "B", 
        "C", 
        "D", 
        "B", 
        "C", 
        "D", 
        "B", 
        "C", 
        "D", 
        "A", 
        "C", 
        "A"
    ], 
    "source": "middle1919"
}