{
    "article": "Mr. Hamel now picked up a French grammar book and started to teach. It all seemed so _ during that last lesson. I understood all the participles which Mr. Hamel explained.\n\" _ didn't French seem so interesting before?\" I asked myself.\nBut I knew the answer. It was my last French lesson, and I regretted not studying hard before. I _ to listen very carefully. Mr. Hamel was trying to teach us everything he knew. He had never taught a lesson so well before.\nThe grammar lesson finished, and then we started _ . I had never seen so many hardworking students before. Everyone had their _ down, and the sound of pens on paper was the only sound to be heard.\nStudents were usually distracted  by even the smallest thing. However, when some beetles flew into the classroom, not one student looked at them today. It was very _ .\nI looked at Mr. Hamel. He was sitting still in his chair. The only things he _ were his eyes. He looked carefully at one thing in the classroom for a while _ looking at the next thing. For forty years, the only classroom was like his _ , and now it was being taken from him.\nMr. Hamel looked at all of the walls, windows, desks, and chairs _ we were working hard. I was sure he wanted to remember everything like it was now.", 
    "options": [
        [
            "difficult", 
            "easy", 
            "common", 
            "great"
        ], 
        [
            "Why", 
            "Who", 
            "Where", 
            "When"
        ], 
        [
            "went", 
            "began", 
            "expected", 
            "Continued"
        ], 
        [
            "listening", 
            "speaking", 
            "reading", 
            "writing"
        ], 
        [
            "heads", 
            "hands", 
            "pens", 
            "books"
        ], 
        [
            "impossible", 
            "excellent", 
            "unusual", 
            "valuable"
        ], 
        [
            "moved", 
            "closed", 
            "opened", 
            "noticed"
        ], 
        [
            "without", 
            "before", 
            "about", 
            "after"
        ], 
        [
            "courage", 
            "dream", 
            "home", 
            "country"
        ], 
        [
            "because", 
            "unless", 
            "whatever", 
            "while"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "D", 
        "D", 
        "A", 
        "C", 
        "A", 
        "B", 
        "C", 
        "D"
    ], 
    "source": "middle1553"
}