{
    "article": "Not everyone has the chance to be a detective. But I ever got one when I was thirteen years old. It happened in 1988.\nOne afternoon, I was walking down the street when I saw my _ new car. I expected to see my father, but to my _ , I saw a young woman driving instead. \"She stole my father's car,\" I thought. So I quickly stopped a _ and got in. I said to the driver, \"Follow that new car in front . \" And I told him why.\nThe taxi driver had a car telephone, and I asked him to _ the police. Soon we heard the _ of a police car and its loudspeaker. The policeman told the woman to _ her car. Our car came to a stop, too. I got out right then and said to the woman, \"It's not _ car. It's my father's.\"\nThe woman _ and said, \"Oh. You're Mr Jackson's son, right? I've once seen your photo at your father's _ .\"\nBefore I could say _ word, the woman explained that she was my father's new assistant. My father had asked her to take his computer to the shop to have it _ . he lent her his car. After hearing her words, we called my father and he told us what she said was _ . the police and the taxi driver laughed. I _ very sorry. It was both the first time and the last time for me to work as a detective. Don't you think my story funny?", 
    "options": [
        [
            "mother's", 
            "father's", 
            "aunt's", 
            "own"
        ], 
        [
            "joy", 
            "way", 
            "surprise", 
            "surprised"
        ], 
        [
            "taxi", 
            "bus", 
            "car", 
            "bike"
        ], 
        [
            "tell", 
            "call", 
            "say", 
            "ask"
        ], 
        [
            "noise", 
            "voice", 
            "cry", 
            "sound"
        ], 
        [
            "leave", 
            "take", 
            "stop", 
            "start"
        ], 
        [
            "my", 
            "your", 
            "mother's", 
            "father's"
        ], 
        [
            "smiled", 
            "frightened", 
            "worried", 
            "refused"
        ], 
        [
            "home", 
            "car", 
            "office", 
            "book"
        ], 
        [
            "another", 
            "other", 
            "else", 
            "others"
        ], 
        [
            "washed", 
            "repaired", 
            "found", 
            "seen"
        ], 
        [
            "wrong", 
            "interesting", 
            "boring", 
            "true"
        ], 
        [
            "felt", 
            "sounded", 
            "fell", 
            "looked"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "B", 
        "D", 
        "C", 
        "B", 
        "A", 
        "C", 
        "A", 
        "B", 
        "D", 
        "A"
    ], 
    "source": "middle1952"
}