{
    "article": "Have you ever complained why life is so tiring? Does the sky sometimes  _  dark to you? Are your lessons sometimes not successful? Well, friends, cheer up and  _  all the time. If you see the world with your warm heart, you will find the whole world smiling to you.. Not long ago, a friend of mine decided to read a lot of books to get  more  knowledge. So he went to the library and  _  happily with several books. But after a few days, he felt bored. The idea of finishing all of the books seemed  _  , because it was  _  for him to sit quietly to read a whole book. He didn't know what to do. Then one day, he suddenly thought of \"Why not make reading fun?\" It gave him  _  again. Reading is a journey of spirit . Every time when we  _  a book, we are actually talking  _  the writer. Since then, he tried to spend more time reading books, so he could feel all of the writer's happiness and sadness. And reading is  no longer  boring, but kind of interesting. Attitude can make a great  _  . Someone once said, \"  Even though  the situation is bad, people are free to choose their attitude.\" So, don't complain about the situation. It helps  _  . For example, one day the weather is fine. You and your friends want to go for a picnic. Just before you go, it suddenly starts to rain. Maybe you would feel very  _  and start to complain about the weather. But dear friends, why don't you sit down and listen to the free concert that the nature brings you? And with the timely rain, crops in the fields will grow better and farmers will have a good harvest . Attitude decides everything. With an optimistic attitude, life is easy and happy. Let's smile to  _  we meet and the whole world will smile to us.", 
    "options": [
        [
            "seem", 
            "taste", 
            "sound", 
            "smell"
        ], 
        [
            "cry", 
            "smile", 
            "complain", 
            "shout"
        ], 
        [
            "sang", 
            "jumped", 
            "returned", 
            "danced"
        ], 
        [
            "easy", 
            "unnecessary", 
            "possible", 
            "impossible"
        ], 
        [
            "hard", 
            "interesting", 
            "happy", 
            "easy"
        ], 
        [
            "money", 
            "hope", 
            "time", 
            "knowledge"
        ], 
        [
            "buy", 
            "borrow", 
            "read", 
            "write"
        ], 
        [
            "on", 
            "about", 
            "of", 
            "with"
        ], 
        [
            "decision", 
            "difference", 
            "discussion", 
            "problem"
        ], 
        [
            "nothing", 
            "anything", 
            "everything", 
            "something"
        ], 
        [
            "comfortable", 
            "nervous", 
            "sad", 
            "happy"
        ], 
        [
            "wherever", 
            "whenever", 
            "however", 
            "whatever"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "C", 
        "D", 
        "A", 
        "B", 
        "C", 
        "D", 
        "B", 
        "A", 
        "C", 
        "D"
    ], 
    "source": "middle1621"
}