{
    "article": "Early every morning, my husband kissed the baby, said goodbye to me and then rushed out of the door, into his busy day. And then I fed my baby and it fell fast  _  . Usually I would lay the baby in bed and quickly have the house in  _  . This morning, however, I sat down, just  _  , with the baby in my arms. The thoughts ran into memories of the mornings with my husband-------a father rushing out of the door to meet the obligations of life. Suddenly, I thought of my own  _  . My mother  passed away  when I was ten. As I looked back, I could see how faithful my dad was. He worked hard to support our family alone. He provided food, clothing, warmth, and  _  . Every time we were in danger, he would try his best to keep us safe. After making the baby comfortable, I dialed my  _  telephone number. I had just realized the  _  of the ordinary daily life going on around us. And we often took it for granted , and it needed to be recognized . \"Hi, Dad.\" I said, holding back tears . \"Hey, how are you?\",  _  was in his voice. \"Fine, I'm just  _  to say... thank you.\" I said it out before my throat tightened too much for me to  _  . \"What for?\" \"For getting up and going to work every morning of my life. Now that I have my own child and I see my husband doing  the same  , I just wanted to thank you for being faithful.\" There was silence for a moment before my dad tried to keep  _  . After a while, he said with a small shaking in his voice, \"You're welcome, Bud.\" I don't remember much of the rest of the call,  _  I will never forget that moment of revelation about my father. Since then, I have realized that those ordinary everyday fathers are the true heroes in life. I'm  _  that my father was one of them.", 
    "options": [
        [
            "sleepy", 
            "asleep", 
            "hungry", 
            "thirsty"
        ], 
        [
            "use", 
            "line", 
            "order", 
            "fashion"
        ], 
        [
            "thinking", 
            "dreaming", 
            "imagining", 
            "expecting"
        ], 
        [
            "child", 
            "father", 
            "mother", 
            "family"
        ], 
        [
            "protection", 
            "help", 
            "family", 
            "money"
        ], 
        [
            "husband's", 
            "baby's", 
            "mother's", 
            "father's"
        ], 
        [
            "difference", 
            "importance", 
            "balance", 
            "confidence"
        ], 
        [
            "sadness", 
            "stress", 
            "sorry", 
            "love"
        ], 
        [
            "emailing", 
            "arriving", 
            "calling", 
            "flying"
        ], 
        [
            "say", 
            "talk", 
            "tell", 
            "speak"
        ], 
        [
            "silent", 
            "worried", 
            "calm", 
            "excited"
        ], 
        [
            "and", 
            "but", 
            "or", 
            "nor"
        ], 
        [
            "surprised", 
            "afraid", 
            "thankful", 
            "angry"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "B", 
        "A", 
        "D", 
        "B", 
        "D", 
        "C", 
        "D", 
        "C", 
        "B", 
        "C"
    ], 
    "source": "middle224"
}