{
    "article": "I was the tallest girl in my class when I started school. It made me feel  _  and I believed that I looked very fat and ugly. The small girls were seen as smarter, so they were more popular and got more  _  from teachers. I began to hate myself  _  not being small when I was seven years old, and by adulthood, I felt sad about my appearance.\nI didn't dare to look into the mirror  _  one day my friend pulled me to the mirror to let me see that I had a good figure. It's true that I was in good shape. Then I did something kind for  _ --I bought a beautiful dress for myself. I felt very happy! Happiness wasn't a part of my life as I was too busy  _  others. I always thought following others could make me more popular. But it's hard to be happy when you don't see your own  _ .\nEach small kindness to me made me  _  myself more. I'd do something loving and feel happier, which made me want to do  _ . That focus on myself  grew into  deep self-love.\nToday my self-love is very  _ .It has helped me develop self-confidence and led me to  _  myself from an unhappy school teacher to a popular writer. Now I see myself  _  a very beautiful woman. I have a wonderful body without losing  losing weight .\nPlease join me in taking steps to develop self-love. Every little loving act you do for yourself helps you build  _ .", 
    "options": [
        [
            "happy", 
            "bad", 
            "good", 
            "hungry"
        ], 
        [
            "attention", 
            "homework", 
            "stress", 
            "help"
        ], 
        [
            "of", 
            "to", 
            "for", 
            "with"
        ], 
        [
            "after", 
            "unless", 
            "while", 
            "until"
        ], 
        [
            "her", 
            "him", 
            "you", 
            "myself"
        ], 
        [
            "hating", 
            "pleasing", 
            "believing", 
            "fooling"
        ], 
        [
            "clothes", 
            "fears", 
            "needs", 
            "shoes"
        ], 
        [
            "doubt", 
            "hate", 
            "worry", 
            "love"
        ], 
        [
            "more", 
            "less", 
            "nothing", 
            "little"
        ], 
        [
            "weak", 
            "little", 
            "strong", 
            "strange"
        ], 
        [
            "teach", 
            "change", 
            "enjoy", 
            "leave"
        ], 
        [
            "for", 
            "as", 
            "like", 
            "with"
        ], 
        [
            "health", 
            "self-love", 
            "dream", 
            "shape"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "D", 
        "D", 
        "B", 
        "C", 
        "D", 
        "A", 
        "C", 
        "B", 
        "B", 
        "B"
    ], 
    "source": "middle1579"
}