{
    "article": "It was a cold winter's night. It was getting late and l was tired so I went to bed.\nAt about two in the morning my phone began to ring. It was from Mum. I started to feel frightened, because she only _ if something was wrong.1 lived in the same flat as Mum, _ I rushed down to see what was wrong.\nThe door would not open. Everything was running through my mind including Mum could be dying and I could not get into her flat. I went around to her bedroom window and could see Mum on the floor. She had heard me and _ to unlock the door painfully.\nThen I entered the flat and what I saw was terrible. I could see Mum's leg was badly broken and it was completely _ the wrong way. I rang the ambulance  and while we were waiting I tried to make Mum comfortable.\nThe ambulance finally arrived and I _ it. It was a cold freezing night. The roads were empty and _ . It seemed that everything was going in a slow way.\nWe arrived at the hospital and rushed into A&E. The doctor told me that Mum would need an _ the next day. After Mum fell asleep, I went home to get some sleep.\nWhen I rang the hospital the next morning, Mum had gone to the operating room. Everything was racing through my head. Is she OK? Will she be safe? Would she _ it through the operation? Finally that day she was fine. My mum is a very _ lady and I am so proud of her.\nFrom this I have learned that you should never take family for granted , _ everyday  every moment you have with them because in my mind family is the most important thing you will ever be a part of, so never, ever forget what you have.", 
    "options": [
        [
            "waited", 
            "wondered", 
            "rang", 
            "cared"
        ], 
        [
            "but", 
            "so", 
            "unless", 
            "because"
        ], 
        [
            "afforded", 
            "offered", 
            "allowed", 
            "managed"
        ], 
        [
            "meeting", 
            "facing", 
            "receiving", 
            "allowing"
        ], 
        [
            "followed", 
            "missed", 
            "ordered", 
            "passed"
        ], 
        [
            "safe", 
            "clean", 
            "quiet", 
            "free"
        ], 
        [
            "experience", 
            "excitement", 
            "experiment", 
            "operation"
        ], 
        [
            "test", 
            "make", 
            "push", 
            "cut"
        ], 
        [
            "brave", 
            "lonely", 
            "weak", 
            "serious"
        ], 
        [
            "trust", 
            "expect", 
            "find", 
            "enjoy"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "D", 
        "B", 
        "A", 
        "C", 
        "D", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "middle1955"
}