{
    "article": "Mr. Klein told the class that a new student, Inez, would join them soon. He  _  that Inez was deaf. She \"talked\" with others by using sign language. Mr. Klein knew sign language, and he decided to teach his students so that they could also \"talk\" with Inez. First, they learned to sign the letters. Some letters were hard to  _  . Other letters, such as C, were easier because the shape of the hand was the same as the shape of the letter. The next thing they learned was finger spelling. They signed one letter after another to spell a word. They  _  with two-letter words such as at and on. Then they spelled  _  words. Finally, Mr. Klein showed that  _  one sign could be used for a whole word. To make the sign for the word fine, a person spreads out the fingers on one hand,  _  the thumb to the chest, and moves the hand away from the chest. Signing is not just  _  with the hands. Expressions on the face are also  _  . The students learned to sign a question mark by using expressions on the face. When Inez first entered the classroom, she looked  _  . But the students signed, \"Good morning, Inez.\" She gave the class a big smile and signed back, \"What a wonderful  _  !\"", 
    "options": [
        [
            "hoped", 
            "said", 
            "guessed", 
            "thought"
        ], 
        [
            "spell", 
            "check", 
            "remember", 
            "write"
        ], 
        [
            "met", 
            "started", 
            "agreed", 
            "helped"
        ], 
        [
            "newer", 
            "easier", 
            "longer", 
            "nice"
        ], 
        [
            "never", 
            "perhaps", 
            "still", 
            "just"
        ], 
        [
            "joins", 
            "fixed", 
            "touches", 
            "ties"
        ], 
        [
            "made", 
            "done", 
            "given", 
            "chosen"
        ], 
        [
            "important", 
            "different", 
            "difficult", 
            "strange"
        ], 
        [
            "serious", 
            "surprised", 
            "frightened", 
            "nervous"
        ], 
        [
            "welcome", 
            "congratulation", 
            "progress", 
            "success"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "B", 
        "C", 
        "D", 
        "C", 
        "B", 
        "A", 
        "D", 
        "A"
    ], 
    "source": "middle687"
}