{
    "article": "Tom woke up on Monday morning. He felt  _  . He always felt sick on Monday mornings. He had to go to school for a  _  week! He almost wished there were no week-ends.  It  was even more difficult for him to go back to school! He  _  in bed and wondered what excuse he could make this time. He looked at his body, but could find  _  wrong, A little headache?  _  . He had used that excuse many times. Then he realized that one of his teeth was loose . Good! He was just going to start groaning  _  he thought that Aunt Polly would pull the tooth out. That would  hurt  ! He looked for something else. Suddenly he remembered what the doctor had said about a certain problem with toes. He pulled his right foot out and looked at it.  _  of the toes was really hurting, Tom began to groan. \"What's  _  with you?\" Aunt Polly asked. \"My toe hurts.\" The old lady fell into a chair,  _  a little. \"Tom, you frightened me. Now shut up at once and get out of  _  .\" Tom felt like a thief being caught. \"Well, it seemed all right. It hurt so much  _  I forgot my tooth.\" \"Tooth, eh? What's wrong with your tooth?\" \"One of them is loose and it hurts  _  .\" \"No problem,\" answered Aunt Polly. \"I can pull it out.\" \"Please, Auntie! Don't pull it out. It has  _  hurting now. Please!\" \"No way! Well, you'll have your tooth out and you'll go to school?", 
    "options": [
        [
            "happy", 
            "tired", 
            "sick", 
            "hungry"
        ], 
        [
            "whole", 
            "all", 
            "next", 
            "this"
        ], 
        [
            "lie", 
            "lay", 
            "lied", 
            "lying"
        ], 
        [
            "something", 
            "anything", 
            "everything", 
            "nothing"
        ], 
        [
            "No", 
            "Yes", 
            "None", 
            "Great"
        ], 
        [
            "then", 
            "when", 
            "while", 
            "as"
        ], 
        [
            "One", 
            "Two", 
            "Some", 
            "Many"
        ], 
        [
            "matter", 
            "trouble", 
            "problem", 
            "wrong"
        ], 
        [
            "saying", 
            "smiling", 
            "shouting", 
            "talking"
        ], 
        [
            "school", 
            "chair", 
            "bed", 
            "kitchen"
        ], 
        [
            "what", 
            "which", 
            "that", 
            "until"
        ], 
        [
            "bad", 
            "badly", 
            "worse", 
            "terrible"
        ], 
        [
            "stopped", 
            "forgotten", 
            "enjoyed", 
            "begun"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "B", 
        "D", 
        "A", 
        "B", 
        "A", 
        "D", 
        "B", 
        "C", 
        "C", 
        "B", 
        "A"
    ], 
    "source": "middle1387"
}