{
    "article": "In front of my daughter Sindu was a bowl filled with cabbage. She  _  cabbage. She sat there in silence with tears in her eyes. \"Sindu, darling, why don't you  _  a little? Your Mom will shout at me.\" Sindu wiped her tears with the back of her hand. \"OK, Dad. I'll eat, just a  _  .\" Then Sindu said: \"Dad, if I eat it all, will you give me what I want?\" \"Yes, within reason.\"  _  she began to eat. It took her almost half an hour to finish the  _  . Then she came up to me and said: \"Dad, I want to have my head shaved !\" \"Sindu, why don't you  ask for  something else? If we see you with a clean-shaved head, we will be  _  ,\" I said. \"But, Dad, you  _  ! Now, you are going back on your words.\" I had to  _  my promise. Sindu had all her hair cut off. She looked beautiful On Monday morning, I took her to school. Just as we  _  , a boy got out of a car, and shouted, \"Sindu, please wait for me!\" Guess what? The boy had  _  hair either. \"Sir, your daughter is  _  !\" A man got out of the car and said, \"That boy is my son Harish. He has cancer. He lost his hair  _  he got ill. Sindu cut hers off, so Harish would feel less  _  . She's a special girl.\" I stood for a while, then said \"My little girl, you are  _  me how selfless real love is!\"", 
    "options": [
        [
            "liked", 
            "enjoyed", 
            "hated", 
            "cooked"
        ], 
        [
            "cook", 
            "cut", 
            "ask", 
            "eat"
        ], 
        [
            "few", 
            "little", 
            "moment", 
            "lot"
        ], 
        [
            "Luckily", 
            "Slowly", 
            "Easily", 
            "Happily"
        ], 
        [
            "food", 
            "homework", 
            "game", 
            "talk"
        ], 
        [
            "happy", 
            "sad", 
            "funny", 
            "excited"
        ], 
        [
            "said", 
            "understood", 
            "promised", 
            "proved"
        ], 
        [
            "make", 
            "break", 
            "change", 
            "keep"
        ], 
        [
            "arrived", 
            "met", 
            "left", 
            "drove"
        ], 
        [
            "much", 
            "no", 
            "thick", 
            "short"
        ], 
        [
            "great", 
            "silly", 
            "weak", 
            "strange"
        ], 
        [
            "before", 
            "and", 
            "so", 
            "when"
        ], 
        [
            "different", 
            "strong", 
            "dangerous", 
            "important"
        ], 
        [
            "giving", 
            "offering", 
            "teaching", 
            "advising"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "B", 
        "B", 
        "A", 
        "B", 
        "C", 
        "D", 
        "A", 
        "B", 
        "A", 
        "D", 
        "A", 
        "C"
    ], 
    "source": "middle271"
}