{
    "article": "It was unusually quiet in the emergency room on December 25. I was the nurse on duty that day. I didn't think there would be any patients. Just then five bodies  showed up  at my desk, a pale woman and four small children. \"Are you all sick?\" I asked. \"Yes,\" she said  _  , lowering her head. But when they described their problems, things got a little strange. Two of the children had headaches, but they didn't show any  _  of headaches at all. Two children had earaches, but only one could tell me which ear was affected. The mother  _  of a cough but seemed to work to produce it. I didn't say anything,  _  I explained that they might wait for a little while before a doctor saw her. She answered, \"Take your time; it's warm here.\" I checked the chart after another nurse had finished registering the family. No  _  --they were homeless. The waiting room was warm. I looked at the family by the Christmas tree. The littlest one was pointing at the television and saying something to her mother. The oldest one was looking at lights on the Christmas tree. I went back to the nurses' station and mentioned we had a homeless family in the waiting room. The nurses who felt bored with  _  Christmas, turned to compassion( for the family just trying to get warm on Christmas. The team went into action. We began to prepare a party for our Christmas  _  . We needed presents. We put together oranges and apples in a basket. We collected from different departments candies, crayons and other things available that could be presents.  _  , as the family walked to the door to leave, the four-year-old child came running back, gave me a hug and  _  , \"Thanks for being our angels today.\"", 
    "options": [
        [
            "excitedly", 
            "loudly", 
            "weakly", 
            "strongly"
        ], 
        [
            "systems", 
            "signs", 
            "symbols", 
            "secrets"
        ], 
        [
            "explained", 
            "expressed", 
            "complained", 
            "compared"
        ], 
        [
            "and", 
            "but", 
            "or", 
            "so"
        ], 
        [
            "address", 
            "age", 
            "name", 
            "money"
        ], 
        [
            "amazing", 
            "working", 
            "interesting", 
            "surprising"
        ], 
        [
            "nurses", 
            "doctors", 
            "guests", 
            "patients"
        ], 
        [
            "Soon", 
            "Suddenly", 
            "Later", 
            "However"
        ], 
        [
            "screamed", 
            "jumped", 
            "whispered", 
            "replied"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "C", 
        "B", 
        "A", 
        "B", 
        "C", 
        "C", 
        "C"
    ], 
    "source": "middle519"
}