{
    "article": "It is two months since MH730 first went missing in the early hours of March 8 , while flying from Kuala Lumpur to Beijing. Malaysia Airlines said it was terribly sorry that MH370 ended in the southern Indian Ocean. People are losing hope that the passengers on the  _  could return alive and realize they should know how to save themselves when accidents like this happen in the air.  _  1985, an Australia professor, Ed Galea, has interviewed 2,000 survivors of 105 airplane accidents, searching for the keys to survival (n.) and found out  _  golden rules after years of research. First, make sure that the airline does not keep your family members too far away on the plane, if you are traveling in family group.  _  ? It's natural that while feeling in danger, you'll probably want to meet the family before you can calmly move out. Second, how do you untie your seat belt on a plane? By lifting a latch.  _  you can't untie your seat belt, you can hardly run away and your chances of survival will drop. Third, the  _  to the exits , the more likely you are to survive. Count exactly how many rows you are from the nearest two exits. Why two exits? Because this helps you find at least  _  even in the sudden dark during an accident. Fourth, we would be safer if airline seats faced backward, according to Galea's research. But the problem is that most of the passengers  don't like  traveling with their back facing the direction of travel. Fifth, \"Smoke is dangerous to your health. If you take in too much of it, your will die,\" explains Galea. You must learn how to use a smoke mask. Without the knowledge of putting on a mask, you'll  _  time trying to put it on--time that could be used to run away. At last, listen to the flight attendants before flying and look  _  at everything shown on a video or a safety card. Always be prepared. Good luck to you.", 
    "options": [
        [
            "train", 
            "plane", 
            "bus", 
            "ship"
        ], 
        [
            "In", 
            "From", 
            "Since", 
            "On"
        ], 
        [
            "four", 
            "five", 
            "six", 
            "seven"
        ], 
        [
            "Who", 
            "How", 
            "When", 
            "Why"
        ], 
        [
            "Unless", 
            "If", 
            "Until", 
            "After"
        ], 
        [
            "close", 
            "closer", 
            "far", 
            "farther"
        ], 
        [
            "all", 
            "them", 
            "one", 
            "both"
        ], 
        [
            "save", 
            "have", 
            "waste", 
            "enjoy"
        ], 
        [
            "careful", 
            "carefully", 
            "careless", 
            "carelessly"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "C", 
        "D", 
        "B", 
        "B", 
        "C", 
        "C", 
        "B"
    ], 
    "source": "middle2123"
}