{
    "article": "Andi Davise, a 49-year-old woman liked hiking. She crossed the trail through the Phoenix Mountains Preserve with a few other hikers as usual. But this morning, she met _ and heard only the sounds of the animals.\nAfter a while, she reached the steep slope  , she climbed up to the top _ her hands. When she finally got to the top of the mountain, she _ a dark shape several inches from her left foot. She was _ and then looked carefully. \"It's a dog and it's dead,\" she said to herself. It took her a few seconds to realize that the dog's eyes were _ . She greeted in a low and soft _ to show she was friendly. The bull dog shook when he heard her.\nAndi inched  _ and dropped some water into the dog's mouth. He tried to stand up but failed. Something was wrong with his left _ . Andi pulled out her phone to contact her husband, Jason, _ , he didn't notice it. She knew that if she didn't carry the dog _ the mountain, he would die.\nAndi had _ trouble going down the steep, rocky mountainside with the 50-pound animal in her arms. Even her arms and back started aching, she didn't give up. The trip up _ 30 minutes while going back down took twice that.\nAndi's _ received her messages at last. He and their son, Justin, jumped into the car and _ to pick up Andi.\nLater that morning, an X-ray showed that the bull dog was badly hurt, he was likely to _ his left leg. A few days later, the Davises returned to the animal hospital. They named the dog Elijah and brought him home that day.", 
    "options": [
        [
            "nobody", 
            "everybody", 
            "anybody", 
            "somebody"
        ], 
        [
            "making", 
            "using", 
            "having", 
            "thinking"
        ], 
        [
            "knew", 
            "heard", 
            "noticed", 
            "looked"
        ], 
        [
            "satisfied", 
            "sad", 
            "excited", 
            "frightened"
        ], 
        [
            "open", 
            "closed", 
            "big", 
            "small"
        ], 
        [
            "sound", 
            "voice", 
            "noise", 
            "hearing"
        ], 
        [
            "faster", 
            "slower", 
            "closer", 
            "longer"
        ], 
        [
            "foot", 
            "eye", 
            "ear", 
            "leg"
        ], 
        [
            "however", 
            "but", 
            "so", 
            "yet"
        ], 
        [
            "up", 
            "down", 
            "left", 
            "right"
        ], 
        [
            "few", 
            "little", 
            "great", 
            "many"
        ], 
        [
            "paid", 
            "cost", 
            "spent", 
            "took"
        ], 
        [
            "husband", 
            "son", 
            "wife", 
            "daughter"
        ], 
        [
            "ran", 
            "drove", 
            "walked", 
            "jumped"
        ], 
        [
            "lose", 
            "lost", 
            "loss", 
            "miss"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "C", 
        "D", 
        "A", 
        "B", 
        "C", 
        "D", 
        "A", 
        "B", 
        "C", 
        "D", 
        "A", 
        "B", 
        "A"
    ], 
    "source": "middle1477"
}