{
    "article": "I get up at half past seven and get dressed for school. My school has a _ --black trousers and shoes, a white shirt and a black and gold tie. The girls wear the same, or they can _ a black skirt. Not all British schools have a uniform, but it's common here.\nI don't live far from the school, _ I walk there with my friends, Brian and Gemma. Lots of students _ the school bus or their parents drive them to school. On Mondays we all start the day _ a meeting in the school hall at eight fifty. The head teacher talks to us and gives us information about school events.\nThis year I've got nine subjects. We all study English, maths and science, and then we choose other _ .\nWe have 20 minutes for break in the morning and an hour for _ . Some students bring sandwiches to school for lunch, but my friends and I always eat in the _ room where you can get a hot meal every day.\nLessons _ at 4 o'clock in the afternoon, but on Mondays and Wednesdays I stay at school until five o'clock. There are lots of clubs and activities at our school.\nAt the end of the day I always spend two hours on _ --sometimes three hours, as we get lots of homework now.", 
    "options": [
        [
            "tradition", 
            "uniform", 
            "rule", 
            "habit"
        ], 
        [
            "borrow", 
            "make", 
            "wear", 
            "take"
        ], 
        [
            "so", 
            "however", 
            "because", 
            "but"
        ], 
        [
            "repair", 
            "wash", 
            "clean", 
            "catch"
        ], 
        [
            "at", 
            "in", 
            "on", 
            "with"
        ], 
        [
            "clothes", 
            "subjects", 
            "games", 
            "clubs"
        ], 
        [
            "lunch", 
            "breakfast", 
            "dinner", 
            "supper"
        ], 
        [
            "sitting", 
            "living", 
            "waiting", 
            "dining"
        ], 
        [
            "begin", 
            "end", 
            "continue", 
            "last"
        ], 
        [
            "events", 
            "clubs", 
            "homework", 
            "activities"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "D", 
        "D", 
        "B", 
        "A", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "middle839"
}