{
    "article": "Making the team Tick-tock. Tick-tock Andreas watched the clock moving very slowly. This was his last class of the day - biology. Usually, Andreas really liked biology. But today was  _  .Today there were tryouts for the basketball team after school There was only one thing that Andreas liked more. than biology: basketball: Because of the tryouts ,Andreas had been  _  for months. Tyrell had been Andreas's best friend since kindergarten. He was also trying out for the basketball team that afternoon. Andreas was glad he'd have his best friend by his  _  . Suddenly the bell rang and cIass was over. Andreas and Tyrell walked down to the gym: When they got there, Andreas's heart sank . There were at least 60 boys crowded there, but the basketball team only had  _  for 20 people. Andreas and Tyrell looked at each other. What if only one of them made the team? That would be  _  than not making the team at all. The coach blew a whistle and the tryouts began. Andreas and. Tyrell were separated into different groups. As soon as he  _  his hands on the basketball, Andreas felt better. This was why he loved the game. All the nights of practicing paid off as he took shots from the 3-point line. When the tryouts were over, the coach said he was posting a list of who made the team the next day before school. Andreas felt his stomach tighten. He knew he had played well ,  _  was it goo d enough? \"It's OK,\" said Tyrell. \"I'm sure you made it. I just don't know if I did.\" \" Playing on the basketball team wouldn't be any  _  without you,\" a little upset. They walked the rest of the way home in  _  . The next morning Andreas hurried to school and went to see the  _  . Tyrell's name was at the very top-----he had made it! But Andreas didn't see his name anywhere. \"Andreas!\" He heard Tyrell's happy voice. \"We  _  it!\" \"What do you mean?\" asked Andreas. \"My name's not on there.\" Tyrell  _  up the first sheet of paper and pointed to Andrea's name at the very top of the second sheet. They shouted and gave each other a high-five. They were going to be on the basketball team together. They shouted and gave each other a high-five. They were going to be on the basketball team together.", 
    "options": [
        [
            "difficult", 
            "different", 
            "interesting", 
            "terrible"
        ], 
        [
            "practicing", 
            "waiting", 
            "hoping", 
            "insisting"
        ], 
        [
            "group", 
            "seat", 
            "side", 
            "class"
        ], 
        [
            "names", 
            "work", 
            "room", 
            "areas"
        ], 
        [
            "weaker", 
            "'easier", 
            "happier'", 
            "worse"
        ], 
        [
            "spread", 
            "covered", 
            "showed", 
            "felt"
        ], 
        [
            "and", 
            "but", 
            "or", 
            "so"
        ], 
        [
            "success", 
            "trouble", 
            "fun", 
            "stress"
        ], 
        [
            "public", 
            "silence", 
            "person", 
            "sorrow"
        ], 
        [
            "list", 
            "page", 
            "wall", 
            "gym"
        ], 
        [
            "met", 
            "got", 
            "kept", 
            "made"
        ], 
        [
            "lifted", 
            "picked", 
            "put", 
            "Sent"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "C", 
        "D", 
        "D", 
        "B", 
        "C", 
        "B", 
        "A", 
        "D", 
        "A"
    ], 
    "source": "middle1857"
}