{
    "article": "Tonight I am more than happy to  read out  the winnersof the photo competition.We were very pleased with our competition thin year.  _  with other years,we received many more photos.Even though all off the photos are excellent,we are sorry to say that we cannot give prizes to everyone. The person  _  won the prize for the subject Nature is fifteen-year-old LiWei .Li took a photo of the trees in Xiangshan Park.His photo shows the different colours on the hill. The photo which we liked best in the City and People group was taken by ZhaoMin.ZhaoMin is only twelve years old.Her photo shows a person  _  across a street on na windy evening.It is beautiful girl who is wearing a blouse and skirt,and who is  _  her books  _  the showers. The best photo in the Music group was taken by HeZhong.His photo of the group Crazy Feet shows the singer,Becky Wang,and the band playing at a concert.HeZhong  manages to  show how this great new band moves and sounds,and the good time which their fans are having. A group of photos which show Beijing and Cambridge in England has won the prize  _  the subject Home and Away.They show some of the experiences of a young visitor to our country,and some memories of his home.The winner is Tony Smith! Congratulations to our winners and  thanks to  everyone who entered the competition.Now let's welcome our headmaster to  _  the prizes to the winners!", 
    "options": [
        [
            "Compare", 
            "Comparing", 
            "Compared", 
            "Compares"
        ], 
        [
            "which", 
            "who", 
            "where", 
            "when"
        ], 
        [
            "rushes", 
            "rushed", 
            "rushing", 
            "rush"
        ], 
        [
            "protects", 
            "protected", 
            "protecting", 
            "protect"
        ], 
        [
            "from", 
            "against", 
            "of", 
            "with"
        ], 
        [
            "for", 
            "to", 
            "in", 
            "with"
        ], 
        [
            "give", 
            "present", 
            "send", 
            "receive"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "C", 
        "C", 
        "B", 
        "A", 
        "B"
    ], 
    "source": "middle1273"
}