{
    "article": "Miracles will happen if you don't give up trying. Even if you have  _  for one hundred times, you may succeed when you try for the 10lst time. When I was born, my doctor told my mother that there was something wrong with my  _  . They were too soft to be able to walk. Although the news was bad, my mother didn't become  _  . She didn't believe what the doctor said  _  started to look for other ways. My mother kept looking for other doctors for me, and finally she  _  . The doctor and his team in the hospital did  _  they could to help me. They also asked my parents to teach me to do some  _  to help me walk. One day when my mother came to pick me  _  . I crawled towards her. She was so surprised and happy that she couldn't believe  _  eyes. Crawling was not walking, but it was a good  _  . Day by day, I could walk by myself. When I grew up, my mother  _  told me these stories. She said that if I thought of what she said whenever I met  _  , I could do anything successfully. I have been working hard and I have turned out to be a very  _  person. I get best  _  ), I live a  _  life now. What the story tells us, as my mother always says, is: Never give up.", 
    "options": [
        [
            "achieved", 
            "failed", 
            "suggested", 
            "told"
        ], 
        [
            "legs", 
            "hands", 
            "arms", 
            "eyes"
        ], 
        [
            "patient", 
            "confident", 
            "frustrated", 
            "proud"
        ], 
        [
            "or", 
            "and", 
            "if", 
            "because"
        ], 
        [
            "forgot", 
            "changed", 
            "succeeded", 
            "worked"
        ], 
        [
            "nothing", 
            "somewhere", 
            "anywhere", 
            "everything"
        ], 
        [
            "time", 
            "exercise", 
            "medicine", 
            "shopping"
        ], 
        [
            "away", 
            "from", 
            "into", 
            "up"
        ], 
        [
            "her", 
            "my", 
            "his", 
            "its"
        ], 
        [
            "advice", 
            "end", 
            "chance", 
            "start"
        ], 
        [
            "hardly", 
            "never", 
            "always", 
            "nearly"
        ], 
        [
            "dreams", 
            "experiments", 
            "jobs", 
            "difficulties"
        ], 
        [
            "excellent", 
            "dangerous", 
            "busy", 
            "special"
        ], 
        [
            "presents", 
            "friends", 
            "books", 
            "grades"
        ], 
        [
            "happy", 
            "sad", 
            "tired", 
            "boring"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "B", 
        "C", 
        "D", 
        "B", 
        "D", 
        "A", 
        "D", 
        "C", 
        "D", 
        "A", 
        "D", 
        "A"
    ], 
    "source": "middle2175"
}