{
    "article": "Mark was walking home from school one day when he saw a boy in front of him. The boy _ all of the books he was carrying, along with two sweaters, a baseball bat and a glove. Mark _ the boy pick the things up and they walked home together. As they walked, Mark learned that the boy's name was Bill. Bill loved video games, baseball and history, _ he was having trouble with some of his subjects in school.\nThey arrived at Bill's home first. Bill _ Mark in for a drink and to watch some television. The afternoon passed _ with some laughs and small talk. Then Mark went home.\nThey went on to see each other around school, had lunch together once or twice, then both graduated  from high school. Three weeks before graduation, Bill asked Mark if they could have a talk. Bill talked about the day years ago when they had _ met. \"Did you ever want to know _ I was carrying so many things home that day?\" asked Bill. \"You see, I cleaned out my locker  because I was going home to kill _ . But after we spent some time together talking and laughing, I got to know that if I had died, I would have missed out on   many good _ . So you see, Mark, when you picked up those books that day, in fact, you _ my life. I want to say 'thank you' to you, my dear friend.\"", 
    "options": [
        [
            "lost", 
            "dropped", 
            "gave", 
            "took"
        ], 
        [
            "asked", 
            "taught", 
            "helped", 
            "wanted"
        ], 
        [
            "but", 
            "instead", 
            "otherwise", 
            "because"
        ], 
        [
            "chose", 
            "offered", 
            "caught", 
            "invited"
        ], 
        [
            "easily", 
            "happily", 
            "sadly", 
            "clearly"
        ], 
        [
            "first", 
            "almost", 
            "never", 
            "already"
        ], 
        [
            "what", 
            "how", 
            "why", 
            "when"
        ], 
        [
            "us", 
            "you", 
            "me", 
            "myself"
        ], 
        [
            "times", 
            "games", 
            "books", 
            "lunches"
        ], 
        [
            "colored", 
            "saved", 
            "cared", 
            "decorated"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "D", 
        "B", 
        "A", 
        "C", 
        "D", 
        "A", 
        "B"
    ], 
    "source": "middle367"
}