{
    "article": "Some people think only school children do not agree with their parents, however, it is not true.  _  is a problem for parents and children of all ages. If it's hard for you to communicate with your  _  , don't worry about it. Here is some advice for you to bridge the generation gap . Don't argue with your parents. Don't get to your parents when you are  _  . Your parents probably won't  _  your ideas if you are shouting at them. And you can't express yourself  _  if you are angry. Go someplace to cool off. Make sure you understand why you are unhappy. Then think about what you want to  _  to your parents. If you don't think you can speak to them at the moment,  _  writing a letter. Try to reach an agreement. Sometimes you and your parents  _  on something. You can keep your disagreement and try your best to  _  each other. Michael's mother didn't agree with him about buying a motorcycle. They  _  over it. But they finally came to an agreement. Michael bought the motorcycle, but only  _  it on certain days. Of course, your parents might refuse to agree on something. In these  _  , it is especially  _  to show love and respect to them. Showing respect will keep your relationship with your parents strong. Talk about your  _  . The values of your parents are probably different from those of your own. Tell your parents what you  _  about, and why. Understanding your values might help them see your purposes in life. A good relationship with your parents can make you a better and happier person. It is worth having a try!", 
    "options": [
        [
            "Education", 
            "Communication", 
            "Presentation", 
            "Examination"
        ], 
        [
            "friends", 
            "teachers", 
            "parents", 
            "students"
        ], 
        [
            "surprised", 
            "excited", 
            "happy", 
            "angry"
        ], 
        [
            "consider", 
            "describe", 
            "cause", 
            "require"
        ], 
        [
            "loudly", 
            "clearly", 
            "excitedly", 
            "heavily"
        ], 
        [
            "speak", 
            "talk", 
            "tell", 
            "say"
        ], 
        [
            "keep", 
            "stop", 
            "try", 
            "finish"
        ], 
        [
            "disagree", 
            "agree", 
            "insist", 
            "work"
        ], 
        [
            "love", 
            "help", 
            "refuse", 
            "accept"
        ], 
        [
            "looked", 
            "turned", 
            "fought", 
            "argued"
        ], 
        [
            "drove", 
            "bought", 
            "borrowed", 
            "lent"
        ], 
        [
            "ways", 
            "places", 
            "situations", 
            "times"
        ], 
        [
            "interesting", 
            "surprising", 
            "difficult", 
            "important"
        ], 
        [
            "hobbies", 
            "interests", 
            "values", 
            "feelings"
        ], 
        [
            "know", 
            "care", 
            "learn", 
            "hear"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "D", 
        "A", 
        "B", 
        "D", 
        "C", 
        "A", 
        "D", 
        "D", 
        "A", 
        "C", 
        "D", 
        "C", 
        "B"
    ], 
    "source": "middle81"
}