{
    "article": "Some students cheat   _  they're busy or lazy and they want to get good grades without  _  the time studying. Other students might feel that they can't  _  the test without cheating. Even when there seems to be a \"good reason\" for cheating, it isn't a good  _ .\nA student who thinks cheating is the only way to pass a test  _  to talk with the teacher and his or her parents so they can find some better ways together. Talking about these problems and  _  them out will help feel better than cheating.\nIf a student gets caught  cheating, the teacher may give a \" _ \" on the test, send him or her to the head teacher's  _ , and call his or her parents. Worse than the  _  grade may be the feeling of having disappointed  those people,  like  parents and teachers. A parent may worry that you are not an  _  person and a teacher might watch you more  _  the next time you're taking a test.\nThere are lots of reasons why a kid shouldn't cheat, but some students have already cheated. If that's you, it's  _ too late to stop cheating. Cheating can become a  _ , but a student is always  _  to act better and make better decisions. It might help to talk the problem over with a parent, teacher, or friend.", 
    "options": [
        [
            "because", 
            "so", 
            "but", 
            "Although"
        ], 
        [
            "taking", 
            "spending", 
            "costing", 
            "using"
        ], 
        [
            "write", 
            "exercise", 
            "pass", 
            "expect"
        ], 
        [
            "idea", 
            "result", 
            "information", 
            "news"
        ], 
        [
            "decides", 
            "hopes", 
            "refuses", 
            "needs"
        ], 
        [
            "breaking", 
            "dreaming", 
            "missing", 
            "working"
        ], 
        [
            "prize", 
            "hundred", 
            "zero", 
            "treat"
        ], 
        [
            "office", 
            "school", 
            "seat", 
            "conversation"
        ], 
        [
            "impossible", 
            "dangerous", 
            "good", 
            "terrible"
        ], 
        [
            "good", 
            "hard-working", 
            "interesting", 
            "honest"
        ], 
        [
            "closely", 
            "bravely", 
            "comfortably", 
            "hardly"
        ], 
        [
            "always", 
            "never", 
            "once", 
            "still"
        ], 
        [
            "hobby", 
            "medicine", 
            "habit", 
            "game"
        ], 
        [
            "able", 
            "ready", 
            "unable", 
            "unready"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "C", 
        "A", 
        "D", 
        "D", 
        "C", 
        "A", 
        "D", 
        "D", 
        "A", 
        "B", 
        "C", 
        "A"
    ], 
    "source": "middle1762"
}