{
    "article": "Mary Roda's parents came to New York from Australia. They lived in a tall building. A man named Donald Smith lived in the building, too. He  _  a toy company. One day Donald gave Mary, the 4-year-old girl, a new  _  . She played with the toy and said, \"This is fun!\" A few weeks later Donald gave her  another  toy. She played with it. She said,\" I am not  interested in  this toy. It doesn't work. \"She was a(n)  _  little girl. Donald liked her honesty, and they became friends. For years Donald gave Mary new toys, and she gave him very good  _  about the toys. When Mary was thirteen years old, Donald  _  her a new ball. The ball had a balloon inside it. Mary wanted to fill the balloon with water. She wanted to paint the ball in crazy colors. She wanted to  _  rice or beans in it to make it noisy. The company made these  _  . Mary's ideas were a great success! The company  _  thousands of the balls. That Christmas Donald gave Mary a(n)  _  gift. He made her a vice-president of the toy company.  _  made $ 200000 a year. Her job was to see  _  the new toys were fun. She took a car from her school to her office. She worked for three or four hours a day at her job,  _  she had to do her homework. Mary was a busy teenager. She had  _  time to be with her family. Her parents taught her that working hard and doing her best is very important. Today Mary works at a college. The little vice-president with bright ideas helps students think about their future.", 
    "options": [
        [
            "owned", 
            "found", 
            "helped", 
            "chose"
        ], 
        [
            "gift", 
            "book", 
            "toy", 
            "bag"
        ], 
        [
            "kind", 
            "honest", 
            "helpful", 
            "lovely"
        ], 
        [
            "ideas", 
            "skills", 
            "names", 
            "facts"
        ], 
        [
            "lent", 
            "called", 
            "returned", 
            "showed"
        ], 
        [
            "grow", 
            "eat", 
            "put", 
            "cook"
        ], 
        [
            "inventions", 
            "rules", 
            "mistakes", 
            "changes"
        ], 
        [
            "sent", 
            "had", 
            "sold", 
            "received"
        ], 
        [
            "amazing", 
            "interesting", 
            "beautiful", 
            "boring"
        ], 
        [
            "He", 
            "She", 
            "It", 
            "They"
        ], 
        [
            "that", 
            "if", 
            "how", 
            "why"
        ], 
        [
            "so", 
            "but", 
            "or", 
            "then"
        ], 
        [
            "less", 
            "more", 
            "much", 
            "most"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "B", 
        "A", 
        "D", 
        "C", 
        "D", 
        "C", 
        "A", 
        "B", 
        "B", 
        "D", 
        "A"
    ], 
    "source": "middle2147"
}