{
    "article": "An old man lived with his son, daughter-in-law and 4-year-old grandson. There was something wrong  _  the old man's hands, eyes and feet. The family ate together at the dinner table. But it was rather  _  for the old man to eat successfully. The son and daughter-in-law became  _  with the old man. So they set a small table in the corner and let him eat  _  while they were enjoying dinner at the dinner table. After the old man  _  a dish or two, they put his food in a wooden bowl. The son and daughter-in-law even shouted at him when he  _  a spoon or turned over the bowl. Sometimes the old man's eyes filled with tears as he ate. The grandson watched it all in  _  . One evening before supper, the father found his son  playing  with a piece of wood on the floor. \"  _  are you making?\" he asked. The boy answered, \"Oh, I am making a little bowl for you and Mom to eat your food from when I  grow up  \". The boy smiled and went back to work. The parents were so surprised that they could speak  _  . Then tears ran down their faces. Both of them knew what should be done  _  no word was spoken. That evening the husband took his father's hand and gently took him back to the family table. Later the old man ate every meal with the family.  _  of the boy's parents seemed to be angry when the old man made some trouble. Children are good at learning from adults. Parents are their  _  . Clever parents know what they say and what they do have a great  _  on their children. Let us all take care of ourselves and those we love today and every day!", 
    "options": [
        [
            "on", 
            "with", 
            "for", 
            "at"
        ], 
        [
            "difficult", 
            "natural", 
            "easy", 
            "possible"
        ], 
        [
            "friendly", 
            "upset", 
            "stressed", 
            "angry"
        ], 
        [
            "together", 
            "luckily", 
            "alone", 
            "seriously"
        ], 
        [
            "cooked", 
            "broke", 
            "made", 
            "sold"
        ], 
        [
            "dropped", 
            "left", 
            "picked", 
            "bought"
        ], 
        [
            "danger", 
            "style", 
            "health", 
            "silence"
        ], 
        [
            "When", 
            "What", 
            "How", 
            "Where"
        ], 
        [
            "everything", 
            "anything", 
            "something", 
            "nothing"
        ], 
        [
            "because", 
            "or", 
            "though", 
            "unless"
        ], 
        [
            "Both", 
            "Neither", 
            "All", 
            "Either"
        ], 
        [
            "examples", 
            "banks", 
            "hope", 
            "homes"
        ], 
        [
            "time", 
            "chance", 
            "comment", 
            "influence"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "D", 
        "C", 
        "B", 
        "A", 
        "D", 
        "B", 
        "D", 
        "C", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "middle2062"
}