{
    "article": "Sam lived in a small village. His mother was often ill and he had to spend much money on  _  . And when he was 28, he borrowed some  _  from his friends and married. His wife was beautiful but came from a poor  _  . So she could not help him. She had to tell her husband to find work in the town. She hoped he would get  _  money to pay off his debt . The young man thought she was right and had to say  goodbye  to her and started to find a job. The young man could neither read nor write. Of course  _  would employ such a man like him in the town. He had to go to an island and  _  trees for a farmer there. The island was small and there were only three men on it. They lived a  _  life and Sam missed his mother and wife very much. He wanted to  write to  them, but he couldn't. Luckily, Charlie, who was  in school  for five years, helped him. He asked the farmer to post the letter for him. From then on he  waited for  the answer every day. About two months later the farmer brought his wife's letter to the island. He was very  _  but he couldn't read it. He had to ask Charlie to help him again. When the farmer came out of the house, he found Sam was covering Charlie's  _  while he was listening to the young man reading. It  _  him and he said, \"What are you doing it for, Sam?\" \"I can't let him  _  my wife's words!\"", 
    "options": [
        [
            "fruit", 
            "medicine", 
            "drinks", 
            "food"
        ], 
        [
            "houses", 
            "cotton", 
            "money", 
            "clothes"
        ], 
        [
            "hill", 
            "office", 
            "school", 
            "family"
        ], 
        [
            "enough", 
            "few", 
            "little", 
            "several"
        ], 
        [
            "somebody", 
            "everyone", 
            "nobody", 
            "anyone"
        ], 
        [
            "buy", 
            "break", 
            "burn", 
            "plant"
        ], 
        [
            "hard", 
            "light", 
            "safe", 
            "sad"
        ], 
        [
            "happy", 
            "careful", 
            "afraid", 
            "sorry"
        ], 
        [
            "head", 
            "ears", 
            "mouth", 
            "eyes"
        ], 
        [
            "interested", 
            "worried", 
            "surprised", 
            "pleased"
        ], 
        [
            "write", 
            "see", 
            "touch", 
            "hear"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "D", 
        "A", 
        "C", 
        "D", 
        "A", 
        "A", 
        "B", 
        "C", 
        "D"
    ], 
    "source": "middle18"
}