{
    "article": "I live in an apartment building where there are several elderly people. There is an old neighbour of mine who is always willing to  help out  and go out of his way to help anyone in need. A few weeks ago, I was taking a large amount of  _  out. This neighbour saw me and stopped to help me as he was taking out his own rubbish. However, after he dumped his rubbish out of the bag, he  _  his rubbish bag. \"Why don't you throw it away?\" I asked him. He replied that he had been using the  _  rubbish bag for a few months because he really didn't have extra money to buy new ones. This immediately made me tear up. I thought that having rubbish bags was really  _  . So I started working out a(n)  _  . I went to every apartment in the building and told them what was going on. I asked each household if they could  _  at least one rubbish bag. I got almost 100 bags. I then put them into a gift basket and left an anonymous  _  saying that they were from his grateful neighbours. A few days later, he told me about the rubbish bags that he  _  . I, of course, did not tell him  _  they came from. Then, later that afternoon, I came home and found this very neighbour using all those rubbish bags to help another neighbour move out!", 
    "options": [
        [
            "rubbish", 
            "money", 
            "food", 
            "medicine"
        ], 
        [
            "threw", 
            "opened", 
            "kept", 
            "sold"
        ], 
        [
            "magic", 
            "beautiful", 
            "new", 
            "same"
        ], 
        [
            "difficult", 
            "different", 
            "expensive", 
            "simple"
        ], 
        [
            "problem", 
            "answer", 
            "plan", 
            "lesson"
        ], 
        [
            "donate", 
            "collect", 
            "buy", 
            "make"
        ], 
        [
            "phone", 
            "note", 
            "book", 
            "ticket"
        ], 
        [
            "received", 
            "missed", 
            "gave", 
            "picked"
        ], 
        [
            "when", 
            "what", 
            "why", 
            "where"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "D", 
        "D", 
        "C", 
        "A", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "middle119"
}