{
    "article": "It was 3:43. Thunder was crashing and the rain was pouring. Suddenly my father rushed into my room. \"Adam! Adam! Get up! We're flooding!\" he shouted and shook me by the shoulders. That woke  _  up! I ran downstairs to the basement. It was like a swimming pool. My mother and I immediately started to pick up things and take them upstairs. I had no  _  on, so my feet were quite freezing. Things got worse every minute. Within the next hour, we had moved everything that we could to the first floor. The computer, big-screen television and heavy boxes  _  with our most valuable things were taken to safety.  _  , our piano, sofa, washing machine and water heater were all still down there--being  _  . There was nothing we could do. That was the hardest part. Knowing that your home is being destroyed is bad enough, but  _  that you can't do anything to stop it feels even worse. Water had come in our front door. Rescue  _  were floating in our streets. Mother told me to pack an overnight bag of clothes and valuables and get ready to leave. When it was  _  safe to walk outside, all the people in the neighborhood  _  at the street corner. People became friends, and friends became like family. People  _  each other. We learned later that the National Weather Service had declared the storm a flash flood. I really have  _  something from this flood. I've learned what destruction is. I have learned what  _  means. I know in the future, when I watch people' s lives affected by natural disasters, I can understand them. I will show great pity on them and I will do what I can to help them.", 
    "options": [
        [
            "him", 
            "them", 
            "her", 
            "me"
        ], 
        [
            "hat", 
            "shoes", 
            "jacket", 
            "glasses"
        ], 
        [
            "covered", 
            "crowded", 
            "filled", 
            "fixed"
        ], 
        [
            "So", 
            "And", 
            "Because", 
            "However"
        ], 
        [
            "discovered", 
            "arranged", 
            "measured", 
            "destroyed"
        ], 
        [
            "realizing", 
            "knowing", 
            "telling", 
            "writing"
        ], 
        [
            "ships", 
            "boats", 
            "cars", 
            "buses"
        ], 
        [
            "finally", 
            "usually", 
            "exactly", 
            "certainly"
        ], 
        [
            "stood", 
            "walked", 
            "gathered", 
            "met"
        ], 
        [
            "comforted", 
            "influenced", 
            "believed", 
            "worried"
        ], 
        [
            "learned", 
            "discovered", 
            "thought", 
            "concluded"
        ], 
        [
            "truth", 
            "safety", 
            "value", 
            "regret"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "C", 
        "D", 
        "D", 
        "A", 
        "B", 
        "A", 
        "C", 
        "A", 
        "A", 
        "B"
    ], 
    "source": "middle931"
}