{
    "article": "It was the beginning of a new term. As a _ teacher in that school, I didn't know any of the students. A little girl was standing at the gate of the classroom. She looked very shy.\nI walked up to her and _ why she stood there. But she said nothing. Then a boy shouted, \"She is from Grade Four, the worst student in her grade.\" I looked at the little girl. She didn't seem to be the smart kind. I _ why her teacher asked her to stay in Grade Three. I took her hand and _ her into the classroom.\n\"Sit here. Now you are my student and I'm your teacher,\" I said. She still said nothing, but suddenly began to cry.\nI later learnt that her parents died in a car accident. She became sad and didn't like talking to others after that.\nShe learnt very _ . I gave her respect  and never looked down upon   her as I know everybody deserves  respect. I helped her after school, and she was making _ little by little. As time went by, she was not as _ as before. At the end of the term, she seemed to have forgotten all her sadness. She was not among the best students when she left that school, but at least , she was not that shy and sad little girl any more.\nIn the following _ , she would send me a card on each Thanksgiving Day. Three days ago, I _ an invitation to her wedding . And now, I am at her wedding, and she is smiling brightly.\nEveryone deserves respect and everyone can be happy.", 
    "options": [
        [
            "new", 
            "beautiful", 
            "strict", 
            "famous"
        ], 
        [
            "told", 
            "answered", 
            "knew", 
            "asked"
        ], 
        [
            "thought", 
            "understood", 
            "forgot", 
            "remembered"
        ], 
        [
            "poured", 
            "threw", 
            "led", 
            "turned"
        ], 
        [
            "slowly", 
            "quietly", 
            "well", 
            "quickly"
        ], 
        [
            "friends", 
            "decision", 
            "progress", 
            "surprises"
        ], 
        [
            "smart", 
            "shy", 
            "angry", 
            "careful"
        ], 
        [
            "days", 
            "weeks", 
            "months", 
            "years"
        ], 
        [
            "wrote", 
            "sent", 
            "refused", 
            "received"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "B", 
        "C", 
        "A", 
        "C", 
        "B", 
        "D", 
        "D"
    ], 
    "source": "middle828"
}