{
    "article": "The New Year is a time of friends, family and fun. People  _  the New Year with many traditions and activities.  _  , not all countries celebrate New Year's Day in the same way. In Japan, people throw beans. They throw beans while  _  ,\"Devils out ,good luck/happiness in.\"After throwing the beans, family members pick up and eat the same number of beans as their age. It will bring  _  and good luck for the New Year. In China, People buy presents, decorations,foods and new clothes a few weeks before the new year. They clean their houses to  sweep away  bad luck. On New Year's Eve people usually get together for a big meal. On New Year's Day, children will  _  hongbao from their parents. People think it will bring good luck to children. People always visit their  _  and friends at this time. The Lion Dance is a  _  activity that is held during the Chinese New Year. People believe that the  _  sound of drums can keep devils away. In India, people usually visit temples to give thanks for a good harvest. Then men and women  _  traditional dances. Family members also enjoy delicious food. They say goodbye to the old year and welcome the New Year.", 
    "options": [
        [
            "celebrate", 
            "take", 
            "break", 
            "promise"
        ], 
        [
            "So", 
            "And", 
            "Then", 
            "However"
        ], 
        [
            "pulling", 
            "shouting", 
            "playing", 
            "practicing"
        ], 
        [
            "worry", 
            "advice", 
            "health", 
            "time"
        ], 
        [
            "accept", 
            "make", 
            "buy", 
            "receive"
        ], 
        [
            "characters", 
            "soldiers", 
            "relatives", 
            "museums"
        ], 
        [
            "beautiful", 
            "traditional", 
            "modern", 
            "boring"
        ], 
        [
            "quiet", 
            "slow", 
            "personal", 
            "loud"
        ], 
        [
            "perform", 
            "spend", 
            "hear", 
            "check"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "B", 
        "C", 
        "D", 
        "C", 
        "B", 
        "D", 
        "A"
    ], 
    "source": "middle1065"
}