{
    "article": "As I was passing the elephants, I was confused to see these huge animals were held by nothing but a small rope. The rope was tied to their front legs. No chains, no cages. It was _ that the elephants could easily break away from the ropes at any time. But the fact was opposite.\nI saw a _ nearby and asked why these elephants just stood there and made no attempt   to get away . \"Well,\" he said, \"when they were very young and much smaller, we used the same _ rope to tie them. At that age, it was enough to hold them. As they grow up , they are used to believing that they cannot break away. They believe the rope can _ hold them, so they never try to break free.\"\nTo my _ , these animals could break free from their ropes at any time, but they _ . Because they believed they couldn't, they were stuck right where they were.\nLike the elephants, how many of us go _ life believing that we cannot do something, simply because we failed at it once before? How many of us have _ trying something new because of a limited belief  ? Worse, how many of us are being held back by someone else's limited beliefs?", 
    "options": [
        [
            "clear", 
            "lively", 
            "smart", 
            "lovely"
        ], 
        [
            "visitor", 
            "gardener", 
            "trainer", 
            "waiter"
        ], 
        [
            "colour", 
            "size", 
            "model", 
            "number"
        ], 
        [
            "even", 
            "still", 
            "hard", 
            "hardly"
        ], 
        [
            "surprise", 
            "joy", 
            "danger", 
            "interest"
        ], 
        [
            "did", 
            "didn't", 
            "are", 
            "aren't"
        ], 
        [
            "down", 
            "on", 
            "at", 
            "through"
        ], 
        [
            "finished", 
            "enjoyed", 
            "avoided", 
            "practised"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "B", 
        "B", 
        "A", 
        "B", 
        "D", 
        "C"
    ], 
    "source": "middle2251"
}