{
    "article": "AMERICA'S first daughters, Malia and Sasha, are excited about getting a pet dog. But their father, President Obama, has told the girls they have to pick up the poop  _ the grass. It's true. Keeping a dog _ lots of other work besides(...) picking up the poop. For example, you'd better know _ the dog goes to bed and how it lives happily. It means you have to know the animals' _ and be ready.\nLi Hui, 15, of Beijing, once kept a rabbit and some goldfish. _ all of them died. \"My rabbit ate the wrong food,\" said Li. \"My _ died because they ate too much!\"\nXiao Ting, 15, of Shanghai, wanted to keep a dog a year ago. She got food and a new doghouse ready to _ the dog, but she only kept the dog for one day. \"I _ thought a dog could be so active. It wouldn't stop barking . My father had to walk _ at 3 o'clock in the morning!\"\n\"You'd better think it is like your _ . \" said Liu Yining, a 14-year-old  Beijinger. She is a (an) _  pet keeper. Her family has kept a dog named Pipi for three years. _ Pipi first came to Liu's home, it made her house dirty everywhere. It took a long time to teach Pipi to go to the toilet. She talks and plays with Pipi a lot. She really  cares about Pipi.\n Keeping a pet means you have to be patient and caring.", 
    "options": [
        [
            "under", 
            "with", 
            "of", 
            "from"
        ], 
        [
            "asks", 
            "needs", 
            "tells", 
            "says"
        ], 
        [
            "what", 
            "why", 
            "when", 
            "how"
        ], 
        [
            "habits", 
            "food", 
            "home", 
            "health"
        ], 
        [
            "Because", 
            "And", 
            "So", 
            "But"
        ], 
        [
            "rabbit", 
            "goldfish", 
            "dog", 
            "cat"
        ], 
        [
            "know", 
            "wait", 
            "welcome", 
            "choose"
        ], 
        [
            "already", 
            "always", 
            "ever", 
            "never"
        ], 
        [
            "me", 
            "it", 
            "you", 
            "her"
        ], 
        [
            "dog", 
            "toy", 
            "friend", 
            "student"
        ], 
        [
            "dangerous", 
            "interesting", 
            "successful", 
            "friendly"
        ], 
        [
            "when", 
            "before", 
            "if", 
            "so"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "C", 
        "A", 
        "D", 
        "B", 
        "C", 
        "D", 
        "B", 
        "C", 
        "C", 
        "A"
    ], 
    "source": "middle1167"
}