{
    "article": "\"Sesame Street\"is a TV programme for children. It first appeared in New York  _  1969. It is called \"the longest street in the world\". That's  _  the TV programme by that name can now be seen in so many parts of the world. In the US over six million children watch the programme regularly. The  _  include more than half the nation's pre-school children. Parents love the programme. Many teachers also consider it a great help,  _  some educators are against certain things in it. Tests show children from different  _  have benefited from watching the programme. Those who watch it five times  a  week learn more than those who watch it once in a while. In the US the programme is shown at  different  hours so that more children can watch it. The programmes all  _  songs, stories, jokes and pictures to help children understand numbers, letters and human relationship. But there are some differences  for example  ,the programme made in Mexico City  _  more time to teaching whole words than to teaching letters one by one. Why is\"Sesame Street\" more successful than other children's shows? There  _  many reasons--the good education of its producers, the support  _  the government and businesses, and the skillful use of many TV tricks. Also  _  watch it along with their children. This is partly because famous adult stars often appear on it. But the best reason may be that it makes every child  feel  able to learn. Children find themselves learning, and they want to learn  _  .", 
    "options": [
        [
            "at", 
            "On", 
            "In", 
            "since"
        ], 
        [
            "why", 
            "because", 
            "when", 
            "how"
        ], 
        [
            "viewers", 
            "visitors", 
            "witnesses", 
            "settlers"
        ], 
        [
            "and", 
            "so", 
            "though", 
            "or"
        ], 
        [
            "films", 
            "cartoons", 
            "stories", 
            "backgrounds"
        ], 
        [
            "use", 
            "take", 
            "sing", 
            "do"
        ], 
        [
            "donates", 
            "costs", 
            "spends", 
            "devotes"
        ], 
        [
            "is", 
            "are", 
            "was", 
            "were"
        ], 
        [
            "for", 
            "with", 
            "about", 
            "form"
        ], 
        [
            "teachers", 
            "doctors", 
            "volunteers", 
            "mothers"
        ], 
        [
            "many", 
            "much", 
            "more", 
            "most"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "A", 
        "C", 
        "D", 
        "A", 
        "D", 
        "B", 
        "D", 
        "D", 
        "C"
    ], 
    "source": "middle1461"
}