{
    "article": "Alicia was a young woman who liked to exercise for her health. In fact, she walked five kilometers before  _  every morning, and went swimming once a week at the swimming pool. She didn't smoke and never  _  . She didn't eat chocolate. She didn't eat sweet and fatty food,  _  . She weighted herself every day. One day Alicia was on her daily walk when she saw a  _  sitting in a rocking chair under a tree. He looked very old and his hair was white. He looked thin and weak, and his hands were shaking,  _  he looked very happy. He smiled at her and said,\" Good morning! Lovely day ,isn't it?\" He had a wide smile  _  his face, and his eyes shone with happiness. But Alicia saw that he did not have teeth. \"Good morning! \"replied Alicia. \"Yes, it is a lovely day. \" Alicia thought he  _  very old and wise. She thought he must be at least 90 years old! She decided to ask him about the  _  of a happy old age. \"I hope you don't  _  me asking, \"she said, \"but what is your secret for being so happy at your age? I hope I can look as happy as you do  _  I am your age. \" The man in the rocking chair said, \"My secret for  _  ? I smoke twenty packets of cigarettes every week, and drink three bottles of wine every day. I eat hamburgers and chocolates whenever I want. I never eat vegetables. I never walk anywhere and I never play sports. I sit at home every day. \" \" Alicia was  _  . She didn't expect the man to give her an answer like that. She wondered how the man got to be so old when he did  _  wrong. She thought he should be  _  and unhappy. Perhaps she was wrong. Maybe ,she thought, people could live a long happy life  _  eating well or doing lots of exercise. \"How old are you ?\" she asked.", 
    "options": [
        [
            "lunch", 
            "breakfast", 
            "dinner", 
            "supper"
        ], 
        [
            "exercised", 
            "drank", 
            "worked", 
            "slept"
        ], 
        [
            "too", 
            "also", 
            "either", 
            "still"
        ], 
        [
            "man", 
            "woman", 
            "boy", 
            "girl"
        ], 
        [
            "so", 
            "but", 
            "and", 
            "or"
        ], 
        [
            "in", 
            "with", 
            "at", 
            "on"
        ], 
        [
            "saw", 
            "looked", 
            "listened", 
            "found"
        ], 
        [
            "secret", 
            "dream", 
            "plan", 
            "future"
        ], 
        [
            "stand", 
            "mind", 
            "allow", 
            "enjoy"
        ], 
        [
            "when", 
            "since", 
            "though", 
            "for"
        ], 
        [
            "health", 
            "success", 
            "happiness", 
            "life"
        ], 
        [
            "surprised", 
            "worried", 
            "excited", 
            "relaxed"
        ], 
        [
            "something", 
            "anything", 
            "everything", 
            "nothing"
        ], 
        [
            "angry", 
            "serious", 
            "quiet", 
            "sick"
        ], 
        [
            "through", 
            "from", 
            "without", 
            "by"
        ]
    ], 
    "answers": [
        "B", 
        "B", 
        "C", 
        "A", 
        "B", 
        "D", 
        "B", 
        "A", 
        "B", 
        "A", 
        "C", 
        "A", 
        "C", 
        "D", 
        "C"
    ], 
    "source": "middle1547"
}