{
    "article": "About ten years ago when I was a student at college, I spent my summer holidays  working  at a museum.  _  was hard for me then. Dad had lost his job and Mum was sick  in bed  I was  _  if I would be able to go on with my study the next term. One day while I was working, I saw an old man come in with a little girl  _  a wheelchair. As I looked  _  at this girl, I found that she had no arms  _  legs. She was wearing a little white dress and she  also  had a hat on. As the old man pushed the wheelchair up to me, I was busy with my work. I  _  my head toward the girl and gave her a wink . When I took the money from her grandfather, I looked back at the girl,  _  was giving me the prettiest, largest smile I have  _  seen. Suddenly her handicap  was covered  and all I saw was this beautiful girl, whose smile almost gave me a better understanding of what life is all about. She  _  me from a poor, unhappy college student and brought me into her  _  of smiles, love and warmth. I'm now a successful business and  _  I get down and think about the trouble of the world, I think about that little girl and the unforgettable lesson about life that she taught me.", 
    "options": [
        [
            "Work", 
            "Life", 
            "Business", 
            "School"
        ], 
        [
            "wondering", 
            "guessing", 
            "hoping", 
            "checking"
        ], 
        [
            "at", 
            "for", 
            "in", 
            "with"
        ], 
        [
            "longer", 
            "nearer", 
            "further", 
            "closer"
        ], 
        [
            "or", 
            "and", 
            "then", 
            "so"
        ], 
        [
            "held", 
            "turned", 
            "lifted", 
            "gave"
        ], 
        [
            "whose", 
            "whom", 
            "who", 
            "that"
        ], 
        [
            "ever", 
            "never", 
            "almost", 
            "even"
        ], 
        [
            "saved", 
            "took", 
            "helped", 
            "taught"
        ], 
        [
            "place", 
            "mind", 
            "earth", 
            "world"
        ], 
        [
            "whatever", 
            "whenever", 
            "whoever", 
            "however"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "D", 
        "A", 
        "B", 
        "C", 
        "A", 
        "A", 
        "D", 
        "B"
    ], 
    "source": "middle793"
}