{
    "article": "Whenever the sun dropped and the blue sky came up, my father and I used to climb the mountain near my house. Walking together, my father and I used to have a lot of  _  through which I learned  _  from his experiences. He always told me, \" You  _  have goals like climbing the mountain.\" Without the mountain-climbing that we both  _  , we couldn't have enough time to spend together because my father was very  _  . I really got a lot from the mountain-climbing. It gave me time to  _  with my father and to be in deep thought  as well as  develop my patience. Once we climbed a very high mountain. It was so challenging for me  _  I was only ten years old. During the first few hours of climbing, I enjoyed the flowers and trees, and the bird's singing. But as time passed, I got a pain in both of my  _  . I wanted to  give up  climbing, but my father said to me, \"You can always see a beautiful sky at the top of the mountain, but you can't see it  _  reaching the top. Only there can you see all of the nice things, which is just like your life.\" At that time, I was too young to understand his  _  . But later after that, I  got to  know the meaning of hope in life. I found  _  standing at the top of the mountain, and the sky was as  _  as crystal.", 
    "options": [
        [
            "conversations", 
            "emotions", 
            "conclusions", 
            "expressions"
        ], 
        [
            "classes", 
            "tests", 
            "lessons", 
            "news"
        ], 
        [
            "can", 
            "may", 
            "would", 
            "should"
        ], 
        [
            "spent", 
            "enjoyed", 
            "hoped", 
            "kept"
        ], 
        [
            "busy", 
            "lazy", 
            "weak", 
            "free"
        ], 
        [
            "play", 
            "work", 
            "talk", 
            "study"
        ], 
        [
            "though", 
            "because", 
            "and", 
            "but"
        ], 
        [
            "legs", 
            "ears", 
            "eyes", 
            "fingers"
        ], 
        [
            "after", 
            "when", 
            "before", 
            "since"
        ], 
        [
            "stories", 
            "words", 
            "pictures", 
            "lessons"
        ], 
        [
            "myself", 
            "himself", 
            "yourself", 
            "ourselves"
        ], 
        [
            "blue", 
            "white", 
            "clean", 
            "clear"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "D", 
        "B", 
        "A", 
        "C", 
        "B", 
        "A", 
        "C", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "middle1180"
}