{
    "article": "When I was in primary school, I had a big argument with a boy in my class. I can't  _  what it was about, but I have never forgotten the  _  I learned that day. I was sure that I was right and he was wrong.  _  , he strongly believed that I was wrong and he was right. The teacher decided to teach us a lesson. She  came up with  a good idea. She brought both of us to the front of the class and placed him on one side of her grey desk and me on  the other  In the middle of the desk was a large, round object. It was  _  for me to see that it was black. She asked the boy what color the object was. \"  _  ,\" he answered in a loud voice. I couldn't  believe  that the object was white, considering that it was certainly black! One more argument started between the boy and me, this time  _  the color of the object. The teacher told me to go stand where the boy was standing and told him to come stand where I had been. We changed  _  , and then she asked me what the color of the object was. I  had to  answer, \"White.\" It was then that I knew what was wrong. It was an object with two  _  colored sides, and from his side it was white.  _  from my side was it black. My teacher taught me a very important lesson that day: You must  _  in other person's position and look at the  _  through their eyes in order to truly understand their ideas.", 
    "options": [
        [
            "understand", 
            "remember", 
            "explain", 
            "know"
        ], 
        [
            "class", 
            "subject", 
            "lesson", 
            "book"
        ], 
        [
            "Therefore", 
            "Also", 
            "However", 
            "But"
        ], 
        [
            "hard", 
            "clean", 
            "lucky", 
            "clear"
        ], 
        [
            "Black", 
            "White", 
            "Grey", 
            "Brown"
        ], 
        [
            "like", 
            "against", 
            "about", 
            "around"
        ], 
        [
            "places", 
            "objects", 
            "opinions", 
            "seats"
        ], 
        [
            "similarly", 
            "differently", 
            "brightly", 
            "truly"
        ], 
        [
            "But", 
            "still", 
            "only", 
            "just"
        ], 
        [
            "appear", 
            "stand", 
            "hide", 
            "sit"
        ], 
        [
            "situation", 
            "discussion", 
            "solution", 
            "way"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "C", 
        "D", 
        "B", 
        "C", 
        "A", 
        "B", 
        "A", 
        "B", 
        "A"
    ], 
    "source": "middle750"
}