{
    "article": "When I was about twelve, I headed to a restaurant for dinner with my family. It was winter, and on that particular night, the _ was really blowing hard.\nAs my mom and I headed towards the restaurant from our car, a girl about my age _ her mother came up to us. They asked if we had any spare change. My mom immediately asked where they kept their things. They pointed to an old car in a parking lot across the street. The girl said there were _ of them living in that car.\nMy mom said she had something to do _  handing the people a few dollars. She sent me inside the restaurant with my dad and my three siblings. But she didn't come with us.\nLater, I  found out that she had gone home and emptied our cupboards into a few bags. Then, she brought the bags of food to the family. I wasn't there when _ happened, but I can imagine the joy it brought to their faces.\nA few days later, when I learned about what she had done, I _ her why she helped those people. She told me that they were not lucky. I remember the face of that girl who had asked us for change -- she was the same _ as me, yet we looked so different.\nHere I stood, dressed in almost new clothes, headed to dine in a restaurant and then went back home to the bedroom I _ with my younger sister. I remember thinking that the girl didn't have any food to eat, and she was heading back to a cold car shared with five other people.\nAfter painting this picture in my mind, I _ why my mom had done what she did. I will never forget what she did that night, and how she taught me one of the best lessons I ever learned.", 
    "options": [
        [
            "wind", 
            "rain", 
            "snow", 
            "cloud"
        ], 
        [
            "of", 
            "or", 
            "by", 
            "with"
        ], 
        [
            "four", 
            "five", 
            "six", 
            "seven"
        ], 
        [
            "if", 
            "before", 
            "unless", 
            "after"
        ], 
        [
            "what", 
            "that", 
            "this", 
            "one"
        ], 
        [
            "asked", 
            "told", 
            "knew", 
            "talked"
        ], 
        [
            "year", 
            "size", 
            "age", 
            "grade"
        ], 
        [
            "worked", 
            "decorated", 
            "studied", 
            "shared"
        ], 
        [
            "forgot", 
            "understood", 
            "remembered", 
            "wondered"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "C", 
        "D", 
        "B", 
        "A", 
        "C", 
        "D", 
        "B"
    ], 
    "source": "middle74"
}