{
    "article": "Dear Kate, It is very exciting that you are coming to our school so soon.  _  you arrive, let me introduce to you what our school life is like. Our school is a good  _  where we can prepare ourselves well for the future. We have many wonderful teachers who are always ready to  _  help. Though we pay a lot of attention to how  _  we do in lessons, getting high scores is not the only reason to study. The  _  encourage us to try out new ideas and ask questions in class. With their help we have developed all kinds of  _  in both Arts and Science. Students can choose to  _  any school clubs they are interested in. We can  _  choose the subjects that we want to study. Last term I chose American Literature, because I wanted to learn  _  famous American writers. This term I chose to attend  _  classes because my father bought me a piano as a birthday present. By the way, I was elected monitor of my class. Sometimes it can be  _  to be a monitor, because I have to do a lot of work and attend many meetings. However, being a monitor has taught me a lot, such as  _  for others and taking responsibilities and so on. When my class was given the title of \"Model Class\", I was  _  than ever before. So being a monitor  _  an important part in my school life. I'm very pleased with my work. I love my school and  _  that you will have a pleasant experience here too. I am looking forward to seeing you soon. Yours Li Ping", 
    "options": [
        [
            "When", 
            "After", 
            "Before", 
            "Since"
        ], 
        [
            "room", 
            "space", 
            "place", 
            "house"
        ], 
        [
            "need", 
            "ask", 
            "want", 
            "offer"
        ], 
        [
            "deep", 
            "well", 
            "fast", 
            "hard"
        ], 
        [
            "teachers", 
            "parents", 
            "classmates", 
            "friends"
        ], 
        [
            "activities", 
            "characters", 
            "personalities", 
            "interests"
        ], 
        [
            "join", 
            "train", 
            "design", 
            "visit"
        ], 
        [
            "also", 
            "just", 
            "yet", 
            "only"
        ], 
        [
            "with", 
            "about", 
            "for", 
            "among"
        ], 
        [
            "art", 
            "music", 
            "cooking", 
            "dance"
        ], 
        [
            "exciting", 
            "tiring", 
            "interesting", 
            "surprising"
        ], 
        [
            "cooking", 
            "copying", 
            "caring", 
            "checking"
        ], 
        [
            "luckier", 
            "kinder", 
            "stronger", 
            "prouder"
        ], 
        [
            "plays", 
            "takes", 
            "makes", 
            "acts"
        ], 
        [
            "wonder", 
            "know", 
            "hope", 
            "feel"
        ]
    ], 
    "answers": [
        "C", 
        "C", 
        "D", 
        "B", 
        "A", 
        "D", 
        "A", 
        "A", 
        "B", 
        "B", 
        "B", 
        "C", 
        "D", 
        "A", 
        "C"
    ], 
    "source": "middle656"
}