{
    "article": "Much meaning can be carried clearly, with our eyes, so it is often  _  that eyes can speak. Do you have such kind of  _  ? In a bus you may look at a stranger, but not too long. And if he  _  that he is being looked at, he may feel uncomfortable. The same in daily life. If you are looked at for more than necessary, you will look at yourself up and down, to see if there is  _  wrong with you. If nothing goes wrong, you will feel  _  toward the person who is looking at you that way. Eyes do speak, right? Looking too long at someone may seem to be impolite. But sometimes things are different. If a man looks at a woman for more than 10 seconds, it may mean that he wishes to attract her attention, to make her understand that he  loves  her. When two people are in a conversation, the speaker will only look at the listener from time to time,  in order to  make sure that the listener does pay attention  _  what he or she is speaking. Lovers will enjoy looking at each other or being looked at for a long time, to show something that  _  cannot express. Clearly, eye contact should be done according to the relationship between two people and the place  _  you stay.", 
    "options": [
        [
            "spoken", 
            "said", 
            "told", 
            "talked"
        ], 
        [
            "experience", 
            "eyes", 
            "mind", 
            "news"
        ], 
        [
            "found", 
            "knew", 
            "finds", 
            "saw"
        ], 
        [
            "anything", 
            "something", 
            "everything", 
            "nothing"
        ], 
        [
            "happy", 
            "angry", 
            "sad", 
            "thankful"
        ], 
        [
            "for", 
            "of", 
            "with", 
            "to"
        ], 
        [
            "eyes", 
            "words", 
            "minds", 
            "body"
        ], 
        [
            "which", 
            "that", 
            "where", 
            "there"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "A", 
        "B", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "middle1016"
}