{
    "article": "Ever since I was a child, my mouth has caused me trouble. I'm not a bad person; I have a _ timelearning when to keep my mouth closed.\nMy mom has told me again and again, \"Robert, your constant bad words are hurting me. If you _ to be this rude, you will get into big trouble.\"\nIt's been a problem at school several times too when teachers have told me something I didn't want to hear. I used to feel it was my duty  to _ myself.\nOne day in English class I began working on my homework until I heard a classmate _ behindme. It was Nathaniel, who liked doing that as usual.\nAt first, I said very _ , \"Nathaniel, would you please be quiet?\"\nHowever, Nathaniel continued talking to himself. I quickly _ \"Nathaniel, shut up !\"\nFor the next five minutes, we threw hurtful  words back and forth at each other.\n\"At least I don't have an ugly lazy eye like you!\" I shouted.\nI knew this would make him _ . It would hurt his feelings and shut him up.\nWhat I said filled him with anger. He tried to _ over my seat and catch me as he shouted, \"That'sit! That's it!\"\n _ at his reaction , I sat back in my seat. I had never seen Nathaniel act like this before.\nLater on, we were taken to the principal's office. There, Mr. Black, our English teacher, told us to  _ the matter. It wasn't until then that I finally foundthat _ I hurt someone physically , the wounds eventuallyheal . But when I hurt them with my _ ,sometimes the pain   never goes away.\nAt the end of the discussion, I said _ to Nathaniel.\nWhen I went back to my room, I spent some time praying . I began to think about how often what I said hurt others. But I believe that as I keep praying and asking God to help me, he'll tell me when tokeep my _ closed.", 
    "options": [
        [
            "busy", 
            "hard", 
            "happy", 
            "fantastic"
        ], 
        [
            "decide", 
            "like", 
            "continue", 
            "try"
        ], 
        [
            "support", 
            "separate", 
            "smell", 
            "spend"
        ], 
        [
            "singing", 
            "reading", 
            "beating", 
            "talking"
        ], 
        [
            "clearly", 
            "nicely", 
            "carelessly", 
            "angrily"
        ], 
        [
            "repeated", 
            "expressed", 
            "replied", 
            "shouted"
        ], 
        [
            "nervous", 
            "afraid", 
            "sad", 
            "bored"
        ], 
        [
            "fall", 
            "look", 
            "hand", 
            "reach"
        ], 
        [
            "Angry", 
            "Surprised", 
            "Nervous", 
            "Happy"
        ], 
        [
            "discuss", 
            "solve", 
            "explain", 
            "report"
        ], 
        [
            "while", 
            "after", 
            "when", 
            "where"
        ], 
        [
            "words", 
            "action", 
            "ideas", 
            "experience"
        ], 
        [
            "goodbye", 
            "thanks", 
            "sorry", 
            "okay"
        ], 
        [
            "eyes", 
            "mouth", 
            "windows", 
            "door"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "D", 
        "B", 
        "D", 
        "C", 
        "D", 
        "B", 
        "A", 
        "C", 
        "A", 
        "C", 
        "B"
    ], 
    "source": "middle1591"
}