{
    "article": "There are many kinds of friends. Some are always  _  you, but don't understand you. Some say only a few words to you, but understand you. Many people will step in your life, but only  _  friends leave footprints . I shall always think of the autumn and the girl with the  _  . It was the golden season. I could see the yellow leaves  _  in the cool wind. Autumn is a harvest season and life is uninteresting. The free days always let  _  down. But one day, the sound of a violin came into my ears. I was so surprised that I jumped to see what it was. A young girl, standing in the wind, was  _  in playing her violin. I had  _  seen her before. The music was so nice that I didn't know I had been  _  there for so long. Every day I went to watch her performance. I was the only listener. The autumn seemed no longer lonely and life became  _  . I thought we were already good friends,  _  we didn't know each other. Autumn was nearly over. One day, when I was listening carefully, the sound suddenly  _  . To my surprise, the girl came over to me. \"You must like violin.\" she said. \"Yes. And you play very well. Why did you stop?\" I asked.  _  , a sad expression appeared on her face and I could feel something unusual. \"I came here to see my grandmother, but now I must leave. I once played very badly. It was your listening every day that  _  me.\" she said. \"  In fact  , it was your playing that gave me a meaningful autumn,\" I answered, \"Let's be friends.\" The girl smiled, and so did I. I never heard her play again in my life. But I will always remember the girl. She is like a dream--so short, so bright, like a star giving off so much light that it makes the  _  beautiful.", 
    "options": [
        [
            "with", 
            "for", 
            "against", 
            "behind"
        ], 
        [
            "bad", 
            "true", 
            "new", 
            "young"
        ], 
        [
            "sound", 
            "song", 
            "play", 
            "violin"
        ], 
        [
            "falling", 
            "hanging", 
            "shining", 
            "playing"
        ], 
        [
            "her", 
            "it", 
            "me", 
            "them"
        ], 
        [
            "lost", 
            "weak", 
            "poor", 
            "interested"
        ], 
        [
            "once", 
            "never", 
            "ever", 
            "usually"
        ], 
        [
            "waiting", 
            "stopping", 
            "standing", 
            "lying"
        ], 
        [
            "interesting", 
            "tiring", 
            "boring", 
            "surprising"
        ], 
        [
            "if", 
            "and", 
            "because", 
            "although"
        ], 
        [
            "stopped", 
            "began", 
            "appeared", 
            "changed"
        ], 
        [
            "Probably", 
            "Suddenly", 
            "Luckily", 
            "Firstly"
        ], 
        [
            "hurt", 
            "taught", 
            "encouraged", 
            "troubled"
        ], 
        [
            "spring", 
            "summer", 
            "autumn", 
            "winter"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "D", 
        "A", 
        "C", 
        "A", 
        "B", 
        "C", 
        "A", 
        "D", 
        "A", 
        "B", 
        "C", 
        "C"
    ], 
    "source": "middle1623"
}