{
    "article": "In a small city in England, there was a farmer who lived alone. Every day he  _  a pound of butter to his neighbour, who was a baker, One day the baker decided to  _  the butter to see if he was getting a pound. After he weighed it, he found that he wasn't. The baker then took  _  farmer to the judge . The judge asked the farmer if he had any way to weigh the butter. The farmer replied. \"I am so  _  that I do not have enough money to buy anything to weigh it,  _  I do have a kind of scale . \" The judge asked, \"Then how do you weigh the butter?\" The farmer replied, \"Before the baker started buying butter from  _  , I had bought bread from him. So now every time when I bring home the bread from the baker, I put it on the scale and give him the butter of the same weight,\" We  get back  what we give to others in life. Whenever you take actions, ask yourself this  _  , \"Am I honest?\" Honesty or dishonesty can become a  _  . Some dishonest people can lie without a red face. Others lie so much that they do not even  _  what the truth is any more. But who is it bad for? As a matter of fact, those who lie will hurt themselves by their own dishonest behavior.", 
    "options": [
        [
            "gave", 
            "fed", 
            "sold", 
            "threw"
        ], 
        [
            "weigh", 
            "watch", 
            "cut", 
            "use"
        ], 
        [
            "/", 
            "a", 
            "an", 
            "the"
        ], 
        [
            "rich", 
            "poor", 
            "honest", 
            "quiet"
        ], 
        [
            "and", 
            "so", 
            "but", 
            "or"
        ], 
        [
            "I", 
            "my", 
            "me", 
            "mine"
        ], 
        [
            "answer", 
            "question", 
            "help", 
            "idea"
        ], 
        [
            "difference", 
            "habit", 
            "mistake", 
            "difficulty"
        ], 
        [
            "study", 
            "mean", 
            "imagine", 
            "know"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "B", 
        "C", 
        "C", 
        "D", 
        "B", 
        "D"
    ], 
    "source": "middle1689"
}