{
    "article": "Working in Africa, one day we went to an orphanage  . There we met a lovely little girl named Tanzile. I gave her a sweet I brought. \"She  _ one more, doctor,\" said the nurse. I said \"Of course.\" and gave her another .\nBefore we left, we went to say  _  to Tanzile. She was holding the sweets I had given her.\nI said to the nurse, \"This little girl is clever. She has taken two sweets for herself.\"  _ after the nurse asked her some questions, we learned the _  about Tanzile.\nTanzile was 7 then. Two years before, her mom and dad had both died of AIDS. Her baby sister was taken away from her. From then on, whenever she _ anything from people, including food, she refused to accept unless they gave her two -- one for her and one for her  _ .\nIn fact, in her room, we found quite a few old things which she _ to give her sister one day.\nLater that day, I was _  to find that this was not an isolated   story. There were many orphans just like Tanzile. With a lot of things in their rooms, they _ for their brothers and sisters who they hadn't seen for so long.\nPeople sometimes think African children are different from our kids. They think that the children there don't feel pain or sadness or love. But that is not true. Their pain is deep. And so is their love.", 
    "options": [
        [
            "gives", 
            "wants", 
            "eats", 
            "keeps"
        ], 
        [
            "thanks", 
            "sorry", 
            "goodbye", 
            "hello"
        ], 
        [
            "Because", 
            "Since", 
            "But", 
            "So"
        ], 
        [
            "duty", 
            "story", 
            "idea", 
            "study"
        ], 
        [
            "received", 
            "bought", 
            "sold", 
            "made"
        ], 
        [
            "because", 
            "friends", 
            "nurse", 
            "sister"
        ], 
        [
            "threw", 
            "wasted", 
            "used", 
            "collected"
        ], 
        [
            "interested", 
            "pleased", 
            "surprised", 
            "tired"
        ], 
        [
            "made", 
            "got", 
            "left", 
            "waited"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "C", 
        "B", 
        "A", 
        "D", 
        "D", 
        "C", 
        "D"
    ], 
    "source": "middle2330"
}