{
    "article": "When I moved into an empty dormitory for the first time two years ago, I was certain of a few things. Firstly, I realized that I didn't _ anybody at the school. Secondly, I knew that I wanted to work hard at my lessons and learn something useful. And thirdly, I wanted to have a good time with new classmates, without my parents around.\nThe first _ frightened me in the beginning. But that _ quickly disappeared. It was the other two goals _ ended up being my difficulties. I knew that it was hard to devote enough time to class and to social efforts. But I wanted to _ in both. I knew this would be a _ , but I didn't realize how much until classes began.\nI got on well with the other girls who lived in my dorm. _ , instead of finishing my homework _ it was due, I went upstairs and had ice cream with my neighbor. I always finished it the next day between classes. I knew it wasn't very good and the grade I _ showed my lack of effort.\nI was _ that I needed to find some sort of balance. So I created a schedule that would _ my time up between going to class, doing homework, and relaxing. It seemed like a good idea, but I was only able to _ it for a few days. A schedule like that was too much pressure.\nSo I tried another _ . Each week I made a list of everything I had to get done during that week. Then, under the list of things I had to get done, I made a list of things I could do if I had time.\nThis is the method I have used since then. I'm glad that I've learned to _ things and it has _ prepare me for what is to come after graduation.", 
    "options": [
        [
            "know", 
            "recognize", 
            "realize", 
            "like"
        ], 
        [
            "teacher", 
            "day", 
            "class", 
            "realization"
        ], 
        [
            "happiness", 
            "excitement", 
            "fear", 
            "desire"
        ], 
        [
            "which", 
            "what", 
            "that", 
            "who"
        ], 
        [
            "win", 
            "succeed", 
            "get", 
            "wish"
        ], 
        [
            "chance", 
            "job", 
            "challenge", 
            "time"
        ], 
        [
            "Often", 
            "Seldom", 
            "Unluckily", 
            "Fortunately"
        ], 
        [
            "because", 
            "when", 
            "after", 
            "before"
        ], 
        [
            "required", 
            "took", 
            "accepted", 
            "received"
        ], 
        [
            "asleep", 
            "awake", 
            "ashamed", 
            "aware"
        ], 
        [
            "fix", 
            "divide", 
            "put", 
            "build"
        ], 
        [
            "use", 
            "keep", 
            "follow", 
            "make"
        ], 
        [
            "plan", 
            "energy", 
            "pressure", 
            "effort"
        ], 
        [
            "do", 
            "control", 
            "balance", 
            "hold"
        ], 
        [
            "had", 
            "helped", 
            "let", 
            "forced"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "C", 
        "C", 
        "B", 
        "C", 
        "A", 
        "D", 
        "D", 
        "D", 
        "B", 
        "C", 
        "A", 
        "C", 
        "B"
    ], 
    "source": "middle1935"
}