{
    "article": "\"My daughter has me around every day. We read, write and sleep together. However, many students of mine have no _ . They have to be _ from their parents. The most heart-warming way of _ a kid is the company of parents.\" At a student care activity called \"Home & Love\", Chen Shaoguang, the principal of No.1 Primary School says, many parents are going out as migrant workers to make money to _ the family. So the students at a very young age have to be _ at home. And that's when their childhood begins to be covered by the feeling of _ and the difficulty of fitting into a group.\nAs _ by Principal Chen, left-behind children can communicate with their parents by installing cameras on the TV. Thanks to the modern technology, the connection between a traditional TV at home and parents' mobile phones becomes much more _ . And the long distance between the left-behind children and their parents is being shortened. Principal Chen also calls for more _ from society. He strongly believes that a better _ for those left-behind children can be created.\nAccording to a survey by the All-China Women's Federation, the _ of China's \"left-behind children\" is more than 61 million. It is the same as the _ of Britain. _ them, 42.8% have parents that both are migrant workers. _ most of the children are being taken care of by their relatives, 7.3% are uncertain to be taken care of.", 
    "options": [
        [
            "problem", 
            "reason", 
            "choice", 
            "decision"
        ], 
        [
            "protected", 
            "stopped", 
            "returned", 
            "separated"
        ], 
        [
            "raising", 
            "rising", 
            "punishing", 
            "trusting"
        ], 
        [
            "encourage", 
            "support", 
            "solve", 
            "develop"
        ], 
        [
            "depended", 
            "managed", 
            "stayed", 
            "left"
        ], 
        [
            "kindness", 
            "happiness", 
            "loneliness", 
            "fairness"
        ], 
        [
            "introduced", 
            "invented", 
            "increased", 
            "interviewed"
        ], 
        [
            "independent", 
            "convenient", 
            "complete", 
            "difficult"
        ], 
        [
            "prediction", 
            "resolution", 
            "discussion", 
            "attention"
        ], 
        [
            "future", 
            "confidence", 
            "tradition", 
            "agreement"
        ], 
        [
            "situation", 
            "number", 
            "trouble", 
            "challenge"
        ], 
        [
            "finding", 
            "condition", 
            "population", 
            "result"
        ], 
        [
            "Among", 
            "Between", 
            "With", 
            "From"
        ], 
        [
            "But", 
            "Because", 
            "So", 
            "Although"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "A", 
        "B", 
        "D", 
        "C", 
        "A", 
        "B", 
        "D", 
        "A", 
        "B", 
        "C", 
        "A", 
        "D"
    ], 
    "source": "middle1144"
}