{
    "article": "Mr. and Mrs. King have lived in our town for nearly twenty years. They have a bookshop by the bus station. They're  _  to everybody and have a lot of friends. They often  _  the poor students and sell them some books cheaply. So there're many young men in their shop. Of course people  _  them and their friends often call on them and  talk with  them. We can always hear their rooms are full of  _  and quarrel. It was a Friday evening. Mr. and Mrs. King were going to have a picnic on the island the next  _  . It was a little far from our town. So they had to  get up  earlier than usual to catch a six o'clock train. After  _  a few friends came to see them while they were cooking some  _  and drinks for the picnic. Mr. king and his wife had to stop  to receive  them. They talked a lot and few of them looked at the  _  on the wall. Mr. and Mrs. King were anxious but they couldn't tell the visitors about it. The woman thought for a few  _  and had an idea. She said to her  _  , \"Oh, it's eleven o'clock! You'd better stop talking, dear! Our guests are anxious to  go home  ! Mr. king heard this and stood up and said  _  to the visitors and they left soon.", 
    "options": [
        [
            "had", 
            "friendly", 
            "cold", 
            "careful"
        ], 
        [
            "help", 
            "hurt", 
            "hit", 
            "watch"
        ], 
        [
            "know", 
            "understand", 
            "meet", 
            "like"
        ], 
        [
            "cry", 
            "shout", 
            "noise", 
            "laugh"
        ], 
        [
            "morning", 
            "afternoon", 
            "evening", 
            "laugh"
        ], 
        [
            "breakfast", 
            "lunch", 
            "supper", 
            "meal"
        ], 
        [
            "clothes", 
            "bags", 
            "books", 
            "food"
        ], 
        [
            "phone", 
            "photo", 
            "clock", 
            "picture"
        ], 
        [
            "minutes", 
            "days", 
            "weeks", 
            "months"
        ], 
        [
            "visitor", 
            "husband", 
            "brother", 
            "father"
        ], 
        [
            "hello", 
            "goodbye", 
            "sorry", 
            "nothing"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "D", 
        "D", 
        "A", 
        "C", 
        "D", 
        "C", 
        "A", 
        "B", 
        "C"
    ], 
    "source": "middle555"
}