{
    "article": "This is a message world. You speak, write letters, make a telephone call. You words carry a message. People communicate with words. Do you think you can communicate without words?\nA smile on your face shows you are _ or friendly. Tears in your eyes tell others that you are sad. When you put up your hands in class, the teacher knows you want to say something or ask questions. You _ your head, and people know you are saying \"No\". You nod and people know you are saying \"Yes\". Other things can also carry messages.\nFor example, a sign at the bus helps you to know _ bus to take. A sign on the door helps you where to go in or out. Have you ever thought that there are a lot of signs around you and that you receive messages from them all the time?\nPeople can communicate in many other ways. An artist can use his _ to tell beautiful scenery, interesting people, and many other things. A musician can express his or her feelings through music. You can _ happiness, sorrows, worries, sadness, and beauty by listening to some kinds of music. A dancer can express his or her feelings through his or her body. That's a kind of body _ \nBooks are written to _ you about all the wonderful things in the world and also about people and their ideas and feelings. Books, magazines, newspapers, TVs, radios, QQ,s e-mails, movies and mobile phones _ help us communicate with others. They can help us to know what is going on in the world and what other people are thinking about.\nI enjoy reading in my _ time. An interesting book, a cup of green tea, a comfortable chair. I can spend my Sunday afternoons _ and happily in the warm winter sunshine.\nCommunication is everywhere in the world and in our lives.", 
    "options": [
        [
            "safe", 
            "happy", 
            "young", 
            "alone"
        ], 
        [
            "shake", 
            "lift", 
            "touch", 
            "wash"
        ], 
        [
            "what", 
            "when", 
            "where", 
            "which"
        ], 
        [
            "buildings", 
            "meanings", 
            "paintings", 
            "beginnings"
        ], 
        [
            "provide", 
            "volunteer", 
            "consider", 
            "experience"
        ], 
        [
            "direction", 
            "emotion", 
            "business", 
            "language"
        ], 
        [
            "tell", 
            "say", 
            "talk", 
            "speak"
        ], 
        [
            "both", 
            "all", 
            "none", 
            "neither"
        ], 
        [
            "busy", 
            "hard", 
            "free", 
            "easy"
        ], 
        [
            "badly", 
            "nearly", 
            "quietly", 
            "Terribly"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "D", 
        "C", 
        "D", 
        "D", 
        "A", 
        "B", 
        "C", 
        "C"
    ], 
    "source": "middle711"
}