{
    "article": "I will never forget the Sunday afternoons I spent at my grandfather's farm in western Pennsylvania when I was a little boy. Miles of winding stone walls around the house provided endless hours of _ for a city kid like me.\nI can still remember one afternoon when I was eight years old. Since my first visit to the _ , I'd wanted to be allowed to climb the stone walls around the farm. My parents would never approve . Still, my wish to climb across those walls grew so _ . One spring afternoon, I picked up all my courage and _ the living room, where the adults were sitting and talking over tea after dinner.\n\"Can I climb the stone walls?\" I asked. Immediately the women in the room cried. \"Heavens, no! You'll _ yourself!\" I wasn't too disappointed; their reply was just as I'd expected. But before I could leave the room, my _ stopped me. \"Wait a minute.\" I heard him say, \"Let the boy climb the stone walls. He has to _ to do things for himself.\"\n\"Hurry up,\" he said to me, \"and come and see me when you get back\". For the next two and a half hours I climbed those old walls and had the _ of my life. Later I met with my grandfather to tell him about my adventure . I'll never forget what he said. \"Fred,\" he said, smiling, \"you made this day  _ day just by being yourself. Always _ , there's only one person in this whole world like you, and I like you exactly as you are.\"", 
    "options": [
        [
            "sadness", 
            "pity", 
            "fun", 
            "puzzle"
        ], 
        [
            "farm", 
            "house", 
            "home", 
            "room"
        ], 
        [
            "weak", 
            "high", 
            "low", 
            "strong"
        ], 
        [
            "visited", 
            "entered", 
            "saw", 
            "left"
        ], 
        [
            "enjoy", 
            "hurt", 
            "forget", 
            "lose"
        ], 
        [
            "mother", 
            "father", 
            "grandfather", 
            "friend"
        ], 
        [
            "agree", 
            "finish", 
            "promise", 
            "learn"
        ], 
        [
            "time", 
            "love", 
            "regret", 
            "failure"
        ], 
        [
            "terrible", 
            "difficult", 
            "special", 
            "hopeless"
        ], 
        [
            "hope", 
            "forget", 
            "value", 
            "Remember"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "B", 
        "B", 
        "C", 
        "D", 
        "A", 
        "C", 
        "D"
    ], 
    "source": "middle583"
}