{
    "article": "My friends and I had just finished lunch at a hotel when it started to pour heavily. When it became lighter, I decided to brave the rain  to get my _ , which was parked at my office three streets away. My friends argued that I shouldn't go, mainly _ I was seven months pregnant   then. I told them that I'd be very _ . One of them wanted to come with me but I insisted that she should stay with another friend who needed _ with her baby.\nI walked out of the _ and started making my way to the car. At the traffic crossing,a car stopped and the passenger got off with an umbrella. _ I knew what was happening, he walked right beside me and told me he'd send me to my destination . I was very embarrassed  and refused, _ he insisted on offering me his help. During our walk, he kept telling me to walk slower, as the ground was _ . When we got to the car parking lot, I _ him and we parted . I did not get his _ and may not even recognize  him now. Did he purposely stop for me? I'll never know.\nSo how did I pay it forward? I was at home when I _ two Indian construction  workers walking in the heavy rain. They were probably on their way to the construction sitenear my home, which was a long walk. I went out and _ them an umbrella. The two men were wet through. They were surprised by my action , and I told them they should _ the umbrella and keep it. They were very _ . And like me, probably wondered why a stranger was giving such kindness.", 
    "options": [
        [
            "money", 
            "bag", 
            "car", 
            "raincoat"
        ], 
        [
            "because", 
            "so", 
            "unless", 
            "if"
        ], 
        [
            "active", 
            "strong", 
            "busy", 
            "careful"
        ], 
        [
            "courage", 
            "water", 
            "help", 
            "food"
        ], 
        [
            "hospital", 
            "hotel", 
            "office", 
            "supermarket"
        ], 
        [
            "Before", 
            "Since", 
            "When", 
            "For"
        ], 
        [
            "so", 
            "but", 
            "and", 
            "as"
        ], 
        [
            "wet", 
            "empty", 
            "dry", 
            "hard"
        ], 
        [
            "paid", 
            "asked", 
            "thanked", 
            "left"
        ], 
        [
            "office", 
            "name", 
            "money", 
            "umbrella"
        ], 
        [
            "heard", 
            "left", 
            "noticed", 
            "sent"
        ], 
        [
            "bought", 
            "sold", 
            "threw", 
            "passed"
        ], 
        [
            "take", 
            "bring", 
            "buy", 
            "lend"
        ], 
        [
            "foolish", 
            "sad", 
            "grateful", 
            "cheerful"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "C", 
        "B", 
        "A", 
        "B", 
        "A", 
        "C", 
        "B", 
        "C", 
        "D", 
        "A", 
        "C"
    ], 
    "source": "middle1954"
}