{
    "article": "Paris, France\nNew _ have taken place in Pairs in recent years. Paris used to be among Europe's  busiest cities. Traffic jams could be seen all the time. But now there is a new 2.5-kilometre-long car-free area inside the _ The Louvre attracts world's _ . People visit there not only for the art works,  but also for the roof of the building which is like a flying carpet. The world's most beautiful city is now even more beautiful.\nLijiang River National Park, China\nLijiang River is in Guilin. It is well-known _ its clear water, limestone caves and green hills. The hills have beautiful names depending on different shapes, such as \"Elephant Trunk\". These attract many Chinese poets and artists. The best way to _ Lijiang River is to take an 83 km boat trip from Guilin to Yangshuo in summer.\nZurich, Switzerland\nWhat do you think Zurich is famous for?  Great banks? Yes. People can find many Swiss _ and foreign banks here. But the city is of great interest to many people for another _ . Zurich hosts Europe's largest street party each year. Its Street Parade has overtaken London's Notting Hill Carnival . What was _ in the city in 2014? In August, Zurich held the European  Athletics Championships . This gave tourists a _ to see the world's top athletes  making new records.\nAdelaide, Australia\nMany people may know _ or Melbourne. They are big cities in Australia. But Adelaide wins people's hearts with great festivals and tasty _ . Adelaide Fringe Festival is the largest art festival in Australia. Every February and March, people celebrate with outdoor _ works, dance performances and live music. Adelaide has many kinds of foreign foods. British fish and chips, Italian pizza and German pork can be found in most _ .", 
    "options": [
        [
            "changes", 
            "change", 
            "fun", 
            "funs"
        ], 
        [
            "country", 
            "town", 
            "city", 
            "cities"
        ], 
        [
            "men", 
            "animals", 
            "children", 
            "tourists"
        ], 
        [
            "by", 
            "for", 
            "of", 
            "from"
        ], 
        [
            "watch", 
            "travel", 
            "enjoy", 
            "go"
        ], 
        [
            "banks", 
            "rivers", 
            "cities", 
            "restaurants"
        ], 
        [
            "excuse", 
            "word", 
            "reason", 
            "street"
        ], 
        [
            "hot", 
            "great", 
            "living", 
            "alive"
        ], 
        [
            "chance", 
            "chair", 
            "stage", 
            "TV"
        ], 
        [
            "Sydney", 
            "Washington", 
            "Tokyo", 
            "Parries"
        ], 
        [
            "drink", 
            "fish", 
            "pizza", 
            "food"
        ], 
        [
            "art", 
            "music", 
            "dancing", 
            "singing"
        ], 
        [
            "restaurants", 
            "hotels", 
            "families", 
            "streets"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "D", 
        "B", 
        "C", 
        "A", 
        "C", 
        "A", 
        "A", 
        "A", 
        "D", 
        "A", 
        "A"
    ], 
    "source": "middle291"
}