{
    "article": "When Susan told me that she was terribly ill and probably would die. I cried. I didn't understand why this happened to my best friend. Then Susan  _  me a red ribbon without saying anything. A month later, Susan was at a hospital about two hours away from where we lived. I asked my dad to take me to see her. I wanted to give my best friend a  _  . So I took out the ribbon and cut it into two pieces with scissors . I put one in my pocket and the other in an envelope , along with a letter explaining it to her. I told her to keep her  _  beside her bed, and I would keep mine near me, too. Then I went to the hospital one Friday afternoon, wondering if the ribbon would  _  anything to her. I walked into the room and ran over to give her a big hug. Then I gave her a teddy bear and the envelope. We talked for a while and then she started looking  _  , so I asked her to get some rest and left the hospital. All the way home I  _  the ribbon close to me. For the next four months, the ribbon was with me  _  I went: school, home, shopping, and at friends' houses. Where I went, it went. It was something to remind me that I had a friend who would  _  home very soon. Susan said that she wore her ribbon  _  her arm all the time and she always had it close to her when she was being tested and treated. Finally, Susan came home! I was so happy. That night, I looked at the ribbon which was still with me. I had a feeling it would never  _  , that I would remember what had happened during the time she had been ill.", 
    "options": [
        [
            "brought", 
            "left", 
            "showed", 
            "handed"
        ], 
        [
            "book", 
            "gift", 
            "flower", 
            "photo"
        ], 
        [
            "friend", 
            "hope", 
            "paper", 
            "half"
        ], 
        [
            "share", 
            "reach", 
            "mean", 
            "send"
        ], 
        [
            "tired", 
            "nervous", 
            "hungry", 
            "worried"
        ], 
        [
            "saved", 
            "held", 
            "caught", 
            "found"
        ], 
        [
            "somewhere", 
            "anywhere", 
            "everywhere", 
            "nowhere"
        ], 
        [
            "be", 
            "see", 
            "find", 
            "lose"
        ], 
        [
            "in", 
            "at", 
            "beside", 
            "around"
        ], 
        [
            "change", 
            "pass", 
            "leave", 
            "finish"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "D", 
        "C", 
        "A", 
        "B", 
        "C", 
        "A", 
        "D", 
        "C"
    ], 
    "source": "middle1489"
}