{
    "article": "\"Get up, get up, Jim. It's time to get up!\" mother said while she was  _  me. I opened my eyes and looked at the clock. \"Oh, dear! It's a quarter to eight already. I'll be late for school again,\" I thought. I  _  out of the bed, washed my face, and then hurried to the bus stop without breakfast. As soon as I  got on  the bus, it started running. \"I'm sure I can get to school in time,\" I said to myself. Suddenly the bus stopped. The bus driver got off the bus, then got on the bus again and said, \"I'm sorry, ladies and gentlemen. There's  _  wrong with the bus. Please get off the bus and wait for another one. \" \"I couldn't wait. The school is not  _  . I'd better run to school,\" I thought, and then I began to run. But before I got to school, it began to  _  heavily. When I  _  the classroom, I was wet shivering with cold. The physics teacher had already begun his lesson. It was Mr Smith. He was about fifty years old. All the students were a little afraid of him and--so was I. I liked neither him nor his physics lessons. I hesitated for a moment, and then I opened the door. \"I'm very sorry, Mr Smith. I'm late again,\" I said with a red face. \"It's you again, Jim,\" Mr Smith said  _  , \"I've told you not to be late, but you... \" He suddenly stopped and looked at my wet clothes. He turned to  the class  and said, \"I'm very sorry, my boys and girls,\" With these words he quickly took off his own jacket and handed it to me. \"Now, take off your wet coat and put this one on, or you'll catch cold. \" he said kindly. I went to my seat with Mr Smith's jacket on. It was a bit larger for me but I felt very  _  in it. I found, for the first time, physics was so interesting and how well I could understand it!", 
    "options": [
        [
            "catching", 
            "touching", 
            "pushing", 
            "helping"
        ], 
        [
            "jumped", 
            "moved", 
            "got", 
            "ran"
        ], 
        [
            "everything", 
            "nothing", 
            "anything", 
            "something"
        ], 
        [
            "far", 
            "near", 
            "big", 
            "small"
        ], 
        [
            "shine", 
            "snow", 
            "rain", 
            "blow"
        ], 
        [
            "entered", 
            "reached", 
            "saw", 
            "left"
        ], 
        [
            "slowly", 
            "quietly", 
            "happily", 
            "angrily"
        ], 
        [
            "cold", 
            "excited", 
            "warm", 
            "nervous"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "A", 
        "C", 
        "B", 
        "D", 
        "C"
    ], 
    "source": "middle434"
}