{
    "article": "Sometimes, I doubt  whether there is any love between my parents. Every day they are busy trying to _ money. They don't act in the romantic  ways that I read in books or I see on TV. They never say, \"I love you\". My father has a bad temper(, ), and it is easy for him to be angry in his daily life.\nOne day, my mother was sewing a quilt  . I sat down beside her.\n\"Mom, I have a question to ask you.\" I said after a while.\n\"What?\" she asked, still working.\n\"Is there _ between you and Dad?\" I asked her _ a very low voice.\nMy mother stopped her work and _ her head with surprise in her eyes. She didn't answer immediately. Then she bowed  her head and went on sewing .\nI thought I had hurt her. At last my mother said: \"Susan, look at this thread . Sometimes it appears, but most of the time, it disappears in the quilt. It makes the quilt _ . If life is a quilt, then love should be a thread. It can hardly be seen anywhere, _ it's really there.\"\nI listened carefully but I didn't understand her _ the next spring. My father suddenly got sick. My mother had to stay with him in the _ for a month.\nAfter they got back, she helped my father walk slowly down the road every day. My father had never been so weak. \"Dad, how are you feeling now?\" I asked him one day.\n\"Susan, don't worry about me.\" he said gently. \"I just like _ with your mom.\"\nOnce I thought love meant flowers, gifts and sweet kisses. Now, I know that love is the thread that holds a family together.", 
    "options": [
        [
            "have", 
            "make", 
            "put", 
            "spend"
        ], 
        [
            "love", 
            "money", 
            "friendship", 
            "peace"
        ], 
        [
            "with", 
            "under", 
            "in", 
            "by"
        ], 
        [
            "nodded", 
            "shook", 
            "lowered", 
            "raised"
        ], 
        [
            "big", 
            "wide", 
            "thick", 
            "strong"
        ], 
        [
            "and", 
            "for", 
            "but", 
            "so"
        ], 
        [
            "until", 
            "because", 
            "when", 
            "unless"
        ], 
        [
            "school", 
            "home", 
            "garden", 
            "hospital"
        ], 
        [
            "talking", 
            "walking", 
            "sitting", 
            "living"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "D", 
        "D", 
        "C", 
        "A", 
        "D", 
        "B"
    ], 
    "source": "middle2001"
}