{
    "article": "A long time ago, the animals often held sports meetings. If an animal could prove himself the  _  runner, he would get a prize. The prize was a pair of horns . The race was  _  on the road through a forest. There were many bushes along the road. All the animals went to the place of meeting. They chose the  _  as the judge . The rabbit  _  the deer would try for the prize. The rabbit was given the first chance. \"I want to  _  the prize.\" the rabbit said. \"but I'd better first look over the road where I will run.\" So he went into the  _  . He was gone for so long that the fox was  _  to look for him. The fox found the rabbit  _  the bushes along the road. The fox went back and told the other  _  what the rabbit was doing. When the rabbit came out of the forest, he was ready to  _  the race. \"Oh, no!\", said the bear. \"We cannot allow you to  take part in  the race. You like cleaning the bushes so much. You may keep on cleaning the bushes instead of trying for the prize.\" The bear talked to the deer. \"It is your  _  to try.\" Then the animals  _  the deer to try his best. The deer  _  as fast as he could along the road. When the deer returned to the place of meeting. The bear said he was the winner of the race. As the bear  _  the prize to the deer, he said, \"You shall wear the horns on your head. You are the fastest runner.\"", 
    "options": [
        [
            "bravest", 
            "tallest", 
            "wisest", 
            "fastest"
        ], 
        [
            "treated", 
            "held", 
            "suggested", 
            "laid"
        ], 
        [
            "rabbit", 
            "fox", 
            "bear", 
            "deer"
        ], 
        [
            "and", 
            "but", 
            "or", 
            "so"
        ], 
        [
            "fail", 
            "win", 
            "find", 
            "rush"
        ], 
        [
            "grass", 
            "hole", 
            "room", 
            "forest"
        ], 
        [
            "spread", 
            "mailed", 
            "sent", 
            "introduced"
        ], 
        [
            "cleaning", 
            "discovering", 
            "planting", 
            "stealing"
        ], 
        [
            "winners", 
            "guests", 
            "students", 
            "animals"
        ], 
        [
            "return", 
            "begin", 
            "stop", 
            "admire"
        ], 
        [
            "trick", 
            "choice", 
            "turn", 
            "form"
        ], 
        [
            "showed", 
            "dreamt", 
            "learnt", 
            "encouraged"
        ], 
        [
            "jumped", 
            "ran", 
            "walked", 
            "spoke"
        ], 
        [
            "produced", 
            "sold", 
            "gave", 
            "lent"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "C", 
        "A", 
        "B", 
        "D", 
        "C", 
        "A", 
        "D", 
        "B", 
        "C", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "middle1430"
}