{
    "article": "Years ago, if a teenager has some problems in her life, she might go home and wrote in her diary. Now, a teenager with the same problems might go onto the Internet and write about  _  in a blog .  _  many ways, a diary and a blog are very similar. So, what makes blogging different  _  writing in a traditional diary?  the  biggest difference is that blogging is  _  more public than a diary. Usually, a teenager treats her diary like a  _  full of secrets that she does not want to share . Because blogging is such a public way of  writing  , it has both good and bad points. The biggest problem with blogging is that  anyone  can read what you write.  _  you write something bad about a friend, that friend might read your blog and get  _  . Because we do not always  think about  things carefully before we write them down, it is easy  to write  something that hurts someone's feelings in a blog. So we  _  be careful of what we write. There are also advantages of blogging, of course. People choose to blog  _  they know that their friends will read what they write. Blogs are a very good  _  to write about daily life, as long as people are careful about what they write. However I still prefer my old diary.", 
    "options": [
        [
            "in", 
            "its", 
            "they", 
            "them"
        ], 
        [
            "In", 
            "On", 
            "At", 
            "Of"
        ], 
        [
            "than", 
            "from", 
            "for", 
            "of"
        ], 
        [
            "many", 
            "much", 
            "more", 
            "most"
        ], 
        [
            "book", 
            "notebook", 
            "movie", 
            "file"
        ], 
        [
            "Before", 
            "While", 
            "If", 
            "Unless"
        ], 
        [
            "happy", 
            "unhappy", 
            "lucky", 
            "unlucky"
        ], 
        [
            "should", 
            "can", 
            "may", 
            "might"
        ], 
        [
            "so", 
            "because", 
            "but", 
            "when"
        ], 
        [
            "information", 
            "message", 
            "way", 
            "road"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "B", 
        "B", 
        "A", 
        "C", 
        "B", 
        "A", 
        "B", 
        "C"
    ], 
    "source": "middle540"
}