{
    "article": "You may have a lot of friends and expect your friendship to last a lifetime. However, lifelong friendships are not  _  what everybody can get. Friends sometimes misunderstand each other. For one thing, you may want your  _  to be near at hand, but also you need your independence  .\nFor example, when one of your friends comes asking  _  it is all right to spend the evening in your house, sometimes you just say \" _ \" to him or her because it is not convenient for you. Unfortunately, not all your friends  _  this type of independence. They believe that friends can ask for any favor and the answer should always be \"yes\".\nAlso, misunderstanding sometimes happens when you ask for  _ . You expect your friends top help you whenever you need. But the fact is, your friends may not always drop everything to satisfy  _  of your needs. This may make you  _  with them and your friendship could end. The most important thing for you and your friends to do is to always show understanding and respect for each other.\nLifelong friendships don't develop overnights. In a true friendship, both people equally  _  each other. Long-term friendships provide the time to build up a  _  together. As you spend more time with your friend, you are creating special times and stocking up   on memories.", 
    "options": [
        [
            "always", 
            "sometimes", 
            "never", 
            "ever"
        ], 
        [
            "parents", 
            "friends", 
            "students", 
            "teachers"
        ], 
        [
            "when", 
            "as", 
            "if", 
            "why"
        ], 
        [
            "yes", 
            "no", 
            "good", 
            "OK"
        ], 
        [
            "provide", 
            "understand", 
            "produce", 
            "invent"
        ], 
        [
            "help", 
            "food", 
            "money", 
            "respect"
        ], 
        [
            "every", 
            "each", 
            "both", 
            "either"
        ], 
        [
            "happy", 
            "excited", 
            "cheerful", 
            "angry"
        ], 
        [
            "connect", 
            "compare", 
            "support", 
            "solve"
        ], 
        [
            "story", 
            "family", 
            "character", 
            "history"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "C", 
        "B", 
        "B", 
        "A", 
        "B", 
        "D", 
        "C", 
        "D"
    ], 
    "source": "middle1929"
}