{
    "article": "When our children were younger, it was popular for city people to buy a small farm in the country and  _  a few animals there. One of our new neighbors  _  some ducks. They seemed very lovely. However, they were  _  to run around in their yard and the neighbors' yards --  _  ours. Our vegetables were their favorite food. Often we would \"shoo\" the ducks home and wonder  _  there wasn't a fence to keep them. One day, I asked her if she  _  her ducks were bringing trouble to my garden. She told me that they were her  _  and he was away traveling. My attitude to her was bad. We realized that our neighbors were not planning to build a  _  , so our son built one. The ducks now stayed in their own yard. I didn't see my neighbor again  _  months later. A women's church group asked me to  _  at their mother and daughter's party. The topic was \"Love\". Much to my  _  , the first woman I saw when I walked into the church was my neighbor. I knew I could not speak about love to them when I hadn't been  _  with my neighbor. So I walked  _  to her and said sorry for my attitude. She forgave me and then we talked a lot. Do you have anybody like that in your life? Let me  _  you, if at all possible, to clear the  _  between you.", 
    "options": [
        [
            "put", 
            "keep", 
            "send", 
            "take"
        ], 
        [
            "bought", 
            "sold", 
            "dropped", 
            "showed"
        ], 
        [
            "made", 
            "allowed", 
            "forced", 
            "chosen"
        ], 
        [
            "except", 
            "but", 
            "without", 
            "including"
        ], 
        [
            "what", 
            "why", 
            "if", 
            "when"
        ], 
        [
            "saw", 
            "understood", 
            "thought", 
            "realized"
        ], 
        [
            "husband's", 
            "daughter's", 
            "wife's", 
            "grandma's"
        ], 
        [
            "fence", 
            "house", 
            "nest", 
            "room"
        ], 
        [
            "after", 
            "before", 
            "until", 
            "while"
        ], 
        [
            "speak", 
            "talk", 
            "say", 
            "tell"
        ], 
        [
            "excitement", 
            "joy", 
            "glad", 
            "surprise"
        ], 
        [
            "nice", 
            "patient", 
            "friendly", 
            "annoyed"
        ], 
        [
            "up", 
            "along", 
            "towards", 
            "down"
        ], 
        [
            "offer", 
            "lift", 
            "encourage", 
            "afford"
        ], 
        [
            "air", 
            "difficulty", 
            "pleasure", 
            "trash"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "B", 
        "D", 
        "B", 
        "D", 
        "A", 
        "A", 
        "C", 
        "A", 
        "D", 
        "B", 
        "A", 
        "C", 
        "A"
    ], 
    "source": "middle1787"
}