{
    "article": "There were two villages in South Asia. They were always fighting each other for more farms. One village lived in the low land and the other lived  _  in the mountains. The mountain people came to the low land one day. They stole a  _  from one of the low land families and took him back up into the mountains. The people in the low land didn't know  _  to climb the mountain. They didn't know where to find the mountain people. Even so, they sent their  _  fighters to climb the mountain to bring the baby back. The fighters  _  many ways of climbing. They used ropes, and they also used ladders. At last, they stepped  _  others' shoulders to climb. But  _  worked. After several days of hard work, they climbed only 100 meters. Feeling  _  , the fighters decided to return to their village. As they were ready to go back, they saw the baby's mother  _  to them. They were greatly surprised to see her baby was on her back. How could it be? They asked the mother how she  _  the baby. She said, \" Because it isn't your baby. \" As long as you have love in your heart, there is no mountain you can't climb.", 
    "options": [
        [
            "low", 
            "high", 
            "far", 
            "deep"
        ], 
        [
            "baby", 
            "dog", 
            "horse", 
            "ladder"
        ], 
        [
            "what", 
            "why", 
            "how", 
            "which"
        ], 
        [
            "tallest", 
            "youngest", 
            "oldest", 
            "best"
        ], 
        [
            "made", 
            "took", 
            "trird", 
            "got"
        ], 
        [
            "to", 
            "on", 
            "in", 
            "at"
        ], 
        [
            "none", 
            "neither", 
            "all", 
            "both"
        ], 
        [
            "hungry", 
            "lonely", 
            "hopeless", 
            "tired"
        ], 
        [
            "turning", 
            "pointing", 
            "shouting", 
            "walking"
        ], 
        [
            "fed", 
            "saved", 
            "caught", 
            "carried"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "D", 
        "C", 
        "B", 
        "A", 
        "C", 
        "D", 
        "B"
    ], 
    "source": "middle1366"
}