{
    "article": "In New York, on a Friday night, a poor young artist stood at the gate of a train station. He was playing his  _  . His music was so great that many people put money into his  _  . The next day, the young artist came to the  _  place, and played the violin as usual. Different from the day before, he took out a piece of paper and put  _  on the ground. The paper said, \"Last night, a man named George Sang put an important thing into my hat by mistake . Please come to  _  it soon.\"  _  about half an hour, a(an)  _  man got there in a hurry, \"Oh, it's you. You did come here.\" The young violinist asked  _  , \"Are you Mr. George Sang?\" \"Yes! Yes!\" Then the violinist asked, \"Did you lose something?\" \"Lottery .It's the most valuable lottery in my 70 years of life,\" said the man. The violinist  took out  a lottery ticket. George Sang's name was on it, so the violinist  _  it to him. Later someone asked the violinist, \"Since you  had to  play the violin every day to make your tuition in the university , why didn't you keep the lottery ticket for yourself?\" The violinist said, \"  _  I don't have much money, I live happily; but if I lose honesty, I won't be happy forever .\" Through our lives, we can get a lot and lose so  _  . But being  _  should always be with us. If we act in a dishonest way, we may be  _  in a short period. However, from the long-term view, we will be a loser .", 
    "options": [
        [
            "piano", 
            "guitar", 
            "violin", 
            "sax"
        ], 
        [
            "bowl", 
            "hat", 
            "pocket", 
            "hands"
        ], 
        [
            "interesting", 
            "different", 
            "strange", 
            "same"
        ], 
        [
            "it", 
            "its", 
            "they", 
            "them"
        ], 
        [
            "borrow", 
            "buy", 
            "get", 
            "bring"
        ], 
        [
            "After", 
            "Before", 
            "From", 
            "When"
        ], 
        [
            "young", 
            "old", 
            "small", 
            "tall"
        ], 
        [
            "coldly", 
            "angrily", 
            "calmly", 
            "sadly"
        ], 
        [
            "sold", 
            "bought", 
            "gave", 
            "lent"
        ], 
        [
            "Although", 
            "Once", 
            "If", 
            "Unless"
        ], 
        [
            "many", 
            "much", 
            "little", 
            "few"
        ], 
        [
            "kind", 
            "rich", 
            "honest", 
            "poor"
        ], 
        [
            "sad", 
            "happy", 
            "sorry", 
            "unlucky"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "D", 
        "A", 
        "C", 
        "A", 
        "B", 
        "C", 
        "C", 
        "A", 
        "B", 
        "C", 
        "B"
    ], 
    "source": "middle1906"
}