{
    "article": "Gwondo was a trainer of dogs. He would go out every day with his dogs, to  _ them how to catch animals so all his tribe  could eat.\nWherever Gwondo went, his tribe could see him away in the distance _  his white hair would shine in the sunlight. The tribe _ would say to their children, \"See, there is Gwondo and his dogs, searching for _  for us all. \" Gwondo went out hunting every day and always came _  with much food. And all were very happy.\nNow Gwondo grew _  and as all humans do, one day he died. The tribe felt sad and cried many days and many nights  _  one day the elders called to their children, \" You have cried enough for Gwondo. Now it is time to think about  living. Go down to the beach and  be happy. \"\nThe children ran down to the beach and looked out to sea.  _  , they all looked at  each other, then turned and ran back to their elders, _  , \"Come quickly. Gwondo, he is back with us. He is out in the sea. \" The elders hurried to the _  and said, \"Yes! It is Gwondo back! He is now a dolphin and lives in the sea. \"\nNow whenever you see  a group of  dolphins in the sea, look for the big old dolphin. You  will know him because be has a large white fin on  _  back. He is Gwondo and he is training the young dolphins to chase  _  close to the beach so that his tribe can catch them.\nGwondo is known to all the tribes  _   the east coast of Australia. They call him their sea dog.", 
    "options": [
        [
            "ask", 
            "teach", 
            "study", 
            "advise"
        ], 
        [
            "before", 
            "unless", 
            "because", 
            "although"
        ], 
        [
            "elders", 
            "guards", 
            "teachers", 
            "visitors"
        ], 
        [
            "food", 
            "water", 
            "oil", 
            "salt"
        ], 
        [
            "down", 
            "out", 
            "back", 
            "about"
        ], 
        [
            "tall", 
            "old", 
            "thin", 
            "strong"
        ], 
        [
            "after", 
            "as", 
            "since", 
            "until"
        ], 
        [
            "Finally", 
            "However", 
            "Anyway", 
            "Suddenly"
        ], 
        [
            "explaining", 
            "warning", 
            "answering", 
            "calling"
        ], 
        [
            "hill", 
            "beach", 
            "forest", 
            "camp"
        ], 
        [
            "its", 
            "his", 
            "her", 
            "my"
        ], 
        [
            "sheep", 
            "fish", 
            "dogs", 
            "dolphins"
        ], 
        [
            "for", 
            "in", 
            "on", 
            "above"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "A", 
        "C", 
        "B", 
        "D", 
        "D", 
        "D", 
        "B", 
        "B", 
        "B", 
        "C"
    ], 
    "source": "middle1940"
}