{
    "article": "This happened to me at the age of twelve. It seems like a long time to remember the name of the old lady. Yet it keeps in my _ that she taught me a lesson in tolerance  which I shall never forget.\nOn a winter afternoon, a friend and I were _ stones onto the roof of the old lady's house. I found myself a perfectly smooth stone and threw it out. The stone was too smooth, however, so it slipped  from my hands and _ straight not for the roof but for a small window on the old lady's back porch . At the sound of broken _ , we knew we were in trouble and ran away.\nI was too scared  about getting caught by the old lady that first night. However, a few days later, when I was sure that I hadn't been _ , I started to feel guilty  for what I had done. She _ greeted me with a smile each day when I gave her the newspaper, but I was no longer able to act comfortably.\nI made up my mind to _ for her window with my paper delivery  money I collected. I put the money in an envelope with a note explaining I was _ for breaking her window and hoped that the seven dollars would cover the cost for repairing it.\nI waited _ it was dark, snuck  up to the old lady's house and put the letter I didn't sign in her door. Once again, I could have the freedom of lookingstraight _ the old lady's kind eyes.\nThe next day, I handed the old lady her paper and was able to return the warm smile that I was _ from her. She thanked me and gave me a bag of cookies.\nReaching for the cookies, I _ an envelope and pulled it out of the bag. When I opened the envelope, I was surprised to see the seven dollars and a short note that said, \"I'm proud of you!\"", 
    "options": [
        [
            "diary", 
            "memory", 
            "notebook", 
            "handbag"
        ], 
        [
            "throwing", 
            "carrying", 
            "choosing", 
            "putting"
        ], 
        [
            "dropped", 
            "knocked", 
            "headed", 
            "landed"
        ], 
        [
            "wall", 
            "roof", 
            "door", 
            "glass"
        ], 
        [
            "discovered", 
            "controlled", 
            "invited", 
            "forgotten"
        ], 
        [
            "often", 
            "just", 
            "hardly", 
            "still"
        ], 
        [
            "ask", 
            "look", 
            "pay", 
            "care"
        ], 
        [
            "late", 
            "sorry", 
            "ready", 
            "good"
        ], 
        [
            "before", 
            "though", 
            "since", 
            "until"
        ], 
        [
            "against", 
            "into", 
            "through", 
            "around"
        ], 
        [
            "receiving", 
            "hearing", 
            "separating", 
            "taking"
        ], 
        [
            "bought", 
            "filled", 
            "felt", 
            "sent"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "D", 
        "A", 
        "D", 
        "C", 
        "B", 
        "D", 
        "B", 
        "A", 
        "C"
    ], 
    "source": "middle2220"
}