{
    "article": "Tom is four years old now. His father works in a middle school and  teaches  P. E. there. His mother works in a shop and his grandma looks after him  at home  . The boy is clever and always  _  that he knows more than his little friends do. One morning Tom ' s father  _  earlier. His school was going to hold a sports meeting that day. Of course, he was going to be  busier  than any other teacher in his school. About two hours later, Tom's grandma 6  _  sick. Her head hurt but she couldn't go to see a  _  by herself. She called her son, but  _  answered. So she asked the little boy to go to tell his father about it As soon as Tom went out, he  met  his friend Henry. And he asked him to go there with him. The boys wanted to watch the sports meeting; and they  _  went there happily. Then they got to school, there were a lot of people on the  _  and the boy ' s 400 metre relay race  _  . They stopped to watch it. And Tom  _  what his grandma told him to do. They were interested in the race. Henry asked, \"Why is the front boy running so fast?\" Tom didn ' t know about it. He  _  for a minute and said, \"What a fool( ) ! Don't you see the other boys with  _", 
    "options": [
        [
            "tells", 
            "wants", 
            "shows", 
            "likes"
        ], 
        [
            "left", 
            "stayed", 
            "came", 
            "ate"
        ], 
        [
            "wanted", 
            "felt", 
            "guessed", 
            "hoped"
        ], 
        [
            "teacher", 
            "policeman", 
            "doctor", 
            "worker"
        ], 
        [
            "nobody", 
            "somebody", 
            "everybody", 
            "anybody"
        ], 
        [
            "all", 
            "some", 
            "many", 
            "both"
        ], 
        [
            "classroom", 
            "playground", 
            "garden", 
            "park"
        ], 
        [
            "finished", 
            "ended", 
            "began", 
            "happened"
        ], 
        [
            "remembered", 
            "forgot", 
            "knew", 
            "said"
        ], 
        [
            "saw", 
            "played", 
            "thought", 
            "jumped"
        ], 
        [
            "sticks", 
            "balls", 
            "tickets", 
            "knives"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "B", 
        "C", 
        "A", 
        "D", 
        "B", 
        "C", 
        "B", 
        "C", 
        "A"
    ], 
    "source": "middle457"
}