{
    "article": "In the United States, \"hitting the books\"means studying a subject with great effort. One of the great challenges for students  _  taking tests. Students  _  long hours preparing for a test. They read all their books carefully, and then read them  a second time  and a third time. They prepare for  _  possible question. They study every night. They are \"hitting the books\". In the United States, most children go to school  _  they are five years old. Public education is a free and most children go to school near their homes. School in these early years is  _  . The children learn to read and write, but they also play games and go on trips. It's not necessary for them to hit the books  _  such an early age. This situation changes as children become older. The subjects become more difficult. Students must  learn about  world history, algebra , and the live sciences. Tests become more common. Pressure  is growing  to hit the books, study hard, and advance .  _  , most students only really begin hitting the books for long hours when they reach high school. Knowledge is a prize that is not easy to gain.", 
    "options": [
        [
            "are", 
            "is", 
            "were", 
            "was"
        ], 
        [
            "cost", 
            "take", 
            "spend", 
            "pay"
        ], 
        [
            "all", 
            "no", 
            "few", 
            "every"
        ], 
        [
            "when", 
            "since", 
            "for", 
            "that"
        ], 
        [
            "boring", 
            "difficult", 
            "fun", 
            "strange"
        ], 
        [
            "at", 
            "on", 
            "in", 
            "for"
        ], 
        [
            "Although", 
            "Even", 
            "Whatever", 
            "However"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "D", 
        "A", 
        "C", 
        "A", 
        "D"
    ], 
    "source": "middle1795"
}