{
    "article": "The sun was shining quite brightly as Mrs Grant left her house, so she decided not to  _  an umbrella with her. She got on the bus to the town and before long it began to rain.The rain had not stopped  _  the bus arrived at the market half an hour later.Mrs Grant stood up and absent--mindedly picked up the umbrella that was  _  on the seat in front of her. A cold voice said loudly,\"That is mine,Madam!\" Suddenly remembering that she had come out without her umbrella,Mrs Grant felt  _  for what she had done,trying at the same time to take no notice of the unpleasant  _  the owner of the umbrella was giving her. When she got off the bus,Mrs Grant made straight for a shop where she could buy an umbrella.She found a pretty one and bought it .Then she  _  to buy another as a present for her daughter. Afterwards she did the rest of her  _  and had lunch in a restaurant. In the afternoon she got on the homeward bus with the two umbrellas under her arm, and sat down. Then she  _  that, by a curious coincidence ,she was sitting next to the woman who had made her feel  _  that morning. That woman now looked at her,and then at the umbrellas. \"You've had quite a good  _  ,\" she said.", 
    "options": [
        [
            "keep", 
            "bring", 
            "take", 
            "leave"
        ], 
        [
            "before", 
            "until", 
            "though", 
            "when"
        ], 
        [
            "hanging", 
            "appearing", 
            "dropping", 
            "losing"
        ], 
        [
            "angry", 
            "sorry", 
            "lucky", 
            "glad"
        ], 
        [
            "reply", 
            "call", 
            "suggestion", 
            "look"
        ], 
        [
            "promised", 
            "decided", 
            "agreed", 
            "remembered"
        ], 
        [
            "hiking", 
            "shopping", 
            "trying", 
            "searching"
        ], 
        [
            "meant", 
            "explained", 
            "saw", 
            "forgot"
        ], 
        [
            "jealous", 
            "bored", 
            "satisfied", 
            "uncomfortable"
        ], 
        [
            "day", 
            "meal", 
            "Journey", 
            "present"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "A", 
        "B", 
        "D", 
        "B", 
        "B", 
        "C", 
        "D", 
        "A"
    ], 
    "source": "middle94"
}