{
    "article": "At a day care centre in Texas, Jessica McClure was playing outside. Jessica's mother,  _  worked at the day care centre, was watching her. Suddenly Jessica  _  and disappeared. Jessica's mother cried and ran to her. The well in the yard was only eight inches across, and a rock always  _  it.But children had moved the rock.  _  Jessica fell, she fell right into the well. Jessica's mother ran to a phone and called 911 for  _  .Men from the fire department arrived. They  _  that Jessica was about 20 feet down in the well. Then they told Jessica's parents their  _  . \"We can't go down into the well\"they said,\" It's so small. So we are going to dig a hole  next to  well.We'll dig down about 20 feet. Then we'll dig a tunnel across to Jessica. When we reach her, we'll bring her through the tunnel. Then we'll bring her up through our  _  .\" The men began to dig the hole on a Wednesday morning. Two days later, on Friday morning, they were  _  digging.And Jessica McClure was still in the well. All over the world people waited for news of Jessica. They read about her in newspapers and watched her rescue on TV.Everyone  worried about  the little girl in the well. At 8:00 p.m. On Friday, the men  _  reached Jessica and brought her up from the well. Then doctors rushed her to the hospital. Jessica was badly injured but she was still  _  .A doctor at the hospital said, \"Jessica is lucky she is very  _  .She's not going to remember this very well.\" Maybe Jessica will not remember her days in the well. But her parents, her rescuers, and many other people around the world will not forget  _  . After Jessica's rescue, one of the rescuers made a metal cover for the well. On the cover he wrote, \"To Jessica, with love from all of us.\"", 
    "options": [
        [
            "she", 
            "who", 
            "whom", 
            "which"
        ], 
        [
            "fell", 
            "slept", 
            "stopped", 
            "rose"
        ], 
        [
            "broke", 
            "hid", 
            "covered", 
            "opened"
        ], 
        [
            "Because", 
            "Although", 
            "If", 
            "When"
        ], 
        [
            "advice", 
            "money", 
            "help", 
            "information"
        ], 
        [
            "promised", 
            "discovered", 
            "hoped", 
            "agreed"
        ], 
        [
            "dream", 
            "study", 
            "lesson", 
            "plan"
        ], 
        [
            "well", 
            "tunnel", 
            "hole", 
            "yard"
        ], 
        [
            "still", 
            "already", 
            "always", 
            "almost"
        ], 
        [
            "immediately", 
            "usually", 
            "quickly", 
            "finally"
        ], 
        [
            "alone", 
            "asleep", 
            "alive", 
            "afraid"
        ], 
        [
            "young", 
            "popular", 
            "clever", 
            "pretty"
        ], 
        [
            "it", 
            "them", 
            "him", 
            "us"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "D", 
        "C", 
        "B", 
        "D", 
        "C", 
        "A", 
        "D", 
        "C", 
        "A", 
        "B"
    ], 
    "source": "middle1538"
}