{
    "article": "It was a lovely spring afternoon. My classmates and I were playing happily on the playground when I let out a cry, \"Ow!Ow! Something in my shoe is biting* me.\" Everyone was shocked by the cry. They took me into a classroom and were about to take off my  _  . \"Which foot is it?\"One asked \"let us have a look.\" Suddenly, I remembered the holes in  _  socks.My family was very poor during those years. I wore welfare socks, which cost only a little, but those  _  welfare socks didn't last long. They soon had  _  at he bottom. I refused to take off my shoe. I  _  stand others seeing the holes in my sock. I tried to hold back my tears Yet, each time the thing  _  my shoe bit me, tears raced down my face. My teacher, Miss Diane, hurried into the  _  , \"What's wrong? \"She asked. \"Something is biting her right foot,  _  she doesn't let us take off her shoe,\"One of my classmates answered. Miss Diane lived next door to me.She  _  everything about my family .She put both hands on my shaking shoulders and  _  into my painful and hopeless eyes. \"Oh,yes,it must be a sock-eating ant,\" She said, as if she had  _  seen the thing inside the shoe. \"I had a bite from one of those ants. By the time I got my shoe off ,it had  _  almost the whole bottom off my sock.\" My classmates nodded while they were listening to the teacher  _  ,although they all looked a little puzzled*. Miss Diane took off my right shoe and sock and shook them over the dustbin*.Two red ants  fell into  it. \"Just what I thought it.The ants have eaten part of her sock.\"When she stroked an alcohol* cotton ball on the bites,she added, \"You are such a  _  girl to take so many bites.\" The alcohol felt cool on the bites and a little girl's pride was saved by the \"sock-eating ant \" story.", 
    "options": [
        [
            "shoe", 
            "shirt", 
            "hat", 
            "coat"
        ], 
        [
            "his", 
            "her", 
            "my", 
            "your"
        ], 
        [
            "free", 
            "wet", 
            "dirty", 
            "cheap"
        ], 
        [
            "holes", 
            "boxes", 
            "stones", 
            "pockets"
        ], 
        [
            "could", 
            "couldn't", 
            "must", 
            "mustn't"
        ], 
        [
            "on", 
            "near", 
            "under", 
            "in"
        ], 
        [
            "office", 
            "playground", 
            "classroom", 
            "toilet"
        ], 
        [
            "because", 
            "but", 
            "or", 
            "so"
        ], 
        [
            "knew", 
            "forgot", 
            "taught", 
            "borrowed"
        ], 
        [
            "looked", 
            "dropped", 
            "ran", 
            "got"
        ], 
        [
            "hardly", 
            "already", 
            "still", 
            "only"
        ], 
        [
            "turned", 
            "put", 
            "taken", 
            "eaten"
        ], 
        [
            "angrily", 
            "sadly", 
            "carefully", 
            "happily"
        ], 
        [
            "lucky", 
            "friendly", 
            "brave", 
            "clever"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "D", 
        "A", 
        "B", 
        "D", 
        "C", 
        "B", 
        "A", 
        "A", 
        "B", 
        "D", 
        "C", 
        "C"
    ], 
    "source": "middle1578"
}