{
    "article": "A poor farmer had a friend who was famous for the wonderful apples he grew. One day, his friend gave him a young apple tree and told him to take it home and _ it.\nSeeing the gift, the farmer was very happy, and he thought he would also have a lot of wonderful apples, but when he got home, he felt _ . He did not know where to plant it. He thought over and over and considered  every place he could think of. _ , he decided to plant the tree in his woods. There were many high trees with thick leaves in the woods. With those trees around ,no one else could see the young apple tree. He even felt proud of himself for finding so secret a place for the apple tree. Every day he went to take care of the tree, watering it. To his surprise and _ , the apple tree didn't grow as well as he expected.  It died without sunlight and good soil.\nLater the friend asked the farmer why he had planted the tree in such a _ place. \"What's the difference?\" the farmer said angrily. \"If I had planted the tree near the _ ,  passers-by  would have stolen the fruit. If I had planted the tree in one of my fields, my neighbors would have come at night and _ some of the apples! If I had planted it near my house, my own children would have taken the fruits.  No matter where I plant the tree, I can't have _ to enjoy the apples: So there is no difference where I planted it.\"\n\"Yes,\" said the friend. \"But sooner or later someone could have enjoyed the fruit. Now you not only have robbed  everyone of the fruit, but also have _ a good apple tree! You don't know the true meaning of 'share'!\"\nWe should learn to _ in our life. The more you want to own something all by yourself, the less you get at last.", 
    "options": [
        [
            "study", 
            "keep", 
            "plant", 
            "develop"
        ], 
        [
            "interested", 
            "worried", 
            "bored", 
            "tired"
        ], 
        [
            "Finally", 
            "Generally", 
            "Suddenly", 
            "Recently"
        ], 
        [
            "pleasure", 
            "excitement", 
            "disappointment", 
            "disagreement"
        ], 
        [
            "poor", 
            "great", 
            "suitable", 
            "comfortable"
        ], 
        [
            "park", 
            "river", 
            "hill", 
            "road"
        ], 
        [
            "borrowed", 
            "stolen", 
            "chosen", 
            "collected"
        ], 
        [
            "rights", 
            "hopes", 
            "chances", 
            "interests"
        ], 
        [
            "destroyed", 
            "thrown", 
            "pulled", 
            "won"
        ], 
        [
            "wait", 
            "share", 
            "compare", 
            "apologize"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "A", 
        "C", 
        "A", 
        "D", 
        "B", 
        "C", 
        "A", 
        "B"
    ], 
    "source": "middle730"
}