{
    "article": "Rose didn't see her school IC card at lunch time. She asked her _ and looked for it everywhere. But she couldn't _ it. Later, one girl said that she saw Kate take a card from Rose's desk. So Rose got very _ .\nWhen she met Kate in the afternoon, Rose _ , \"You have stolen  my card!\" Hearing this, Kate began to cry, \"No, no, I didn't steal it! I only took it by _ .\" But Rose didn't think so and they began to fight.\nJust then a teacher came up and _ what had happened. Kate told the whole story. She said her pen pal came to see her in the morning. She was so _ that she took the card carelessly. Then they went for lunch happily. \"I used the card, but I had thought it was _ . I didn't know it was Rose's _   she asked. I was too _ to explain it to her. So I decided to put the _ back with some money secretly. I am sorry, Rose.\" Kate said in a low _ .\n\"It's just a misunderstanding !\" said the teacher. Tears came into Rose's eyes. Then she said, \"I was _ sorry, Kate! I hope we are still good friends. \"\nAfter that, the two girls get on _ with each other. They often help each other  _ the homework and they often play and chat with each other. They are good friends as before.", 
    "options": [
        [
            "parents", 
            "students", 
            "classmates", 
            "teachers"
        ], 
        [
            "find", 
            "buy", 
            "put", 
            "look"
        ], 
        [
            "happy", 
            "angry", 
            "afraid", 
            "glad"
        ], 
        [
            "sang", 
            "shouted", 
            "read", 
            "talked"
        ], 
        [
            "card", 
            "words", 
            "mistake", 
            "herself"
        ], 
        [
            "asked", 
            "understood", 
            "allowed", 
            "knew"
        ], 
        [
            "sad", 
            "excited", 
            "interested", 
            "afraid"
        ], 
        [
            "mine", 
            "yours", 
            "his", 
            "hers"
        ], 
        [
            "until", 
            "after", 
            "if", 
            "when"
        ], 
        [
            "difficult", 
            "afraid", 
            "nervous", 
            "excited"
        ], 
        [
            "pen", 
            "book", 
            "card", 
            "pencil"
        ], 
        [
            "voice", 
            "sound", 
            "noise", 
            "noisy"
        ], 
        [
            "not", 
            "also", 
            "never", 
            "either"
        ], 
        [
            "good", 
            "well", 
            "better", 
            "best"
        ], 
        [
            "at", 
            "in", 
            "of", 
            "with"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "B", 
        "B", 
        "C", 
        "A", 
        "B", 
        "A", 
        "A", 
        "B", 
        "C", 
        "A", 
        "B", 
        "B", 
        "D"
    ], 
    "source": "middle621"
}