{
    "article": "When I was little, I wanted to play basketball for school. But I wasn't good at it. I kept on trying though.\nI started playing in the 2nd grade. My brother, who was _ the 7th grade, would always help me. He would _ the basket on purpose  so I wouldn't lose against him. One day, though, another boy shouted at my brother: \" Go away! You fool!\" My brother had to stop playing basketball with me. I felt so _ that I wanted to stop playing. About a week later, though, I saw my brother play in a real game. He was so good that I realized I had to keep playing.\nNow five years later I start in my school's basketball _ . All my hard work has paid off.\nI always tell others never to give up, either. If someone puts you _ , remember they are only one person, and you must never stop trying.\nNever giving up helped me in other ways too.\nAt school, when someone told me that algebra   is too hard for me to understand, I decided not to give up. I knew that if I just kept on trying, I would _ it in the end. Again, it took a lot of work, but now I understand algebra well.\nYou have to keep on trying, even when it hurts you so much that every part of your body _ you to stop. When you finally become a success, you'll know that the reason you have become successful is that you _ gave up.", 
    "options": [
        [
            "in", 
            "on", 
            "over", 
            "under"
        ], 
        [
            "catch", 
            "miss", 
            "hit", 
            "get"
        ], 
        [
            "worried", 
            "sad", 
            "afraid", 
            "lonely"
        ], 
        [
            "team", 
            "lesson", 
            "school", 
            "fan"
        ], 
        [
            "up", 
            "down", 
            "in", 
            "on"
        ], 
        [
            "get", 
            "have", 
            "know", 
            "find"
        ], 
        [
            "hopes", 
            "wants", 
            "helps", 
            "troubles"
        ], 
        [
            "always", 
            "sometimes", 
            "ever", 
            "never"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "B", 
        "A", 
        "B", 
        "A", 
        "B", 
        "D"
    ], 
    "source": "middle561"
}