{
    "article": "I sat with my friend in a well-known coffee shop in a town of Italy.\nAs we enjoyed our coffee, a man entered and sat beside us. He called the waiter over, saying, \"Two cups of coffee, one of them there on the  _ \"\nWe heard his order with  _ and noticed that he was served one cup of coffee _ he paid for two.\nWhen he left, the waiter put a piece of paper on the wall saying \"A Cup of Coffee\".\nWhile we were still there, two other men entered and _ three cups of coffee , two on the table and one on the wall. They had two but paid for _ .  This time also, the waiter did the same thing.  It was _ unusual for us.\nAfter a few days, we had a chance to enter this coffee shop again. While we were enjoying our coffee, a man _ appeared homeless entered. He looked at the wall and said, \"One cup of coffee from the wall.\"\nThe waiter served a cup of coffee to this man with _ . The man had his coffee and left without _ . We were amazed to watch all of this as the waiter _ a piece of paper off the wall and threw it into the bin.\nNow it was no surprise for us---the matter was very _ . The people of this town showed great respect for those people who needed help.\nJust think about _ this man wanted. He didn't have to lose his face to ask for a(n) _ cup of coffee. _ asking or knowing who was giving him this cup of coffee, he only looked at the wall, placed an order, _ his coffee and left.\nIt's a truly beautiful thing---probably the most beautiful wall anywhere in the world.", 
    "options": [
        [
            "table", 
            "wall", 
            "paper", 
            "bin"
        ], 
        [
            "interest", 
            "pride", 
            "pain", 
            "worry"
        ], 
        [
            "until", 
            "so", 
            "but", 
            "if"
        ], 
        [
            "offered", 
            "ordered", 
            "drank", 
            "left"
        ], 
        [
            "none", 
            "one", 
            "two", 
            "three"
        ], 
        [
            "nothing", 
            "anything", 
            "everything", 
            "something"
        ], 
        [
            "who", 
            "whom", 
            "which", 
            "what"
        ], 
        [
            "respect", 
            "satisfaction", 
            "regret", 
            "pity"
        ], 
        [
            "asking", 
            "booking", 
            "replying", 
            "paying"
        ], 
        [
            "brought", 
            "carried", 
            "took", 
            "laid"
        ], 
        [
            "important", 
            "clear", 
            "direct", 
            "correct"
        ], 
        [
            "how", 
            "when", 
            "what", 
            "that"
        ], 
        [
            "free", 
            "expensive", 
            "low", 
            "cheap"
        ], 
        [
            "With", 
            "Without", 
            "Before", 
            "After"
        ], 
        [
            "shared", 
            "bought", 
            "preferred", 
            "enjoyed"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "B", 
        "D", 
        "D", 
        "A", 
        "A", 
        "D", 
        "C", 
        "B", 
        "C", 
        "A", 
        "B", 
        "D"
    ], 
    "source": "middle1040"
}