{
    "article": "When I was about six years old, my brother David and I visited our aunt, Mary. We stayed in her house for a night. David was only 4 years old, and was still  _  of the dark., so Mary left the hall light on when we slept. However, David  _  the grey moths flying around the hall light. He asked Mary to make the moths go away. When she asked  _  , she simply said, \"Because they are ugly and scary, I don't like them.\" Mary laughed and said, \"Being ugly outside doesn't  _  not being beautiful inside. In fact, moths are one of the most beautiful animals in the animal world. \"Once, the angels were  _  . They were sad because it was raining heavily. The  _  little moths hated to see others so sad. They decided to make a rainbow to cheer up the angels. They thought if the butterflies  _  , they could make a beautiful rainbow together. \"Then one of the moths went to ask the butterflies for help. But the butterflies didn't want to  give up  any of their colors, so the moths decided to make a rainbow themselves. They beat their wings very hard and the colors on them made a rainbow. They kept giving a little more and a little more  _  the rainbow went across the sky. They had given away all their colors except grey, which didn't match the beautiful rainbow. \"Then the once-colorful moths became  _  . The angles saw the rainbow and smiled...\" My brother went to sleep with that story and hasn't feared months since then.", 
    "options": [
        [
            "afraid", 
            "sure", 
            "proud", 
            "happy"
        ], 
        [
            "liked", 
            "hated", 
            "let", 
            "killed"
        ], 
        [
            "how", 
            "what", 
            "when", 
            "why"
        ], 
        [
            "mean", 
            "make", 
            "know", 
            "hope"
        ], 
        [
            "laughing", 
            "playing", 
            "crying", 
            "talking"
        ], 
        [
            "kind", 
            "angry", 
            "ugly", 
            "sad"
        ], 
        [
            "refused", 
            "advised", 
            "helped", 
            "left"
        ], 
        [
            "unless", 
            "until", 
            "after", 
            "since"
        ], 
        [
            "red", 
            "yellow", 
            "green", 
            "grey"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "D", 
        "A", 
        "C", 
        "A", 
        "C", 
        "B", 
        "D"
    ], 
    "source": "middle1346"
}