{
    "article": "Don't Let the Candle Off\nA man had a little daughter---an only and much-loved child. He lived for her--- she was his whole _ . He was so happy to hear his girl's voice that he hardly imagined what he would do _ her. But unluckily , one day, his daughter became seriously ill. He was very _ . He tried all he could to _ her. At last, his efforts   was  _  and the child died. The father became a bitter recluse   after that, shutting  _  away from his friends and refusing  every activity that might _ him back to his normal self. But one night he had a dream. He was in heaven, seeing a group of little child angels. They were dressed in white and _ in a line passing by the Great White Throne. Every angel _ a candle. He noticed that all the candles were bright except one. Then he found that the child with the _ candle was his own little daughter.  _  to her, he held her in his _ ,hugged her gently, and then asked, \"Why is it, darling, that your candle alone is unlighted?\" His daughter said, \"Daddy, they often relight it, but your  _ always put it out.\" Just then he woke up The lesson was very clear, and its effects were immediate. From that hour on he was not a recluse, but socialized  freely and gladly with his former friends and colleagues. No longer would his darling's candle be put out by his useless tears.\nWe can't avoid having a sad _ during lifetime, but we should remember not to let our beloved person's candle off.", 
    "options": [
        [
            "heart", 
            "life", 
            "faith", 
            "mood"
        ], 
        [
            "without", 
            "by", 
            "through", 
            "over"
        ], 
        [
            "angry", 
            "worried", 
            "calm", 
            "satisfied"
        ], 
        [
            "help", 
            "persuade", 
            "save", 
            "serve"
        ], 
        [
            "useful", 
            "useless", 
            "important", 
            "unimportant"
        ], 
        [
            "herself", 
            "himself", 
            "themselves", 
            "itself"
        ], 
        [
            "put", 
            "fetch", 
            "hold", 
            "bring"
        ], 
        [
            "running", 
            "walking", 
            "speeding", 
            "travelling"
        ], 
        [
            "carried", 
            "picked", 
            "packed", 
            "caught"
        ], 
        [
            "little", 
            "beautiful", 
            "dark", 
            "bright"
        ], 
        [
            "Smiling", 
            "Talking", 
            "Rushing", 
            "Jumping"
        ], 
        [
            "hands", 
            "arms", 
            "breast", 
            "face"
        ], 
        [
            "tears", 
            "dreams", 
            "hopes", 
            "complaints"
        ], 
        [
            "part", 
            "spirit", 
            "feeling", 
            "behavior"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "B", 
        "C", 
        "B", 
        "B", 
        "D", 
        "B", 
        "A", 
        "C", 
        "C", 
        "B", 
        "A", 
        "C"
    ], 
    "source": "middle1635"
}