{
    "article": "Once upon a time, there was a child ready to be born. So  one day  he asked God, \"They tell me you are sending me to  the earth  , but being so small and helpless,  _  am I going to live there?\" \"  _  the many angels , I chose the best one for you. She will be waiting for you and will take care of you. \" God replied. \"But here in heaven , I do  _  else but sing and smile! That's enough for me to be happy.\" God said, \"Your angel will sing and smile for you every day. And you will feel your angel's love and you'll be  _  \" The child said, \"And how am I able to understand when people talk to me  _  I don't know the language that men speak?\" God told the child, \"Your angel will tell you the most beautiful and sweetest words you will ever hear, and with  _  patience and care, your angel will teach you  how to speak  . The child said, \"I've  _  that on the earth there are bad men, who will protect me?\" God said, \"Your angel will protect you  even if  it means risking her life .\" \"But I will always be sad because I will not see you any more.\" \"Your angel will always talk to you about  _  and in face, I will always be next to you.\" At the moment there was much peace in Heaven, but voices from the earth could already be heard, and the child, in a hurry, asked, \" Oh , God, since I am about to  _  now, please tell me my angel's  _  \" \"It is not hard to remember,\" God replied  _  . \"You will call your angel Mommy.\"", 
    "options": [
        [
            "where", 
            "how", 
            "why", 
            "when"
        ], 
        [
            "Between", 
            "For", 
            "Among", 
            "With"
        ], 
        [
            "nothing", 
            "everything", 
            "anything", 
            "something"
        ], 
        [
            "lonely", 
            "happy", 
            "excited", 
            "surprised"
        ], 
        [
            "though", 
            "whether", 
            "after", 
            "if"
        ], 
        [
            "no", 
            "little", 
            "much", 
            "some"
        ], 
        [
            "heard", 
            "remembered", 
            "forgotten", 
            "said"
        ], 
        [
            "me", 
            "you", 
            "us", 
            "her"
        ], 
        [
            "die", 
            "work", 
            "study", 
            "leave"
        ], 
        [
            "address", 
            "name", 
            "number", 
            "job"
        ], 
        [
            "angrily", 
            "sadly", 
            "softly", 
            "shyly"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "B", 
        "D", 
        "C", 
        "A", 
        "A", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "middle1735"
}