{
    "article": "Three _ ago, my family got our first computer. _ the beginning of this summer, I found it was too old and I wanted to get a _ one. After my father and I talked for a long time, he _ . We went to many shops and read many ads. At last we bought an HP computer.\nDuring the first week, I noticed _ our computer had some problems. I spent many hours trying to fix it, but it _ work. So I _ to phone the HP company and ask them _ to work out my problem. They told me to wait until the next morning because all their workers were _ that day.\nThe next morning two workers came. It took them many hours to mend it, but the computer  _  did not work. My dad had no other way but to return the whole thing. A few days later, we decided that I should go on the Internet and order some parts to build a new computer by _ .\nIt was not an easy job for me to build a new computer. I tried many times, and in the end I was successful. From these setbacks , I have learned a lot. Now I believe that if the HP computer hadn't had any problems, _ I would not have learned how to build the new one. Even though I spent lots of time on it, I know it wasn't a waste of time .", 
    "options": [
        [
            "days", 
            "weeks", 
            "months", 
            "years"
        ], 
        [
            "At", 
            "On", 
            "To", 
            "For"
        ], 
        [
            "big", 
            "new", 
            "cheap", 
            "small"
        ], 
        [
            "won", 
            "paid", 
            "agreed", 
            "received"
        ], 
        [
            "if", 
            "that", 
            "what", 
            "how"
        ], 
        [
            "do", 
            "did", 
            "don't", 
            "didn't"
        ], 
        [
            "hoped", 
            "have", 
            "had", 
            "liked"
        ], 
        [
            "how", 
            "what", 
            "why", 
            "where"
        ], 
        [
            "free", 
            "sad", 
            "busy", 
            "exciting"
        ], 
        [
            "already", 
            "always", 
            "still", 
            "usually"
        ], 
        [
            "themselves", 
            "himself", 
            "itself", 
            "myself"
        ], 
        [
            "or", 
            "then", 
            "so", 
            "and"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "B", 
        "C", 
        "B", 
        "D", 
        "C", 
        "A", 
        "C", 
        "C", 
        "D", 
        "B"
    ], 
    "source": "middle620"
}