{
    "article": "About 30 years ago, I left Cuba for the United States with my son who started learning in a kindergarten there. Several weeks  _  , my son's teacher asked me to meet him at the school. In the office , after the greeting words, the teacher asked \"Is your son mentally retarded ?\" Was he talking about my wonderful Scola? NO, no, it _ be. What a helpless, _  moment! I told him that Scola was a quiet, sweet little boy. I asked him  _ he was asking me this question. He told me that my son couldn't _ the teachers'directions , and was making bad effects to the class.\nDidn't he know my son did not speak English yet?\nHe was _ ,\"Why haven't you taught him to speak English? Don't you speak English at home?\"\n\"No, I didn't speak English at home,\" I replied, \"I was sure my son would learn English in a few months, and I didn't want him  to forget his native language.\"\n\"I can't believe  _ there are such people who don't teach their children to speak English at home and at all time.\" the teacher said.\nThen he told me the meeting was over, and I _ the office.\nAs I had expected,  my son  learned to speak English well before the school year was over. He went on to graduate from college and got a high-paid job. He travels widely and has a _ life. And all these are mostly because of being bilingual .\nSpeaking more than one language allows people to communicate with  others ;it teaches people about other cultures and other places. But the \"educator\" I met in my son's kindergarten didn't realized these.", 
    "options": [
        [
            "earlier", 
            "later", 
            "before", 
            "after"
        ], 
        [
            "mustn't", 
            "needn't", 
            "can't", 
            "shouldn't"
        ], 
        [
            "friendly", 
            "useful", 
            "careless", 
            "lonely"
        ], 
        [
            "what", 
            "how", 
            "why", 
            "where"
        ], 
        [
            "follow", 
            "find", 
            "correct", 
            "think"
        ], 
        [
            "angry", 
            "sad", 
            "pleased", 
            "proud"
        ], 
        [
            "who", 
            "which", 
            "when", 
            "that"
        ], 
        [
            "reached", 
            "left", 
            "returned", 
            "made"
        ], 
        [
            "awful", 
            "wonderful", 
            "terrible", 
            "comfortable"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "D", 
        "C", 
        "A", 
        "A", 
        "D", 
        "B", 
        "B"
    ], 
    "source": "middle395"
}