{
    "article": "Joe loved to eat hamburgers in fast food restaurants with his friend Daniel. Every week, they would go to eat hamburgers. One day, Joe  _  a dream. In his dream, there was a very big hamburger. And there was a voice said, \"Eat it! It is  _  !\" So Joe took this big hamburger and began to eat. But suddenly Joe felt sick and had a serious stomachache. When he looked around for help, he saw  _  in a mirror. He became very fat! \"No!\" Joe shouted and  woke up  from the terrible dream. He ran to the bathroom quickly  to see  if he became fat in real life. The dream made Joe think if he had a healthy  _  habit. The next day, Joe and Daniel went to eat hamburgers as usual .  _  Joe stopped at the door of the restaurant and said, \"Daniel, if we keep eating so  _  hamburgers, we will get fat or sick. Shall we eat  something else  today?\" Daniel said, \"Of course. Why do you change your mind today?\" \"I think fast food isn't all bad. But we shouldn't eat them too often,\" said Joe.  _  that day, they began to eat fewer hamburgers and more healthy food.", 
    "options": [
        [
            "did", 
            "had", 
            "made", 
            "took"
        ], 
        [
            "dangerous", 
            "famous", 
            "delicious", 
            "serious"
        ], 
        [
            "his", 
            "him", 
            "himself", 
            "he"
        ], 
        [
            "sleeping", 
            "studying", 
            "reading", 
            "eating"
        ], 
        [
            "And", 
            "But", 
            "Or", 
            "So"
        ], 
        [
            "many", 
            "few", 
            "much", 
            "little"
        ], 
        [
            "For", 
            "From", 
            "In", 
            "At"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "C", 
        "D", 
        "B", 
        "A", 
        "B"
    ], 
    "source": "middle1071"
}