{
    "article": "Dear Laura, I just heard you tell an old story of gift giving and unselfish love in your program. You don't know whether it is true that such unselfish love would happen in today's world. Well, I'm here to give you  _  . I wanted to do something very  _  for my fifteen-year-old son, who has always been the perfect child. He worked all summer to earn enough money to buy a used motorcycle. Then, he spent hours and hours on it  _  it looked almost new. I was so proud of him that I bought him the shiniest helmet and a riding outfit . I could hardly wait for him to open up his gift. In fact, I couldn't sleep the night before. Upon awakening, I went to the kitchen to  _  the coffee, tea, and morning dishes. In the living room was a beautiful keyboard with a  _  : \"To my wonderful mother, all my love, your son.\" I was so surprised. It had been a long-standing joke in our family that I wanted a piano so that I could take lessons. \"Learn to play the piano, and I'll get you one\" was my husband's promise. I stood there shocked, crying a river,  asking  myself how my son could  _  this expensive gift. Of course, the house awoke, and my son was very pleased with my reaction . Many kisses were exchanged, and I immediately wanted him to  _  my gift. As he saw the helmet and outfit, the look on his face was not exactly what I was expecting. Then I realized that he had sold the motorcycle to get me the keyboard. Of course I was the proudest mother ever on that day, and my feet never hit the ground for a month. So I wanted you to know, that kind of love is  _  present and lives even in the ever-changing world of me, me, me! I thought you'd love to  _  this story. Yours, Hilary", 
    "options": [
        [
            "hope", 
            "advice", 
            "spirit", 
            "courage"
        ], 
        [
            "strange", 
            "similar", 
            "special", 
            "private"
        ], 
        [
            "after", 
            "before", 
            "unless", 
            "until"
        ], 
        [
            "start", 
            "cook", 
            "set", 
            "serve"
        ], 
        [
            "sign", 
            "notice", 
            "word", 
            "note"
        ], 
        [
            "present", 
            "find", 
            "afford", 
            "order"
        ], 
        [
            "tear", 
            "open", 
            "check", 
            "Receive"
        ], 
        [
            "only", 
            "still", 
            "ever", 
            "even"
        ], 
        [
            "send", 
            "publish", 
            "share", 
            "Write"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "D", 
        "A", 
        "D", 
        "C", 
        "B", 
        "B", 
        "C"
    ], 
    "source": "middle2073"
}