{
    "article": "A daughter was born sick. The doctor told the girl's father that the _ was that she couldn't run over 400 metres at a time, or a terrible problem might happen to her. The father felt really sad about it. He asked the doctor if there were any _ to cure it. The doctor shook his head. How blue the father felt! But the man still didn't give up his _ .\nHe began to pay attention to any news from about the girl's health. One day, a piece of news from a newspaper _ him, which said if you keep saying the same words to a person every night when he or she is _ , it will have a magical power. From that day on, every night, when the girl fell asleep, the father would say to her, \"you will be beautiful and healthy in the future. No matter   what you will be I will always love you.\" The father kept on doing the same thing every night for over 16 years. Year after year, magic _ . As the girl grew up, she became healthier and healthier. Later she _ took part in a 3000-metre cross-country race and won a prize. In 2014, the parents took the girl to the doctor again. The doctor could _ believe his eyes when he saw the report. He said it was a(n) _ that he had never met before.\nLater, the girl said--Whenever I thought of my father's _ , I was deeply moved. I'll spend all the rest of my life to give my father a happy life. My dear father, love you forever.", 
    "options": [
        [
            "best", 
            "worst", 
            "least", 
            "latest"
        ], 
        [
            "needs", 
            "time", 
            "methods", 
            "thoughts"
        ], 
        [
            "doubt", 
            "pity", 
            "hope", 
            "plan"
        ], 
        [
            "discovered", 
            "met", 
            "arrested", 
            "attracted"
        ], 
        [
            "sleeping", 
            "watching", 
            "reading", 
            "hearing"
        ], 
        [
            "failed", 
            "worked", 
            "went", 
            "died"
        ], 
        [
            "ever", 
            "almost", 
            "never", 
            "even"
        ], 
        [
            "probably", 
            "highly", 
            "hardly", 
            "always"
        ], 
        [
            "wonder", 
            "waste", 
            "accident", 
            "problem"
        ], 
        [
            "face", 
            "words", 
            "cry", 
            "shouts"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "C", 
        "D", 
        "A", 
        "B", 
        "D", 
        "C", 
        "A", 
        "B"
    ], 
    "source": "middle2234"
}