{
    "article": "On my first day of the sixth grade, I noticed one little girl called Amy on the school bus. \"Don't\n talk to her,\" Lauren said, who sat beside me, \"or the others will laugh at you.\"\nAmy had many physical differences--lots of reasons for other kids to laugh at her. Her eyes weren't straight. Her glasses were very thick. And she had really ugly teeth.\nEvery day _ we drove to and from school, kids would shout insults  at Amy. \"God, what a _ face! Stop looking at me!\" \"Mr. Rolland (the driver)! Amy took off her hat. Make her put it back on!\" For a while I shouted my share of insults, just so I'd fit in . After all, I didn't want them to treat me the same way they treated Amy.\nBut while I was insulting her, I felt _ for the girl. I could see that the insults were making her look uglier, because she was so ashamed and alone. Then I wanted to _ her. I just didn't know how to stop my schoolmates until the night of our class roller-skating party.\nOur whole class was there, including Amy. Amy didn't know how to skate, but I could see how much she wanted to have fun like the rest of us. So I skated over to her and took her by the hand. We began the journey together around the skating rink  . She just smiled, and sometimes she would laugh in _ .\nOn the school bus the next morning there was much news about Amy and me skating together, _ nobody insulted her or me. And they didn't do that for the rest of the year.\nAfter graduation , I never heard from Amy. However, I never forget her and I've always wondered if I changed her life for the better. But I know for sure she has changed my _ . I was no longer influenced by others. I became myself.", 
    "options": [
        [
            "when", 
            "though", 
            "after", 
            "before"
        ], 
        [
            "pretty", 
            "strange", 
            "nice", 
            "lovely"
        ], 
        [
            "happy", 
            "excited", 
            "sorry", 
            "nervous"
        ], 
        [
            "ask", 
            "know", 
            "help", 
            "see"
        ], 
        [
            "fear", 
            "surprise", 
            "danger", 
            "joy"
        ], 
        [
            "so", 
            "because", 
            "still", 
            "but"
        ], 
        [
            "life", 
            "family", 
            "interest", 
            "friend"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "C", 
        "C", 
        "D", 
        "D", 
        "A"
    ], 
    "source": "middle1356"
}