{
    "article": "My father was a self-taught mandolin player. He was one of the best players in our town. He could not _ music, but if he heard a tune a few times, he could play it. When he was young, he was a _ of a small country music band. They played at local dances and the radio station.\nAt home Dad often got out his mandolin and played for the family. We three children sang along. _ played the mandolin like my father. He could _ your heart with the music that came out of that old mandolin. He seemed to shine when he was playing. You could see his _ in his ability to play so well for his family.\nBut Dad had to find another _ in a factory later because the money he made at the band wasn't enough to _ the family. Unluckily he had an _ one day and lost one finger. He couldn't play as _ as before. From then on, every time we asked him to play, he would make up reasons to _ down our request. However, we missed his performance so much. _ , he agreed and said \"Okay, but remember, I can't hold down on the strings the way I _ to\". When he played the old mandolin, it carried us back to a _ , happy time in our lives.\nDad was that kind of man. _ was what he was doing all his life. If he could give _ to others, he would, especially his family. He was always there, sacrificing his time to see that his family had enough in their life.", 
    "options": [
        [
            "express", 
            "raise", 
            "read", 
            "lead"
        ], 
        [
            "dancer", 
            "member", 
            "driver", 
            "friend"
        ], 
        [
            "Nobody", 
            "Somebody", 
            "Anybody", 
            "Everybody"
        ], 
        [
            "shut", 
            "touch", 
            "cover", 
            "hurt"
        ], 
        [
            "doubt", 
            "truth", 
            "pride", 
            "worry"
        ], 
        [
            "job", 
            "wallet", 
            "game", 
            "hobby"
        ], 
        [
            "start", 
            "work", 
            "value", 
            "support"
        ], 
        [
            "action", 
            "accident", 
            "argument", 
            "exam"
        ], 
        [
            "deep", 
            "fast", 
            "well", 
            "loud"
        ], 
        [
            "turn", 
            "break", 
            "close", 
            "lay"
        ], 
        [
            "Nearly", 
            "Exactly", 
            "Certainly", 
            "Finally"
        ], 
        [
            "regretted", 
            "used", 
            "kept", 
            "pointed"
        ], 
        [
            "careful", 
            "forgetful", 
            "cheerful", 
            "helpful"
        ], 
        [
            "Giving", 
            "Receiving", 
            "Changing", 
            "Taking"
        ], 
        [
            "production", 
            "pleasure", 
            "purpose", 
            "patience"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "A", 
        "B", 
        "C", 
        "A", 
        "D", 
        "B", 
        "C", 
        "A", 
        "D", 
        "B", 
        "C", 
        "A", 
        "B"
    ], 
    "source": "middle1488"
}