{
    "article": "Red is the color of China. Among all the colors, red is most _ seen. The color red is fresh and pure, and in China we call it China Red. Chinese people are attracted by the color red not only because it makes people excited, but also because it has _ meaning in Chinese culture and history.\nNo country in the world has ever _ a color in such a way as China. Here, red is a symbol. It gives color to the soul   of the nation. In the past, red represented dignity   and mystery. Even now, Chinese people _ the color much more than the rest of the world does. It can be said that China Red is an everlasting theme for China, and an important color for the Chinese people. China Red has _ a very popular phrase, attracting the world's attention.\nFinding red-colored things in China is very _ , as you can see the color everywhere. All traditional red things have played special roles in China. Things like the walls of ancient palaces, the _ flag, Chinese knots, lanterns, traditional paper-cuts, and even tanghulu are all red.\nRed is the color of _ , health, harmony, happiness, peace, wealth and so on. Only real things and events can _ fully   red's real beauty. The color can be alive and breathing only when it's connected with people.\nIn China, red is more than just a color. It carries the ancient history and _ of the Chinese nation. China Red is filled with mysterious charm beyond description and it is right here in China waiting for you to feel and discover!", 
    "options": [
        [
            "easily", 
            "quickly", 
            "carefully", 
            "closely"
        ], 
        [
            "different", 
            "rich", 
            "simple", 
            "correct"
        ], 
        [
            "used", 
            "shared", 
            "drawn", 
            "mentioned"
        ], 
        [
            "need", 
            "dislike", 
            "hate", 
            "love"
        ], 
        [
            "spoken", 
            "said", 
            "become", 
            "got"
        ], 
        [
            "difficult", 
            "easy", 
            "simple", 
            "free"
        ], 
        [
            "national", 
            "international", 
            "local", 
            "foreign"
        ], 
        [
            "rainbow", 
            "fear", 
            "worry", 
            "luck"
        ], 
        [
            "believe", 
            "show", 
            "talk", 
            "write"
        ], 
        [
            "art", 
            "business", 
            "culture", 
            "ability"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "A", 
        "D", 
        "C", 
        "B", 
        "A", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "middle1947"
}