{
    "article": "Choose the best answer to complete the passage. \nMegan could hardly stay in her seat as her dad _ the car into the parking lot of Coaster Kingdom, the biggest roller coaster park in the state. Today was Megan's 11thbirthday and she was _ enough to ride the scariest coaster, the Dragon. The Dragon's tracks were made _ wood, not metal. Megan knew that wooden tracks were _ than metal ones, but wooden tracks also swayed , especially on _ days like today.\nMegan's father paid for their tickets, and she  _ took his hand. She wanted to hurry to the coaster, but her dad was _ after the long car ride. They stopped at the food court and shared a glass of juice and an ice cream.. After their snack, Megan led her dad to the entrance of the Dragon. A sign shaped like a dragon _ in front of the gate. The dragon was holding one hand up, and the message read, \" You must be at least this tall to ride this coaster.\" Megan ran up to the sign. She stood on the tips of her toes. Her father,  _ , shook his head. \" I'm sorry, honey,\" he said. \" Let's go to the other rides. There are still plenty of fun things we can do today.\"", 
    "options": [
        [
            "took", 
            "drove", 
            "bought", 
            "washed"
        ], 
        [
            "old", 
            "young", 
            "brave", 
            "lucky"
        ], 
        [
            "by", 
            "with", 
            "in", 
            "of"
        ], 
        [
            "slow", 
            "slower", 
            "slowest", 
            "slowly"
        ], 
        [
            "sunny", 
            "rainy", 
            "snowy", 
            "windy"
        ], 
        [
            "angrily", 
            "quietly", 
            "excitedly", 
            "loudly"
        ], 
        [
            "thirsty", 
            "tired", 
            "hungry", 
            "sleepy"
        ], 
        [
            "took", 
            "stood", 
            "slept", 
            "laid"
        ], 
        [
            "but", 
            "though", 
            "however", 
            "so"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "D", 
        "B", 
        "D", 
        "C", 
        "A", 
        "B", 
        "C"
    ], 
    "source": "middle1321"
}