{
    "article": "I moved to a new neighborhood two months ago. A taxi driver lived in a house with a large garage across the road. He's single parent with two school-age children. At the end of the day, he would  _  his taxi on the road. \" Why he did not park it in the garage?\" I asked myself.\nThen, one day I  _ that he had another car in his garage. In the afternoon he would come home  _  work, leave his taxi and go out for his  _  car, not in his taxi. I felt it was  _ .\nI was curious to see his personal car but did not  _  it until I happened to be outside one evening two weeks later, when the garage door was  _  and he drove out in his \"own\" car: a Rolls-Royce ! It shook me completely _  I realized what that meant. You see, he was a taxi driver. But deep inside, he saw himself as something else: a Rolls-Royce owner and a(n)  _ . He drove others in his taxi but himself and his children in his Rolls-Royce. The world looked at his taxi and called him a taxi driver. But for him, a taxi was  _ something he drove for a life.\nWe go to bed every night and  wake up  every morning as parents or children, not as bankers, CEOs or professors. We go for a  _  as close friends or go for a vacation as a family. We love life as it is. Yet often, we base our entire happiness and  _  on how high we climb the social ladder --how much bigger and better a _  we have. And we fail to notice Rolls-Royce, by keeping it dusty in our garage. We should pay more attention to  _  we are than what we do!", 
    "options": [
        [
            "park", 
            "drive", 
            "check", 
            "repair"
        ], 
        [
            "learnt", 
            "understood", 
            "told", 
            "remember"
        ], 
        [
            "for", 
            "at", 
            "without", 
            "from"
        ], 
        [
            "another", 
            "other", 
            "third", 
            "first"
        ], 
        [
            "useful", 
            "careful", 
            "wasteful", 
            "painful"
        ], 
        [
            "get", 
            "make", 
            "buy", 
            "have"
        ], 
        [
            "broken", 
            "closed", 
            "painted", 
            "open"
        ], 
        [
            "once", 
            "before", 
            "when", 
            "until"
        ], 
        [
            "father", 
            "son", 
            "driver", 
            "engineer"
        ], 
        [
            "yet", 
            "never", 
            "just", 
            "still"
        ], 
        [
            "Competition", 
            "Performance", 
            "test", 
            "party"
        ], 
        [
            "success", 
            "plans", 
            "beauty", 
            "wishes"
        ], 
        [
            "garden", 
            "garage", 
            "car", 
            "taxi"
        ], 
        [
            "who", 
            "what", 
            "which", 
            "where"
        ]
    ], 
    "answers": [
        "A", 
        "A", 
        "D", 
        "B", 
        "C", 
        "B", 
        "D", 
        "C", 
        "A", 
        "C", 
        "D", 
        "A", 
        "A", 
        "D"
    ], 
    "source": "middle2321"
}