{
    "article": "Barefoot and dirty, the girl just sat there and watched the people go by. She never tried to speak. She never said a word. Many people  _  , but never did one person stop. The next day, I decided to go back to the park, being curious if the little girl would still be there. Right in the very spot as she was the day before, she sat, with the  _  look on her face. As I began walking towards her, I could see the back of the little girl's dress showed a deformity . As I got closer, the little girl slightly  _  her eyes to avoid my stare. I sat down beside her and opened with a simple  _  . The little girl stammered a hi. I smiled and she shyly smiled back. We talked  _  darkness fell and the park was completely empty. \"Why are you so sad?\" She replied slowly, \"Because I'm  _  .\" \"Little girl,\" I said in a soft voice, \"You  _  me of an angel because of your difference.\" She stood to her feet excitedly, \"Really?\" \"Yes, that's the thing. You're like a little angel sent to watch over all those people walking by.\" She nodded her head and smiled, \"  _  I am. And since you think of someone  _  yourself, my job here is done.\" What a big  _  ! I stood quickly, \"Wait, so why did no one stop to help an angel?\" She bloomed a big smile, \"You're the  _  one who could see me, because you care for others.\" With those words, she spread her wings and flied away from my sight. From then on, I believe I am not all I have, for there is an angel always  _  me. She is always watching over those who do good things for others.", 
    "options": [
        [
            "passed", 
            "looked", 
            "asked", 
            "helped"
        ], 
        [
            "angriest", 
            "coldest", 
            "happiest", 
            "saddest"
        ], 
        [
            "lowered", 
            "closed", 
            "rose", 
            "opened"
        ], 
        [
            "smile", 
            "hello", 
            "question", 
            "word"
        ], 
        [
            "before", 
            "after", 
            "till", 
            "when"
        ], 
        [
            "different", 
            "foolish", 
            "beautiful", 
            "poor"
        ], 
        [
            "force", 
            "treat", 
            "turn", 
            "remind"
        ], 
        [
            "Indeed", 
            "Happily", 
            "Perhaps", 
            "Luckily"
        ], 
        [
            "beyond", 
            "beside", 
            "including", 
            "except"
        ], 
        [
            "excitement", 
            "present", 
            "surprise", 
            "happiness"
        ], 
        [
            "clever", 
            "great", 
            "lucky", 
            "only"
        ], 
        [
            "on", 
            "with", 
            "in", 
            "for"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "A", 
        "B", 
        "C", 
        "A", 
        "D", 
        "A", 
        "D", 
        "C", 
        "D", 
        "B"
    ], 
    "source": "middle599"
}