{
    "article": "Some years ago on a hot summer day in south Florida a little boy decided to go for a swim in the old swimming hole behind his house.\nIn a  _  to dive into the cool water, he ran out the back door, leaving  _  his shoes, socks, and shirt as he went. He flew into the water, not  _  that as he swam toward the middle of the lake, an alligator  was swimming  _  him. His mother in the house was looking out of the window. She saw the two as they got closer and closer together. In great fear, she  _  toward the water, _  to her son as loudly as she could.\nHearing her voice, the little boy became alarmed and made a  _  to swim to his mother. It was too  _ . Just as he reached her son, the alligator reached him.\nFrom the bank, the mother caught her little boy by the  _  just as the alligator snatched his legs. That began an unbelievable tug-of-war  between the two. The alligator was much  _  than the mother, but the mother wouldn't give up.\nA farmer  _  to drive by. He heard the cry, raced from his truck, took aim and shot the alligator.\nAfter weeks and weeks in the hospital, the little boy was in good  _  again. But on his legs there were scars   _  by the animal and, on his arms, there were also scars left by his mother in her effort to hold on to the son she loved.\nA newspaper reporter asked the boy  _  he would show him his scars. The boy lifted his legs. And then, with clear  _ , he said to the reporter:\" But look at my arms. I have great scars on my arms, too. I have them because my mother wouldn't let go.\"", 
    "options": [
        [
            "hurry", 
            "dream", 
            "hungry", 
            "time"
        ], 
        [
            "for", 
            "over", 
            "behind", 
            "out"
        ], 
        [
            "hearing", 
            "understanding", 
            "feeling", 
            "realizing"
        ], 
        [
            "backward", 
            "downward", 
            "toward", 
            "upward"
        ], 
        [
            "ran", 
            "walked", 
            "jumped", 
            "moved"
        ], 
        [
            "smiling", 
            "shouting", 
            "talking", 
            "nodding"
        ], 
        [
            "change", 
            "mistake", 
            "face", 
            "return"
        ], 
        [
            "dangerous", 
            "close", 
            "late", 
            "early"
        ], 
        [
            "legs", 
            "arms", 
            "hands", 
            "feet"
        ], 
        [
            "faster", 
            "taller", 
            "bigger", 
            "stronger"
        ], 
        [
            "happened", 
            "came", 
            "noticed", 
            "stopped"
        ], 
        [
            "shape", 
            "health", 
            "look", 
            "build"
        ], 
        [
            "followed", 
            "written", 
            "left", 
            "broken"
        ], 
        [
            "where", 
            "how", 
            "when", 
            "whether"
        ], 
        [
            "sadness", 
            "pride", 
            "purpose", 
            "service"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "D", 
        "C", 
        "A", 
        "B", 
        "D", 
        "C", 
        "B", 
        "D", 
        "A", 
        "B", 
        "C", 
        "D", 
        "B"
    ], 
    "source": "middle2144"
}