{
    "article": "Once upon a time, there was a very old man called Yu Gong. He lived with his family in a village and there were two big and  _  mountains near his house. They spent a long time  getting  to the other side.\nOne day, Yu Gong told his family that they must move the mountains to the other places.  _  this, everyone in his family were laughing at him. One of his sons said: \"Are you kidding?\" \"No, I'm serious and all of you must do it with me.\" Everyone was  in silence  at that time. They really didn't want to do it, but they had to do because the oldest man in the family was  the most important person at that time.\nThe next day everyone in Yu Gong's family started to dig the mountains. They put the stones and the earth  _  the sea. One day a man saw Yu Gong and his children  digging  the mountains. He told Yu Gong he would never do it. But Yu Gong said though he was  _  and would die, his family could continue to move the mountains. Then they kept on digging day after day and year after year.\nFinally a god was so moved by Yu Gong  _  he sent two gods to help Yu Gong move the mountains away.\nThe  _  reminds us that you can never know what's possible unless you try to make it happen.", 
    "options": [
        [
            "short", 
            "thin", 
            "high", 
            "long"
        ], 
        [
            "Seeing", 
            "Doing", 
            "Hearing", 
            "Watching"
        ], 
        [
            "on", 
            "to", 
            "up", 
            "into"
        ], 
        [
            "healthy", 
            "well", 
            "strong", 
            "weak"
        ], 
        [
            "that", 
            "who", 
            "which", 
            "whether"
        ], 
        [
            "magazine", 
            "novel", 
            "story", 
            "book"
        ]
    ], 
    "answers": [
        "C", 
        "C", 
        "D", 
        "D", 
        "A", 
        "C"
    ], 
    "source": "middle1235"
}