{
    "article": "About 70,000,000 Americans are trying to lose weight.This is almost one out of every three people in the United States.Some people eat  _  food and they hardly have any fats or sweets. Others do running exercise with machines,take medicines,or even have operations.  _  you can see losing weight is  _  work,and it will also cost a lot of money.But  _  do so many people in the United States want to lose weight? Many people in the United States worry about their look of the body.For many people,looking nice also means to be  _  .Other people worry about their health as many doctors  _  overweight is not good. Most people want to find a faster and  _  way to take off fat,and books of this kind are very popular.These books tell people how to lose weight.Each year a lot of new books like these are  _  .Each one says it can easily help people take fat away. Losing weight can be expensive.Some overweight people go to health centers,like La Costa in California.Men and women  _  several hundred dollars a day at these health centers.People live there for one week or two,taking exercise,eating different foods.Meals there may be just a little.All this works for losing weight.  _  4 days on the program,one woman called Mrs. Warren lost 5 pounds(2.27kg).At 400 dollars a day, she spent 320dollars to lose each pound.But she said she was still glad to do so. Health centers,books,medicines,operations,running and exercise machines all get a lot of money.So in the United States,losing Weight may mean losing money too.", 
    "options": [
        [
            "1ess", 
            "more", 
            "nice", 
            "fast"
        ], 
        [
            "For", 
            "So", 
            "Or", 
            "And"
        ], 
        [
            "good", 
            "useful", 
            "hard", 
            "easy"
        ], 
        [
            "why", 
            "what", 
            "how", 
            "when"
        ], 
        [
            "high", 
            "short", 
            "thin", 
            "fat"
        ], 
        [
            "talk", 
            "say", 
            "speak", 
            "tell"
        ], 
        [
            "dearer", 
            "harder", 
            "shorter", 
            "easier"
        ], 
        [
            "taken", 
            "given", 
            "written", 
            "copied"
        ], 
        [
            "pay", 
            "cost", 
            "take", 
            "have"
        ], 
        [
            "Before", 
            "Until", 
            "After", 
            "At"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "C", 
        "A", 
        "C", 
        "B", 
        "D", 
        "D", 
        "A", 
        "C"
    ], 
    "source": "middle53"
}