{
    "article": "One day Divya woke her mother up in the early morning. She said, \"Mummy, it is so long since you made my favorite chocolate cake----please  _  it today!\" Mummy smiled and said, \"All right, I will get it  _  for you by the time you are back from school.\" Then Divya went to school and  thought about  the delicious cake all that day. That  _  , her elder brother, Dhruv came home with his friend. Mummy had gone to the market and he  _  a plate full of freshly made cakes. He decided to give his friend a treat and within minutes the plate was  _  ! Just then Mummy rang up and told him the cakes were made especially for Divya. Hearing this, Dhruv was very  _  . Soon he got a 'good'  _  . He put his pet on the plate and placed a lid over it. Then he left home with his friend. Divya got home in the evening, excitedly went into the kitchen and opened the plate. A pair of eyes stared at her. Four-year-old Divya was  _  . She went to her mother and asked \"Mummy, do your  _  have eyes?\" \"Certainly not,\" said Mummy. \"Go on and  _  the cake !\" This time when Divya went and lifted the lid, a frog jumped right at her! The little girl jumped back in fear and went crying to her mother. She told her mother about the frog and they  _  for Dhruv to get back that night,  _  , when Dhruv came back, their  _  first said sorry to him for what she had said on the phone. Then Dhruv realized his  _  and said sorry to Divya. The next day Mummy made some more chocolate cakes and this time little Divya had her fill!", 
    "options": [
        [
            "buy", 
            "cut", 
            "make", 
            "bring"
        ], 
        [
            "secret", 
            "ready", 
            "clean", 
            "fit"
        ], 
        [
            "morning", 
            "afternoon", 
            "evening", 
            "night"
        ], 
        [
            "broke", 
            "need", 
            "lost", 
            "found"
        ], 
        [
            "dirty", 
            "hot", 
            "empty", 
            "gone"
        ], 
        [
            "happy", 
            "angry", 
            "careful", 
            "hungry"
        ], 
        [
            "luck", 
            "book", 
            "place", 
            "idea"
        ], 
        [
            "tired", 
            "brave", 
            "surprised", 
            "polite"
        ], 
        [
            "cakes", 
            "toys", 
            "plates", 
            "pets"
        ], 
        [
            "hide", 
            "sell", 
            "take", 
            "eat"
        ], 
        [
            "waited", 
            "cared", 
            "paid", 
            "hoped"
        ], 
        [
            "Except", 
            "Instead", 
            "Including", 
            "However"
        ], 
        [
            "teacher", 
            "mother", 
            "sister", 
            "friend"
        ], 
        [
            "dream", 
            "difficulty", 
            "reason", 
            "mistake"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "B", 
        "D", 
        "C", 
        "B", 
        "D", 
        "C", 
        "A", 
        "D", 
        "A", 
        "D", 
        "B", 
        "D"
    ], 
    "source": "middle1097"
}