{
    "article": "People who speak or perform before the public sometimes may suffer from \"Stage Fright\". Stage fright makes a person  _  . In that case it can make one's mind go back and forget  _  one ought to say or to act. Actors, musicians, dancers, lawyers, even radio show hosts suffered from stage fright at one time or  another  . Diana Nichols is an expert in helping people free from stage fright at a medical center in New York City. She helps actors learn to  _  themselves. Miss Nichols says some people have always been afraid to perform before the audience. Others, she says, develop stage fright after a sad  _  . She offers them ways to control the fear. One way is to smile before going onto the stage. Taking two deep breaths  _  helps. Deep breathing helps you get control of your body. Miss Nichols advises her patients to tell themselves that their speech or performance does not have to be perfect. It's  all right  to make a mistake. She tells them they should not be too nervous while they are performing. It is important that they should continue to perform while she is helping them. After each performance, they discuss what happened and  find out  what helped and what did not.  _  they perform more and more, they will fear less and less as much as 50%. Miss Nichols says the aim is only to  _  stage fright, not to smooth it away completely. This is because a little stage fright makes a person more careful, and improves the performance.", 
    "options": [
        [
            "joyful", 
            "proud", 
            "nervous", 
            "hopeless"
        ], 
        [
            "when", 
            "what", 
            "how", 
            "whether"
        ], 
        [
            "cure", 
            "control", 
            "hold", 
            "protect"
        ], 
        [
            "experience", 
            "activity", 
            "process", 
            "event"
        ], 
        [
            "usually", 
            "too", 
            "also", 
            "sometimes"
        ], 
        [
            "As", 
            "While", 
            "Before", 
            "Until"
        ], 
        [
            "change", 
            "produce", 
            "improve", 
            "reduce"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "B", 
        "A", 
        "C", 
        "A", 
        "D"
    ], 
    "source": "middle2139"
}