{
    "article": "It was Molly's job to hand her father his paper lunch bag each morning before he went to work. One morning, beside his usual lunch bag, Molly  _  him a second paper bag. This one didn't look so good. It was  _  and was held together with tape. Her father kissed Molly and started off to work with the  _  bags. On his lunch break, while he was eating, he looked  _  the second old bag: two small dolls, three small stones and some coins. The busy father smiled, finished eating and  _  away the bags, dolls and stones. That  _  when they were having supper, Molly asked, \" Where's my bag, Daddy?\" \"What bag?\"\"The one I gave  _  this morning.\"\"I left it at the office.  _  ?\" \"I forget to put this note in it,\" she said. \"Those are the  _  I really love. I thought you might like to  _  with them. You didn't lose the bag, did you, Daddy? \"Oh, no,\" he said, lying. \"I  _  forgot to bring it home. I'll bring it tomorrow.\" When Molly put her arms around her father's neck, he opened the  _  that read: \"I love you, Daddy.\"Molly had given him her treasures,  _  he had thrown them into the trash can. So when he went back to the  _  , he went straight to the trash can and  picked up  all of Molly's things. He put the treasures inside the bag and carried it home.", 
    "options": [
        [
            "handed", 
            "asked", 
            "helped", 
            "bought"
        ], 
        [
            "nice", 
            "old", 
            "empty", 
            "expensive"
        ], 
        [
            "two", 
            "three", 
            "four", 
            "five"
        ], 
        [
            "for", 
            "after", 
            "into", 
            "around"
        ], 
        [
            "gave", 
            "put", 
            "ran", 
            "threw"
        ], 
        [
            "morning", 
            "noon", 
            "evening", 
            "midnight"
        ], 
        [
            "you", 
            "him", 
            "her", 
            "them"
        ], 
        [
            "Who", 
            "When", 
            "Where", 
            "Why"
        ], 
        [
            "foods", 
            "places", 
            "people", 
            "collections"
        ], 
        [
            "study", 
            "play", 
            "deal", 
            "fight"
        ], 
        [
            "even", 
            "just", 
            "still", 
            "hardly"
        ], 
        [
            "card", 
            "letter", 
            "note", 
            "book"
        ], 
        [
            "so", 
            "or", 
            "but", 
            "and"
        ], 
        [
            "shop", 
            "office", 
            "bedroom", 
            "school"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "A", 
        "C", 
        "D", 
        "C", 
        "A", 
        "D", 
        "D", 
        "B", 
        "B", 
        "C", 
        "C", 
        "B"
    ], 
    "source": "middle1304"
}