{
    "article": "How often do you let other people's rude actions change your mood? Do you let a bad driver or an impolite waiter make your day in a mess? However, the mark of your wise reply to the actions is how  _  you can come back to smiling to them. Sixteen years ago, I learned this  _  at the back of a taxi in New York.\nWe were driving fast in the right lane  when suddenly, a black car jumped  out of  a parking space right to front of us. My taxi driver stepped on the brake as hard as possible, and at the _ moment our car stopped just one inch from the back of the other car.\nI couldn't believe what happened next. The driver of the car turned his head around and started _ bad words. But then here's what really _  me. My taxi driver just smiled and waved  at the guy. I said, \"Why did you just do that? This guy nearly  _ us!\" He told me what I now remember \"The Law of the Garbage Truck.\"\nHe said, \"Like garbage trucks, many people run around full of garbage, full of anger, and full of regret.  _ their garbage increases more and more, they look for a place to pour it. If you let them, they'll pour it on you. So when someone wants to pour it on you, don't feel hurt. Just smile, wave, and move on. You will be _ .\"\nI started thinking: how often do I let Garbage Trucks run right over me? And how often do I take their garbage and _ it to other people? Then I knew clearly what I should do.\nI began to see Garbage Trucks. I see the bad mood people are carrying. I see them coming to pour it. And like my taxi driver, I don't feel hurt. I just smile, wave, and move on.", 
    "options": [
        [
            "clearly", 
            "quickly", 
            "exactly", 
            "correctly"
        ], 
        [
            "example", 
            "experience", 
            "lesson", 
            "case"
        ], 
        [
            "next", 
            "busy", 
            "right", 
            "last"
        ], 
        [
            "shouting", 
            "telling", 
            "whispering", 
            "expressing"
        ], 
        [
            "cheered", 
            "encouraged", 
            "surprised", 
            "satisfied"
        ], 
        [
            "attacked", 
            "killed", 
            "warned", 
            "beat"
        ], 
        [
            "Since", 
            "While", 
            "As", 
            "Before"
        ], 
        [
            "happier", 
            "busier", 
            "safer", 
            "luckier"
        ], 
        [
            "donate", 
            "lend", 
            "spread", 
            "hang"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "D", 
        "A", 
        "C", 
        "B", 
        "C", 
        "A", 
        "C"
    ], 
    "source": "middle1889"
}