{
    "article": "Miss Carter is a beautiful girl. Her father  _  two years ago and her mother made a terrible mistake and was sent away. They began to live a  _  life. When she  _  middle school, she couldn't go on studying. Her uncle found a  _  for her. Mr. Baker, a rich shopkeeper, hired her. Her work was to clean the rooms and sweep the floors. She tried her  _  and worked hard. Mrs. Baker liked her and paid her  _  than the other servants . It was Sunday. Mr. Baker was reading and Mrs. Baker was watching TV in the sitting room. The girl came in and said, \"I'm  _  , Mrs. Baker. I have to tell you I can't work for you any longer.\" It  surprised  Mr. and Mrs. Baker. The woman asked, \"What makes you say that? Aren't we  _  to you?\" \"Yes, you are, Madam,\" the girl said. \"Have you found a piece of  _  work yet?\" Mrs. Baker asked. \"No, I haven't,\" Miss Carter said. \"  _  I don't think you trust me.\" \"You are  _  , Miss Carter,\" said Mr. Baker. \"I always think you are a  _  girl. And I often leave my keys in my study.\" \"It was  _  that you often left the keys in your study,\" said the girl. \"But I could use none of them to  _  the safe .\" \"Well,\" said Mr. Baker. \"You can go right now!\"", 
    "options": [
        [
            "died", 
            "dieded", 
            "dying", 
            "dead"
        ], 
        [
            "excellent", 
            "fine", 
            "good", 
            "hard"
        ], 
        [
            "finished", 
            "stopped", 
            "end", 
            "over"
        ], 
        [
            "work", 
            "works", 
            "job", 
            "jobs"
        ], 
        [
            "better", 
            "good", 
            "best", 
            "well"
        ], 
        [
            "much", 
            "more", 
            "little", 
            "less"
        ], 
        [
            "sorry", 
            "glad", 
            "angry", 
            "please"
        ], 
        [
            "friendly", 
            "friend", 
            "rich", 
            "cold"
        ], 
        [
            "good", 
            "better", 
            "best", 
            "well"
        ], 
        [
            "But", 
            "And", 
            "Though", 
            "What"
        ], 
        [
            "wrong", 
            "right", 
            "foolish", 
            "bright"
        ], 
        [
            "bad", 
            "good", 
            "well", 
            "happy"
        ], 
        [
            "poor", 
            "true", 
            "bad", 
            "well"
        ], 
        [
            "break", 
            "answer", 
            "find", 
            "open"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "A", 
        "C", 
        "C", 
        "B", 
        "A", 
        "A", 
        "B", 
        "A", 
        "A", 
        "B", 
        "B", 
        "D"
    ], 
    "source": "middle1284"
}