{
    "article": "Here are some important rules for you to become a good student at school. *Go to school on time As a  _  , going to school on time is very important. If you are late, you will not start your lesson at the same time with your classmates so that you will  _  some lessons, which can influence your grades. If you are late, the teacher will be  _  with you, too. So remember to go to school on time. *Follow the school rules Do not  _  the school rules. For example, you are not allowed to chew gum or sleep in class. Don't fight  _  your classmates, and you should be friendly to your classmates and your teachers and be ready to  _  others who are in trouble. You mustn't run in the hallway . *Prepare lessons before class  _  you want to know what you will learn next day, you'd better prepare lessons. It is good for your study and it can help you get good  _  Besides, you should listen to the teachers as  _  as possible. *Take part in all kinds of activities at school Try to be in all kinds of activities at school. For example, sports can not only improve the relationship between you and your classmates but also make you  _  . It's easy to follow the school rules and you will become a good student.", 
    "options": [
        [
            "classmate", 
            "teacher", 
            "volunteer", 
            "student"
        ], 
        [
            "miss", 
            "teach", 
            "study", 
            "practice"
        ], 
        [
            "pleased", 
            "angry", 
            "strict", 
            "popular"
        ], 
        [
            "break", 
            "make", 
            "change", 
            "follow"
        ], 
        [
            "to", 
            "at", 
            "with", 
            "about"
        ], 
        [
            "help", 
            "love", 
            "understand", 
            "realize"
        ], 
        [
            "If", 
            "Although", 
            "Unless", 
            "After"
        ], 
        [
            "lessons", 
            "comments", 
            "studies", 
            "grades"
        ], 
        [
            "happily", 
            "carefully", 
            "easily", 
            "slowly"
        ], 
        [
            "calmer", 
            "funnier", 
            "healthier", 
            "cleverer"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "B", 
        "A", 
        "C", 
        "A", 
        "A", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "middle934"
}