{
    "article": "Every Friday night, Winston would stand at the gate of the railway  station to play his violin happily. He smiled to everyone and many people put money into the _ in front of him. One day, Winston showed up and put his hat on the ground as usual. But _ from what he always did in the past days, he took out a large piece of paper and laid it on the ground.\nIt said: Last night, a gentleman _ George Miller left an important thing into my hat by mistake. Please come back , Mr. Miller. About half an hour later, a middle-aged man rushed to Winston in a hurry and said, \"It is you! I know that you are an _ man and will certainly be here.\"\nWinston asked, \"Are you Mr. Miller? Did you lose anything yesterday?\" \"Yes, a lottery   ticket!\" answered the middle-aged man quickly. Winston then _ it to the man. When the man knew that his _ was worth $ 500,000 yesterday, he was so excited! So he threw some money into the young man's hat, later he realized that he threw the ticket together with the money!\nSomeone asked Winston, \"You play the violin to make money . Why didn't you keep the ticket and take the prize for yourself?\" Winston replied, \"Although I don't have much money, I live _ now. But if I lose honesty, I won't be happy forever.\"", 
    "options": [
        [
            "hat", 
            "bag", 
            "paper", 
            "ground"
        ], 
        [
            "usual", 
            "different", 
            "free", 
            "tired"
        ], 
        [
            "had", 
            "talked", 
            "said", 
            "named"
        ], 
        [
            "interesting", 
            "unhappy", 
            "energetic", 
            "honest"
        ], 
        [
            "returned", 
            "offered", 
            "sent", 
            "sold"
        ], 
        [
            "watch", 
            "clothes", 
            "ticket", 
            "car"
        ], 
        [
            "happily", 
            "angrily", 
            "silently", 
            "confidently"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "D", 
        "D", 
        "A", 
        "C", 
        "A"
    ], 
    "source": "middle1531"
}