{
    "article": "My crippled grandmother was dancing. I stood in the living room doorway, looking at her beautiful movements, completely _ . Do you know she'd had her accident. I had read that in an old newspaper article.\n''So...Your leg? I mean, _ did your leg heal ?\"\n\"To tell you the truth my legs have been well all my life,\" she said.\n\"But I don't understand!\" I said, \"Your dancing career...You _ all these years?\"\n''Very much so, and for a very good _ .\"\nShe thought for a while and then continued. \"Your grandfather and I were talking about engagement  _ he had to go to war. I was so afraid of losing him that the only way I could stay normal was to dance. I put all my heart _ practicing and I became very good. The public loved me, but all I could feel worried about not knowing whether the love of my life would _ return. One day a letter came, There were only three sentences: \"I have lost my leg. I am no longer a _ man and now give you back your freedom. It is best you forget about me.\"\n\"I made my decision there and then. I traveled away from the city. When I returned I had bought _ a stick. I told everyone I had been in a car crash and that my leg would never completely heal again. No one doubted the story l had learned to limp . And I made sure the first person to hear of my accident was a _ I knew well. Then I went to the hospital. The nurses pushed your grandfather outside in his _ .I took a deep breath, leaned on my stick and limped to him.\"\nI showed him newspaper articles of my accident. \"There is a whole life waiting for us out there! But I am not going to _ you. You are going to walk yourself.\"\nI limped a few steps toward him and showed him what I'd taken out of my pocket. \"Now show me you are _ a man.\" I said.He bent to take his stick from the ground and struggled  out of that wheelchair.He managed it on his own and walked to me and never sat in a wheelchair _ in his life.\"\n\"What did you show him?\" I had to know. Grandma looked at me and smiled. \"Two engagement rings, of course. I had bought them the day _ he left for the war and I was not going to waste them on any other man.\"", 
    "options": [
        [
            "dropped", 
            "defeated", 
            "shocked", 
            "pleased"
        ], 
        [
            "How", 
            "What", 
            "Why", 
            "Who"
        ], 
        [
            "predicted", 
            "pretended", 
            "prepaired", 
            "preferred"
        ], 
        [
            "reason", 
            "excuse", 
            "effect", 
            "result"
        ], 
        [
            "where", 
            "while", 
            "when", 
            "since"
        ], 
        [
            "with", 
            "into", 
            "for", 
            "from"
        ], 
        [
            "just", 
            "almost", 
            "ever", 
            "even"
        ], 
        [
            "sad", 
            "half", 
            "rich", 
            "whole"
        ], 
        [
            "myself", 
            "himself", 
            "ourselves", 
            "youself"
        ], 
        [
            "doctor", 
            "reporter", 
            "visitor", 
            "leader"
        ], 
        [
            "way", 
            "sunglass", 
            "car", 
            "wheelchair"
        ], 
        [
            "take", 
            "fetch", 
            "carry", 
            "bring"
        ], 
        [
            "hardly", 
            "still", 
            "also", 
            "never"
        ], 
        [
            "again", 
            "about", 
            "above", 
            "along"
        ], 
        [
            "though", 
            "unless", 
            "until", 
            "after"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "B", 
        "A", 
        "C", 
        "B", 
        "C", 
        "D", 
        "A", 
        "B", 
        "D", 
        "C", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "middle1014"
}