{
    "article": "A group of grown-ups, all did well in in their jobs, went to visit their old teacher. Soon they began to complain about the stress in work and life.\nThe teacher went to the kitchen and returned _ a pot of coffee and all kinds of cups --crystal , glass, plastic ; some nice looking, some just common; some _ , some cheap. And he told them to help _ to the coffee.\nWhen all the students had a cup of coffee in hand, the teacher said, \"I _ that all of you took away the nice looking expensive cups, leaving behind the common and cheap ones. While it is normal for you to take only the best for yourselves, that is the cause of your problems and stress.\nYou know that the cup itself doesn't make the coffee more delicious. What you really wanted was coffee, not the cup, _ you just went for the best cups.\nNow think about this: Life is the coffee. The jobs, _ and position  in society are the cups. We just use them to hold life, and the type of cup does not change our life. Sometimes, by seeing only the cup, we forget to enjoy the coffee that God _ us. God provides us with the coffee, not the cups. Please enjoy your coffee!\"\nThe happiest people don't have the best of everything. They just make everything the best .\nLive simply. Love generously . Care deeply. Speak _ ,And leave the rest to God.", 
    "options": [
        [
            "for", 
            "at", 
            "in", 
            "with"
        ], 
        [
            "expensive", 
            "beautiful", 
            "strong", 
            "serious"
        ], 
        [
            "them", 
            "themselves", 
            "him", 
            "everyone"
        ], 
        [
            "found", 
            "guessed", 
            "thought", 
            "believed"
        ], 
        [
            "and", 
            "but", 
            "so", 
            "or"
        ], 
        [
            "money", 
            "age", 
            "health", 
            "family"
        ], 
        [
            "teaches", 
            "offers", 
            "sells", 
            "buys"
        ], 
        [
            "kindly", 
            "sadly", 
            "loudly", 
            "seriously"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "B", 
        "A", 
        "B", 
        "D", 
        "B", 
        "A"
    ], 
    "source": "middle1282"
}