{
    "article": "Mr. King was a strong man. He liked playing football and _ a lot of time on it when he studied in a medical college. Unfortunately, his left leg was broken when he was playing football with his friends. He couldn't play football any longer. He was _ for it, but he still liked watching the matches.\nNow Mr. King works in a hospital. He is a good dentist and here are always _ patients in his office. He is always busy and has little time to watch the matches. He has to watch them on TV at home in the evening. But the biggest football match in their city would _ at four one afternoon. Mr. King hoped to watch it, but the leader of the hospital didn't agree to let him take the leave at working hours. \"You can go out _ all the patients in your office leave,\" he said.\nIt was three twenty when there were about ten patients in the waiting room. Mr. King was _ . He thought for a moment and then he had an idea. He said to the old woman who was lying on the chair, \"Cry _ , madam! I'll pull out all your bad teeth for free if you frighten away the other _ !\"", 
    "options": [
        [
            "took", 
            "spent", 
            "cost", 
            "paid"
        ], 
        [
            "glad", 
            "sorry", 
            "angry", 
            "excited"
        ], 
        [
            "little", 
            "few", 
            "many", 
            "much"
        ], 
        [
            "start", 
            "finish", 
            "come", 
            "go"
        ], 
        [
            "unless", 
            "until", 
            "before", 
            "after"
        ], 
        [
            "worried", 
            "free", 
            "pleased", 
            "quiet"
        ], 
        [
            "happily", 
            "quietly", 
            "loudly", 
            "angrily"
        ], 
        [
            "doctors", 
            "women", 
            "patients", 
            "nurses"
        ]
    ], 
    "answers": [
        "B", 
        "B", 
        "C", 
        "A", 
        "D", 
        "A", 
        "C", 
        "C"
    ], 
    "source": "middle246"
}