{
    "article": "Miss Brown would never forget the night when she met a robber many years ago. That evening, she went to a birthday party which  _  until two o'clock in the morning. Miss Brown walked in the  _  street alone. Suddenly from the back of the dark building a tall man with a sharp knife in his right hand ran out at her. \"Good morning,lady.\" the man said in a low voice, \"I don't think you wish to  _  here!\" \"What do you want?\" \"Your earrings. Take them  _  !\" Miss Brown suddenly had a  _  idea. She tried to cover her necklace with the collar of her overcoat while she used the other hand to take off both of her earrings and then quickly  _  them on the ground. \"Take them and let me go,\" she said. The robber thought that the girl didn't like the earrings at all, only trying to  _  the necklace. The earrings would cost  _  , so he said, \"Give me your necklace.\" \"Oh, sir. It doesn't cost much. Please let me wear it.\" \"I am not that  _  . Quick!\" With shaking  _  , Miss Brown took off her necklace. As soon as the robber left, she picket up her earrings and ran as fast as she could to one of her friends. The earrings cost 2000 pounds and the necklace which the robber had taken away cost only six pounds.", 
    "options": [
        [
            "ended", 
            "stayed", 
            "stopped", 
            "lasted"
        ], 
        [
            "busy", 
            "quiet", 
            "noisy", 
            "wide"
        ], 
        [
            "die", 
            "escape", 
            "fight", 
            "sleep"
        ], 
        [
            "out", 
            "away", 
            "off", 
            "down"
        ], 
        [
            "funny", 
            "safe", 
            "brave", 
            "great"
        ], 
        [
            "handed", 
            "threw", 
            "passed", 
            "put"
        ], 
        [
            "own", 
            "keep", 
            "have", 
            "get"
        ], 
        [
            "cheap", 
            "expensive", 
            "more", 
            "less"
        ], 
        [
            "afraid", 
            "angry", 
            "silly", 
            "bad"
        ], 
        [
            "hands", 
            "feet", 
            "head", 
            "body"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "A", 
        "C", 
        "D", 
        "B", 
        "B", 
        "D", 
        "C", 
        "A"
    ], 
    "source": "middle968"
}