{
    "article": "I stood in the doorway, watching my elder brother carefully putting clothes into his bag. I coughed uneasily. Finally  _  that I was there, Rocky turned towards me with a sad smile. \"I'm  _  tomorrow,\" he said. \"I know.\" My  _  was almost a whisper. I was  _  at myself for being so weak, but I wasn't about to cry. \"My  _  is early, so there is still  _  time to come to the airport,\" he said. Seeing the  _  look on my face, he quickly added, \"I promise I won't leave without saying goodbye.\" I tried to say  _  , but didn't. It's always  _  to keep quiet if you're about to cry. \"You promised you wouldn't cry,\" he said to me, thinking that I was close to  _  . I remember the day he taught me how to ride a bike.  At first  I thought he was always right behind me, holding the seat to keep me from  _  . I was happy with this, but he knew he couldn't hold me up all my life. He told me that one day he would have to let go. His coughing stopped my thinking. What was left to say? How could I say  _  to the person who taught me everything? The next morning I  woke up  , looked at my alarm clock, and realized he had left  _  ago. We never even said goodbye. Goodbye, Rocky! Although he may have been many miles away, I knew he heard me, even if it was only an answer in his heart.", 
    "options": [
        [
            "forgetting", 
            "realizing", 
            "watching", 
            "learning"
        ], 
        [
            "arriving", 
            "living", 
            "coming", 
            "leaving"
        ], 
        [
            "voice", 
            "sound", 
            "noise", 
            "word"
        ], 
        [
            "glad", 
            "moved", 
            "angry", 
            "pleased"
        ], 
        [
            "ship", 
            "flight", 
            "train", 
            "bus"
        ], 
        [
            "enough", 
            "little", 
            "no", 
            "busy"
        ], 
        [
            "surprised", 
            "excited", 
            "sad", 
            "happy"
        ], 
        [
            "anything", 
            "everything", 
            "something", 
            "nothing"
        ], 
        [
            "stranger", 
            "better", 
            "worse", 
            "easier"
        ], 
        [
            "tears", 
            "smiles", 
            "words", 
            "sadness"
        ], 
        [
            "riding", 
            "running", 
            "walking", 
            "falling"
        ], 
        [
            "goodbye", 
            "hello", 
            "yes", 
            "sorry"
        ], 
        [
            "minutes", 
            "hours", 
            "days", 
            "weeks"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "A", 
        "C", 
        "B", 
        "A", 
        "C", 
        "C", 
        "B", 
        "A", 
        "D", 
        "A", 
        "B"
    ], 
    "source": "middle975"
}