{
    "article": "Although it was autumn, the snow was already beginning to fall in Tibet .Our legs were so heavy and cold that  _  felt like big pieces of ice. Have you  _  seen snowmen ride bicylces? That's what we looked like! Along the way children who were  dressed in  long wool coats stopped to look at us. In the late  _  we found it was so cold that our water bottles froze .However, the lakes  _  like glass in the setting sun and loooked wonderful. Wang Wei rode in front of me as usual. She was in high spirit and I knew I didn't need to  _  her. To climb the mountains was hard work but as we  looked around  us, we were surprised by the view. We seemed to be able to see for miles, and we were so high that we found ourselves cycling through clouds. After a while, we began going  _  the mountains. It was great fun especially as it slowly became much  _  .At the foot of the mountains, colourful butterflies flew around us and we saw many sheep eating green grass. Then we had to  _  our caps, gloves and trousers for T-shirts and shorts. In the early evening we stopped to make camp .We  put up  our tent and then we ate. Afte supper Wang Wei went to sleep but I stayed  _  .  _  midnight the sky became clearer and the stars grew brighter.As I  _  below the stars I thought about how far we had already travelled. We will reach Dali in Yunan Province soon, where our cousins will join us. We  _  hardly wait to see them!", 
    "options": [
        [
            "we", 
            "you", 
            "they", 
            "it"
        ], 
        [
            "never", 
            "ever", 
            "even", 
            "yet"
        ], 
        [
            "morning", 
            "afternoon", 
            "evening", 
            "night"
        ], 
        [
            "shine", 
            "shining", 
            "shines", 
            "shone"
        ], 
        [
            "follow", 
            "encourage", 
            "remind", 
            "discover"
        ], 
        [
            "up", 
            "down", 
            "around", 
            "into"
        ], 
        [
            "colder", 
            "drier", 
            "warmer", 
            "wetter"
        ], 
        [
            "charge", 
            "check", 
            "chase", 
            "change"
        ], 
        [
            "alive", 
            "alone", 
            "away", 
            "awake"
        ], 
        [
            "At", 
            "On", 
            "In", 
            "From"
        ], 
        [
            "lie", 
            "lied", 
            "lay", 
            "laid"
        ], 
        [
            "may", 
            "can", 
            "must", 
            "shall"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "B", 
        "D", 
        "B", 
        "B", 
        "C", 
        "D", 
        "D", 
        "A", 
        "C", 
        "B"
    ], 
    "source": "middle1639"
}