{
    "article": "When I met my best friend for the first time. I was studying for an important oral exam in the library and people there made a lot of noise. The more upset I got, the harder it was for me to stay focused . The worst was that someone was even singing loudly behind me.\nI turned around and glared   at the person. She looked like a friendly girl, _ it made me even angrier.\nI picked up my books, glared at her and said in a low voice angrily. \"Thanks to your _ , I can't study. You're so selfish.\"\nWhen I got home two hours later, I found that I'd left my most important textbook in the library and the library was closed. I was so _ that I almost cried. Just then, the phone rang. After making sure that I was Jane, the girl said that she had found my book and she got my phone number from the librarians' files according to  my name on the book . She said she could bring it around for me.\nI was so _ ! When I found she was the girl I had shouted at for singing, my face turned red and I said sorry several times for my rude behavior . Jenny just laughed and told me she was glad to see that I'd also left my glare in the library! I couldn't help _ .We got along really well and ever since then we've been best friends. I often think how _ I am. If Jenny hadn't been a kind person who was willing to forgive   my rudeness, I would never have _ such true friendship.", 
    "options": [
        [
            "though", 
            "or", 
            "but", 
            "for"
        ], 
        [
            "help", 
            "noise", 
            "books", 
            "words"
        ], 
        [
            "surprised", 
            "bored", 
            "excited", 
            "upset"
        ], 
        [
            "careful", 
            "helpful", 
            "wonderful", 
            "thankful"
        ], 
        [
            "studying", 
            "crying", 
            "laughing", 
            "talking"
        ], 
        [
            "lucky", 
            "happy", 
            "successful", 
            "talented"
        ], 
        [
            "promised", 
            "experienced", 
            "refused", 
            "accepted"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "D", 
        "D", 
        "C", 
        "A", 
        "B"
    ], 
    "source": "middle79"
}