{
    "article": "My good friend\nOne Friday afternoon in September, Mrs. Ferrara told us that a new student would join the class. \"Her name is Lisa,\" said Mrs. Ferrara. \"You might notice that there is something wrong with her _ .\"\nLisa walked into our _ on Monday morning. There was a cane  in her hand. Mrs. Ferrara gave her a seat in the front of the room. Her desk was far away from the windows. Maybe the strong light made her eyes feel _ . Mrs. Ferrara put a small computer on Lisa's desk. Lisa used it to make the words in a book look bigger.\nSome of the children wanted to help Lisa walk after school. She always said, \"Thanks, _ I don't need help.\" I thought Lisa looked a little _ . One day, I asked her, \"Why are you unhappy, Lisa?\" She looked at me for a moment. Then she said, \"I _ my friends in my old school. They know _ I can do. They know when I need help and when I don't.\"\nIn October, things began to get _ . It was time for the chorus   to begin practicing. Lisa and I both joined it. She had a great voice! Lisa also joined the Maths Club. She did very well in Maths! Soon Lisa could help other kids who were not good at _ . Lisa looked happier than before.\nLisa became very special to me. We visited each other after school. Sometimes at the weekend, our families went out together. We became best friends. I could tell Lisa _ . She could keep a secret. Of course she was a good friend!", 
    "options": [
        [
            "eyes", 
            "hands", 
            "legs", 
            "feet"
        ], 
        [
            "home", 
            "playground", 
            "classroom", 
            "library"
        ], 
        [
            "good", 
            "dark", 
            "comfortable", 
            "uncomfortable"
        ], 
        [
            "and", 
            "but", 
            "or", 
            "so"
        ], 
        [
            "happy", 
            "sad", 
            "bored", 
            "excited"
        ], 
        [
            "like", 
            "hate", 
            "miss", 
            "dislike"
        ], 
        [
            "how", 
            "why", 
            "where", 
            "what"
        ], 
        [
            "better", 
            "worse", 
            "funnier", 
            "cuter"
        ], 
        [
            "Maths", 
            "English", 
            "singing", 
            "reading"
        ], 
        [
            "nothing", 
            "something", 
            "anything", 
            "everything"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "D", 
        "B", 
        "B", 
        "C", 
        "D", 
        "A", 
        "A", 
        "C"
    ], 
    "source": "middle2129"
}