{
    "article": "(15;l,15) Recently, I felt like I reached a very low point in life. My relationships weren't good, I wasn't  _  my classes, and I felt like I had nothing to  look forward to  .My life seemed to be full of endless homework, tests and loneliness. Nothing anyone said seemed  _  to me. I wasn't sure what to do about myself.  All I wanted  was to be happy again, but I didn't know who or what would  _  that. During these days, I had trouble  _  . I had to take sleeping pills but still woke up in the midnight. I had no  _  but to tell my dad. He  _  the book The Secret. I immediately bought the e-book online and read the whole thing that night. I'm normally quite a stubborn person,  _  the influence on my mood after finishing the book was obvious . Suddenly, I felt like life was  _  again. I had never felt such a deep and quick  _  in my life before. In fact, the book's message was very simple--think positively .The book had many  _  stories about how people were able to  _  money, soul mates and old friends back into their lives. I started learning to thank everything in my life  _  them. Little by little, I realized that The Secret could work only  _  I believed these people's success stories. Now I'm sure I can bring myself happiness.", 
    "options": [
        [
            "playing", 
            "doing", 
            "giving", 
            "enjoying"
        ], 
        [
            "helpful", 
            "colourful", 
            "peaceful", 
            "powerful"
        ], 
        [
            "serve", 
            "offer", 
            "answer", 
            "prevent"
        ], 
        [
            "sleepy", 
            "asleep", 
            "sleep", 
            "sleeping"
        ], 
        [
            "problem", 
            "idea", 
            "need", 
            "doubt"
        ], 
        [
            "borrowed", 
            "collected", 
            "returned", 
            "suggested"
        ], 
        [
            "and", 
            "but", 
            "or", 
            "so"
        ], 
        [
            "pleased", 
            "common", 
            "beautiful", 
            "serious"
        ], 
        [
            "breath", 
            "notice", 
            "surprising", 
            "change"
        ], 
        [
            "success", 
            "successful", 
            "succeed", 
            "successfully"
        ], 
        [
            "attract", 
            "control", 
            "imagine", 
            "mention"
        ], 
        [
            "as", 
            "like", 
            "likes", 
            "for"
        ], 
        [
            "until", 
            "When", 
            "since", 
            "before"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "B", 
        "D", 
        "B", 
        "D", 
        "B", 
        "C", 
        "D", 
        "A", 
        "A", 
        "B", 
        "B"
    ], 
    "source": "middle2037"
}