{
    "article": "Every child has a dream of what they want to be, right? When Renee Butts was _ , her dream was to become a volunteer firefighter because her father was one. Sadly, when she was 14, her father died and she was _ able to volunteer with him. Renee's story doesn't _ there, however, which is why I think of her as a true _ . She was strong-minded and never give up , which makes her a good firefighter.\nSome days she must be ready to deal with any emergency, like _ a fire, dealing with a car accident or helping someone _ is sick. Other days she is in the driver's seat. Sometimes Renee works nine or eleven hours a month on 24-hour shifts. She also has a _ to take care of. Her husband is a firefighter, too.\nRenee remembers the _ time she fought a fire. She was awoken early in the morning by the alarm. She said she was very _ but did what she had to do.\n _ I asked Renee what the best part of her job is, she replied, \"Helping people and saving their lives.\"I think that _ signs of being a true hero. She's always glad to do _ for anyone in need. With 140 people in her station, Renee is one of the only three women.\nI think she's great. We could never live _ people like Renee who is glad to help others. Renee's deed helps me believe that _ can do anything. Someday I hope to be just her: to wake up and help people every day.", 
    "options": [
        [
            "young", 
            "strong", 
            "old", 
            "tall"
        ], 
        [
            "always", 
            "never", 
            "almost", 
            "usually"
        ], 
        [
            "change", 
            "start", 
            "end", 
            "continue"
        ], 
        [
            "girl", 
            "fool", 
            "volunteer", 
            "hero"
        ], 
        [
            "getting", 
            "making", 
            "catching", 
            "fighting"
        ], 
        [
            "who", 
            "which", 
            "whom", 
            "what"
        ], 
        [
            "home", 
            "house", 
            "family", 
            "room"
        ], 
        [
            "first", 
            "second", 
            "last", 
            "next"
        ], 
        [
            "unhappy", 
            "excited", 
            "sad", 
            "nervous"
        ], 
        [
            "When", 
            "Until", 
            "Before", 
            "Unless"
        ], 
        [
            "finds", 
            "sees", 
            "writes", 
            "shows"
        ], 
        [
            "something", 
            "anything", 
            "nothing", 
            "what"
        ], 
        [
            "without", 
            "around", 
            "with", 
            "besides"
        ], 
        [
            "you", 
            "she", 
            "I", 
            "he"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "C", 
        "D", 
        "D", 
        "A", 
        "C", 
        "A", 
        "D", 
        "A", 
        "D", 
        "B", 
        "A", 
        "C"
    ], 
    "source": "middle496"
}