{
    "article": "Everyone has a personality.One person might love to run and jump.Another may prefer to sit and think.Animals have personalities,  _  .Scientists study their behavior,or the way they act,in order to learn more about them.Here are  _  kinds of animals that have special personalities. A cat called Phoenix doesn't need anyone to open doors  _  him.When he wants to go out,he just pushes a special doorbell.The doorbell's inventor thought that many people would rush to buy the cat doorbells,but  _  have been sold.That may be because not many cats have the same personality as Phoenix. Scientists at Seattle's Woodland Park Zoo gave carved pumpkins to their chimpanzees.They wanted to know  _  their chimpanzees played with the pumpkins before eating them.A chimpanzee called Jumoke  _  a lot of time picking out the biggest pumpkin.Another chimpanzee called Alafia looked for a pumpkin she could fit over her head.Congo,a chimpanzee from South Africa,chose a pumpkin with a face he liked best.  _  chimpanzee showed his or her personality while making choices. Most parrots can only repeat words their owners say,  _  one parrot,named Alex,is a talker and a good listener! When his  _  showed different objects to him at the same time,Alex Can pick out the yellow object,the biggest object,or even\"the one under the square.\"Alex also has a good memory.If his owner asks,\"Alex,what color is corn?\"Alex answers,\"Yellow.\"He can do this even if there is  _  corn in the room.", 
    "options": [
        [
            "too", 
            "also", 
            "either", 
            "neither"
        ], 
        [
            "three", 
            "four", 
            "five", 
            "six"
        ], 
        [
            "from", 
            "for", 
            "to", 
            "by"
        ], 
        [
            "many", 
            "few", 
            "much", 
            "little"
        ], 
        [
            "where", 
            "when", 
            "what", 
            "how"
        ], 
        [
            "took", 
            "cost", 
            "spent", 
            "made"
        ], 
        [
            "All", 
            "Either", 
            "None", 
            "Each"
        ], 
        [
            "but", 
            "and", 
            "instead", 
            "besides"
        ], 
        [
            "father", 
            "mother", 
            "teacher", 
            "owner"
        ], 
        [
            "not", 
            "anything", 
            "no", 
            "any"
        ]
    ], 
    "answers": [
        "A", 
        "A", 
        "B", 
        "B", 
        "D", 
        "C", 
        "D", 
        "A", 
        "D", 
        "C"
    ], 
    "source": "middle1171"
}