{
    "article": "_  my special day, my husband took me to the Olive Garden. Our  _ , Carlini, was very nice. We had a great dinner and after we _ the meal, Carlini brought our bill .\nWhen she came back to the table to get our money, I knew it was my  _ to give. I put the gift bag on the table and said, \"I want to _ you a gift, for it's my birthday.\"\n\"Oh, no,\" she said, \"not for me! It's _ birthday!\" But I insisted . Then she said, \"Can I  _  it in front of you?\" And I said that would be fine.\nThe first thing she noticed was the  color of the gift bag which was purple. Purple is her favorite color and she  _ had a purple tie on!\nShe opened the bag, saying, \"It's Christmas Day in July.\"\nAs she was taking the gift out of the bag, she said she was  _ and she never thought that day was her lucky day. It was _ to give someone the exact present that she loved! She opened the box and saw it was a purple cup. Inside the cup was a thank-you card and forty-five dollars, a dollar for each  _  of my life.\n _  she saw the money, she looked at us and said, \"You do not have to leave a tip .\" But my husband and I just said _  and left.\nCarlini was so thankful for  _  she had received. She said we had given her a big surprise. I thanked her for receiving my gift so beautifully.", 
    "options": [
        [
            "On", 
            "In", 
            "At", 
            "As"
        ], 
        [
            "actress", 
            "singer", 
            "doctor", 
            "waitress"
        ], 
        [
            "ordered", 
            "finished", 
            "cooked", 
            "bought"
        ], 
        [
            "time", 
            "job", 
            "duty", 
            "pleasure"
        ], 
        [
            "lend", 
            "give", 
            "make", 
            "show"
        ], 
        [
            "my", 
            "her", 
            "his", 
            "your"
        ], 
        [
            "pack", 
            "write", 
            "open", 
            "take"
        ], 
        [
            "nearly", 
            "actually", 
            "quickly", 
            "simply"
        ], 
        [
            "excited", 
            "bored", 
            "tired", 
            "relaxed"
        ], 
        [
            "interesting", 
            "wonderful", 
            "funny", 
            "silly"
        ], 
        [
            "person", 
            "thing", 
            "event", 
            "year"
        ], 
        [
            "Before", 
            "Though", 
            "After", 
            "Unless"
        ], 
        [
            "something", 
            "everything", 
            "anything", 
            "nothing"
        ], 
        [
            "how", 
            "why", 
            "what", 
            "where"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "B", 
        "A", 
        "B", 
        "D", 
        "C", 
        "B", 
        "A", 
        "B", 
        "D", 
        "C", 
        "D", 
        "C"
    ], 
    "source": "middle1695"
}