{
    "article": "Andy went home from school by bus one day. When an old woman carrying a basket full of apples got onto the bus, Andy  _  his seat. The old woman  _  her thanks to him and before she got off, she  picked out  three big apples and said, \"I want to give you these three  _  apples. Tell one apple your wish, eat it and then wait and see.\" The next day Andy went to a park with the apples. \"I wish to be tall and strong.\" Andy said when he saw boys playing baseball there. He ate the first apple and grew into a very tall boy. But all the boys ran away with  _  when they saw this. Andy was sad. He took out another apple and said, \"I wish to be famous so as to have lots of friends.\" With these words, he ate the second apple. But when hundreds of reporters tried to interview him, he had to hide himself to  _  them. Andy's third wish was to be one of the richest men in the world. But when his wish came true, he found himself still  _  . One night Andy  came across  the old lady again in the street. She saw he was not in high spirits and asked him what he really wanted to be. \"I just want to be  _  !\" Andy said. Suddenly he was at the  _  again. One of the boys came up and said to him, \"Come on and play with us!\"", 
    "options": [
        [
            "refused", 
            "offered", 
            "kept", 
            "shook"
        ], 
        [
            "expressed", 
            "explained", 
            "imagined", 
            "regretted"
        ], 
        [
            "bitter", 
            "plain", 
            "magic", 
            "funny"
        ], 
        [
            "joy", 
            "pride", 
            "courage", 
            "fear"
        ], 
        [
            "avoid", 
            "control", 
            "receive", 
            "warn"
        ], 
        [
            "lonely", 
            "silent", 
            "lively", 
            "excellent"
        ], 
        [
            "him", 
            "me", 
            "them", 
            "you"
        ], 
        [
            "bus", 
            "street", 
            "park", 
            "heaven"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "D", 
        "A", 
        "A", 
        "B", 
        "C"
    ], 
    "source": "middle1332"
}