{
    "article": "When my son, Justin, was four, he found a caterpillar and put it in a box. Each day he _ it fresh grass and leaves . In a few weeks, the caterpillar became fat and was ready to sleep. One morning we found _ had become a cocoon .\nJustin was _ . He knew a moth or butterfly was going to be _ .\n\"Dad ! _ is happening. Come and look!\" He shouted happily. We could clearly see the wings _ . A few days later, a beautiful black moth broke free from its cocoon.\nThe next day, Justin took the _ outside and opened it, and the little moth flew out. It flew around the yard twice, came back , and landed on Justin's arm. He picked it up and threw it in the air, _ the moth came back again. He tried over and over to set it free, but each time it would return to his arm.\nI believe the moth, just like a person, was afraid to _ comfortable places and situations. It wanted to stay with something _ and was afraid to move on and experience new things.\nI was once that little moth. My cocoon was my mother's love which made me comfortable. _ the moth, I didn't want to fly too far from it. When my first job required me to move to a new city, I was _ but later I chose to move there. And finally, I found I was happy about my _ .\nHumans are animals of habit. We _ change. However, if we hadn't moved, we would not have experienced many new things. So spread your wings and fly.", 
    "options": [
        [
            "caught", 
            "gave", 
            "found", 
            "carried"
        ], 
        [
            "it", 
            "they", 
            "we", 
            "he"
        ], 
        [
            "unhappy", 
            "afraid", 
            "excited", 
            "tired"
        ], 
        [
            "born", 
            "changed", 
            "created", 
            "raised"
        ], 
        [
            "Anything", 
            "Nothing", 
            "Everything", 
            "Something"
        ], 
        [
            "indoor", 
            "outdoor", 
            "inside", 
            "outside"
        ], 
        [
            "door", 
            "box", 
            "book", 
            "window"
        ], 
        [
            "and", 
            "or", 
            "but", 
            "so"
        ], 
        [
            "stay", 
            "feel", 
            "develop", 
            "leave"
        ], 
        [
            "dangerous", 
            "familiar", 
            "strange", 
            "boring"
        ], 
        [
            "Like", 
            "As", 
            "For", 
            "To"
        ], 
        [
            "mad", 
            "angry", 
            "afraid", 
            "happy"
        ], 
        [
            "decision", 
            "job", 
            "city", 
            "success"
        ], 
        [
            "enjoy", 
            "hate", 
            "plan", 
            "love"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "A", 
        "D", 
        "C", 
        "B", 
        "C", 
        "D", 
        "B", 
        "A", 
        "C", 
        "A", 
        "B"
    ], 
    "source": "middle2277"
}