{
    "article": "Years ago, a very rich man and his young son shared an interest in collecting art. They traveled around the world, collecting _ works of art by famous artists like Picasso, Van Gogh and Monet.\nWhen war broke out, the son left to _ for his country. After a few weeks, the old man received a _ saying his son had died. The man became very lonely and sad.\nOne day, a soldier visited the old man and gave him a painting - it was _ by his son. The painting was important to the man _ the world would never think it a great work. He told his neighbors it was the _ gift he had ever received.\nThe following spring, the old man died. All of the old man's paintings would be _ at an auction . The auction began with a painting that was not on any of the buyers' _ ... it was the painting of the old man's son. \"Who will open the price at $100?\" the auctioneer asked. Moments passed and no one spoke or _ their hand. Someone said: \"Who cares about that painting? Let's get on to the good ones.\" More voices followed in _ . \"No, we must sell this one first,\" replied the auctioneer. \"Now, who will take the picture of the son?\"\n _ , a good friend of the old man spoke: \"Will you take $10 for the painting? That's all I have.\" \"Will _ go higher?\" called the auctioneer. After more _ he said: \"Going once ... going twice ... sold!\" The auctioneer looked at the crowd and said that the whole auction was _ . \"According to the father's will, _ takes the son's picture gets the whole collection, \" the auctioneer said.\nIn the eyes of a father, nothing is more valuable than his son - not even paintings of the famous artists are as important as his son's.", 
    "options": [
        [
            "priceless", 
            "useless", 
            "helpless", 
            "careless"
        ], 
        [
            "train", 
            "fight", 
            "cheer", 
            "practise"
        ], 
        [
            "letter", 
            "book", 
            "diary", 
            "bag"
        ], 
        [
            "decorated", 
            "drawn", 
            "bought", 
            "repaired"
        ], 
        [
            "before", 
            "when", 
            "until", 
            "though"
        ], 
        [
            "cheapest", 
            "oldest", 
            "greatest", 
            "biggest"
        ], 
        [
            "donated", 
            "counted", 
            "sold", 
            "named"
        ], 
        [
            "lists", 
            "desks", 
            "pockets", 
            "notebooks"
        ], 
        [
            "shook", 
            "showed", 
            "raised", 
            "touched"
        ], 
        [
            "agreement", 
            "public", 
            "trouble", 
            "need"
        ], 
        [
            "Slowly", 
            "Suddenly", 
            "Finally", 
            "Luckily"
        ], 
        [
            "somebody", 
            "anybody", 
            "everybody", 
            "nobody"
        ], 
        [
            "noise", 
            "action", 
            "choice", 
            "silence"
        ], 
        [
            "out", 
            "off", 
            "on", 
            "over"
        ], 
        [
            "Whatever", 
            "Whenever", 
            "Wherever", 
            "Whoever"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "A", 
        "B", 
        "D", 
        "C", 
        "C", 
        "A", 
        "C", 
        "A", 
        "C", 
        "B", 
        "D", 
        "D", 
        "D"
    ], 
    "source": "middle57"
}