{
    "article": "A businessman sent his son to learn the secret of happiness from the wisest man. The boy walked through the desert for forty days  _  he reached a beautiful castle at the top of a mountain where the Sage lived. When he  _  a room, he saw lots of strange views: businessmen coming and going, a small music group  _  sweet music, and all kinds of delicious dishes on a large table. The Sage  conversed with  everyone. The young man had to wait for two hours until it was his  _  .  _  enough patience, the Sage listened to the boy, but he was too  _  to explain to him the secret of happiness.  _  he suggested that the boy would walk around his palace and come back in two hours. \"However,\" he added, handing the boy a teaspoon with two drops of oil in it, \"while you walk,  _  this spoon and don't let the oil spill.\" The boy began to walk around the palace,  _  keeping his eyes fixed on the spoon. At last he returned to the Sage. \"So,\" asked the Sage, \"did you notice anything amazing in my palace?\"  _  , the boy said that he had seen nothing. He was only concentrating on the  _  . \"OK. Now go back and see the wonders of my world,\" said the Sage. Now more  _  , the boy took the spoon and walked again through the palace. Returning to the Sage, he exactly reported all  _  he had seen. \"But where is the oil?\" asked the Sage. Looking down at the spoon, the boy realized that he had spilled it all. \"Well, the secret of happiness lies in looking at all the wonders of the world and never  _  the two drops of oil in the spoon,\" the Sage said with a smile. They were both important. Then the boy realized what happiness was.", 
    "options": [
        [
            "until", 
            "unless", 
            "after", 
            "while"
        ], 
        [
            "saw", 
            "left", 
            "entered", 
            "lived"
        ], 
        [
            "hearing", 
            "writing", 
            "enjoying", 
            "playing"
        ], 
        [
            "time", 
            "way", 
            "turn", 
            "duty"
        ], 
        [
            "To", 
            "For", 
            "In", 
            "With"
        ], 
        [
            "busy", 
            "angry", 
            "happy", 
            "funny"
        ], 
        [
            "Though", 
            "While", 
            "Because", 
            "Since"
        ], 
        [
            "catch", 
            "fetch", 
            "grab", 
            "take"
        ], 
        [
            "never", 
            "nearly", 
            "always", 
            "sometimes"
        ], 
        [
            "Interested", 
            "Terrified", 
            "Embarrassed", 
            "Excited"
        ], 
        [
            "spoon", 
            "man", 
            "castle", 
            "palace"
        ], 
        [
            "carefully", 
            "freely", 
            "luckily", 
            "difficultly"
        ], 
        [
            "what", 
            "which", 
            "who", 
            "that"
        ], 
        [
            "forgetting", 
            "minding", 
            "realizing", 
            "considering"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "D", 
        "C", 
        "D", 
        "A", 
        "B", 
        "D", 
        "C", 
        "C", 
        "A", 
        "B", 
        "D", 
        "A"
    ], 
    "source": "middle77"
}