{
    "article": "I was at a little store buying some potatoes. I  _  a small boy; he was thin and wearing old but clean clothes, with a basket in his hand. His eyes were  _  fresh green peas. I paid for my potatoes. At this time, I couldn't help listening to the  _  between Mr. Miller, the store owner, and the poor boy next to me. \" Hello Barry, how are you today?\" \" Hello, Mr. Miller. Fine, thank you. The green peas sure look good.\" \" They are good, Barry.  _  is your mum?\" \" Fine. She is getting better.\" \" Good. Anything I can  _  you with?\" \" No, Sir. I am just having a look at the peas.\" \" Would you like to  _  some home?\" asked Mr. Miller. \" No, Sir. I have nothing to pay for them.\" \" Well, what can you  _  to me for some of those peas?\" \" All I got is my prize marble here.\" \" Is that  _  ? Let me see,\" said Miller. \" Here it is. It is lovely.\" \" I can see that. The only thing is that this one is blue and I want a red one. Do you have a red one like this at home?\" the store owner asked. \"  Maybe  .\" \" OK. Take this bag of peas home with you and next trip this way let me look at that red marble,\" Mr. Miller told the boy. \" Sure, I  _  . Thanks Mr. Miller.\" Mrs. Miller, who had been standing nearby, came over to help me. With a smile she said, \" There are two other boys like him in our community; all three are in very  _  families. Jim just loves to bargain with them for peas, apples, tomatoes, or  _  . When they come back with their red marbles, and they always do, he  _  he doesn't like red after all, and he sends them home with a bag of produce for a green marble or an orange one, when they come on their  _  trip to the store. I left the store smiling to myself, impressed with this man. I would never forget the story of this man, the boys, and their lovely  _  .", 
    "options": [
        [
            "watched", 
            "noticed", 
            "stopped", 
            "showed"
        ], 
        [
            "from", 
            "in", 
            "on", 
            "for"
        ], 
        [
            "conversation", 
            "news", 
            "story", 
            "joke"
        ], 
        [
            "How", 
            "What", 
            "Where", 
            "Which"
        ], 
        [
            "do", 
            "help", 
            "play", 
            "work"
        ], 
        [
            "bring", 
            "take", 
            "carry", 
            "fetch"
        ], 
        [
            "pay", 
            "help", 
            "buy", 
            "give"
        ], 
        [
            "useful", 
            "right", 
            "expensive", 
            "enough"
        ], 
        [
            "will", 
            "would", 
            "must", 
            "should"
        ], 
        [
            "honest", 
            "rich", 
            "friendly", 
            "poor"
        ], 
        [
            "whenever", 
            "however", 
            "whatever", 
            "wherever"
        ], 
        [
            "hopes", 
            "decides", 
            "warns", 
            "expects"
        ], 
        [
            "next", 
            "first", 
            "last", 
            "only"
        ], 
        [
            "present", 
            "friendship", 
            "marble", 
            "deal"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "A", 
        "B", 
        "B", 
        "D", 
        "B", 
        "A", 
        "B", 
        "C", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "middle2132"
}