{
    "article": "My father enjoys bike riding. Ever since I was little, I've always loved going biking with my dad.  _ ,as I became a teenager, other things began to draw my attention. Suddenly  it was important to do things with  _ . I saw my dad every evening home. Why did I have to devote my Sundays to all day bike trip with him,too? My indifference (coldness) hurt him, my father kept  _ . But he would always let me know when he was planning a bike trip in case I wanted to come.\nIt was a Sunday morning , and I was in low spirits. Two of my friends had gone to the movies without inviting me. Just then my father  _ my room \"It's a beautiful day. Want to go for a ride, today,Beck?\"\"Leave me alone!\"I impatiently _ .\nThose were the last words I said to him before he left the house that morning.\nSeveral hours later, the police called us, informing, us that Dad had a traffic accident. My father's injuries were serious. It took several days before he could eventually speak. Beside his bed I held his hand gently, _ of hurting him.\n\"Daddy...I'm sorry...\" \"It's okay,sweetheart. I'll be okay.\"\n\"No,\" I said,\"I  _ what I said to you that day. You know,that morning?\"\n\"Sweetheart, I don't remember anything about that day. I remember kissing you goodnight the night before, though.\" he  _ a weak smile.\nI felt regretful for my thoughtless remark, for I  _ wanted him to leave me alone. My teacher once told me that words have immeasurable power. They can hurt or they can heal. And we all have the power to choose our words. I intend to do that very carefully from now on.", 
    "options": [
        [
            "Therefore", 
            "Instead", 
            "Besides", 
            "However"
        ], 
        [
            "dad", 
            "friends", 
            "teachers", 
            "brothers"
        ], 
        [
            "silent", 
            "busy", 
            "asleep", 
            "awake"
        ], 
        [
            "left", 
            "checked", 
            "entered", 
            "knocked"
        ], 
        [
            "whispered", 
            "warned", 
            "announced", 
            "shouted"
        ], 
        [
            "tired", 
            "afraid", 
            "aware", 
            "sorry"
        ], 
        [
            "discuss", 
            "think", 
            "care", 
            "mean"
        ], 
        [
            "got", 
            "expressed", 
            "exchanged", 
            "managed"
        ], 
        [
            "often", 
            "never", 
            "even", 
            "once"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "A", 
        "C", 
        "D", 
        "B", 
        "D", 
        "D", 
        "B"
    ], 
    "source": "middle288"
}