{
    "article": "Two months ago, there was a serious earthquake in my country. Many people were hurt and _ their homes during the disaster. In my school, we decided to organize a 5-kilometer run to collect money for the people. _ signed up for the run and asked their relatives and neighbors to support them. These people agreed to _ some money--50 cents or a dollar, for example, for every kilometer that the students completed.\nJoe was my classmate. He was the _ student in my class because he seldom did any exercise and he ate plenty of junk food. He never walked to school. He always took a bus. When he was asked _ he was going to take part in the run, he said he would think about it. A few students laughed and I think Joe felt embarrassed. I felt a bit sorry for _ .\nThe next day, as I was riding to school, I saw Joe walking in the street. I stopped and asked him why he was _ . He said he was training to take part in the run. \"Good for you, Joe!\" I said. _ , I told my friends about Joe. Most of them just laughed and said that they didn't think he would _ the run. I wasn't sure, but I decided that I would _ Joe. So, for the two weeks before the run, I was his trainer. He walked to school for a few _ . Then he started to run slowly.\nOn the day of the run, Joe lined up with the other students. The _ began and soon Joe was left behind. Well, it took him hours to finish and he didn't expect to catch up with the other students, but he tried to do his best. And _ he completed the 5-kilometer run. Everyone was very _ and said, \"Well done, Joe!\" What is more, Joe collected more money than any other student! What a good lesson we should learn from.", 
    "options": [
        [
            "cleaned", 
            "reached", 
            "lost", 
            "made"
        ], 
        [
            "Parents", 
            "Students", 
            "Teachers", 
            "Workers"
        ], 
        [
            "borrow", 
            "get", 
            "give", 
            "lend"
        ], 
        [
            "happiest", 
            "heaviest", 
            "tallest", 
            "youngest"
        ], 
        [
            "how", 
            "where", 
            "why", 
            "if"
        ], 
        [
            "her", 
            "him", 
            "us", 
            "you"
        ], 
        [
            "crying", 
            "riding", 
            "singing", 
            "walking"
        ], 
        [
            "Again", 
            "However", 
            "Later", 
            "So"
        ], 
        [
            "complete", 
            "discuss", 
            "support", 
            "understand"
        ], 
        [
            "help", 
            "invite", 
            "stop", 
            "visit"
        ], 
        [
            "days", 
            "weeks", 
            "months", 
            "years"
        ], 
        [
            "class", 
            "movie", 
            "race", 
            "school"
        ], 
        [
            "easily", 
            "quickly", 
            "firstly", 
            "finally"
        ], 
        [
            "busy", 
            "happy", 
            "interested", 
            "nervous"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "C", 
        "B", 
        "D", 
        "B", 
        "D", 
        "C", 
        "A", 
        "A", 
        "A", 
        "C", 
        "D", 
        "B"
    ], 
    "source": "middle1497"
}