{
    "article": "Six-year-old Brandon decided one morning to make his parents pancakes. He  found  a big bowl and a spoon, pulled a chair to the table, opened the cupboard and pulled out the heavy flour bag. He put some flour  _  the bowl with his hands, mixed in a cup of milk and  _ some sugar.\nSoon Brandon  was covered with  flour and getting frustrated . He wanted this to be something  _ for Mum and Dad, but it was getting very bad. He didn't know what to do  _ .\nSuddenly he saw his cat near the bowl and went to push her away,  _  the egg box to the floor. He tried to clean up but slipped on the eggs, getting his clothes  _ . Just then, he saw his Dad _  at the door.\nBrandon's eyes were full of tears. All he wanted to do was something good, but now. He was sure his Dad would beat him, but his father didn't.  _ , he picked up his crying son and kissed him.\nThat's what we sometimes face in  _ . We try to do something good, but it turns into a mess . Sometimes we just _  there in tears  because we can't think of anything else to do. Hopefully, that's someone close to us picks us up, loves us and forgives us. But we can't  _  trying to \"make pancakes\" for Dad or for other. Sooner or _  we'll get it right, and then they'll be glad we tried.", 
    "options": [
        [
            "above", 
            "at", 
            "into", 
            "under"
        ], 
        [
            "put", 
            "dumped", 
            "gave", 
            "added"
        ], 
        [
            "terrible", 
            "forgetable", 
            "good", 
            "interesting"
        ], 
        [
            "certainly", 
            "already", 
            "recently", 
            "next"
        ], 
        [
            "falling", 
            "breaking", 
            "knocking", 
            "sending"
        ], 
        [
            "clean", 
            "big", 
            "cheap", 
            "dirty"
        ], 
        [
            "standing", 
            "sitting", 
            "knocking", 
            "pushing"
        ], 
        [
            "Therefore", 
            "Finally", 
            "Instead", 
            "But"
        ], 
        [
            "life", 
            "time", 
            "use", 
            "space"
        ], 
        [
            "lay", 
            "land", 
            "study", 
            "stand"
        ], 
        [
            "stop", 
            "keep", 
            "mind", 
            "finish"
        ], 
        [
            "late", 
            "later", 
            "less", 
            "loss"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "C", 
        "D", 
        "C", 
        "D", 
        "A", 
        "C", 
        "A", 
        "D", 
        "A", 
        "B"
    ], 
    "source": "middle1540"
}