{
    "article": "As she walked round the large shop, Edith realized how difficult it was to choose a suitable Christmas gift for her father. She wished that he were as easy to please as her mother, who was  _  satisfied with perfume .  _ , shopping at this time of the year was a most  _  job.\nPeople stepped on your  _ , pushed you with their shoulders and almost  _  you over in their hurry in order to find something cheap ahead of you.\nPartly to have a rest, Edith paused in front of a counter, where some beautiful ties were on  _ . \"They are real silk.\" the shop assistant told her with a smile trying to persuade her to buy one. But Edith knew from past _ that her choice of ties hardly ever pleased her father. She moved on slowly and then, quite by chance,  _  where a small crowd of men had gathered round a counter. She found some fine pipes  on sale and the  _  were very beautiful. Edith did not hesitate  for long, although her father  _  smoked a pipe once in a while, she believed this was  _  to please him.\nWhen she got home, with her small but  _  present hidden in her handbag, it was time for supper and her parents were already  _  table. Her mother was in great  _ . \"Your father has at last decided to stop smoking,\" she told her daughter happily. Edith was so  _  that she could not say a single word.", 
    "options": [
        [
            "never", 
            "seldom", 
            "always", 
            "hardly"
        ], 
        [
            "Therefore", 
            "Fortunately", 
            "Besides", 
            "Finally"
        ], 
        [
            "unhappy", 
            "careful", 
            "exciting", 
            "tired"
        ], 
        [
            "hands", 
            "feet", 
            "back", 
            "faces"
        ], 
        [
            "turned", 
            "hit", 
            "brought", 
            "knocked"
        ], 
        [
            "time", 
            "show", 
            "board", 
            "duty"
        ], 
        [
            "experience", 
            "things", 
            "books", 
            "school"
        ], 
        [
            "stopped", 
            "saw", 
            "asked", 
            "found"
        ], 
        [
            "price", 
            "cigarette", 
            "shapes", 
            "shop"
        ], 
        [
            "always", 
            "nearly", 
            "only", 
            "never"
        ], 
        [
            "hard", 
            "impossibly", 
            "possibly", 
            "certainly"
        ], 
        [
            "cheap", 
            "well-chosen", 
            "expensive", 
            "ready-made"
        ], 
        [
            "on", 
            "by", 
            "beside", 
            "at"
        ], 
        [
            "excitement", 
            "anger", 
            "sadness", 
            "disappointment"
        ], 
        [
            "glad", 
            "happy", 
            "surprised", 
            "Excited"
        ]
    ], 
    "answers": [
        "C", 
        "C", 
        "A", 
        "B", 
        "D", 
        "B", 
        "A", 
        "A", 
        "C", 
        "C", 
        "D", 
        "B", 
        "D", 
        "A", 
        "C"
    ], 
    "source": "middle1482"
}