{
    "article": "Still clearly remember that day. My jeep broke down on the way home. I was on the side of the road for about four  _  with my big Jeep. I put signs in the windows that  _  , \"NEED A JACK .\" Right as I was about to  give up  , a truck stopped and a man got off. He sized up the situation and went back to take a jack. About two hours later , we finished the job with sweats. We were both  _  . His wife brought a large water jug for us to wash  _  hands in. I tried to put $20 in the man's hand, but he wouldn't take it,  _  instead I went up and gave it to his wife as quietly as I could. I  _  them for their help again and again. I asked the little girl, their daughter,  _  they lived, thinking maybe I'd send them a gift. She said they were in Oregon now so Mommy and Daddy could pick cotton for the next few weeks. After saying goodbyes I started walking back to the Jeep, the girl ran up and handed me a tamale . When I opened the tamale, what did I  _  inside? My $20 bill! I ran to the van and the guy rolled down his  _  . He saw the $20 in my hand, started shaking his head,  _  and said: \"Today you, tomorrow me.\" Then he rolled up his window and  _  away, with his daughter waving to me from the back. This family, working on a seasonal basis where time is money, took several hours to help a  _  while others passed by quietly.  _  then I've helped many people like the family. I didn't accept  _  . But every time I was able to help, I felt as if I was putting something in the bank.", 
    "options": [
        [
            "seconds", 
            "minutes", 
            "hours", 
            "days"
        ], 
        [
            "wrote", 
            "spoke", 
            "talked", 
            "said"
        ], 
        [
            "dirty", 
            "clean", 
            "cruel", 
            "hungry"
        ], 
        [
            "her", 
            "my", 
            "their", 
            "our"
        ], 
        [
            "so", 
            "though", 
            "but", 
            "and"
        ], 
        [
            "helped", 
            "asked", 
            "thanked", 
            "invited"
        ], 
        [
            "what", 
            "how", 
            "when", 
            "where"
        ], 
        [
            "see", 
            "smell", 
            "hear", 
            "feel"
        ], 
        [
            "door", 
            "car", 
            "hat", 
            "window"
        ], 
        [
            "crying", 
            "shouting", 
            "smiling", 
            "screaming"
        ], 
        [
            "ran", 
            "walked", 
            "flew", 
            "drove"
        ], 
        [
            "friend", 
            "family", 
            "stranger", 
            "neighbour"
        ], 
        [
            "Since", 
            "After", 
            "Before", 
            "From"
        ], 
        [
            "thanks", 
            "time", 
            "food", 
            "money"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "A", 
        "D", 
        "A", 
        "C", 
        "D", 
        "A", 
        "D", 
        "C", 
        "D", 
        "C", 
        "A", 
        "D"
    ], 
    "source": "middle2091"
}