{
    "article": "Jennie sat at her window as usual, looking out upon the street, with a look of sadness on her face,\"What a long day this is going to be!\" Then she saw a little boy running down the street, swinging his schoolbag. Looking up to the window, he took off  _  hat and bowed with a bright, pleasant smile. \"What a nice  _  ,\"said Jennie to herself, as the boy ran out of sight.\"It seems like having the sunshine. I wish everybody who goes by would look up  _  smile.\" George, the little boy, told his mother about that  _  girl when he got back home,\"She looks so helpless. I wish I could do something for her.\" \"Why not give her some  _  ?\"said his mother. George agreed. The next morning, as Jennie  _  at he window again, she saw George with a handful of beautiful flowers carefully picking his way across the street. He stopped in front of her window, smiling pleasantly, and said,\"Can I come in?\"Jennie told him  _  to get into the house. Opening the door to Jennie's gentle\"Come in\", George said, \"I've brought you some flowers.\" \"Are they for me?\"said Jennie  _  .\"How kind you are,\"she continued, as George put the flowers on her lap.\"I've  _  received any flower since we moved to the town.\" \"Did you live in the countryside?\"asked George,  looking around  the old, small and empty room. \"Yes,\"said Jennie. Jennie used to have a happy family and live in a beautiful house in the countryside. However, she lost her right leg in an accident. She  _  walk like other people any longer. Later, her father died, and her mother was sick  _  so many years that their money was all gone. They sold the house, and move here to get work to do. George told his parents  _  . They decided to help her. More and more people in the  _  gave Jennie friendly smiles when they passed by her house. She was greatly cheered up. A few months later, Jennie and her mother  _", 
    "options": [
        [
            "her", 
            "his", 
            "your", 
            "my"
        ], 
        [
            "house", 
            "door", 
            "smile", 
            "schoolbag"
        ], 
        [
            "and", 
            "but", 
            "as", 
            "or"
        ], 
        [
            "rich", 
            "lucky", 
            "bad", 
            "poor"
        ], 
        [
            "money", 
            "flowers", 
            "clothes", 
            "food"
        ], 
        [
            "danced", 
            "cried", 
            "sat", 
            "laughed"
        ], 
        [
            "how", 
            "who", 
            "when", 
            "why"
        ], 
        [
            "angrily", 
            "easily", 
            "sadly", 
            "happily"
        ], 
        [
            "never", 
            "usually", 
            "always", 
            "sometimes"
        ], 
        [
            "shouldn't", 
            "needn't", 
            "couldn't", 
            "mustn't"
        ], 
        [
            "for", 
            "in", 
            "at", 
            "on"
        ], 
        [
            "something", 
            "anything", 
            "everything", 
            "nothing"
        ], 
        [
            "countryside", 
            "town", 
            "village", 
            "city"
        ], 
        [
            "reached", 
            "left", 
            "closed", 
            "opened"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "D", 
        "B", 
        "C", 
        "A", 
        "D", 
        "A", 
        "C", 
        "A", 
        "C", 
        "B", 
        "D"
    ], 
    "source": "middle569"
}