{
    "article": "When Chinese people find out that someone comes from London, they often say, \"London is a foggy city, isn't it?\" British people who visit China often  have to say that London is not a foggy city at all! But if London is not foggy,   _  do so many people in China think it is? In fact, London used to be a foggy city,  but it isn't any more.\nIn London lots of its pollution came from factories, but a lot of it came from coal because people used it in their houses to keep warm during the winter. By the 1950s, London's air pollution had become so  _ that the government decided to do something to clean up the air. A new rule was made. It said that  _ was not allowed to burn coal in any British city. Just a few years  _ , the air became much cleaner.\nNow many Chinese cities meet the same kind of  _ with air pollution that London met forty or fifty years ago. However, this problem is  much more difficult for Chinese cities to solve . First, more of the pollution comes from big factories than from coal that people use in their houses. If these factories are suddenly  _ , lots of people may lose their jobs. Second, cleaner fuels are quite expensive. However, the air in many cities is  _ slowly becoming cleaner, because the government and ordinary people are trying to make pollution  _ .", 
    "options": [
        [
            "what", 
            "when", 
            "which", 
            "why"
        ], 
        [
            "seriously", 
            "terrible", 
            "good", 
            "badly"
        ], 
        [
            "somebody", 
            "anybody", 
            "nobody", 
            "everybody"
        ], 
        [
            "before", 
            "ago", 
            "later", 
            "after"
        ], 
        [
            "problem", 
            "question", 
            "accident", 
            "discussion"
        ], 
        [
            "closed", 
            "close", 
            "open", 
            "opened"
        ], 
        [
            "almost", 
            "already", 
            "nearly", 
            "hardly"
        ], 
        [
            "many", 
            "more", 
            "little", 
            "less"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "B", 
        "C", 
        "A", 
        "A", 
        "B", 
        "D"
    ], 
    "source": "middle1983"
}