{
    "article": "One morning thirty years ago, I walked into the Track Kitchen, a _ where almost everyone came for breakfast. I saw an empty chair next to an old short man. He was _ a pair of old glasses and a wrinkled  black hat. \"He must be from a _ family.\" I thought to myself. I asked him, \"Could I join you, sir?\" He agreed quietly and I sat down to have my breakfast .\nWe began a conversation and talked a lot. But we _ asked each other's name. I guessed that he might have no money and couldn't buy anything to eat. So when I went back to the counter and bought a _ cup of coffee, I asked.\n\"May I get you something??\n\"A coffee would be nice.\"\nThen I bought him a cup of coffee. We talked more, and I got him another  cup of coffee. Finally, I got up to leave, wished him well, and walked to the door. At the door, I met one of my friends. He asked.\n\"How did you know Mr. Carpenter?\"\n\"Who?\"\n\"The man you were sitting with. He is the CEO of the Channel.\"\nI could hardly _ it. I was buying a free breakfast _ one of the richest men in town!\nMy few hours with Mr. Carpenter changed my life. Now I try to treat _ with respect , no matter  what he wears. What one has doesn't depend on what he wears.", 
    "options": [
        [
            "mall", 
            "cinema", 
            "hotel", 
            "restaurant"
        ], 
        [
            "putting", 
            "wearing", 
            "dressing", 
            "having"
        ], 
        [
            "big", 
            "small", 
            "poor", 
            "rich"
        ], 
        [
            "ever", 
            "always", 
            "often", 
            "never"
        ], 
        [
            "first", 
            "second", 
            "third", 
            "fourth"
        ], 
        [
            "hear", 
            "believe", 
            "get", 
            "understand"
        ], 
        [
            "to", 
            "of", 
            "for", 
            "from"
        ], 
        [
            "somebody", 
            "anybody", 
            "everybody", 
            "nobody"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "C", 
        "D", 
        "B", 
        "B", 
        "C", 
        "C"
    ], 
    "source": "middle1681"
}