{
    "article": "The ideal teacher may be young or old, tall or short, fat or thin. He should  _  his subject very well and like learning something about other subjects. The ideal teacher must be full of strong feelings of wonder or interest. He must  _  teach anything he himself is not  _  in. He should be like a man who can act and should not be afraid to  _  his feelings and tell other people what he likes and what he doesn't like clearly. He must like his students and respect them, and he must also respect himself and be proud of his work.  _  he doesn't, he cannot respect his students and  _  respect from them. The ideal teacher should have an  _  of his students and be able to get on well with them. He needs students' understanding, too. The ideal teacher should be kind and  _  and he should give hope to his students to learn knowledge. The ideal teacher should see his students'  _  so that he can know how to encourage the growth of  _  of his students. The ideal teacher is one who grows, learns, and makes himself better along with his students. So what about the teacher around you?", 
    "options": [
        [
            "like", 
            "know", 
            "choose", 
            "remember"
        ], 
        [
            "never", 
            "ever", 
            "even", 
            "still"
        ], 
        [
            "weak", 
            "well", 
            "interested", 
            "strict"
        ], 
        [
            "hold", 
            "show", 
            "pass", 
            "keep"
        ], 
        [
            "Since", 
            "As", 
            "If", 
            "Because"
        ], 
        [
            "give", 
            "lose", 
            "change", 
            "win"
        ], 
        [
            "understanding", 
            "idea", 
            "exercise", 
            "excuse"
        ], 
        [
            "forgetful", 
            "helpful", 
            "quick", 
            "lucky"
        ], 
        [
            "lists", 
            "mistakes", 
            "cards", 
            "differences"
        ], 
        [
            "each", 
            "every", 
            "one", 
            "either"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "B", 
        "C", 
        "D", 
        "A", 
        "B", 
        "D", 
        "A"
    ], 
    "source": "middle2106"
}