{
    "article": "Five years ago, David Smith wore an expensive suit to work. He used to carry a nice  _  to work with him so that he could change if his clothes got wrinkled . \"I'm working harder than ever,\" David says, \"  _  I need to feel comfortable.\" More and more companies are  _  their office workers to wear casual clothes to work. They thought the casual clothes could  be good for  their work. In the early 1990s, the workers in American companies could wear casual clothes on Friday (but only on Friday).This became known  _  \"dress-down Friday\" or \"casual Friday\". Why have so many companies done like that? One reason is that it's  _  for a company to hire new workers if it has a casual dress style. \"A lot of young people don't want to  dress up  for work,\" says the owner of a software company, \"so it's hard to hire people if you make a  _  for their dressing.\" Another reason is that people work  _  when they are wearing comfortable clothes. Supporters of casual office wear also say that a casual dress style helps them  _  money. \"Suits are expensive, if you have to wear one every day,\" one person said, \"for the same amount of money, you can buy a lot more casual clothes.\"", 
    "options": [
        [
            "suit", 
            "bag", 
            "breakfast", 
            "newspaper"
        ], 
        [
            "or", 
            "so", 
            "while", 
            "unless"
        ], 
        [
            "helping", 
            "inviting", 
            "encouraging", 
            "warning"
        ], 
        [
            "of", 
            "as", 
            "for", 
            "about"
        ], 
        [
            "harder", 
            "safer", 
            "easier", 
            "worse"
        ], 
        [
            "plan", 
            "rule", 
            "fire", 
            "mark"
        ], 
        [
            "politely", 
            "seriously", 
            "correctly", 
            "happily"
        ], 
        [
            "save", 
            "raise", 
            "make", 
            "waste"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "C", 
        "B", 
        "C", 
        "B", 
        "D", 
        "A"
    ], 
    "source": "middle725"
}