{
    "article": "I had never noticed her. She was not the kind of girl who could draw attention. She was not tall and just looked  _  . In class, she liked sitting at the back, reading or taking notes. One day I asked her to read aloud the text. When I heard her standard American pronunciation, I looked at her with new eyes. And I  _  her name--Kelly. Later on, the National College Speech Competition would be held. One student in our school was allowed to attend. I thought it over and filled in  _  name. Kelly practiced hard for the competition. However, I was a little worried because she was always too  _  . Could she do well in the competition? On the night of the competition, I sat in the front row of the hall very early. I told her to take it easy. Her face turned red and she said nothing. It seemed she was really  _  . I felt upset, but I just patted her on the shoulder and let her go to draw lots . As a result, she drew No. 9 while No. 8 was a boy who was very good at giving speeches. Sure enough, No. 8 was very  _  . The whole audience made a warm applause almost every 30 seconds and was still talking about his speech with  _  until Kelly appeared on the stage. I sat there with no  _  to look at her. It was her first time to go up the stage, so I couldn't be angry with her for any small mistakes. But at that moment, I found I was so afraid of her  _  . The strong spotlight and large hall made her so small that nobody seemed to notice she had been on the stage. I felt hopeless. But the moment that  _  me came. I clearly heard a voice, a very loud voice, \"Now, please focus on me.\" Three times in all, louder and louder. The whole audience fell silent. I could  _  believe that loud voice came from the girl, who was usually soft-voiced and didn't  _  attention at all. She gave a perfect speech. I think I will never forget this touching lesson that my student taught me -- never underestimate the power of the silent people.", 
    "options": [
        [
            "beautiful", 
            "ordinary", 
            "popular", 
            "strange"
        ], 
        [
            "mentioned", 
            "called", 
            "remembered", 
            "wrote"
        ], 
        [
            "her", 
            "his", 
            "my", 
            "your"
        ], 
        [
            "different", 
            "lazy", 
            "slow", 
            "quiet"
        ], 
        [
            "strict", 
            "nervous", 
            "angry", 
            "bored"
        ], 
        [
            "careful", 
            "thankful", 
            "successful", 
            "cheerful"
        ], 
        [
            "patience", 
            "confidence", 
            "pride", 
            "excitement"
        ], 
        [
            "courage", 
            "interest", 
            "excuse", 
            "effort"
        ], 
        [
            "decision", 
            "expression", 
            "appearance", 
            "failure"
        ], 
        [
            "upset", 
            "saved", 
            "surprised", 
            "changed"
        ], 
        [
            "simply", 
            "hardly", 
            "surely", 
            "deeply"
        ], 
        [
            "catch", 
            "need", 
            "pay", 
            "show"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "D", 
        "B", 
        "C", 
        "D", 
        "A", 
        "D", 
        "C", 
        "B", 
        "A"
    ], 
    "source": "middle1093"
}