{
    "article": "Letting kids learn more about science at an early age is easier than you think. It is happening all around us, and you can _ everyday things to encourage your children's interest.\nMost parents believe it is difficult to help their children with science. But you don't need a high scientific _ to teach your children science. All you need is that you're willing to try, to see the world, and to _ the time to encourage their natural curiosity .\nYou can help by having an active attitude  towards science yourself. Then start _ by asking your children questions about the things you see every day. And then listen  to their answers without judging  them, which will _ their confidence , and help you decide just what your children know or do not know.\nDifferent kids have different interest, _ they need different kinds of science projects. Collecting rocks may interest your young daughter, but your older son may need something more to deal with it. Knowing your children is the best way to _ enjoyable learning activities. Here are some more pieces of advice:\nChoose activities that are the right _ of difficulty. If you are not sure, pick something easier.\nRead the suggested ages on any projects, books, and then make sure that the activity is _ for your child.\nLet your child choose the project or activity himself. It's easy enough to ask rather than force him. Suggest choosing 2 or 3 things your child can do. When a child picks something he is _ in, he will enjoy it and learn more from it.", 
    "options": [
        [
            "buy", 
            "make", 
            "invent", 
            "use"
        ], 
        [
            "degree", 
            "place", 
            "brain", 
            "result"
        ], 
        [
            "follow", 
            "solve", 
            "take", 
            "raise"
        ], 
        [
            "seriously", 
            "simply", 
            "cheaply", 
            "completely"
        ], 
        [
            "lose", 
            "create", 
            "improve", 
            "believe"
        ], 
        [
            "so", 
            "if", 
            "though", 
            "but"
        ], 
        [
            "delete", 
            "find", 
            "cancel", 
            "print"
        ], 
        [
            "answer", 
            "way", 
            "point", 
            "level"
        ], 
        [
            "proper", 
            "famous", 
            "cheap", 
            "deep"
        ], 
        [
            "proud", 
            "interested", 
            "known", 
            "good"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "C", 
        "B", 
        "C", 
        "A", 
        "B", 
        "D", 
        "A", 
        "B"
    ], 
    "source": "middle916"
}