{
    "article": "Today some people call Amsterdam the \"City of Bicycles\" because it is a city which is flat and convenient for bicycles. In the 1960s, a group of cycling fans  _  an idea. They believed that it would be better for everybody if the city only allows bicycles to go in the streets in the city centre. They were  _  that this would help to save energy, reduce pollution and provide free public transport. The group painted hundreds of bicycles  _  and placed them in public places around Amsterdam for people to use.  Anyone  could take them and use them for short journeys, whether he was a local or a foreigner. Whenever someone finished a journey, they would  _  the bike there for someone else to use. The problem was that it didn't work because  _  took all the bicycles within weeks!  _  more than thirty years later, the \"white bike\" is back in town---this time with a computer chip to its  _  very move! To take a bicycle, you have to put a special card inside. The new \"white bike\" is not white any more but is an unusual  _  with bright colors. The bikes are parked at special parking places and people who want to use them have to take them to another place that has enough room. There is already less traffic in central Amsterdam, because both locals and tourists are  _  the white bikes every day. Thanks to the good ideas of lots of people, like the cycling fans in the 1960s, many people around the world have been enjoying city centre streets without cars for many years.", 
    "options": [
        [
            "stole", 
            "had", 
            "refused", 
            "dropped"
        ], 
        [
            "thoughtful", 
            "helpful", 
            "hopeful", 
            "thankful"
        ], 
        [
            "black", 
            "brown", 
            "blue", 
            "white"
        ], 
        [
            "take", 
            "leave", 
            "carry", 
            "send"
        ], 
        [
            "robbers", 
            "shoplifters", 
            "kidnappers", 
            "thieves"
        ], 
        [
            "However", 
            "Instead", 
            "Therefore", 
            "Though"
        ], 
        [
            "make", 
            "mark", 
            "record", 
            "describe"
        ], 
        [
            "design", 
            "idea", 
            "size", 
            "experiment"
        ], 
        [
            "making", 
            "using", 
            "selling", 
            "stealing"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "D", 
        "B", 
        "D", 
        "A", 
        "C", 
        "A", 
        "B"
    ], 
    "source": "middle1909"
}