{
    "article": "Life is full of unexpected. _ a cold winter afternoon, a man saw an old lady standing by her expensive car and clearly she needed help. So he stopped and got off his old truck. \"Is he going to hurt me? He doesn't look safe,\" the old lady was _ .\nThe man could see that she was afraid, so he said in his friendliest voice, \"I'm here to help you, madam. Why don't you wait in the car where it's warm? By the way, my name is Ted Johnson.\" Ted quickly fixed the car and the lady thanked him. The she asked how much she could pay him.\nBut Ted wanted no money. He was just giving a hand to someone in trouble. _ was normal for him to do such a thing like that. He said. \" If you really want to repay me , next time you see someone in need, think of me and help them.\"\nAfter saying goodbye, the lady continued down the road until she reached a small _ where she decided to stop for something to eat. As the pretty waitress took her order, the lady noticed she was nearly eight months pregnant . The waitress looked tired and week, _ she was very kind. As the lady was going to pay the $10 bill, she remembered Ted's words.\nAfter the lady was gone, the waitress saw a small note on the table. It said, \"Somebody once helped me the way I'm helping you. Continue being kind to other people.\" Under the note were five hundred dollars.\nThe waitress was _ excited that she called her husband to tell him the news, \"Ted...Ted Johnson my dear... you're not going to believe what just happened...\"", 
    "options": [
        [
            "In", 
            "On", 
            "At", 
            "Under"
        ], 
        [
            "glad", 
            "excited", 
            "worried", 
            "surprised"
        ], 
        [
            "This", 
            "That", 
            "It", 
            "They"
        ], 
        [
            "restaurant", 
            "bookstore", 
            "cinema", 
            "library"
        ], 
        [
            "so", 
            "but", 
            "or", 
            "though"
        ], 
        [
            "too", 
            "very", 
            "such", 
            "so"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "C", 
        "A", 
        "B", 
        "D"
    ], 
    "source": "middle2285"
}