{
    "article": "Souanis Kim was an archery teacher in a sports school and had trained many outstanding archers. So many parents sent their children to him. One morning, Souanis Kim took the students to a tall tree for  _  .He put a toy bird on the trunk and said, \"The task is to  _  the toy bird down.\" The students stood in a  _  quickly. The first one was Sandy. He walked a few steps forward, put the arrow on the string ,drew the bow and aimed at the toy bird. \"What's  _  the bird?\" asked Souanis Kim suddenly. \"The blue sky,\" Sandy answered. Souanis Kim smiled. He asked Sandy to stand aside. The students  _  what the teacher's meaning was. The next was Keston. Like Sandy, he walked up. Just as he was  _  to shoot the arrow, Souanis Kim asked him the same question. \"I see the trunk and the leaves,\" answered Keston. Souanis Kim smiled and asked Keston to stand aside, too. The third one was Jobes. Just  _  he was drawing the bow, Souarus Kim asked. \"What's over the bird, Jobes?\" Jobes stared at the toy bird and said,. I have seen  _  but the toy bird.\" \"Great!\" said Souanis Kim  _  .Then he shouted, \"Go ahead!\" Jobes shot the arrow and the toy bird fell. The students cheered with one voice. Souanis Kim looked at the surprised students and said seriously,\"Remember, when an archer is showing, he must have only the.  _  but nothing else.\"", 
    "options": [
        [
            "walking", 
            "training", 
            "playing", 
            "resting"
        ], 
        [
            "put", 
            "tum", 
            "shoot", 
            "get"
        ], 
        [
            "circle", 
            "way", 
            "position", 
            "line"
        ], 
        [
            "over", 
            "under", 
            "inside", 
            "behind"
        ], 
        [
            "thought", 
            "expected", 
            "learned", 
            "wondered"
        ], 
        [
            "ready", 
            "afraid", 
            "anxious", 
            "willing"
        ], 
        [
            "as", 
            "after", 
            "before", 
            "because"
        ], 
        [
            "anything", 
            "something", 
            "nothing", 
            "everything"
        ], 
        [
            "hopefully", 
            "softly", 
            "angrily", 
            "happily"
        ], 
        [
            "bird", 
            "goal", 
            "sky", 
            "bow"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "D", 
        "A", 
        "D", 
        "A", 
        "A", 
        "C", 
        "D", 
        "B"
    ], 
    "source": "middle657"
}