{
    "article": "This story happened when I was 11 years old. I'll never forget it. I was at my friend Jenny's  _  after school one day. We were doing homework when a friend of Jenny's mum's came over to  _  . I don't remember her name or even what she looked like. I  _  remember her hands, her voice and the lesson she taught me. I remember her hand reaching out for mine. What  _  hands she had, I thought; rich, dark skin going well with the orange nail polish . Then I heard her saying, \"Oh no, that is NOT  _  you shake hands. Let me show you.\" After that, I just remember her voice explaining the importance of a good  _  , having a sense of self, looking the other person in the eye... At that moment I felt respected. I think of her every time I meet someone  _  . I'm so thankful for her little lesson. I thank her for  _  the time to teach me something I didn't know. I thank her for the  _  that she didn't talk down to me because I was 11 or because I didn't  _  something. I thank her for instilling the idea that if someone doesn't know something, don't be afraid to share your knowledge.", 
    "options": [
        [
            "kitchen", 
            "office", 
            "classroom", 
            "house"
        ], 
        [
            "watch", 
            "help", 
            "visit", 
            "look"
        ], 
        [
            "just", 
            "still", 
            "also", 
            "hardly"
        ], 
        [
            "dirty", 
            "beautiful", 
            "large", 
            "useful"
        ], 
        [
            "why", 
            "when", 
            "where", 
            "how"
        ], 
        [
            "handshake", 
            "experience", 
            "education", 
            "impression"
        ], 
        [
            "familiar", 
            "new", 
            "special", 
            "big"
        ], 
        [
            "saving", 
            "checking", 
            "taking", 
            "changing"
        ], 
        [
            "truth", 
            "news", 
            "result", 
            "fact"
        ], 
        [
            "like", 
            "know", 
            "tell", 
            "want"
        ]
    ], 
    "answers": [
        "D", 
        "C", 
        "A", 
        "B", 
        "D", 
        "A", 
        "B", 
        "C", 
        "D", 
        "B"
    ], 
    "source": "middle2198"
}