{
    "article": "Eric was standing in front of a large, gray house in the countryside. He had just been dropped off by his mum, who left after telling him that he was going to  _  the next twelve days there with no TV, no mobile phone and worst of all--no  _  . Just then, a man appeared* at the gate of the house. When he saw Eric, he went up to him immediately*. \"I'm  _  you are Eric. Welcome to Camp Reboot,\" said the man proudly. \"I'm Tony, the camp leader*, but you will  _  me 'Sir'. Now you tell me  _  you're here.\" Eric quickly replied, \"My mum made me  _  here!\" When Tony looked angrily  _  him and did not say  _  , Eric realized his mistake and added, \"Sir!\" \"And do you know why your mother sent  _  here? Asked Tony. \"She thinks I spend too much time online--that I can't live without the Internet... Sir,\" answered Eric. \"It's not just her opinion. It's the  _  ! Look at you--tired, unhealthy and certainly not getting  _  sleep. You're here because you think your world on the Internet is much  _  than the real world. But you're wrong! The real world has much more to offer. At Camp Reboot, you're going to go hiking, boating, rock-climbing and stay outdoors most of the  _  ,\" said Tony. Eric's heart broke. \"But it's not going be all fun and games.\" Tony continued. \" We have rules here.  _  you break them, you'll never be sent home  _  ! Instead, you'll have to sweep the floor, wash the dishes or do an extra hour of exercise!\" \"Oh, my God!\" cried Eric. \"What have you got me into, Mum?\"", 
    "options": [
        [
            "save", 
            "keep", 
            "show", 
            "spend"
        ], 
        [
            "radio", 
            "camera", 
            "book", 
            "computer"
        ], 
        [
            "sad", 
            "sure", 
            "anxious", 
            "surprised"
        ], 
        [
            "call", 
            "make", 
            "wish", 
            "name"
        ], 
        [
            "what", 
            "how", 
            "why", 
            "when"
        ], 
        [
            "attempt", 
            "pretend", 
            "escape", 
            "come"
        ], 
        [
            "at", 
            "on", 
            "in", 
            "to"
        ], 
        [
            "something", 
            "anything", 
            "everything", 
            "nothing"
        ], 
        [
            "it", 
            "you", 
            "him", 
            "her"
        ], 
        [
            "answer", 
            "story", 
            "truth", 
            "excuse"
        ], 
        [
            "short", 
            "quick", 
            "enough", 
            "terrible"
        ], 
        [
            "older", 
            "darker", 
            "poorer", 
            "better"
        ], 
        [
            "time", 
            "life", 
            "year", 
            "month"
        ], 
        [
            "If", 
            "Until", 
            "Before", 
            "While"
        ], 
        [
            "extremely", 
            "possibly", 
            "early", 
            "slowly"
        ]
    ], 
    "answers": [
        "D", 
        "D", 
        "B", 
        "A", 
        "C", 
        "D", 
        "A", 
        "B", 
        "B", 
        "C", 
        "C", 
        "D", 
        "A", 
        "A", 
        "B"
    ], 
    "source": "middle2236"
}