{
    "article": "Taking a Nap During the Day Medical experts say most Americans do not get enough sleep. They say more Americans need to rest for a short period in the middle of the day.  _  continuing with other activities. One study earlier this year found that persons who  _  for a few minutes during the day were less likely to die of heart disease. The study  _  more than 2,300 Greek adults for about six years. Adults who rested for half an hour at least three times a week had a 37 percent  _  risk of dying from heart disease than those who did not nap. The study organizers said the strongest evidence was in working men. They said naps might improve  _  by mitigating tension caused by work. Some European and Latin American businesses have supported the  _  of napping for many years. They urge people to  _  work, go home and have a nap before returning. In the United States, some companies let workers rest briefly in their offices. They believe this reduces  _  and accidents, and  _  increases the amount of work a person can do. Sleep experts say it is likely that people make more mistakes at work than at other times. They say people should not  carry out  important duties when they feel sleepy. And they say the best thing to do is to take a nap. About twenty minutes of rest is all you need. Experts say this provides extra energy and can increase your effectiveness  _  the end of the day. But experts  _  that a nap should last no more than twenty to thirty minutes. A longer nap will put the body into deep sleep and waking up will be difficult.", 
    "options": [
        [
            "as", 
            "when", 
            "before", 
            "after"
        ], 
        [
            "laugh", 
            "sleep", 
            "walk", 
            "move"
        ], 
        [
            "knew", 
            "learned", 
            "studied", 
            "followed"
        ], 
        [
            "less", 
            "more", 
            "lower", 
            "higher"
        ], 
        [
            "life", 
            "health", 
            "thinking", 
            "ability"
        ], 
        [
            "way", 
            "idea", 
            "suggestion", 
            "experiment"
        ], 
        [
            "leave", 
            "repeat", 
            "change", 
            "improve"
        ], 
        [
            "work", 
            "time", 
            "energy", 
            "mistakes"
        ], 
        [
            "too", 
            "also", 
            "never", 
            "seldom"
        ], 
        [
            "until", 
            "while", 
            "unless", 
            "during"
        ], 
        [
            "say", 
            "think", 
            "guess", 
            "warn"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "D", 
        "C", 
        "B", 
        "B", 
        "A", 
        "D", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "middle414"
}