{
    "article": "Hello! Welcome to our Music Program. And now if you listen to this programme, you'll know that it's time for our competition every week. Last week's prize of two theatre tickets was won by Bill Martins. Congratulations, Bill. I hope you've  _  your tickets by now. This week we are offering a classical CD. I hope you will be the first listener to tell the name of the music and the person who  _  it. but  _  I do, you need to get a pencil and a piece of paper, as I'm going to give you some  _  which should make your job a little easier. Are you ready? Right. Now listen carefully, as you might be this week's  _  winner. Although the person who wrote the music was born in Italy, he spent most of his  _  in Spain. Have you got that? The second point: There is also a famous play which has the same title as this music and which is usually performed in the open air in the summer. Any  _  yet? I should warn you that it's not that easy. Now for the next point: When this piece of music was first performed, many people in the audience got up and walked out. They thought the music was terrible and said it was a waste of their money. It's  _  really, when you think how  _  it is today. And now for the last point. Part of his music was used for an advertisement which you can see on television, in a lot of magazines and even on your cinema screen from next month. I'm  _  when you hear the music, you'll know what the advertisement is for. I'm not going to tell you what product it is, because that would almost give you the answer! So, that's four things to remember. If you can give us the answer, please ring 400-8937224. And the music is coming up now.", 
    "options": [
        [
            "heard", 
            "checked", 
            "received", 
            "noticed"
        ], 
        [
            "sang", 
            "wrote", 
            "loved", 
            "played"
        ], 
        [
            "after", 
            "until", 
            "while", 
            "before"
        ], 
        [
            "notice", 
            "stories", 
            "help", 
            "secret"
        ], 
        [
            "correct", 
            "lucky", 
            "successful", 
            "funny"
        ], 
        [
            "life", 
            "money", 
            "music", 
            "dream"
        ], 
        [
            "question", 
            "idea", 
            "thing", 
            "point"
        ], 
        [
            "fantastic", 
            "surprising", 
            "unfair", 
            "unwelcome"
        ], 
        [
            "common", 
            "funny", 
            "interesting", 
            "popular"
        ], 
        [
            "believe", 
            "think", 
            "afraid", 
            "sure"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "D", 
        "C", 
        "B", 
        "A", 
        "B", 
        "B", 
        "D", 
        "D"
    ], 
    "source": "middle19"
}