{
    "article": "One day, a poor man was travelling on horseback. At noon, he tied his horse to a tree and then sat down to eat something. A few minutes _ , a rich man came along and tied his horse to the same tree.\n\"Please tie your horse to another tree,\" said the poor man. \"My horse is wild. It will kill yours.\"\nBut the rich man said, \"I shall tie my horse as I like!\" he tied up his horse and had his lunch nearby. After a moment they heard a loud _ , the two horses were fighting. They went up to them, but it was too _ . The rich man's horse was killed. \"See what your horse has done!\" cried the rich man. \"You will have to pay for it.\" And he brought the poor man before Mr. Know.\nMr. Know asked the poor man some questions. But he made no _ . At last Mr. Know said, \"This man is dumb. He cannot speak.\"\n\"Oh,\" the rich man shouted _ . \"He can! He spoke to me when I met him.\"\n\"Are you sure?\" asked Mr. Know. \"What did he _ ? \"\n\"He advised me not to tie my horse to the same tree because his horse was wild and would kill my horse.\"\n\"Oh,\" said Mr. Know. \"So he _ you. Then can you hope to get money _ him?  \"\nThe rich man said nothing and left silently.", 
    "options": [
        [
            "later", 
            "ago", 
            "late", 
            "after"
        ], 
        [
            "song", 
            "word", 
            "bell", 
            "noise"
        ], 
        [
            "slow", 
            "late", 
            "hard", 
            "quick"
        ], 
        [
            "idea", 
            "answer", 
            "money", 
            "mistake"
        ], 
        [
            "angrily", 
            "quietly", 
            "happily", 
            "heavily"
        ], 
        [
            "speak", 
            "tell", 
            "say", 
            "talk"
        ], 
        [
            "helped", 
            "warned", 
            "thanked", 
            "said"
        ], 
        [
            "from", 
            "for", 
            "with", 
            "about"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "B", 
        "B", 
        "A", 
        "C", 
        "B", 
        "A"
    ], 
    "source": "middle346"
}