{
    "article": "Once a beggar had walked about five miles in the hot sun. He was quite tired and wanted to  _  . As he came to a crossing, he saw a tall tree. On one side  _  the tree he saw a board . \"Take This Road To Franklin\" was written on the board. \"I will rest under the  _  ,\" said the beggar. \"I can lie on the board while I sleep.\" As the beggar  _  , a doctor rode up to him. \"Wake up, beggar!\" said the doctor. \"I am lost. Can you tell me  _  road to take to Franklin?\" \"It is too hot to think,\" said the beggar. \"Thinking is work in such a  _  day.\" \"Here is a dollar,\" said the doctor, \"now, will you think?\" \"Of course, I will, sir!\" said the beggar, \"  _  that road to Franklin.\" After a while, a driver stopped to  _  the beggar which road to take to Franklin. \"You must give me a dollar,\" said the beggar, \"for me to start thinking.\" The driver gave him a dollar. \"Turn to the left,\" the beggar said. The beggar went back to  _  . Before long a farmer woke him up. \"Which is the road to Franklin?\" he asked. The beggar got  _  dollar and the farmer went along the road. \"A doctor gets paid when he doctors.\" said the beggar to himself, \"A driver gets paid when he drives, and a farmer gets paid when he farms. But this time a beggar got paid, and all he did was thinking!\"", 
    "options": [
        [
            "drink", 
            "eat", 
            "rest", 
            "ride"
        ], 
        [
            "with", 
            "of", 
            "by", 
            "for"
        ], 
        [
            "tree", 
            "sign", 
            "road", 
            "bed"
        ], 
        [
            "thought", 
            "said", 
            "passed", 
            "slept"
        ], 
        [
            "right", 
            "which", 
            "short", 
            "only"
        ], 
        [
            "warm", 
            "cold", 
            "hot", 
            "wet"
        ], 
        [
            "Walk", 
            "Take", 
            "Go", 
            "Get"
        ], 
        [
            "tell", 
            "show", 
            "ask", 
            "help"
        ], 
        [
            "sleep", 
            "work", 
            "read", 
            "write"
        ], 
        [
            "three", 
            "more", 
            "paid", 
            "another"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "A", 
        "D", 
        "B", 
        "C", 
        "B", 
        "C", 
        "A", 
        "D"
    ], 
    "source": "middle677"
}