{
    "article": "One of the most remarkable things about the human mind is our ability to imagine the future. In our minds we can see what has not yet happened. For example, while we are looking forward to 1.  _  a new place or country, we 2.  _  what it will be like. We predict( ) the habit people will eat, dress and act. Of course, we do not always predict things 3.  _  . Things are often very different from the way we 4.  _  them to be. One of the 5.  _  dreams in history is the dream of the German scientist, Kekule, who had been 6.  _  to work out a very difficult problem in physics. He had studied and analyzed the problem from every angle for days, but there 7.  _  to be no way of 8.  _  out the answer. Then one night he went to bed and dreamed. When he 9.  _  up, he realized that he knew the answer. He had solved the problem in his 10.  _  . The hypnotist sat in the chair opposite him and spoke 11.  _  : I want you to concentrate on my voice. Think about 12.  _  . You know nothing but my voice. And as you pay attention to my voice, your 13.  _  will get heavier. Soon you'll be asleep. You will hear my voice and understand my words, but your body will be asleep, your eyes are too heavy. You are almost asleep, and when you wake up you will 14.  _  nothing. You will forget everything. Now I am going to 15.  _  slowly from one to five. One, two, three, four, five.", 
    "options": [
        [
            "visiting", 
            "seeking", 
            "reaching", 
            "discovering"
        ], 
        [
            "imagine", 
            "know", 
            "feel", 
            "guess"
        ], 
        [
            "quickly", 
            "simply", 
            "correctly", 
            "neatly"
        ], 
        [
            "required", 
            "wished", 
            "left", 
            "expected"
        ], 
        [
            "funny", 
            "dull", 
            "famous", 
            "silly"
        ], 
        [
            "managing", 
            "trying", 
            "thinking", 
            "hoping"
        ], 
        [
            "used", 
            "ought", 
            "seemed", 
            "had"
        ], 
        [
            "making", 
            "finding", 
            "turning", 
            "letting"
        ], 
        [
            "gave", 
            "sat", 
            "woke", 
            "got"
        ], 
        [
            "dream", 
            "lesson", 
            "research", 
            "exercise"
        ], 
        [
            "softly", 
            "loudly", 
            "slowly", 
            "firmly"
        ], 
        [
            "everything", 
            "something", 
            "nothing", 
            "anything"
        ], 
        [
            "eyes", 
            "feet", 
            "head", 
            "body"
        ], 
        [
            "accept", 
            "remember", 
            "hear", 
            "receive"
        ], 
        [
            "count", 
            "say", 
            "add", 
            "speak"
        ]
    ], 
    "answers": [
        "A", 
        "A", 
        "C", 
        "D", 
        "C", 
        "B", 
        "C", 
        "B", 
        "C", 
        "A", 
        "A", 
        "C", 
        "A", 
        "B", 
        "A"
    ], 
    "source": "middle1978"
}