{
    "article": "Electronic books, or e-books, have changed the way many of us read. Now, electronic textbooks are changing the way many students  _  . Many schools in Washington have begun using online course materials for their students. Rather than using a regular textbook, it's all online. \"Our students are ready to use resources from different  _  ,\" said the head teacher, Peter Noonan. He talked about the  _  of electronic textbooks to a reporter. \"The world is changing  _  . Online textbooks can change right along with the things that are happening. Besides, electronic textbooks  _  less than regular textbooks. We need to pay $8 million for the regular textbooks for our students, but we only need to spend $6 million  _  the electronic textbooks,\" said Peter Noonan. Students have different ideas about the change,  _  most like it. \"I don't have to carry a textbook around, so that is  _  ,\" said a high school student named Melanie Reuter. Maria didn't  _  . \"I don't like it because the Internet sometimes doesn't work.\" Some students don't have a computer or can't go online at home. Stephen is  _  of them. But he said, \"I can go to the library, or go to a friend's house, to go online.\"", 
    "options": [
        [
            "eat", 
            "learn", 
            "sleep", 
            "walk"
        ], 
        [
            "newspapers", 
            "schools", 
            "places", 
            "grades"
        ], 
        [
            "advantages", 
            "progress", 
            "messages", 
            "environment"
        ], 
        [
            "normally", 
            "slowly", 
            "possibly", 
            "fast"
        ], 
        [
            "happened", 
            "cost", 
            "ended", 
            "behaved"
        ], 
        [
            "for", 
            "in", 
            "at", 
            "on"
        ], 
        [
            "but", 
            "or", 
            "until", 
            "and"
        ], 
        [
            "polite", 
            "rude", 
            "good", 
            "bad"
        ], 
        [
            "appear", 
            "stay", 
            "agree", 
            "arrive"
        ], 
        [
            "another", 
            "one", 
            "other", 
            "neither"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "D", 
        "B", 
        "D", 
        "A", 
        "C", 
        "C", 
        "B"
    ], 
    "source": "middle494"
}