{
    "article": "Do you know that you can use the Internet to buy things? For several _ , Americans have enjoyed online shopping. Now online shopping is starting in the world. In many countries, people can turn on their computers and shop for clothes, food, toys and many other things.\nOnline shopping is in fashion in England. For example, the ABC Company is one of the biggest _ in 15 European countries. It sells different kinds of things over the Internet, and in one year it made $100 million. In France, until last year online shopping was only possible _ one web page. Then the government allowed more online shopping. The Frenchmen spend much money a year _ things through these web pages. French businesses are hoping this new online shopping will help them sell more things in the future.\nSome people like online shopping because it allows them to do _ shopping without leaving their homes. And they don't have the problems of traffic in the cities. But they usually worry _ the quality of the things for sale over the Internet. Good quality is _ to them. So the companies will have to be more careful about the quality of the things _ sell. Because people always care about both the quality _ the price. Enjoy online shopping!", 
    "options": [
        [
            "hours", 
            "days", 
            "weeks", 
            "years"
        ], 
        [
            "country", 
            "countries", 
            "company", 
            "companies"
        ], 
        [
            "at", 
            "on", 
            "in", 
            "of"
        ], 
        [
            "buying", 
            "keeping", 
            "saving", 
            "doing"
        ], 
        [
            "his", 
            "her", 
            "its", 
            "their"
        ], 
        [
            "in", 
            "about", 
            "of", 
            "with"
        ], 
        [
            "difficult", 
            "interesting", 
            "important", 
            "different"
        ], 
        [
            "it", 
            "he", 
            "she", 
            "they"
        ], 
        [
            "and", 
            "or", 
            "so", 
            "But"
        ]
    ], 
    "answers": [
        "D", 
        "D", 
        "B", 
        "A", 
        "D", 
        "B", 
        "C", 
        "D", 
        "A"
    ], 
    "source": "middle1000"
}