{
    "article": "Once upon a time there lived a woman who had a bad temper . She  _  at everyone around her. For most of her life she believed the anger inside her was  _  else's fault . She went to see a wise monk to ask for  _  . The monk told her to take a large pot from his kitchen, fill it with  _  , and stand outside on the sidewalk in front of his house. \"It's hot outside,\" the monk said to her \"When a person  walks past  , you must give him or her a glass of water. Do this until there is no  _  left inside you.\"  _  she stood outside with a water pot and served water to walkers every day for the next several weeks. Every morning she asked  _  if there was any anger inside her. And every morning the answer was, \"yes.\" So she continued  _  water. Until one afternoon when a man walked up, took the water pot out of her hand and drank the water up, and then  _  it onto the ground as he went on his way. The woman was very  _  . Unable to control herself, she  picked up  the pot and threw it at the rude man. The pot broke into pieces over the back of his head and he fell to the ground, bleeding. As the woman calmed down, she realized the mistake of what she had made and began to cry. She called 911 and  _  what had happened. A moment later an ambulance and two police cars arrived and took the man away. Then one of the police officers walked over to the woman, who was  _  crying, and said, \" The city owes you a big 'thank you.' That man has been  _  our wanted list for over a year now. He is an important suspect in many murder cases and robberies.\"", 
    "options": [
        [
            "pointed", 
            "laughed", 
            "smiled", 
            "screamed"
        ], 
        [
            "anybody", 
            "somebody", 
            "everybody", 
            "nobody"
        ], 
        [
            "information", 
            "news", 
            "advice", 
            "message"
        ], 
        [
            "juice", 
            "water", 
            "milk", 
            "coffee"
        ], 
        [
            "water", 
            "money", 
            "anger", 
            "energy"
        ], 
        [
            "Because", 
            "But", 
            "So", 
            "Unless"
        ], 
        [
            "herself", 
            "himself", 
            "itself", 
            "themselves"
        ], 
        [
            "drinking", 
            "serving", 
            "selling", 
            "buying"
        ], 
        [
            "put", 
            "dropped", 
            "fell", 
            "threw"
        ], 
        [
            "happy", 
            "excited", 
            "surprised", 
            "angry"
        ], 
        [
            "spoke", 
            "told", 
            "reported", 
            "asked"
        ], 
        [
            "already", 
            "still", 
            "always", 
            "never"
        ], 
        [
            "on", 
            "in", 
            "at", 
            "to"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "C", 
        "B", 
        "C", 
        "C", 
        "A", 
        "B", 
        "D", 
        "D", 
        "C", 
        "B", 
        "A"
    ], 
    "source": "middle1074"
}