{
    "article": "She had been shopping with her Mom in Wal-Mart. She must have been 6 years old.  It was raining hard outside. We all stood there, just inside the door of the Wal-Mart. We all waited.\nHer voice was sweet as it _ the daydream we were all caught in. --Mom, let's run through the rain.|| She said.\n--What?|| Mom asked.\n--Let's run through the rain!|| She repeated.\n--No, honey. We'll wait  _ it slows down a bit.|| Mom replied.\nThis young child waited about another minute and repeated, --Mom, let's run through the rain.|| --We'll get  _ if we do.|| Mom said.\n--No, we won't, Mom. That's not what you said this morning.|| the young girl said as she held her Mom's arm.\n--This morning? When did I say we could run through the rain and not get wet?||\n--Don't you remember? When you were talking to Daddy about his cancer  , you said, if God can get us through this, he can get us through anything!||\nWe all stood dead silent. I promise you couldn't _ anything but the rain. No one came or left in the next few minutes. Mom thought for a moment about what she could say.\nNow some would laugh at the girl for her being silly. Some might even fail to notice what was said. But this was a _ of importance in a young child's lifetime when trust can be cared for, it will grow into faith  . --Honey, you are right. Let's run through the rain. If get wet, well maybe we just need washing.|| Mom said. Then off they  _ .\nWe all stood watching, smiling and laughing as they rushed past the cars. They held their shopping bags over their heads. They got wet. But they were _ by a few who laughed like children all the way to their cars. And yes, I  _ . I ran. I got wet. I needed washing. Sometimes your money can be taken away, and your health can be taken away. But no one can  _ take away your precious memories. So, don't forget to make time and take the chances to make  _ every day!\nTo everything there is a season and a time to every purpose under heaven. I hope you still take the time to run through the rain.", 
    "options": [
        [
            "hit", 
            "broke", 
            "built", 
            "described"
        ], 
        [
            "since", 
            "so", 
            "until", 
            "for"
        ], 
        [
            "funny", 
            "wet", 
            "sick", 
            "hurt"
        ], 
        [
            "smell", 
            "touch", 
            "taste", 
            "hear"
        ], 
        [
            "condition", 
            "behavior", 
            "step", 
            "moment"
        ], 
        [
            "jumped", 
            "took", 
            "ran", 
            "got"
        ], 
        [
            "followed", 
            "criticized", 
            "changed", 
            "recognized"
        ], 
        [
            "realized", 
            "accepted", 
            "reviewed", 
            "did"
        ], 
        [
            "ever", 
            "yet", 
            "never", 
            "almost"
        ], 
        [
            "suggestions", 
            "memories", 
            "friends", 
            "Introductions"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "B", 
        "D", 
        "D", 
        "C", 
        "A", 
        "D", 
        "A", 
        "B"
    ], 
    "source": "middle320"
}