{
    "article": "One midnight, a little girl was thirsty and got up to drink some water. She walked to the bedroom door and _ it. The little girl looked outside but walked _ and stood in the center of the room, because it was so _ in the hall and she was afraid. Her mother said: \"Don't be afraid, honey. Have courage  , I believe you can do it yourself!\"\n\" _ is courage?\" she asked, running to her mother's bed. \"Courage is the brave breath  ,\" her mother answered.\n\"Mom, do you have courage?\" \"Certainly.\" her mother replied, The little girl held out her cold hands, saying: \"Mom, blow some of your breath of courage to _ .\"\nAfter her mother blew into her little cold hands, the little girl clenched her fists   _ , afraid that the \"breath of courage\" would _ away. Then with her fists clenched, she walked out of the bedroom towards the kitchen with _ to be afraid of. Her mother said to herself: \"It will be nice _ someone can blow some courage to me. Then I can also hold it in my hands when I feel terrified.\"\nIn a word, the thing that we are afraid of is nothing but the _ in our mind. The person who we should win is nobody but ourselves.", 
    "options": [
        [
            "closed", 
            "knocked", 
            "opened", 
            "kicked"
        ], 
        [
            "in", 
            "back", 
            "out", 
            "down"
        ], 
        [
            "bright", 
            "dark", 
            "cold", 
            "warm"
        ], 
        [
            "What", 
            "How", 
            "Where", 
            "Why"
        ], 
        [
            "me", 
            "you", 
            "her", 
            "it"
        ], 
        [
            "politely", 
            "happily", 
            "luckily", 
            "carefully"
        ], 
        [
            "pull", 
            "run", 
            "move", 
            "took"
        ], 
        [
            "something", 
            "anything", 
            "everything", 
            "nothing"
        ], 
        [
            "because", 
            "though", 
            "if", 
            "until"
        ], 
        [
            "fear", 
            "idea", 
            "worry", 
            "secret"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "B", 
        "A", 
        "A", 
        "D", 
        "B", 
        "D", 
        "C", 
        "A"
    ], 
    "source": "middle383"
}