{
    "article": "The little boy entered the house, unhappy. His mother was  _  cakes in the kitchen. She smiled as she  turned around  but stopped when she saw his face. \"Tyler,  _  happened? Is everything okay?\" \"Nothing is okay, mom.\" said the boy, \"Today, in our science lesson, Mrs. Green was talking about the  _  She said that the whole world is getting dirtier and that many animals and plants are dying. She wants us to think of something we can do to help. I thought all the way, but there is  _  I can do to make a difference.\" \"Let me tell you  a story  .\" the mother said after thinking for a while. \"One morning a man was walking down a beach, there he saw thousands of dying starfish covering the beach, they were pushed up by the  _  , and it was too far up for them to make their way back by  _  . The man shook his head as he walked along, 'What a pity! So many starfish will die on the beach.' The man felt very sorry  _  those starfish. He went on walking and just at that time he was  _  to find a boy in front who was throwing the starfish  _  into the sea as soon as he could, 'how  _  you are! My son .' the man said, 'There are so many starfish, can you throw all of them back?' The boy didn't stop but kept throwing, \"  _  I can't help them all ,I can make a difference to this one, and this one, and this one, and this one.\" \"Thinking for a moment, the man  _  to help return the starfish to their home. He smiled and said to himself, 'Sometimes the biggest lesson in life comes from the  _  person.", 
    "options": [
        [
            "drinking", 
            "making", 
            "selling", 
            "washing"
        ], 
        [
            "what", 
            "when", 
            "where", 
            "why"
        ], 
        [
            "air", 
            "land", 
            "water", 
            "environment"
        ], 
        [
            "something", 
            "anything", 
            "everything", 
            "nothing"
        ], 
        [
            "wind", 
            "rain", 
            "waves", 
            "sands"
        ], 
        [
            "himself", 
            "itself", 
            "ourselves", 
            "themselves"
        ], 
        [
            "of", 
            "for", 
            "from", 
            "forward"
        ], 
        [
            "afraid", 
            "surprised", 
            "sad", 
            "angry"
        ], 
        [
            "after", 
            "back", 
            "up", 
            "down"
        ], 
        [
            "clever", 
            "kind", 
            "silly", 
            "ugly"
        ], 
        [
            "Or", 
            "So", 
            "Because", 
            "Though"
        ], 
        [
            "began", 
            "continued", 
            "forgot", 
            "waited"
        ], 
        [
            "shortest", 
            "tallest", 
            "smallest", 
            "biggest"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "D", 
        "D", 
        "C", 
        "D", 
        "B", 
        "B", 
        "B", 
        "C", 
        "D", 
        "A", 
        "C"
    ], 
    "source": "middle2300"
}