{
    "article": "It was Friday. The football game was Saturday and we were very excited. My brother was going to be the quarterback  for our team. It was the first time he would be in that _ . He had been hoping to be the quarterback ever since he joined the team. He said, \"That's the big job. That's the one that makes the big difference.\"\nMy mother said, \" Be careful , son. That's the big target , too. You know the other _ want to knock you down. You can get hurt.\"\n\"Don't worry, I'm so _ and I'm fast. Besides, I have great players who will _ them from coming at me.\" my brother said.\nI couldn't _ well the whole night. I worried about my brother. My mother was _ ---he could get hurt.\nThe next morning, he _ early to get to the game. When we got there, it was about to start. The _  ran out on the field. My brother looked great. He saw us and _ .\nThen it started. They were playing hard. One player in particular from the other team kept _ at him. Then it happened. He knocked my brother down. My brother was slow to get up. My brother was screaming. The coach ran out on the field. He told my brother to _ some time on the bench. He was afraid he had been hurt.\nMy mother ran down to _ on my brother. But all he did was a smile. \"It's just a bruise  . I'm fine. And don't worry, I'll be back. This is _ . I love leading the team.\"\nAfter that game, my brother plays quarterback every Saturday. But my mother is still _ . She can't go to the games. She just waits at home and hopes to see him walking in smiling.", 
    "options": [
        [
            "game", 
            "list", 
            "show", 
            "place"
        ], 
        [
            "parents", 
            "players", 
            "fans", 
            "strangers"
        ], 
        [
            "handsome", 
            "healthy", 
            "brave", 
            "strong"
        ], 
        [
            "stop", 
            "help", 
            "protect", 
            "hide"
        ], 
        [
            "behave", 
            "play", 
            "sleep", 
            "dream"
        ], 
        [
            "right", 
            "sad", 
            "angry", 
            "excited"
        ], 
        [
            "rested", 
            "exercised", 
            "left", 
            "returned"
        ], 
        [
            "family", 
            "team", 
            "coach", 
            "crowd"
        ], 
        [
            "laughed", 
            "nodded", 
            "greeted", 
            "cheered"
        ], 
        [
            "pointing", 
            "shouting", 
            "looking", 
            "rushing"
        ], 
        [
            "spend", 
            "waste", 
            "save", 
            "kill"
        ], 
        [
            "call", 
            "check", 
            "operate", 
            "breathe"
        ], 
        [
            "funny", 
            "easy", 
            "great", 
            "dangerous"
        ], 
        [
            "proud", 
            "excited", 
            "anxious", 
            "clam"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "D", 
        "A", 
        "C", 
        "A", 
        "C", 
        "B", 
        "B", 
        "D", 
        "A", 
        "B", 
        "C", 
        "C"
    ], 
    "source": "middle763"
}