{
    "article": "At the beginning of the world, it was Bear who owned Fire. Bear and his people carried Fire with them  _  they went. One day, Bear and his people came to a great forest, where they found many acorns  _  on the forest floor. Bear set Fire at the edge of the forest, and he and his  _  began eating acorns. They went further and further away from Fire, eating the delicious acorns and looking for  _  . Fire blazed up happily for a while  _  it had burned almost all of its wood. It started to smoke. \"  _  me! Feed me!\" Fire shouted to Bear. But Bear and his people did not hear Fire's  _  . At that moment, Man came walking through the forest and saw the small Fire. \"What should I feed you?\" Man asked, He had  _  seen Fire before. \"I eat sticks and wood of all kinds,\" Fire said. Man  picked up  a stick and put it on Fire. Man got a second stick and then a third one... By this time, Fire's hunger was satisfied. Man warmed himself by the Fire, enjoying the changed colors. Man and Fire were very happy together, and Man fed Fire sticks whenever it got hungry. And now Fire  _  to Man.", 
    "options": [
        [
            "whatever", 
            "however", 
            "wherever", 
            "whenever"
        ], 
        [
            "blessing", 
            "playing", 
            "sleeping", 
            "lying"
        ], 
        [
            "people", 
            "sister", 
            "brother", 
            "parents"
        ], 
        [
            "less", 
            "more", 
            "little", 
            "few"
        ], 
        [
            "until", 
            "unless", 
            "if", 
            "but"
        ], 
        [
            "Hire", 
            "Twist", 
            "Feed", 
            "Mend"
        ], 
        [
            "education", 
            "step", 
            "voice", 
            "cries"
        ], 
        [
            "ever", 
            "never", 
            "always", 
            "often"
        ], 
        [
            "lowers", 
            "cheers", 
            "likes", 
            "Belongs"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "A", 
        "B", 
        "A", 
        "C", 
        "D", 
        "B", 
        "D"
    ], 
    "source": "middle2126"
}