{
    "article": "One can have many experiences, but the one I never forget is my bicycling trip in Taiwan. When we were going to  _  school, my teacher suggested that we could do something special to remember our school life. After a long discussion, we decided to travel  _  the whole island by bicycle. We began to get some training to make our  _  stronger. So we ran 3,000 meters after school. At first, I could only ran about 2,000 meters. My legs were heavy like steel and my heart  _  very fast. After two weeks of training, I could run 3,000 meters  _  . We started our journey the last week of July. We rode about 100 kilometers  every day  . It was very hot and our clothes were  _  all the time. One day, we were riding up the mountain when there were  _  wrong with my bicycle, and I fell and was hurt. I almost gave up and didn't want to  _  the trip, but I tried to solve the problems successfully and kept on. Fifteen days passed, we returned to school again. We were so  _  . This experience was like a miracle for me. I learned that I could do what I want to.", 
    "options": [
        [
            "leave", 
            "pass", 
            "enter", 
            "choose"
        ], 
        [
            "toward", 
            "along", 
            "from", 
            "around"
        ], 
        [
            "arm", 
            "heart", 
            "body", 
            "leg"
        ], 
        [
            "ran", 
            "beat", 
            "hurt", 
            "broke"
        ], 
        [
            "safely", 
            "easily", 
            "luckily", 
            "pleasantly"
        ], 
        [
            "wet", 
            "dry", 
            "clean", 
            "dirty"
        ], 
        [
            "nothing", 
            "anything", 
            "everything", 
            "something"
        ], 
        [
            "miss", 
            "continue", 
            "stop", 
            "begin"
        ], 
        [
            "surprised", 
            "worried", 
            "excited", 
            "interested"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "C", 
        "B", 
        "B", 
        "A", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "middle1793"
}