{
    "article": "A small man ih his wheelchair gently makes his way into Line 2 subway. He pulls out his microphone, MP3 player and speaker. He clears his  _  and smiles uncomfortably. \"I'm always a bit nervous when I get started,\" he says in a quiet  _  . For now, Gao Xiaowei sings in subways in Beijing, this is the  _  he makes a living. Born in Jiangsu Province on a farm, Gao was a happy and  _  baby. He explains  _  a small illness caused an unfortunate event at the age of three. \"At that time, rural medical conditions were very poor and the doctor wasn't very  _  \". Gao didn't like depending on others.  _  his parents didn't allow him to leave his hometown, he ran away from home to find out what life  _  offer him. \"I sold all kinds of toys. But now singing in subways can let me live day by day better than  _  things before.\" Gao  _  his brightest days in Beijing performing music with two friends. \"We  _  to sing in a busy subway at Wangfujing. At that time, many people appreciated us, and we were  _  by Beijing TV and some newspapers.\" But Beijing is a city where people come and go, and Gao has struggled with loneliness since his friends returned to their hometown. Fortunately, music  _  to play an important part in his life. \"It can give me  _  of mind. Although my life isn't very good, I need  _  than just food and music gives me a lot of spiritual comfort.", 
    "options": [
        [
            "face", 
            "throae", 
            "head", 
            "back"
        ], 
        [
            "station", 
            "sound", 
            "voice", 
            "place"
        ], 
        [
            "part", 
            "project", 
            "cost", 
            "way"
        ], 
        [
            "disabled", 
            "healthy", 
            "unusual", 
            "well-known"
        ], 
        [
            "how", 
            "what", 
            "where", 
            "who"
        ], 
        [
            "professional", 
            "confident", 
            "energetic", 
            "creative"
        ], 
        [
            "Because", 
            "If", 
            "But", 
            "Though"
        ], 
        [
            "must", 
            "need", 
            "could", 
            "should"
        ], 
        [
            "borrowing", 
            "receiving", 
            "providing", 
            "selling"
        ], 
        [
            "finished", 
            "practiced", 
            "spent", 
            "found"
        ], 
        [
            "wanted", 
            "used", 
            "stopped", 
            "pretended"
        ], 
        [
            "included", 
            "influenced", 
            "interested", 
            "interviewed"
        ], 
        [
            "countinues", 
            "happens", 
            "develops", 
            "describes"
        ], 
        [
            "problem", 
            "prediction", 
            "peace", 
            "pressure"
        ], 
        [
            "less", 
            "more", 
            "fewer", 
            "worse"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "D", 
        "B", 
        "A", 
        "A", 
        "D", 
        "C", 
        "D", 
        "C", 
        "B", 
        "D", 
        "A", 
        "C", 
        "B"
    ], 
    "source": "middle20"
}