{
    "article": "The day after Thanksgiving has become America's wildest shopping day. Closed all day on  _  , shops all across the country open early on Friday. Some open at 12:01 Friday morning, while others open at 4 a.m. Some lazy ones , like Target this year ,don't open their doors on Friday  _  6 a.m. From Friday to the day before Christmas, this is the season when businesses make  as much as  25% of their whole year's revenue . This season puts many businesses \"in the black\"--that is, into profitability --for the year. Reporters from local TV stations  _  people who camp out in front of shops before the doors open on Friday. These people patiently wait in line to get products that are discounted 50 percent or more. \"Oh, we have fun\", said one camper.\" We bring games to play, we watch TV and we meet interesting people .And, most  _  of all, we save big dollars! \" Each store has plenty of goods reduce from 10% to 50%. Not all Americans like this crazy shopping. Reverend William Graham wants to  _  the name of Black Friday. \"We want to call it Remember Jesus Friday. People should start the season  _  the right attitude .Christmastime has become a Season of Shopping. We want to make it a Season of  _  .And we don't mean giving IPods, DVDs, flat screen TVs ,and so on .We mean giving your back, your mind, and your hands. Help an old lady  clean up  her house. Teach a kid how to read. Pick up the rubbish in your neighborhood. Give blood to the  Red Cross  . Celebrate Christmas by remembering Jesus and forgetting Father Christmas.\"", 
    "options": [
        [
            "Monday", 
            "Thursday", 
            "Friday", 
            "Saturday"
        ], 
        [
            "at", 
            "since", 
            "until", 
            "from"
        ], 
        [
            "stop", 
            "find", 
            "interview", 
            "tell"
        ], 
        [
            "dangerous", 
            "careful", 
            "beautiful", 
            "important"
        ], 
        [
            "give", 
            "change", 
            "make", 
            "call"
        ], 
        [
            "at", 
            "with", 
            "on", 
            "for"
        ], 
        [
            "Taking", 
            "Selling", 
            "Giving", 
            "Thanking"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "C", 
        "D", 
        "B", 
        "B", 
        "C"
    ], 
    "source": "middle2031"
}