{
    "article": "It began a year ago, around Christmas. Every time I drove down our street, I  _  an old man sitting in his front yard. He was usually smoking or drinking, and looking rather unhappy. One day, while I was driving past him with my  _  , I decided to wave at him with a lot of excitement.  At the beginning  , when he noticed me waving at him, he looked a bit shocked. Then, I saw his hand go up and he waved back. \"  _  did you wave at him?\" my daughter asked. I told her it's just an act of kindness that doesn't  _  anything. It gives both him and me a feeling of joy. My daughter replied that she felt a bit uncomfortable to wave to a  _  , but next time she would try it as well. We liked close to the old man,  _  we saw him rather often. Whenever we drove by, both of us would start waving at him and, pretty soon, the old man started  _  at everyone who passed by his house. One time, my daughter's friend came to visit and she told my daughter that she saw this strange old man near our home wave at her very  _  . She mentioned that she waved back, although she didn't know  _  , and it felt really good. As soon as my daughter heard this, she told her friend the  _  of how all the waving began. Her friend answered: \"Tell your mom that's really cool!\" Other friends gave similar  _  . This taught my daughter that an act of kindness can be natural and  _  , if you really want to do it. It showed us how giving happiness can do good to  _  the giver and the receiver. Moved by the old man's actions, we're planning to give our waving neighbor a thank-you card to express our  _  for his exciting waves. We are really thankful for him sharing his simple joy with all who pass by his house.", 
    "options": [
        [
            "noticed", 
            "felt", 
            "heard", 
            "kept"
        ], 
        [
            "husband", 
            "son", 
            "daughter", 
            "friend"
        ], 
        [
            "Why", 
            "How", 
            "When", 
            "Where"
        ], 
        [
            "buy", 
            "cost", 
            "hide", 
            "guess"
        ], 
        [
            "friend", 
            "driver", 
            "classmate", 
            "stranger"
        ], 
        [
            "or", 
            "but", 
            "so", 
            "yet"
        ], 
        [
            "shouting", 
            "waving", 
            "laughing", 
            "looking"
        ], 
        [
            "angrily", 
            "excitedly", 
            "loudly", 
            "carefully"
        ], 
        [
            "him", 
            "me", 
            "her", 
            "us"
        ], 
        [
            "lesson", 
            "accident", 
            "news", 
            "story"
        ], 
        [
            "gifts", 
            "notes", 
            "opinions", 
            "books"
        ], 
        [
            "easy", 
            "funny", 
            "usual", 
            "special"
        ], 
        [
            "past", 
            "between", 
            "all", 
            "both"
        ], 
        [
            "attention", 
            "thanks", 
            "suggestions", 
            "interests"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "A", 
        "B", 
        "D", 
        "C", 
        "B", 
        "B", 
        "A", 
        "D", 
        "C", 
        "A", 
        "D", 
        "B"
    ], 
    "source": "middle2188"
}