{
    "article": "The ability to forgive others is a great thing that can certainly help to make life happier for everyone. However, some people think that it is very  _  to do, and they don't know how to forgive others, especially their family and friends. This is all because they don't understand the meaning of \"forgiveness\". In the dictionary, \"to forgive\" means \"to  _  feeling angry with somebody that has done something bad to you.\" I'm happy that many people have  _  in doing this. I have succeeded, too, and I know how hard it is. I lived with a friend for two years. During that time, he did cause me many  _  . I easily got angry when communicating with him. However, we  _  had a talk about our problems. When he pointed out that I wasn't treating him like a friend, I was  _  . I never knew that I also needed to be forgiven for doing something wrong. I thought however  _  I might get, I did love my friend deep in my heart. Then I understood the saying, \"To love is to forgive.\" And when we  _  each other, we feel great. After that long talk, we both  _  those bad moments. Our friendship became fresh again. Now I understand the  _  of forgiveness better.", 
    "options": [
        [
            "useless", 
            "difficult", 
            "strange", 
            "late"
        ], 
        [
            "stop", 
            "suffer", 
            "keep", 
            "consider"
        ], 
        [
            "spent", 
            "continued", 
            "succeeded", 
            "enjoyed"
        ], 
        [
            "dangers", 
            "mistakes", 
            "questions", 
            "problems"
        ], 
        [
            "firstly", 
            "finally", 
            "suddenly", 
            "always"
        ], 
        [
            "surprised", 
            "excited", 
            "satisfied", 
            "bored"
        ], 
        [
            "worried", 
            "frightened", 
            "angry", 
            "nervous"
        ], 
        [
            "control", 
            "help", 
            "protect", 
            "forgive"
        ], 
        [
            "learn", 
            "forget", 
            "imagine", 
            "consider"
        ], 
        [
            "meaning", 
            "purpose", 
            "process", 
            "reason"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "D", 
        "B", 
        "A", 
        "C", 
        "D", 
        "B", 
        "A"
    ], 
    "source": "middle1317"
}