{
    "article": "When I was19 years old, I had a part-time job in a hospital. At that time I was shy and didn't believe in myself. I  _  talked with others. I wasn't confident in any future. Later I met a doctor, Mike, and we became good friends. He  _  me to believe in myself and try to communicate with others. He helped me learn to enjoy myself. He also asked me to take some important courses. I did  _  he told me and did very well. One day, he asked me what I  _  my life to be like. I hadn't thought about it before. That night, I thought it over and finally knew the life I had been  looking forward to  From then on, I started to work for it. Later I got a chance to go to college, but I had another friend. At that time I was too  _  to pay for my education. I was very frustrated and didn't know what to do. When I wanted to  give up  my dream, Mike helped me again. He  _  to pay for my college education. He helped me  _  asking for anything in return . After graduating , I got my dream job and I like it very much. Mike made me enter a different  _  I am so lucky to have met such a good friend in my life.", 
    "options": [
        [
            "usually", 
            "often", 
            "hardly", 
            "always"
        ], 
        [
            "encouraged", 
            "invited", 
            "taught", 
            "allowed"
        ], 
        [
            "why", 
            "how", 
            "what", 
            "that"
        ], 
        [
            "expected", 
            "lived", 
            "enjoyed", 
            "spent"
        ], 
        [
            "rich", 
            "weak", 
            "poor", 
            "strong"
        ], 
        [
            "agreed", 
            "continued", 
            "offered", 
            "stopped"
        ], 
        [
            "by", 
            "with", 
            "except", 
            "without"
        ], 
        [
            "world", 
            "contest", 
            "university", 
            "country"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "C", 
        "A", 
        "C", 
        "C", 
        "D", 
        "A"
    ], 
    "source": "middle1926"
}