{
    "article": "A man with a green bag walked into a doctor's room. \"Please sit down. Open your mouth and  put out  your tongue ,\"the doctor said, \"OK. You can  _  your mouth now. It's clear something is  _  with you. You have to do more exercise.\" \"But, doctor,\" the man said. \"I don't think...\" \"Don't tell me what you  _  ,\" the doctor said. \"I am the doctor, not you. I know  _  you need. I see hundreds of people like you. None of them get any exercise. They  _  in offices all day and in front of the television in the  _  .What you need is to walk quickly for at least 30  _  a day.\" \"Doctor, you don't understand,\" the man said. \"I...\" \"I don't want to hear any  _  \" the doctor said. \"You must find time for exercise. If you don't, you will get  _  and have health problems when you are older.\" \"But I walk every day.\" the man said. \"Oh, yes, and I know what kind of walking that is. You  _  a few meters to the train station from your house, a few more meters from the station to your office, and a few more meters from your office to a  _  for lunch and back.\" \"Please listen to me, doctor!\" the man shouted, getting  _  . \"I'm a mailman.\" the man continued, \"I walk for seven hours every day and I come to  _  letters.\" For a moment, the doctor said nothing, and  _  he said slowly, \"Put your tongue out again, will you?\"", 
    "options": [
        [
            "open", 
            "close", 
            "fill", 
            "try"
        ], 
        [
            "wrong", 
            "strange", 
            "nice", 
            "exciting"
        ], 
        [
            "discuss", 
            "talk", 
            "think", 
            "meet"
        ], 
        [
            "how", 
            "why", 
            "where", 
            "what"
        ], 
        [
            "eat", 
            "stand", 
            "run", 
            "sit"
        ], 
        [
            "evening", 
            "afternoon", 
            "noon", 
            "morning"
        ], 
        [
            "seconds", 
            "minutes", 
            "hours", 
            "days"
        ], 
        [
            "news", 
            "advices", 
            "excuses", 
            "messages"
        ], 
        [
            "thin", 
            "healthy", 
            "fat", 
            "strong"
        ], 
        [
            "walk", 
            "drive", 
            "run", 
            "fly"
        ], 
        [
            "office", 
            "school", 
            "restaurant", 
            "factory"
        ], 
        [
            "sad", 
            "excited", 
            "surprised", 
            "angry"
        ], 
        [
            "get", 
            "send", 
            "bring", 
            "have"
        ], 
        [
            "or", 
            "so", 
            "but", 
            "then"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "D", 
        "D", 
        "A", 
        "B", 
        "C", 
        "C", 
        "A", 
        "C", 
        "D", 
        "B", 
        "D"
    ], 
    "source": "middle257"
}