{
    "article": "If you are given only 1 yuan, can you live in a city for one day? It may be a little difficult. But _ from Xi'an did it.\nOn April 10th, more than 60 students from the Middle School Attached to Northwestern Poly technical University took part in the One Yuan Metropolis Survival. The charity for teenagers called Imperceptible Education held this _ .  Students had to live and they had to deal with a lot of _ tasks. It has happened in eight cities and is going to four others, including Beijing, in May.\nTo make money , many students looked for part-time jobs and saw how hard life was. Zhang Qiyue, 14, asked more than 10 restaurants for a job and _ got one chance. \"We were sad when they said _ . But slowly, we got used to it,\" he said. After being a waiter for an hour, he _ 25 yuan.\nSome made use of their talents _ singing and dancing in parks or shopping malls. Many people who walked by took notice and helped _ . Zhao Jiacheng, 14, drew pictures and made paper crafts  . \"This showed it's _ to learn a special skill,\" he said.\nLiving was hard, _ finishing the tasks was not any easier. They went to different places to finish tasks in a _ time. The most amazing one was when they had to exchange things worth a hundred yuan with only a piece of paper in half an hour. \"We learned _ to persuade   others. From a balloon to a cake to a bottle of yogurt..., after almost 20 tries, we got an expensive necklace, \"he said, \"we would _ all of the money we had raised to poor schools in Tibet.\"", 
    "options": [
        [
            "teachers", 
            "students", 
            "workers", 
            "waiters"
        ], 
        [
            "activity", 
            "party", 
            "celebration", 
            "festival"
        ], 
        [
            "easy", 
            "hard", 
            "perfect", 
            "secret"
        ], 
        [
            "finally", 
            "quickly", 
            "recently", 
            "suddenly"
        ], 
        [
            "hello", 
            "thanks", 
            "yes", 
            "no"
        ], 
        [
            "borrowed", 
            "paid", 
            "got", 
            "spent"
        ], 
        [
            "by", 
            "from", 
            "with", 
            "about"
        ], 
        [
            "him", 
            "her", 
            "them", 
            "us"
        ], 
        [
            "important", 
            "difficult", 
            "possible", 
            "interesting"
        ], 
        [
            "or", 
            "if", 
            "as", 
            "hut"
        ], 
        [
            "long", 
            "short", 
            "right", 
            "wrong"
        ], 
        [
            "where", 
            "why", 
            "how", 
            "when"
        ], 
        [
            "show", 
            "bring", 
            "afford", 
            "give"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "B", 
        "A", 
        "D", 
        "C", 
        "A", 
        "C", 
        "A", 
        "D", 
        "B", 
        "C", 
        "D"
    ], 
    "source": "middle1162"
}