{
    "article": "Robert had just moved into the neighborhood, and he had a strange feeling that he was not wanted. He thought maybe  the other  boys were trying to get idea of what he was like. But that didn't make him feel any less  _  . He was new, and he had to be  _  , Still, proving himself would not be all  _  easy. He didn't want to make friends with bad boys or do anything  _  the law to prove that he was  _  . No! He must show what he was  made of  in a good way. That's how he got his idea. The next day was Saturday. He  _  that most of the boys would go down to the playground and choose sides for Saturday's  _  game. Robert knew he was strong. Then the boys would want to be his friends. He  _  early and did his step exercises. He shot the ball several times and did some other exercises. Some of  _  were very difficult and looked cool. Then the boys came. Robert  went through  what he had done before the game and  _  what he could do. No one said a  _  . The boys just looked at each other and thought about it. When it was all over, the biggest one in the group  _  and shook his hand. Robert knew ha had made it.", 
    "options": [
        [
            "lonely", 
            "friendly", 
            "happy", 
            "uncertain"
        ], 
        [
            "examined", 
            "checked", 
            "corrected", 
            "tested"
        ], 
        [
            "even", 
            "that", 
            "too", 
            "much"
        ], 
        [
            "for", 
            "against", 
            "on", 
            "about"
        ], 
        [
            "weak", 
            "friendly", 
            "strong", 
            "lovely"
        ], 
        [
            "decided", 
            "considered", 
            "realized", 
            "knew"
        ], 
        [
            "football", 
            "basketball", 
            "volleyball", 
            "baseball"
        ], 
        [
            "arrived", 
            "got", 
            "reached", 
            "appeared"
        ], 
        [
            "that", 
            "it", 
            "them", 
            "which"
        ], 
        [
            "showed", 
            "acted", 
            "played", 
            "gave"
        ], 
        [
            "letter", 
            "word", 
            "phrase", 
            "sentence"
        ], 
        [
            "cried", 
            "left", 
            "smiled", 
            "stayed"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "B", 
        "B", 
        "C", 
        "D", 
        "B", 
        "A", 
        "D", 
        "A", 
        "B", 
        "C"
    ], 
    "source": "middle191"
}