{
    "article": "The boss of an Australian restaurant is tired of the waste left by customers. He has required them to eat everything on their plates or they'll be fined and won't be allowed to _ next time.\nChef Yukako Ichikawa has introduced a 30 percent discount for customers who eat all the food they have ordered at Wafu, her 30-seat restaurant which is not far from Sydney.\n\"To contribute to _ a future which can continue to develop, we require a little _ of our guests than most other restaurants,\" she says and she has put up a list of her rules on the door to the restaurant .\nThis list includes finishing all dishes ordered which are free of milk, sugar and eggs and the cook and all her workers tell people who don't _ their plates to choose another restaurant next time.\n\" _ your meal means that everything is eaten _ lemon slices, ginger  and wasabi,\" says the menu.\n\"Please also pay attention to that vegetables and salad on the _ are not decorations ; they are _ of the meal too.\"\nWafu's strict rules have been _ by some but against by some reviewers. Ichikawa insists on it.\n\"Wafu is not just a restaurant; it is also the _ of Yukako's personal qualities ,\" says a statement on the restaurant's website.\n\"We not only serve meals and respect the body _ prevent waste. We have _ to protect the environment and keep the healthy development of our earth.\"", 
    "options": [
        [
            "return", 
            "leave", 
            "stay", 
            "live"
        ], 
        [
            "create", 
            "discover", 
            "creating", 
            "discovering"
        ], 
        [
            "fewer", 
            "more", 
            "less", 
            "bit"
        ], 
        [
            "clean", 
            "wash", 
            "clear", 
            "tidy"
        ], 
        [
            "Finishing", 
            "Ordering", 
            "Cooking", 
            "Making"
        ], 
        [
            "except", 
            "with", 
            "and", 
            "or"
        ], 
        [
            "way", 
            "edges", 
            "bank", 
            "side"
        ], 
        [
            "members", 
            "part", 
            "member", 
            "parts"
        ], 
        [
            "refused", 
            "supported", 
            "unwelcome", 
            "welcome"
        ], 
        [
            "show", 
            "appearance", 
            "invention", 
            "exhibition"
        ], 
        [
            "also", 
            "and", 
            "but", 
            "or"
        ], 
        [
            "abilities", 
            "duties", 
            "ideas", 
            "ways"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "B", 
        "C", 
        "A", 
        "A", 
        "D", 
        "B", 
        "D", 
        "A", 
        "C", 
        "B"
    ], 
    "source": "middle359"
}