{
    "article": "Old George selected his food in the supermarket more carefully than NASA chose its astronauts. When he left the cashier,he was  _   to think that he had saved 80 cents today.\nAt the exit,the cold wind made him  think of   his gloves. He looked for them in his coat and pants  _    could not find them anywhere. He had bought the black gloves at a(an)  _   price,for just $35,years ago. They were  _  and very comfortable. He had taken great care looking  _  them,so they were in good condition.\nGeorge,calm on the outside but mad on the inside,reentered the  _ .He followed the same route he had walked before. Several minutes of searching turned out to be in vain .His  _  were gone.\"People have changed,\" he said to himself.\"Years ago,if somebody picked up something lost,they would give it back. Not any more!\"\nHe stared at anybody wearing black gloves to see if they looked like  _ .On his way to the dairy section,he  _  a lady wearing a pair of black gloves. He sped up and in three seconds was in front of her. But   _  the surprised woman looked over,his eyes dropped,for her gloves were just far too small to be his. He went over to the cashier to ask if she had received any lost gloves,but she said no. He finally walked out   _  the street.\nA few days later,poor George decided to buy another leather pair.  _  getting on the subway,he stepped into the supermarket again. He wanted to see if by any chance his gloves had been returned to the lost and found office.\"What color are they?\" the woman in the office asked.\"Black,\" he  _  the same answer. She looked into her drawer and drew out a pair of  _  leather gloves.\"Are they?\"\n\"Yes!Those are mine,\" George exclaimed,his eyes full of joy.", 
    "options": [
        [
            "sad", 
            "sorry", 
            "pleased", 
            "worried"
        ], 
        [
            "when", 
            "and", 
            "but", 
            "so"
        ], 
        [
            "good", 
            "high", 
            "cheap", 
            "expensive"
        ], 
        [
            "hard", 
            "soft", 
            "new", 
            "small"
        ], 
        [
            "for", 
            "after", 
            "at", 
            "over"
        ], 
        [
            "exit", 
            "condition", 
            "store", 
            "office"
        ], 
        [
            "coats", 
            "pants", 
            "gloves", 
            "cents"
        ], 
        [
            "him", 
            "his", 
            "them", 
            "theirs"
        ], 
        [
            "caught", 
            "knocked", 
            "held", 
            "noticed"
        ], 
        [
            "although", 
            "when", 
            "unless", 
            "until"
        ], 
        [
            "of", 
            "off", 
            "on", 
            "into"
        ], 
        [
            "After", 
            "When", 
            "While", 
            "Before"
        ], 
        [
            "returned", 
            "got", 
            "gave", 
            "took"
        ], 
        [
            "kid's", 
            "men's", 
            "women's", 
            "lady's"
        ]
    ], 
    "answers": [
        "C", 
        "C", 
        "A", 
        "B", 
        "B", 
        "C", 
        "C", 
        "B", 
        "D", 
        "B", 
        "D", 
        "D", 
        "C", 
        "B"
    ], 
    "source": "middle1739"
}