{
    "article": "The best thing to start your day is a good breakfast. There are different  _  of breakfasts around the world. \"Eat breakfast like a king, lunch like a prince and dinner like a pauper .\"  _  the old saying tells us, breakfast is the most important meal of the day. It  _  us with energy after a long night without food. If people don't have breakfast in the morning, they will feel tired and get angry  _  . Breakfast helps  _  stay more focused in school. A study showed that children who eat breakfast regularly score  _  in most subjects. Breakfast is also important for weight loss. If you have a balanced breakfast, you will eat less throughout the day. A healthy and  _  breakfast should include some protein like eggs, milk or a little meat, which makes you  _  all day. Carbohydrates like rice or bread  _  keep you active. Vegetables and fruit have the vitamins  _  humans need.  _  , in China, breakfast is different from region to region. Porridge  _  pickles ,baozi, noodles, soybean milk and youtiao are common throughout the  _  country. Although western culture has influenced China a lot, most people still  _  traditional Chinese breakfast. They think that porridge and noodles are not only easily digested, but also can provide enough  _  in the morning", 
    "options": [
        [
            "ways", 
            "types", 
            "rules", 
            "ideas"
        ], 
        [
            "So", 
            "Though", 
            "As", 
            "When"
        ], 
        [
            "provides", 
            "gives", 
            "offers", 
            "has"
        ], 
        [
            "properly", 
            "directly", 
            "easily", 
            "quickly"
        ], 
        [
            "girls", 
            "boys", 
            "people", 
            "children"
        ], 
        [
            "lower", 
            "less", 
            "higher", 
            "more"
        ], 
        [
            "experienced", 
            "balanced", 
            "excited", 
            "different"
        ], 
        [
            "sleepy", 
            "painful", 
            "energetic", 
            "knowledgeable"
        ], 
        [
            "can", 
            "should", 
            "must", 
            "need"
        ], 
        [
            "how", 
            "what", 
            "why", 
            "that"
        ], 
        [
            "Therefore", 
            "But", 
            "Because", 
            "However"
        ], 
        [
            "about", 
            "with", 
            "on", 
            "for"
        ], 
        [
            "all", 
            "one", 
            "whole", 
            "only"
        ], 
        [
            "dislike", 
            "know", 
            "want", 
            "prefer"
        ], 
        [
            "food", 
            "energy", 
            "protein", 
            "meal"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "C", 
        "D", 
        "C", 
        "B", 
        "C", 
        "A", 
        "D", 
        "D", 
        "B", 
        "C", 
        "D", 
        "B"
    ], 
    "source": "middle483"
}