{
    "article": "Yesterday my son and I went to the grocery store. In front of us  in line  was a little girl with her mother. The little girl was asking her mother for a box of Smarties. The polite way she was asking  _  broke the mother's heart. \"I'm sorry, honey, but we have no money to buy it.\" My son was watching that dialogue. By the way, he had been raking leaves in our garden to  _  himself some money to buy a bike. As he watched the mother and daughter leave the  _  , he ran to the candy counter and bought a box of Smarties with his money. Then he ran out after the little girl and her mother, and gave them the  _  . He came back and told me what he told them, \"Every kid should have a pack of Smarties because they can make you  _  .\" I was so excited  _  I bought a pack of Smarties for my son. I told him that I was proud of him, and that was for his act of generosity because he gave his own Smarties to others. Quickly, he  _  , \"But you do nice things for people and you never get anything for it.\" I explained, \"When you do something nice for someone, you shouldn't  expect to  get anything, but when you do get something you should be very  _  .\"", 
    "options": [
        [
            "almost", 
            "hardly", 
            "seldom", 
            "never"
        ], 
        [
            "buy", 
            "pay", 
            "provide", 
            "raise"
        ], 
        [
            "store", 
            "house", 
            "mall", 
            "centre"
        ], 
        [
            "money", 
            "box", 
            "leaves", 
            "bike"
        ], 
        [
            "happy", 
            "smart", 
            "sweet", 
            "lovely"
        ], 
        [
            "and", 
            "as", 
            "that", 
            "but"
        ], 
        [
            "replied", 
            "told", 
            "lied", 
            "talked"
        ], 
        [
            "hopeful", 
            "wonderful", 
            "thankful", 
            "helpful"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "A", 
        "B", 
        "B", 
        "C", 
        "A", 
        "C"
    ], 
    "source": "middle1934"
}