{
    "article": "I used to have little passion(,)in my life. But what happened the other day changed my mind. It was then that I learned how _ it is to have a passion in life.\nThat day I went home in Mom's car. When Mom _ at a red light, someone on the side of the road caught my eye. It was a man dressed _ rags. He was homeless. That didn't interest me, because I had seen _ like him before. Those people usually looked unhappy and hopeless.\nBut this man was _ n some way. He was not sitting down with a _ expression. Instead, he had a _ in his hand and was dancing happily to the music. The radio seemed to be the most precious thing he had.\n\"Mom, why does that man have a radio _ he's homeless?\" I asked.\n\"He _ it, \" she replied.\n\"But why doesn't he use the money to buy food or clothes? He paid for something that he didn't need.\"\n\"Well, Sarah, sometimes food and clothes aren't the most important.\"\nThat man must care so much about _ that he bought a radio instead of food or clothes. I soon realized that _ is the key to life.\nSince then I am always thinking of _ is truly important in life. A home, a meal, clothes - these things are _ part of the life. What we often forget is that we all need a joy, a light on a _ day. We all need a passion which gives a person the happiness they need to keep going.", 
    "options": [
        [
            "strange", 
            "important", 
            "dangerous", 
            "difficult"
        ], 
        [
            "stopped", 
            "walked", 
            "stood", 
            "exercised"
        ], 
        [
            "in", 
            "on", 
            "at", 
            "of"
        ], 
        [
            "none", 
            "few", 
            "all", 
            "many"
        ], 
        [
            "common", 
            "different", 
            "polite", 
            "rude"
        ], 
        [
            "sad", 
            "nervous", 
            "polite", 
            "rude"
        ], 
        [
            "hat", 
            "phone", 
            "scarf", 
            "radio"
        ], 
        [
            "though", 
            "because", 
            "until", 
            "unless"
        ], 
        [
            "borrowed", 
            "made", 
            "fixed", 
            "bought"
        ], 
        [
            "stories", 
            "music", 
            "news", 
            "languages"
        ], 
        [
            "knowledge", 
            "health", 
            "happiness", 
            "friendship"
        ], 
        [
            "who", 
            "what", 
            "where", 
            "when"
        ], 
        [
            "only", 
            "all", 
            "also", 
            "never"
        ], 
        [
            "warm", 
            "hot", 
            "dark", 
            "relaxing"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "A", 
        "D", 
        "B", 
        "C", 
        "D", 
        "A", 
        "D", 
        "B", 
        "C", 
        "B", 
        "A", 
        "C"
    ], 
    "source": "middle1272"
}