{
    "article": "A young man went to visit a wise man living deep in the mountain for the wisdom of life. \"Excuse me! Could you please tell me what the most  _  day in our lives is?Is it the day when we were born or the day we  _  ?Is it the day when we fall in love or the day we succeed?\"The young man asked. \"  None  The most important day in our lives is today. \"The wise man replied calmly. \"Why?\"The young man felt more than  _  . \"Is it because there is a moving event taking place today?\" \"No. Nothing has happened today. \" \"Is it because of my visit?\" \"Even if nobody visited me today, today is  _  very important because today is the only wealth we have. No matter how memorable yesterday is, it has gone by like a ship going down into the sea; no matter how bright tomorrow may be, it is yet to come; but no matter how common today is, it is  _  our control . \" The young man still wanted to ask something, while the wise man  _  him and said, \"When we are talking about the meaning of today, we have  _  a lot of it. \" The young man nodded and then went down the mountain. Actually, today is the only  _  we have. So, what we should do now is to  _  yesterday and tomorrow and catch fast today!", 
    "options": [
        [
            "important", 
            "necessary", 
            "comfortable", 
            "funny"
        ], 
        [
            "miss", 
            "die", 
            "grow", 
            "start"
        ], 
        [
            "awful", 
            "pleased", 
            "surprised", 
            "excited"
        ], 
        [
            "yet", 
            "already", 
            "ever", 
            "still"
        ], 
        [
            "for", 
            "under", 
            "on", 
            "with"
        ], 
        [
            "stopped", 
            "refused", 
            "encouraged", 
            "ordered"
        ], 
        [
            "treasured", 
            "handed", 
            "wasted", 
            "avoided"
        ], 
        [
            "excuse", 
            "way", 
            "chance", 
            "plan"
        ], 
        [
            "forget", 
            "remember", 
            "call", 
            "treat"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "C", 
        "D", 
        "B", 
        "A", 
        "C", 
        "C", 
        "A"
    ], 
    "source": "middle1794"
}