{
    "article": "One day, I was reading a newspaper when my wife called, \"Will you  _  here and make your baby daughter eat her food?\" I threw the  _  away and rushed to my 8-year-old daughter, Sinduja. In front of her was a bowl full of rice. She said to me, \"Dad,  _  I eat all the rice, will you give me whatever I ask for? \" \"Certainly, \"I promised. \"Dad, I want to have my hair  cut off  from my head this Sunday! \" she said. I felt a little surprised. \"Sinduja, why don't you ask for something else? We will be  _  when seeing you with a clean-shavenhead.\" \"Dad, you have promised to give me  _  I ask for. \" Sinduja cried. \"Now, you are breaking your promise! \" On Monday morning, I dropped her at the  _  I watched my hairless Sinduja walking towards her classroom. Just then, a boy with a  _  head got down from a car, and shouted, \"Sinduja, please  _  for me! \" \"Sir, your daughter Sinduja is  _  indeed! \" A lady got out of the  _  and continued, \"That boy who is walking along with your daughter is my son, Harish. He is suffering...... from leukemia. He  _  all his hair because of the side effects of the chemotherapy. He was afraid that his classmates would laugh at him, so he  _  to come back to school. Sinduja visited him last week. I  _  imagined she would give up her lovely hair for my son! \" I stood there, unable to move or speak. \"Thank you, my little Angel. You are teaching me how selflessreal love is!\" I thought. The  _  people on this planet are those who live for the ones they love!", 
    "options": [
        [
            "come", 
            "go", 
            "ride", 
            "drive"
        ], 
        [
            "book", 
            "paper", 
            "picture", 
            "magazine"
        ], 
        [
            "though", 
            "until", 
            "because", 
            "if"
        ], 
        [
            "happy", 
            "sad", 
            "confident", 
            "excited"
        ], 
        [
            "something", 
            "anything", 
            "nothing", 
            "none"
        ], 
        [
            "library", 
            "cinema", 
            "museum", 
            "school"
        ], 
        [
            "hairless", 
            "smart", 
            "big", 
            "good-looking"
        ], 
        [
            "look", 
            "ask", 
            "wait", 
            "search"
        ], 
        [
            "patient", 
            "funny", 
            "great", 
            "fashionable"
        ], 
        [
            "bus", 
            "taxi", 
            "van", 
            "car"
        ], 
        [
            "lost", 
            "got", 
            "grew", 
            "had"
        ], 
        [
            "wanted", 
            "hoped", 
            "refused", 
            "decided"
        ], 
        [
            "always", 
            "sometimes", 
            "almost", 
            "never"
        ], 
        [
            "richest", 
            "happiest", 
            "luckiest", 
            "healthiest"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "D", 
        "B", 
        "B", 
        "D", 
        "A", 
        "C", 
        "C", 
        "D", 
        "A", 
        "C", 
        "D", 
        "B"
    ], 
    "source": "middle865"
}