{
    "article": "\"Who did this?\" asked the teacher. Sixty children tried to think  _  not only what they had done, but also what the teacher might have found out. \"Who did this?\" she asked again. She never became  _  , but she was this time. She  held up  a piece of broken glass and asked loudly, \"Who broke the window?\" \"Oh, oh,\" I thought. It was I that broke the window. I didn't do that on purpose . It was caused by a  _  throw of a basketball. Why did it have to be me? If I said it was me, I would  _  in a lot of trouble. How would I be able to pay for a big window like that? I didn't want to put up my hand,  _  something much stronger than me pulled me up. \"I did it.\" Then I didn't know  _  to say. It was hard enough saying what I had done. My teacher went to the bookshelf and took down a book. She then began walking to my desk. I thought she was going to punish me. \"I know how you like birds,\" she said as she stood looking down at my face. \"Here is a  _  about birds. It is yours now. You will not be punished. But remember, it's only  _  your honesty.\" I couldn't  _  it! I wasn't punished and I was getting a book--the very one that I had been saving up all my money to buy!", 
    "options": [
        [
            "back", 
            "for", 
            "up", 
            "about"
        ], 
        [
            "happy", 
            "angry", 
            "interested", 
            "excited"
        ], 
        [
            "good", 
            "bad", 
            "wonderful", 
            "soft"
        ], 
        [
            "have", 
            "be", 
            "take", 
            "make"
        ], 
        [
            "but", 
            "and", 
            "so", 
            "or"
        ], 
        [
            "who", 
            "what", 
            "how", 
            "when"
        ], 
        [
            "basketball", 
            "window", 
            "book", 
            "glass"
        ], 
        [
            "about", 
            "of", 
            "with", 
            "for"
        ], 
        [
            "believe", 
            "think", 
            "use", 
            "take"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "B", 
        "B", 
        "A", 
        "B", 
        "C", 
        "D", 
        "A"
    ], 
    "source": "middle1939"
}