{
    "article": "I often see some homeless people on the corner of the street. It used to make me uncomfortable to see them, and I had to ask myself, \"  _  ?\" Then, one day I saw a homeless person. I parked my car and got out. I went up to him and asked him what would make him happy. \"A hot cup of  _  ,\" he told me. So we walked across the street to a little dinner and I bought him a cup of coffee, and some bread and eggs. He talked, and I  _  . I told him now I used to look through people like him, but that day, I had decided to open my eyes and to really see the world. I told him he was the  _  homeless person I had ever spoken to. After our meal together, I asked him if there was anything else that would make his life a bit  _  . He said the only other thing he wanted was just a new pair of socks. Socks, really? He said he'd been wearing the same pair  _  a few weeks. There are always clean socks in my dresser drawer. I actually happened to be wearing a nice and new pair of socks at that very moment. I told him that I wanted to give him the pair I was wearing  _  he wouldn't mind. I had only been wearing them for a few  _  . At first, my new friend  _  . I told him it would make me happy if he would take  _  . Finally, he agreed. He was very happy to wear my socks. Now, I always have an extra pair with me in my car. They are always my best pair, just waiting to be given away...", 
    "options": [
        [
            "How", 
            "Who", 
            "Why", 
            "Where"
        ], 
        [
            "milk", 
            "juice", 
            "tea", 
            "coffee"
        ], 
        [
            "smiled", 
            "listened", 
            "laughed", 
            "cried"
        ], 
        [
            "first", 
            "second", 
            "third", 
            "last"
        ], 
        [
            "simpler", 
            "safer", 
            "easier", 
            "harder"
        ], 
        [
            "of", 
            "during", 
            "with", 
            "for"
        ], 
        [
            "even", 
            "if", 
            "though", 
            "because"
        ], 
        [
            "hours", 
            "minutes", 
            "days", 
            "weeks"
        ], 
        [
            "offered", 
            "satisfied", 
            "accepted", 
            "refused"
        ], 
        [
            "it", 
            "this", 
            "them", 
            "that"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "B", 
        "A", 
        "C", 
        "D", 
        "B", 
        "A", 
        "D", 
        "C"
    ], 
    "source": "middle1831"
}