{
    "article": "I still remember that day. I was waiting to get some _  for shopping in a bank. Among the people, I noticed a little boy carrying some sunglasses in one hand and a big bag in   the other .\nThe boy was about 10 years old. He was walking around the people inside the _ and asked them to buy his sunglasses. But _  would buy any from him. He tried from one person to another. From the look on his face, I knew he would not give up anyway.\nNow, I decided to have a _  with him. I went up and asked, \"Do you go to school?\" He nodded his head. Then I continued, \"Why do you _  sunglasses?\" He said nothing. I gave him $20 and said that I was not in _ of the sunglasses but he could keep the money. To my _ , his face changed a lot, which is still in my memory today. I didn't know  _  to say next. Then he replied,\"Either you buy sunglasses or you  _  back the money. I don't need your pity.\" I felt very  _ for what I did, and I told him that I would buy two pairs.\nI took these sunglasses home and kept _ myself, \"Did such a young boy need to do it for his self-respect ?\" He could _  take the $20 and left. But he chose to sell his sunglasses and get the money not because of others'  _ . I will remember this lesson forever.", 
    "options": [
        [
            "bags", 
            "books", 
            "money", 
            "information"
        ], 
        [
            "shop", 
            "school", 
            "hotel", 
            "bank"
        ], 
        [
            "nobody", 
            "somebody", 
            "everybody", 
            "anybody"
        ], 
        [
            "talk", 
            "decision", 
            "walk", 
            "trade"
        ], 
        [
            "send", 
            "sell", 
            "buy", 
            "give"
        ], 
        [
            "danger", 
            "need", 
            "time", 
            "trouble"
        ], 
        [
            "joy", 
            "surprise", 
            "fear", 
            "happiness"
        ], 
        [
            "how", 
            "when", 
            "where", 
            "what"
        ], 
        [
            "take", 
            "give", 
            "pay", 
            "send"
        ], 
        [
            "worried", 
            "happy", 
            "excited", 
            "sorry"
        ], 
        [
            "telling", 
            "answering", 
            "asking", 
            "watching"
        ], 
        [
            "easily", 
            "proudly", 
            "sadly", 
            "hardly"
        ], 
        [
            "joke", 
            "pity", 
            "advice", 
            "decision"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "A", 
        "A", 
        "B", 
        "B", 
        "B", 
        "D", 
        "A", 
        "D", 
        "C", 
        "A", 
        "B"
    ], 
    "source": "middle614"
}