{
    "article": "My wife wanted me to take another woman out to dinner and watch a movie. She said, \"I love you, but I know that woman also loves you and would like to spend  _  with you.\"\nThe other woman  _ my wife asked me to pay attention to was my mother. My father has been dead for many years. My mother lived  _ , but sometimes I was too busy to visit her.\nThat evening I called her and invited her to dinner and watch a movie. She seemed very _  when I arrived at her house. We went to a restaurant. My mother took my arm and walked as if she was my first lady.\n _  dinner, we had a very good conversation. It was nothing special. We simply _ the latest events in our lives. But we were so busy talking _ we missed the movie. At last, she said,\" I'll go out with you again, but only if you let me invite you.\"I agreed.\nA few days later, my mother died of a heart attack. It happened so suddenly that I didn't have a  _  to do anything for her. Not long after that, I received a payment receipt   from the restaurant as well as an attached   note:\n\"I paid the bill for our second dinner in advance . I am not sure _ I could have dinner with you or not. So I paid for two people, you and your wife. I have no words to explain how important that dinner meant to me. My son, I love you.\"\nAt that moment, I understood the importance of saying in time \"I LOVE YOU\" and giving our loved ones the time that they deserve   .  _  in life is more important than our family.", 
    "options": [
        [
            "time", 
            "money", 
            "movie", 
            "dinner"
        ], 
        [
            "whose", 
            "whom", 
            "why", 
            "which"
        ], 
        [
            "there", 
            "home", 
            "alone", 
            "herself"
        ], 
        [
            "upset", 
            "angry", 
            "worried", 
            "excited"
        ], 
        [
            "Before", 
            "During", 
            "After", 
            "When"
        ], 
        [
            "told", 
            "shared", 
            "talked", 
            "spoke"
        ], 
        [
            "and", 
            "but", 
            "that", 
            "because"
        ], 
        [
            "chance", 
            "time", 
            "hope", 
            "will"
        ], 
        [
            "that", 
            "when", 
            "where", 
            "whether"
        ], 
        [
            "Nothing", 
            "Everything", 
            "Something", 
            "Anything"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "C", 
        "D", 
        "B", 
        "B", 
        "C", 
        "A", 
        "D", 
        "A"
    ], 
    "source": "middle630"
}