{
    "article": "\"I've been writing a book, John. Do you think anyone would be interested in _ it?\" said the old lady.\nJohn took over the papers from her shaking hand and let her sit in a chair. He remembered her rich _ in the early days of the Old West. He looked through the papers. \"It's good, Grandma,\" he said gently. Then realizing that she _ hear him, he shouted into her ears. \"I think it's very good. I'll send it to a publisher  .\"\nTen days later, he reported that the publisher had read a few _ . He agreed to publish it, and he had paid $100 for the copyright  . _ money would be given as an advance  . Every month, John brought her $100 with a letter from the publisher telling about the progress of the book.\nOne morning, three months after her 100th birthday, Grandma didn't get up. The doctor told her that she couldn't _ more than a few days. She was ready to go, but she first wanted her book to be in print. John promised that she could get it very soon.\nGrandma held on until the day the book came into her hands. She proudly touched her book with her fingers, tears in her eyes. Two hours later, she died peacefully, _ holding her book.\nHer granddaughter took the book and opened it. \"Why, it's just blank   pages!\" She cried in surprise. John's face turned _ . Then the girl understood. There never was a book. It was John _ , who couldn't take away his grandmother's only hope, had written the letters and sold his car to pay the advance.", 
    "options": [
        [
            "borrowing", 
            "publishing", 
            "reading", 
            "lending"
        ], 
        [
            "advice", 
            "experiences", 
            "thoughts", 
            "family"
        ], 
        [
            "couldn't", 
            "needn't", 
            "mustn't", 
            "wouldn't"
        ], 
        [
            "words", 
            "letters", 
            "pages", 
            "books"
        ], 
        [
            "Some", 
            "Much", 
            "Enough", 
            "More"
        ], 
        [
            "die", 
            "stop", 
            "last", 
            "remain"
        ], 
        [
            "still", 
            "yet", 
            "always", 
            "then"
        ], 
        [
            "white", 
            "red", 
            "grey", 
            "yellow"
        ], 
        [
            "herself", 
            "himself", 
            "him", 
            "her"
        ]
    ], 
    "answers": [
        "B", 
        "B", 
        "A", 
        "C", 
        "D", 
        "C", 
        "A", 
        "B", 
        "B"
    ], 
    "source": "middle1992"
}