{
    "article": "If you have no special plans for your holidays, why not be a volunteer with us? Being a volunteer, you don't think only of  _  . You work, and you don't get money.  _  your helping hands can make both others and yourself happy. More and more young people are ready to  _  us. Let's share some of their stories and plans. Mary, 17 I visited the forest park with Mr Cao last week. I found there were not enough  _  there. I'm going to help the Forest Centre build new hiking paths in the mountains. It's going to be great  _  --I'll spend seven days living in a forest and enjoying the clean mountain air. I'm going to  _  with friends in the day and then sleep under the moon and stars. It will be a nice sport, and I'll be able to do  _  good at the same time. Andy, 18 This summer, I'm going to volunteer with Loving Pets Program. I  looked after  my neighbours' pets last summer. And I fell in love with dogs and cats. This summer, I will work in the  _  centre and  _  my kindness and love to more pets. I am sure to make friends with more  _  ! Haitao, 16 Some children find reading  _  . They have problems with reading. They need our help. I'll work for a  _  called Reading for Life. Every day, I'm going to help them choose and read books  _  they like. I want to be a  _  when I grow up, and I love children and reading, so this experience will help me in many ways.", 
    "options": [
        [
            "himself", 
            "yourself", 
            "herself", 
            "ourselves"
        ], 
        [
            "And", 
            "So", 
            "But", 
            "Or"
        ], 
        [
            "join", 
            "invite", 
            "help", 
            "share"
        ], 
        [
            "trees", 
            "animals", 
            "rivers", 
            "paths"
        ], 
        [
            "fun", 
            "danger", 
            "news", 
            "advertisement"
        ], 
        [
            "jog", 
            "hike", 
            "work", 
            "shop"
        ], 
        [
            "anything", 
            "something", 
            "nothing", 
            "everything"
        ], 
        [
            "sports", 
            "youth", 
            "animal", 
            "art"
        ], 
        [
            "take", 
            "show", 
            "provide", 
            "lend"
        ], 
        [
            "pets", 
            "girls", 
            "patients", 
            "teachers"
        ], 
        [
            "interesting", 
            "important", 
            "exciting", 
            "hard"
        ], 
        [
            "school", 
            "hospital", 
            "program", 
            "restaurant"
        ], 
        [
            "who", 
            "what", 
            "whose", 
            "that"
        ], 
        [
            "doctor", 
            "teacher", 
            "nurse", 
            "director"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "D", 
        "A", 
        "C", 
        "B", 
        "C", 
        "A", 
        "A", 
        "D", 
        "C", 
        "D", 
        "B"
    ], 
    "source": "middle199"
}