{
    "article": "Do you remember the name of your kindergarten  teacher? I do. Her name was Mrs White.\nI don't remember much about _ we learned in her class, but my mother once told me that we used to write a lot. And I would bring back what I wrote and she could see there were so many mistakes. _ no red corrections. And always a star. Sometimes even a Good! It worried my mother, so one day she went to _ Mrs White and asked her why she _ corrected my mistakes.\nAnd my mother says Mrs White said \"The children are just _ to get excited about using words, about forming sentences. I don't want to lose the interests with red ink . _ and grammar can wait. The wonder of _ won't... \".Maybe she didn't say it exactly like that at that moment. And what my mother gave me was the main idea of what she could remember.\nI look back now and think Mrs White must have been a rather _ teacher. She encouraged joy, wonder and excitement -- even if our expression of it was _ Because she believed a bud once nipped  never opens.\nI used to misspell \"beautiful\" a lot. Never could quite remember that the e went _ the a. It annoyed my teacher in high school very much. If I was going to use the word so often, she considered the _ I could do was spell it right. Finally the e's and a's were in their right places. Am glad I didn't wait on them though. Pretty is _ to spell but it doesn't hold as much as you mean sometimes.\nAnd thanks to Mrs White I had no worries about writing what I meant. Because Life isn't Pretty. It's Baeutiful.", 
    "options": [
        [
            "where", 
            "what", 
            "why", 
            "when"
        ], 
        [
            "But", 
            "So", 
            "And", 
            "Because"
        ], 
        [
            "chat", 
            "criticize", 
            "show", 
            "meet"
        ], 
        [
            "often", 
            "always", 
            "never", 
            "sometimes"
        ], 
        [
            "beginning", 
            "staring", 
            "thinking", 
            "opening"
        ], 
        [
            "Speaking", 
            "Reading", 
            "Listening", 
            "Spelling"
        ], 
        [
            "exams", 
            "words", 
            "exercises", 
            "homework"
        ], 
        [
            "excellent", 
            "strict", 
            "hardworking", 
            "careless"
        ], 
        [
            "right", 
            "wrong", 
            "good", 
            "bad"
        ], 
        [
            "behind", 
            "after", 
            "before", 
            "below"
        ], 
        [
            "best", 
            "worst", 
            "most", 
            "least"
        ], 
        [
            "easy", 
            "easier", 
            "funny", 
            "funnier"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "D", 
        "C", 
        "A", 
        "D", 
        "B", 
        "A", 
        "B", 
        "C", 
        "D", 
        "B"
    ], 
    "source": "middle1918"
}