{
    "article": "When Millie got up this morning, she found it was a beautiful spring day. She saw some   _  in the sky, but she didn't think about them. She woke up her dog, Eddie, and put him in the    _  . Then she drove out into the country _  a picnic with her dog.\nWhen they got to a big tree, Millie stopped her car and told Eddie to get off the car. They began to play games under the _  . How happy they were! An hour later, the wind began to blow and it turned   _ .\nMillie and Eddie were warm from running, so they didn't feel cold. When Eddie was playing with the ball, Millie  _  snowflakes   in the sky. She called Eddie, picked up the picnic things and got _  into the car. As she was driving home, the   _  became heavier and heavier. Soon all Millie could see was white all around  _ . The road became slippery   and she had to drive very _ .Then the car hit into a piece of ice and it went around in circles. She got her mobile phone and asked for _ quickly. They waited for about an hour because it was  _ for the police to drive in the snow. At  _ , the police came to  _  them. Millie was very thankful, she said she would listen to the weather report    _  going on a picnic next time.", 
    "options": [
        [
            "birds", 
            "clouds", 
            "snows", 
            "kites"
        ], 
        [
            "room", 
            "desk", 
            "car", 
            "bag"
        ], 
        [
            "on", 
            "for", 
            "with", 
            "in"
        ], 
        [
            "car", 
            "tree", 
            "bridge", 
            "desk"
        ], 
        [
            "warm", 
            "hot", 
            "cold", 
            "cool"
        ], 
        [
            "looked", 
            "saw", 
            "cleaned", 
            "put"
        ], 
        [
            "up", 
            "back", 
            "off", 
            "around"
        ], 
        [
            "rain", 
            "snow", 
            "car", 
            "dog"
        ], 
        [
            "him", 
            "us", 
            "her", 
            "himself"
        ], 
        [
            "slowly", 
            "easily", 
            "carelessly", 
            "happily"
        ], 
        [
            "apple", 
            "fire", 
            "help", 
            "water"
        ], 
        [
            "easy", 
            "nice", 
            "difficult", 
            "lucky"
        ], 
        [
            "first", 
            "end", 
            "last", 
            "least"
        ], 
        [
            "save", 
            "teach", 
            "look", 
            "visit"
        ], 
        [
            "after", 
            "in", 
            "before", 
            "when"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "B", 
        "B", 
        "C", 
        "B", 
        "B", 
        "B", 
        "C", 
        "A", 
        "C", 
        "C", 
        "C", 
        "A", 
        "C"
    ], 
    "source": "middle1376"
}