{
    "article": "The little country schoolhouse was heated by an old mal stove .A little boy had the job of coming to school early each day to start the _ and warm the room before his teacher and his classmates got there One morning they _ to find the schoolhouse burning. They dragged the little boy out of the building more dead than alive. Then he was _ taken to a nearby county hospital.\nThe doctor told the boy's mother that _ the lower part of his body was seriously burnt, he couldn't use his legs anymore. However, the _ boy made up his mind that he would walk. Unluckily his thin legs _ hung there, all but lifeless.\nFinally he returned home from the _ .Every day his mother would press his little legs, but there was no feeling, no control, _ .Yet his determination that he would walk was as _ as ever.\nWhen he wasn't in bed, he would sit in a wheelchair. One sunny day his mother wheeled him out into the yard to get some fresh air. This day, instead of sitting there, he _ himself from the chair and pulled himself across the grass,dragging his _ behind him.\nHe worked his way to the white fence around the yard. With great effort, he raised himself up on the fence. Then, he began dragging himself along the fence, _ that he would walk. He started to do this every day. There was nothing he _ more than to develop life in those legs.\nIn the end,through his determination he did stand up .He began to walk to school,then to run to school,to run _ the joy of running. Later in college he made the running team.\nStill later in Madison Square Garden this determined young man, Dr. Glenn Cunningham, ran the world's fastest mile!", 
    "options": [
        [
            "fire", 
            "class", 
            "game", 
            "story"
        ], 
        [
            "left", 
            "waited", 
            "arrived", 
            "hid"
        ], 
        [
            "clearly", 
            "quickly", 
            "suddenly", 
            "nearly"
        ], 
        [
            "when", 
            "unless", 
            "before", 
            "because"
        ], 
        [
            "honest", 
            "brave", 
            "worried", 
            "calm"
        ], 
        [
            "just", 
            "also", 
            "once", 
            "ever"
        ], 
        [
            "school", 
            "yard", 
            "hospital", 
            "square"
        ], 
        [
            "everything", 
            "anything", 
            "something", 
            "nothing"
        ], 
        [
            "strong", 
            "simple", 
            "strange", 
            "similar"
        ], 
        [
            "helped", 
            "threw", 
            "picked", 
            "enjoyed"
        ], 
        [
            "arms", 
            "chair", 
            "legs", 
            "mother"
        ], 
        [
            "believing", 
            "doubting", 
            "promising", 
            "suggesting"
        ], 
        [
            "afforded", 
            "hated", 
            "forgot", 
            "wanted"
        ], 
        [
            "to", 
            "for", 
            "from", 
            "without"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "B", 
        "D", 
        "B", 
        "A", 
        "C", 
        "D", 
        "A", 
        "B", 
        "C", 
        "A", 
        "D", 
        "B"
    ], 
    "source": "middle1115"
}