{
    "article": "When I was 18 years old, I lived with my parents on a farm.\nOne morning, my father asked me to drive him into the town, about 18 miles away, for he would attend a meeting there. We were deep in the country, so I would always look forward to going to the town. And I had just learned to drive, so I _ with pleasure. First we came to the town. Then I took the car to a nearby garage to have it parked and promised to pick dad up at 4 pm. Because I have a few _ to spend, I decided to go to the _ . However, I became so interested in the films that I forgot the _ . When the last film finished, it was 6 pm.\nI was afraid that dad would be _ and never let me drive again, so I drove back _ to meet dad and made an excuse for being late. Then dad caught me in the lie. I'll never forget _ he said to me.\n\"I'm disappointed that you feel you have to lie to me, Jack. I'm angry, not with you, but with myself. I've _ because there must be something wrong in the way I brought you up that didn't give you the confidence to tell me the truth. I'm going to _ home now and think seriously about it.\"\nDad began walking along the road. I begged all the way, telling him how sorry I was. I drove behind him for 18 miles, at a speed of 5 miles an hour. It was the most _ lesson. I have never lied to him ever since.", 
    "options": [
        [
            "said", 
            "agreed", 
            "answered", 
            "replied"
        ], 
        [
            "weeks", 
            "days", 
            "hours", 
            "minutes"
        ], 
        [
            "cinema", 
            "supermarket", 
            "restaurant", 
            "bookstore"
        ], 
        [
            "time", 
            "job", 
            "speed", 
            "way"
        ], 
        [
            "glad", 
            "polite", 
            "kind", 
            "angry"
        ], 
        [
            "slowly", 
            "quietly", 
            "easily", 
            "quickly"
        ], 
        [
            "how", 
            "what", 
            "which", 
            "that"
        ], 
        [
            "failed", 
            "cheered", 
            "succeeded", 
            "worked"
        ], 
        [
            "drive", 
            "walk", 
            "run", 
            "ride"
        ], 
        [
            "difficult", 
            "necessary", 
            "unforgettable", 
            "wonderful"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "A", 
        "D", 
        "D", 
        "B", 
        "A", 
        "B", 
        "C"
    ], 
    "source": "middle347"
}