{
    "article": "Many things can affect our feelings, such _ the environment, the people around us and the way we think of the things.\nThe environment affects your feelings. On the one hand, if the environment around you is pleasant, you are most likely to be a happy person. On the _ hand, if your environment is full of fighting and argument, you are probably going to be a pessimist .\nThe people around us affect us more easily than the environment. The way they talk, the way they act and react , and the way they live can influence our feelings easily. Maybe you like their writing, _ you would try and see if you could imitate  it. Many people like to _ other people in some way. If you are under a condition with optimists , you are going to be a pleasant person; _ , if you are with pessimists, you are not going to feel _ about yourself.\nThe last one is the way we think of the things. Different people take different actions when they face the same thing. This shows people their feelings. You could say \" Why do I have black hair while everyone else has yellow hair?\" or you could say \" Oh! I have black hair, so I must be very special!\" Can you see the _ between these?", 
    "options": [
        [
            "as", 
            "for", 
            "in", 
            "to"
        ], 
        [
            "others", 
            "other", 
            "two", 
            "another"
        ], 
        [
            "because", 
            "but", 
            "so", 
            "or"
        ], 
        [
            "write", 
            "copy", 
            "learn", 
            "see"
        ], 
        [
            "instead", 
            "also", 
            "always", 
            "although"
        ], 
        [
            "good", 
            "worried", 
            "well", 
            "nervous"
        ], 
        [
            "difference", 
            "differences", 
            "influence", 
            "influences"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "C", 
        "B", 
        "A", 
        "C", 
        "B"
    ], 
    "source": "middle1008"
}