{
    "article": "Thanksgiving is an American festival. It is celebrated  _  the fourth Thursday in November. It is a time for a special dinner among family and friends. People make short speeches and give thanks for their food.\nWe have celebrated the festival  _  the first pioneers from England arrived in America by ship in the  _  century. While they were crossing the Atlantic, many people died and after they landed, their first winter was worse  _  any English winter. The local people, the Native Americans  , taught the pioneers how to grow corn. The following year they celebrated together by eating a dinner of the new food.\nWe still celebrate Thanksgiving today with a traditional dinner. The kitchen is always the most crowded room in our house because we all help prepare the food. We lay the table and then before we begin dinner, my father gives thanks for the food,  _  we remember why we celebrate the festival. We usually eat too much, but it is only once a year! We often talk a lot and tell stories after dinner as well. When it is all  _ , everyone helps wash the dishes.\nThe festival is a very busy time for travel when friends and families come together to celebrate. During the festival, there  _  plenty of other things to see and do. We live in New York City, and we go to watch the Macy's Thanksgiving Day Parade  . The parade goes along several streets and finishes at the famous Macy's store. Thanksgiving is the start of the Christmas season, and we start  _  for presents. Football is  also  important at Thanksgiving, with many teams playing games. Like many Americans, we usually watch the games on television and enjoy ourselves very much.", 
    "options": [
        [
            "on", 
            "in", 
            "at", 
            "of"
        ], 
        [
            "since", 
            "for", 
            "as", 
            "when"
        ], 
        [
            "seventeen", 
            "seventeenth", 
            "seventeen's", 
            "seventieth"
        ], 
        [
            "then", 
            "as", 
            "for", 
            "than"
        ], 
        [
            "so", 
            "then", 
            "when", 
            "while"
        ], 
        [
            "right", 
            "over", 
            "often", 
            "ready"
        ], 
        [
            "was", 
            "is", 
            "are", 
            "were"
        ], 
        [
            "asking", 
            "giving", 
            "receiving", 
            "shopping"
        ]
    ], 
    "answers": [
        "A", 
        "A", 
        "B", 
        "D", 
        "A", 
        "B", 
        "C", 
        "D"
    ], 
    "source": "middle546"
}