{
    "article": "I am my mother's third child. When I was born, the doctor gently explained to my mother that my left arm was missing, below the elbow . Then he gave her some  _  , \"Don't treat her any  _  from the other girls. Demand more.\" And she did! My mother had to work to  _  my family. There were five girls in our family and we all had to help out. Once when I was about seven, I came out of the  _  , \"Mom, I can't peel(......) potatoes. I only have one hand.\"\"You get back to peel those potatoes, and don't ever use that as a(n)  _  for anything again!\" Of course I could peel potatoes--with my good hand, while holding them down with my other arm. There was always a way, and Mom knew it. \"If you try hard  _  ,\" she said, \"you can do anything.\" Once in the second grade, our teacher had each of us race across the monkey bars . When it was my turn, I  _  my head. Some kids laughed. I went home crying. After work the next afternoon, Mom took me back to the school playground.\"Now, pull up with your right arm,\" she advised. She stood by  _  I practiced, and she praised me when I made progress. I'll never forget the next time I was crossing the bars. The kids were standing there with their mouths open. It was the way with everything. When I  _  I can't handle things, I see Mom's smile again. She had the heart to  _  anything. And she taught me I could, too.", 
    "options": [
        [
            "warning", 
            "medicine", 
            "help", 
            "advice"
        ], 
        [
            "badly", 
            "differently", 
            "well", 
            "normally"
        ], 
        [
            "care", 
            "help", 
            "support", 
            "feed"
        ], 
        [
            "kitchen", 
            "bedroom", 
            "house", 
            "school"
        ], 
        [
            "idea", 
            "change", 
            "excuse", 
            "tool"
        ], 
        [
            "enough", 
            "too", 
            "again", 
            "often"
        ], 
        [
            "hurt", 
            "nodded", 
            "shook", 
            "turned"
        ], 
        [
            "before", 
            "as", 
            "after", 
            "until"
        ], 
        [
            "know", 
            "fear", 
            "find", 
            "realize"
        ], 
        [
            "face", 
            "teach", 
            "learn", 
            "solve"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "C", 
        "A", 
        "C", 
        "A", 
        "C", 
        "B", 
        "B", 
        "A"
    ], 
    "source": "middle1881"
}