{
    "article": "Once there lived in our town a poor family. They were so  _  that there was almost nothing in the house but a pot under a broken table. In it there was a little rice  _  from their neighbor for the coming New Year. On New Year's Eve, the wife had already fallen asleep, but the husband was  _  in bed, worrying about their life. Suddenly he heard someone breaking into the house. \"It must be a  _  ,\" he thought, \" but it doesn't matter. The thief can steal nothing. \" He didn't shout or move, but he kept watching over the thief. The thief came into the house and was only interested in the rice under the table. \"But  _  can I take it away?\" the thief thought hard. Then he had an idea. He took off his coat, put it on the ground between the bed and the table and turned  _  to take the pot. Now the husband knew what the thief would do. He  _  up the coat quickly and covered himself with it  _  the thief turned back. The thief took the pot, and poured the rice onto the coat. Then he began to feel it. But he was  _  to find that his coat was gone. \" Hey! \" he shouted out. The voice woke up the wife. She asked her husband, \" Did you hear any sound? Maybe there is a thief in the room. \" \"Shut up! \" replied her husband. \"Go back to sleep. There is no thief in the room. \" \"That's impossible,\" the thief said  _  . \"If there isn't a thief, then, where is my coat?\"", 
    "options": [
        [
            "good", 
            "kind", 
            "happy", 
            "poor"
        ], 
        [
            "borrowed", 
            "asked", 
            "lent", 
            "taken"
        ], 
        [
            "speaking", 
            "lying", 
            "talking", 
            "looking"
        ], 
        [
            "daughter", 
            "mouse", 
            "son", 
            "thief"
        ], 
        [
            "what", 
            "why", 
            "how", 
            "when"
        ], 
        [
            "around", 
            "off", 
            "over", 
            "on"
        ], 
        [
            "hung", 
            "called", 
            "picked", 
            "put"
        ], 
        [
            "before", 
            "after", 
            "until", 
            "because"
        ], 
        [
            "afraid", 
            "surprised", 
            "pleased", 
            "excited"
        ], 
        [
            "slowly", 
            "politely", 
            "carefully", 
            "loudly"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "B", 
        "D", 
        "C", 
        "C", 
        "C", 
        "A", 
        "B", 
        "D"
    ], 
    "source": "middle112"
}