{
    "article": "Stuart and Steve were twin brothers. Stuart loved to play basketball. But Steve loved to read books. One day Stuart was playing basketball  _  he fell and broke his leg. When they took him to the hospital, the doctor said he wouldn't be able to play for six months. Steve went  to visit  him and brought him books on basketball. At first Stuart wasn't going to read them. Then he began to read them and  _  that there were ways he could play basketball better. He began to think that books weren't that  _  . When Stuart's leg started getting better, Steve would help him by going for walks with him.  _  Stuart's doctor said he could start playing basketball again. Then Stuart showed Steve how to toss for baskets. Steve found that he enjoyed it. Then Stuart was ready to  join in  the basketball games. Steve went to games and enjoyed himself. They then  _  practiced basketball and read books together. So you can see, when  something bad  happens, something good may also happen. Steve showed Stuart about books and Stuart showed Steve about basketball. So you can also  _  showing others something that you like to do and they can show you something that they like to do.  In this way  you can find new things to do.", 
    "options": [
        [
            "until", 
            "when", 
            "after", 
            "where"
        ], 
        [
            "saw", 
            "looked", 
            "read", 
            "found"
        ], 
        [
            "good", 
            "bad", 
            "better", 
            "worse"
        ], 
        [
            "But", 
            "However", 
            "Finally", 
            "So"
        ], 
        [
            "always", 
            "never", 
            "seldom", 
            "much"
        ], 
        [
            "try", 
            "practice", 
            "enjoy", 
            "like"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "B", 
        "C", 
        "A", 
        "A"
    ], 
    "source": "middle2338"
}