{
    "article": "Maybe you have seen this in schools. Some students are studying nearly all the time but they just pass their exams,  _ some others may spend much less time on their books but do much better in exams. How could this happen? People used to think that hard work is the only way to  _ . But now they have understood that smart work can make them succeed, too.\nHard workers don't mind working for long hours, while smart workers always think of several different answers  _  these questions, \"Why should I suffer this?\" \"Isn't there a better way to do this?\" Thanks to these people, we can use computers instead of  the abacus  now. Progress in every field is the direct result of \"try to find a better way\" by smart workers.\nThere was a large soap factory in Japan. Once it  received  an unusual letter from someone who complained that there was no soap in the soapbox he bought.\nHow could empty soapboxes go out of the factory? The engineers checked the producing and packing. The producing was fine, but in about one in ten thousand cases, the packing machine let an empty soapbox go. There was no _  to spend a lot of money repairing the machine for such a small problem. The engineer soon worked out a solution, he put a huge X-ray machine and two large computers to find out the empty soapboxes. After teaching the workers  _  to use it, he sat down in his seat, tired.\n\"Sir, we could have solved the problems in a  _  simpler and cheaper way,\" a worker said.\n\"Really? How?\"\n\"We can put a huge fan near the packing machine. The wind  coming  from the fan will blow away the empty boxes, leaving the other boxes with soap.\"\nSee, this is smart work.  In order to  succeed, we should not only work hard like the engineer, but also think smart like this worker.", 
    "options": [
        [
            "however", 
            "and", 
            "when", 
            "while"
        ], 
        [
            "success", 
            "school", 
            "exam", 
            "question"
        ], 
        [
            "to", 
            "with", 
            "of", 
            "in"
        ], 
        [
            "way", 
            "use", 
            "need", 
            "doubt"
        ], 
        [
            "what", 
            "how", 
            "when", 
            "where"
        ], 
        [
            "very", 
            "more", 
            "far", 
            "pretty"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "A", 
        "C", 
        "B", 
        "C"
    ], 
    "source": "middle248"
}