{
    "article": "The Little Boat That Sailed Through Time\nEver since I was a 10-year-old child, the idea about depending upon myself has come into my mind though I couldn't really understand it.\nAt the mountain _ in Western Norway where my mother was born, I spent the summer of my childhood. _ my grandfather had to work all day himself, he could spare me time.\nI still remembered that day. \"Come, I have a toy boat for you.\" A voice came into my ear. I followed him to a workroom _ . However, nothing like that was there _ a block of wood. \"Is that the boat......?\" I asked curiously. \"No one can give you what you do for _ . With your own hands, you'll make it out of the wood. Then it'll be the best boat in your heart.\" Finally, I finished it with his help. Seeing the boat _ in the lake Storvassdal, I felt _ and thought everything around nicer.\nGood times don't last long. I had to _ to America. Feeling sad, I hid my boat under a big rock at Storvassdal. Moreover, I didn't know that was the _ time I saw my grandfather.\nYears later, I returned to the mountain farm with parents and children. I searched for my boat, but _ . I was about to give up _ I touched something different under a big rock. Luckily, I found the boat which _ grandfather and me. Holding it, I felt my grandfather was there and we _ were together again.\nAs time went by, each time I held the boat, I carved  the year. My grandfather seemed _ . I went on the last trip to the farm with my granddaughter. High in the mountain, I hope they would understand the importance of the boat and its simple _ of self-reliance.", 
    "options": [
        [
            "lake", 
            "farm", 
            "village", 
            "river"
        ], 
        [
            "But", 
            "Until", 
            "Though", 
            "If"
        ], 
        [
            "excitedly", 
            "frightenedly", 
            "unhappily", 
            "unwillingly"
        ], 
        [
            "with", 
            "except", 
            "without", 
            "besides"
        ], 
        [
            "myself", 
            "yourselves", 
            "yourself", 
            "himself"
        ], 
        [
            "falling", 
            "floating", 
            "swimming", 
            "jumping"
        ], 
        [
            "proud", 
            "terrible", 
            "worried", 
            "interested"
        ], 
        [
            "walk", 
            "come", 
            "return", 
            "leave"
        ], 
        [
            "final", 
            "first", 
            "next", 
            "another"
        ], 
        [
            "succeeded", 
            "failed", 
            "lost", 
            "worked"
        ], 
        [
            "while", 
            "when", 
            "as", 
            "for"
        ], 
        [
            "connected", 
            "mixed", 
            "separated", 
            "contacted"
        ], 
        [
            "two", 
            "three", 
            "four", 
            "five"
        ], 
        [
            "far", 
            "alive", 
            "near", 
            "living"
        ], 
        [
            "news", 
            "message", 
            "word", 
            "sign"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "B", 
        "C", 
        "B", 
        "A", 
        "C", 
        "A", 
        "B", 
        "B", 
        "A", 
        "B", 
        "C", 
        "D"
    ], 
    "source": "middle2246"
}