{
    "article": "Every day cars kill or hurt many people on roads. Sometimes the drivers drive too fast or do not drive carefully enough .Some of them _ traffic rules and cause accidents.\nAccording to some researchers, it is usually the pedestrians  who cause the accidents. A lot of road users are very _ . They walk or run across the roads in front of the cars. They walk in the roads but not on the walkways. Some do not take the time to wait for the green lights and simply cross the roads against the red lights.\nMany people think accidents often happen in _ roads in large cities, but this is not always true. For example , Tokyo is one of the world's largest cities and probably one of the busiest cities. However, there are very few accidents to pedestrians. The reason is that the police there are very _ and the pedestrians are very careful . Pedestrians never cross the roads against a red light and they _ follow the traffic rules.\nDo you know alcohol  is another main cause of traffic accidents? It delays  people's response . Those who have drunk alcohol are _ in making decision. They need a few more seconds to react. Alcohol drinking is especially dangerous for motor car drivers. It is not only drivers who may have accidents after drinking, drunk pedestrians may put their lives in danger as well.", 
    "options": [
        [
            "make", 
            "break", 
            "follow", 
            "remember"
        ], 
        [
            "tired", 
            "careful", 
            "careless", 
            "afraid"
        ], 
        [
            "busy", 
            "wide", 
            "clean", 
            "new"
        ], 
        [
            "lazy", 
            "polite", 
            "patient", 
            "strict"
        ], 
        [
            "even", 
            "never", 
            "hardly", 
            "always"
        ], 
        [
            "slow", 
            "active", 
            "excited", 
            "lazy"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "D", 
        "D", 
        "A"
    ], 
    "source": "middle1499"
}