{
    "article": "Parents can be a great example for their children. A man always stands out on different corners of our city. He holds a sign that _ \"Will work for food for my family\". _ I don't have too much money to help him. Many times my mom is with me and she makes me pull over  and she will _ him some money.\nTonight, I was on my way to the store to get _ when I saw the man. My daughter and her friend were waiting in the car. We all felt so _ that this man was standing out in the cold, wet weather. Many people say that he should be able to work. Either way, I don't feel it is my place to _ . As I was sharing that feeling with my daughter and her friend, I decided that I needed to _ this man. For one I wanted to show the girls the importance of helping others, and not worrying whether they were trying hard or not.\nI believe that if he is standing out on different corners all day and night, _ the weather is, he must really need the help.\nSo, when we pulled over to give him some money, I said, \"God bless you,\" and he said it back to us. We got him a hot chocolate and a hamburger because we were worried about him being _ . He was so sweet and very thankful.\nAll of us left with smiles, especially me! Because, as we were pulling away, the girls were talking about ways they could _ money to help him and others like him. It was the best trip I had ever made to get milk!", 
    "options": [
        [
            "writes", 
            "notices", 
            "reads", 
            "calls"
        ], 
        [
            "Normally", 
            "Gradually", 
            "Curiously", 
            "Luckily"
        ], 
        [
            "lend", 
            "hand", 
            "promise", 
            "allow"
        ], 
        [
            "chocolate", 
            "hamburger", 
            "bread", 
            "milk"
        ], 
        [
            "comfortable", 
            "dangerous", 
            "awful", 
            "strange"
        ], 
        [
            "park", 
            "live", 
            "sit", 
            "judge"
        ], 
        [
            "leave", 
            "help", 
            "refuse", 
            "teach"
        ], 
        [
            "whatever", 
            "however", 
            "wherever", 
            "whenever"
        ], 
        [
            "helpless", 
            "eager", 
            "tired", 
            "cold"
        ], 
        [
            "raise", 
            "borrow", 
            "lose", 
            "waste"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "B", 
        "D", 
        "C", 
        "D", 
        "B", 
        "A", 
        "D", 
        "A"
    ], 
    "source": "middle532"
}