{
    "article": "Dad was having another bout  of pneumonia . I stayed with him for the weekend but had to _ to my job by Monday morning. Local relatives would come and make sure he got his _ medicine and took him to his doctor appointments. But I longed to be able to let him know that we _ too, though we weren't with him.\nThen I remembered a _ tradition I had started when our children were small. When leaving their grandparents' home after a(an) _ , each child would _ a love note in the house for their grandfather or grandmother to find after they were _ . They'd put the note under a hairbrush, next to the phone or in the microwave. For days after their going away, their grandparents would smile _ they discovered these reminders of our love.\nSo as I made up a bed for him downstairs in the living room, I began writing _ . Some were practical. \"Dad, remember to put the fish in the fridge so it wouldn't go bad.\" Some expressed my love. \"Dad, I hope you sleep _ in your new bed.\"Most notes were downstairs where he had to stay for several weeks until he regained  strength, but one note I hid _ under his pillow . \"Dad, if you have found this note, you must be feeling better. We are so _ !\" While others cared for his day-to-day needs, we, of course stayed in touch _ phone. Our notes were reminder of our concern for him during this recovery period . Just like his medicines benefitted him physically, these notes _ his mental health as well.\nSeveral weeks later, in one of our regular phone calls, I asked Dad how he was going. \"I'll tell you how I'm doing. I just found your note under my pillow!\" he said.", 
    "options": [
        [
            "get", 
            "return", 
            "come", 
            "devote"
        ], 
        [
            "popular", 
            "normal", 
            "daily", 
            "monthly"
        ], 
        [
            "worried", 
            "cared", 
            "agreed", 
            "liked"
        ], 
        [
            "school", 
            "group", 
            "nation", 
            "family"
        ], 
        [
            "visit", 
            "break", 
            "play", 
            "invitation"
        ], 
        [
            "hide", 
            "bring", 
            "pick", 
            "send"
        ], 
        [
            "staying", 
            "missing", 
            "gone", 
            "left"
        ], 
        [
            "before", 
            "as", 
            "until", 
            "since"
        ], 
        [
            "letters", 
            "notes", 
            "articles", 
            "passages"
        ], 
        [
            "alone", 
            "late", 
            "well", 
            "much"
        ], 
        [
            "away", 
            "outside", 
            "indoors", 
            "upstairs"
        ], 
        [
            "amazed", 
            "tired", 
            "nice", 
            "glad"
        ], 
        [
            "in", 
            "with", 
            "by", 
            "on"
        ], 
        [
            "improved", 
            "enjoyed", 
            "replaced", 
            "increased"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "B", 
        "D", 
        "A", 
        "A", 
        "C", 
        "B", 
        "B", 
        "C", 
        "D", 
        "D", 
        "C", 
        "A"
    ], 
    "source": "middle557"
}