{
    "article": "In China, many parents try to keep their children at home. In Canada, they will sometimes push them out of the house to make them live  _  If a person over 18 chooses to stay at home, the parents may become  _  . They are afraid that their child is either lazy, or that he will become lazy if he stays at home for too long. So often they will say, \"OK, you can stay at home, but you must  _  rent .\" In some homes, the parents may make their children do their own  _  , cooking, and something like that. This is not because the parents are  _  , it's because they want to be sure their child is not too lazy. In China, parents often show their love and care  _  their children by trying to take care of all their problems. They think it is not  _  to let their children walk on the road by themselves because there are so many cars and buses, so they take their children to school in the morning, and  _  them back after school. They only want their children  to study  hard. Children try their best to get good  _  in all subjects. Usually parents care about everything of their children. They think by doing so their children will have a better life.", 
    "options": [
        [
            "away", 
            "alone", 
            "near", 
            "far"
        ], 
        [
            "worried", 
            "angry", 
            "sad", 
            "afraid"
        ], 
        [
            "pay", 
            "cost", 
            "spend", 
            "give"
        ], 
        [
            "playing", 
            "sleeping", 
            "eating", 
            "washing"
        ], 
        [
            "rude", 
            "careless", 
            "unkind", 
            "unhappy"
        ], 
        [
            "at", 
            "to", 
            "for", 
            "of"
        ], 
        [
            "dangerous", 
            "safe", 
            "right", 
            "wrong"
        ], 
        [
            "take", 
            "bring", 
            "make", 
            "carry"
        ], 
        [
            "lessons", 
            "awards", 
            "classes", 
            "grades"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "A", 
        "D", 
        "C", 
        "B", 
        "B", 
        "B", 
        "D"
    ], 
    "source": "middle1980"
}