{
    "article": "Cancer is a serious illness. People sometimes lose their hair when they fight against cancer. Delaney Clements who suffers from a kind of cancer lost her hair _ she was being treated for the disease.\n\"I've been getting a treatment called chemotherapy   and it makes my hair fall out,\" Clements told CNN.\nSo her friend, Kamryn Renfro, had her hair cut to _ Delaney. But Kamryn's school said the \"haircut\" was against the school dress rule and they didn't _ her new \"haircut\". The school asked her to stay home until her hair grew back out.\nKamryn's mother emailed the school explaining _ her daughter had her hair cut. But at first, school officials said they were no exceptions. \"The school she attends has told her not to return to school. The school's rulebook _ states that students mustn't have heads shaved,\" Kamryn's mother was _ at school's decision and then posted on Facebook.\n\"We follow the rules every year ... but honestly, I never thought my 9-year-old daughter would do something with so much _ I think she is brave and selfless,\" her mother continued.\nAfter _ a barrage from parents across the country, officials at Kamryn's school changed their minds. Kamryn will be _ to continue attending her school, even with her shaved head.\nSchool officials said the dress rule was set for uniformity and a non-distracting  _ . They said exceptions could be made in special situation.", 
    "options": [
        [
            "since", 
            "while", 
            "before", 
            "till"
        ], 
        [
            "follow", 
            "copy", 
            "stand", 
            "support"
        ], 
        [
            "accept", 
            "follow", 
            "prevent", 
            "like"
        ], 
        [
            "what", 
            "how", 
            "why", 
            "when"
        ], 
        [
            "surprisingly", 
            "clearly", 
            "finally", 
            "wisely"
        ], 
        [
            "nervous", 
            "upset", 
            "touched", 
            "shocked"
        ], 
        [
            "courage", 
            "care", 
            "fear", 
            "difficultly"
        ], 
        [
            "mailing", 
            "receiving", 
            "publishing", 
            "calling"
        ], 
        [
            "wanted", 
            "helped", 
            "invited", 
            "allowed"
        ], 
        [
            "class", 
            "rule", 
            "environment", 
            "Conditions"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "A", 
        "C", 
        "B", 
        "D", 
        "A", 
        "B", 
        "D", 
        "C"
    ], 
    "source": "middle2226"
}