{
    "article": "I live in the north of New York. One day last  _  when we received our first snow, I looked out and knew that I had to stay at home. An hour later, I tried to go out to walk my dog. But to my  _  , I found my sidewalk and path were cleaned. I had no idea  _  did this good deed . I looked over to my neighbor's sidewalk. There stood the husband with also surprising looks on his face. I  _  him who did it. He also had no idea. About a week later, we had another snow and I  _  to find the snow angel . It was a good plan, but I got busy inside and  _  to keep a look out. When I remembered to look out, the sidewalk was 3  _  again. Now I believe determined to find my snow angel. I asked everyone I knew in the neighborhood. I had 3  _  here for only three years and only knew some of them. So once again my snow angel got away. I waited for the third snow. While I was reading I  _  some noise. Tears came to my eyes. I found my snow angel was an 8-year-old boy. He lives a few houses away from me,  _  he came here to clean my side-walk. For a short time I know , he is an angel for everyone, not only for me.", 
    "options": [
        [
            "spring", 
            "summer", 
            "autumn", 
            "winter"
        ], 
        [
            "excitement", 
            "surprise", 
            "worry", 
            "interest"
        ], 
        [
            "what", 
            "whose", 
            "who", 
            "when"
        ], 
        [
            "told", 
            "talked", 
            "said", 
            "asked"
        ], 
        [
            "decided", 
            "wanted", 
            "had", 
            "began"
        ], 
        [
            "had", 
            "forgot", 
            "thought", 
            "remembered"
        ], 
        [
            "noisy", 
            "quiet", 
            "clean", 
            "dirty"
        ], 
        [
            "worked", 
            "taught", 
            "come", 
            "lived"
        ], 
        [
            "listened", 
            "heard", 
            "looked", 
            "saw"
        ], 
        [
            "but", 
            "or", 
            "if", 
            "and"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "C", 
        "D", 
        "A", 
        "B", 
        "C", 
        "D", 
        "B", 
        "A"
    ], 
    "source": "middle956"
}