{
    "article": "The word \"blog\"is a short way of _ web log  . A\"blogger\" is a person who writes a blog on the Internet. Anyone can start a blog. and they can write about anything they like.\nThere are a lot of blogs on the Internet today. They give information, news and ideas to many people _ read them. And they give people a place to write their ideas and talk about other people's ideas. If you want to open a biog. the first step is to link  to the website. Then you can surf the Internet, find interesting articles and write comments about each one. This is called an online diary of links. Also there are personal diaries. The writers talk about their lives and _ there. Sometimes these blogs can be very personal.\nBlogs are growing very fast. Compared _ other websites, blogs are special in many ways. Most _ , they are updated   more often. Many blogs are updated every day, and some are updated several times a day. Also, there are many special websites for blogs, so you don't need to be a computer expert   to start your own blog.\nMany people think that as blogs become more common, news reporting will depend _ on TVs or radios, and more on people posting news to the Internet. They think that then the news will be less like a lesson, but more like a conversation, which anyone can join in .", 
    "options": [
        [
            "saying", 
            "speaking", 
            "talking", 
            "telling"
        ], 
        [
            "where", 
            "which", 
            "who", 
            "when"
        ], 
        [
            "feel", 
            "feels", 
            "feeling", 
            "feelings"
        ], 
        [
            "with", 
            "for", 
            "on", 
            "at"
        ], 
        [
            "important", 
            "importantly", 
            "difficult", 
            "difficultly"
        ], 
        [
            "few", 
            "fewer", 
            "little", 
            "less"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "D", 
        "A", 
        "B", 
        "D"
    ], 
    "source": "middle646"
}