{
    "article": "An 8-year-old child heard her parents talking about her little brother Andrew. All she knew was that he was very _ and they had no money. Only a very expensive operation could _ him.\nOne morning, the girl heard her father say to her mother: \"Only a miracle  can save Andrew now.\" The girl went to her bedroom, collected all of her money and counted it _ . She hurried to a drugstore.\n\"How can I help you?\" asked the salesman.\n\"I want to buy a miracle,\" the girl answered. \"My brother has something _ growing inside his head. My daddy says only a miracle can save him. So how much does a miracle\n _ ?\"\n\"We don't sell miracles here, my dear. I'm so sorry,\" the salesman said _ .\n\"What kind of a miracle does your brother need?\" asked a well-dressed man standing nearby.\n\"I don't know,\" she answered. \"He's really sick and needs an operation in his head. So I _ all my money.\"\n\" How much do you have?\" asked the man.\n\"$1.11,\" she answered, \" but I can try and get some more.\" She said again and again.\n\"Well, what luck,\" said the man. \"$1.11 is the _ of a miracle. Let's go to see your brother.\"\nThat man was Dr Carlton Armstrong, a famous brain doctor. The operation was _ and it wasn't long before Andrew was well again. Sometimes miracles do happen.", 
    "options": [
        [
            "happy", 
            "sick", 
            "strong", 
            "funny"
        ], 
        [
            "save", 
            "take", 
            "make", 
            "use"
        ], 
        [
            "carefully", 
            "early", 
            "really", 
            "hardly"
        ], 
        [
            "nice", 
            "clean", 
            "bad", 
            "beautiful"
        ], 
        [
            "spend", 
            "take", 
            "pay", 
            "cost"
        ], 
        [
            "happily", 
            "wisely", 
            "sadly", 
            "easily"
        ], 
        [
            "took", 
            "brought", 
            "put", 
            "sent"
        ], 
        [
            "price", 
            "power", 
            "money", 
            "prize"
        ], 
        [
            "important", 
            "expensive", 
            "difficult", 
            "successful"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "A", 
        "C", 
        "D", 
        "C", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "middle735"
}