{
    "article": "We don't have special skills but all of us can be special people. Why? Because we can volunteer.\nMary, a Canadian girl, was sad because she had a heart problem. Her classmates had always been trying to _ her up. However, they couldn't because she was so _ that she needed lots of money to have an operation  . Her parents _ to get help from the public. A TV station soon set up a call-in center for Mary. Many people called and offered to help Mary _ . At the same time, Mary's classmates donated  money, and some of them even handed out notices _ Mary's story at a local supermarket. All above helped Mary a lot. Mary and her parents really _ everyone's hard work.\nThere are lots of opportunities   for us to volunteer. The Asian Games in Guangdong, for example, need hundreds of volunteers. And volunteers are also _ in local hospitals, old people's homes, and so on. We can also help homeless people and _ people, and volunteer to clean up parks. Volunteering is not only a great way to help people, but also a great way to make new friends, to learn new skills, and to have fun.", 
    "options": [
        [
            "think", 
            "cheer", 
            "call", 
            "give"
        ], 
        [
            "tired", 
            "glad", 
            "sick", 
            "healthy"
        ], 
        [
            "finished", 
            "missed", 
            "refused", 
            "hoped"
        ], 
        [
            "in", 
            "up", 
            "down", 
            "out"
        ], 
        [
            "speaking", 
            "telling", 
            "selling", 
            "finding"
        ], 
        [
            "forgot", 
            "changed", 
            "thanked", 
            "joined"
        ], 
        [
            "hurt", 
            "offered", 
            "caused", 
            "needed"
        ], 
        [
            "lucky", 
            "happy", 
            "disabled", 
            "dead"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "D", 
        "D", 
        "B", 
        "C", 
        "D", 
        "C"
    ], 
    "source": "middle728"
}