{
    "article": "The story tell us about the British writer, Richard Savage. He was once living in London with  little  money in his pockets. In order to get some food and clothes, he wrote the story of his life and managed to have it published. But not many copies of his books were  _  in the shops, and he was still living a hard life. Because of anxiety and malnutrition , he became very weak and before long he fell  _  , and a doctor was sent for. The doctor was not rich enough, but was  interested in  literature. He tried his best to cure Savage of his illness and a week later Savage was out of danger. When he finally recovered his  _  , the doctor sent a bill to Savage for his  _  , but poor Savage had no money to pay it. The doctor waited for a month and sent another bill. Receiving no money again, the doctor went to Savage himself. \"You know you owe your life to me,\" said the doctor, \"and I should  _  some thankfulness from you.\" \"I agree,\" said the writer, \" you've done a great favour for me and if I'm not ungrateful for your kindness, I'll damage my life to you.\" With these words he handed the doctor two copies of The Life of Richard Savage. The doctor took the books home and began to  _  them carefully. \"I see I've  _  the life of a great writer,\" the doctor said to himself with a sense of pride, Maybe this is the only thing I could be really  _  of in my life.\" Five years later Savage called on the doctor to pay his bill, only to find that the doctor had already passed away.", 
    "options": [
        [
            "bought", 
            "sold", 
            "printed", 
            "showed"
        ], 
        [
            "weak", 
            "anxious", 
            "frightened", 
            "ill"
        ], 
        [
            "walk", 
            "health", 
            "movement", 
            "action"
        ], 
        [
            "care", 
            "help", 
            "attention", 
            "treatment"
        ], 
        [
            "wish", 
            "choose", 
            "get", 
            "master"
        ], 
        [
            "write", 
            "correct", 
            "improve", 
            "read"
        ], 
        [
            "made", 
            "saved", 
            "trained", 
            "taught"
        ], 
        [
            "fond", 
            "aware", 
            "proud", 
            "afraid"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "B", 
        "D", 
        "C", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "middle2038"
}