{
    "article": "When I was thirteen years old, a girl gave me an important gift. It was a smile.\nIt was the early autumn of my _ year at a new school. It's also the first year of middle school. No one knew me. I was very _ , and afraid to make friends with anyone.\nEvery time I _ the other students talking and laughing, I felt even more lonely. I could not talk to anyone about my problem, and I didn't want my parents to worry about me.\nOne day, my classmates were _ with their friends, but I sat in silence  and felt so down that everything didn't sound real. At that moment, a girl entered the classroom. I did not know who she was. She passed me and then turned back. She looked at me and, without a word, _ .\nSuddenly, I felt the  _ of something bright and friendly. It made me feel happy, lively and warm. It was like a hidden treasure .\nThat smile _ my life. I started to talk with other students. Day by day, I learnt to trust people, and they included me in their circle of friends. The _ with the bright smilehas become my best friends now, and we stick together like glue. I can talk to her about my study, feelings and hobbies, pretty much everything. I am so lucky that I met such a nice girl.\nOne day, I asked her _ she smiled at me that day. She said she could not remember!\nNow I believe that the world is like a _ . It is just what you think it is. If you think you are lonely, you might always be alone. But if you smile at it, it will always smile back!", 
    "options": [
        [
            "first", 
            "second", 
            "third", 
            "last"
        ], 
        [
            "happy", 
            "lonely", 
            "friendly", 
            "excited"
        ], 
        [
            "looked", 
            "felt", 
            "heard", 
            "missed"
        ], 
        [
            "eating", 
            "talking", 
            "drawing", 
            "dancing"
        ], 
        [
            "left", 
            "laughed", 
            "played", 
            "smiled"
        ], 
        [
            "touch", 
            "surprise", 
            "talk", 
            "experience"
        ], 
        [
            "broke", 
            "found", 
            "hit", 
            "changed"
        ], 
        [
            "teacher", 
            "volunteer", 
            "girl", 
            "boy"
        ], 
        [
            "why", 
            "when", 
            "how", 
            "what"
        ], 
        [
            "lesson", 
            "friend", 
            "game", 
            "mirror"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "C", 
        "B", 
        "D", 
        "A", 
        "D", 
        "C", 
        "A", 
        "D"
    ], 
    "source": "middle338"
}