{
    "article": "On the first day of school our teacher introduced someone we didn't know. I stood up to look around when a _ hand touched my shoulder.\nI turned around to _ a little old lady with a warm smile. She said, \"Hi, handsome. My name is Rose. I'm eighty-seven years old.\"\n\"Why are you in university at such a YOUNG age?\" I asked. She _ , \"I'm here to meet a rich husband, get married, have a couple of kids, and then retire and travel.\"\nI knew she was joking. I was curious  what might have encouraged her to be taking on this _ at her age.\n\"I always dreamed of having a university _ and now I'm getting one!\" she told me. We became friends. Every day we would talk nonstop after class. I always enjoyed listening to this \"time machine\" as she _ her wisdom and experience with me. And Rose _ made friends wherever she went.\nAt the end of the _ , we invited Rose to make a little speech. She cleared her throat and _ , \"We do not stop playing because we are old; we grow old because we stop playing. I've learned a few secrets to staying young, being happy, and achieving success. You have to laugh and find humor every day. You've got to have a dream. _ you lose your dreams, you will die.\"\n\"There is a huge difference between growing older and growing up. Anybody can grow older. That doesn't take any talent or ability. The idea is to grow up by always finding the opportunity in change.\"", 
    "options": [
        [
            "gentle", 
            "empty", 
            "smooth", 
            "clean"
        ], 
        [
            "miss", 
            "find", 
            "feel", 
            "mention"
        ], 
        [
            "expressed", 
            "shouted", 
            "replied", 
            "repeated"
        ], 
        [
            "choice", 
            "chance", 
            "change", 
            "challenge"
        ], 
        [
            "education", 
            "career", 
            "culture", 
            "job"
        ], 
        [
            "recorded", 
            "discussed", 
            "shared", 
            "explained"
        ], 
        [
            "suddenly", 
            "easily", 
            "politely", 
            "slowly"
        ], 
        [
            "meeting", 
            "month", 
            "discussion", 
            "term"
        ], 
        [
            "began", 
            "hoped", 
            "smiled", 
            "ended"
        ], 
        [
            "Though", 
            "When", 
            "Because", 
            "Before"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "C", 
        "D", 
        "A", 
        "C", 
        "B", 
        "D", 
        "A", 
        "B"
    ], 
    "source": "middle1527"
}