{
    "article": "A young mother set her feet on the pathway of the life. \"Is the way long?\"\nAnd her guide said, \"Yes, and the way is hard. And you will be old  _  you reach the end of it, but the end will be better than the beginning.\" But the young mother was happy and would not  _  anything could be better than these years. So she  _  with her children and gathered flowers for them along the way and bathed with them in the clear springs. The sun shone on them, and life was good. And the young mother cried, \" Nothing will be  _  than this.\"\nThen the night came. And the storm    _  them and the path was dark, and the children shook with  _  and cold. And the mother drew them close and covered them with her clothes, and the children said, \" Oh, Mum, we are not afraid, for you are  _ , and we know that no harm   can come to us.\" And the mother said, \"This is better than the  _  of the day, for I have taught my  _  courage.\"\nAnd the morning came. There was a hill ahead, and the children  _  it and soon grew tired. And the mother was  _ , too. But she said to the children, \" A little patience and we are there.\" So the children climbed and climbed, and when they reached the top, they said, \"Mum, we  _  not have done it without you.\" And when the mother lay down to sleep that night, she  looked up at the stars and said, \"This is a better day than the  _  , for my children have learned determination  in the face of  _ . Yesterday I gave them courage--today I gave them strength.\"", 
    "options": [
        [
            "after", 
            "before", 
            "since", 
            "until"
        ], 
        [
            "know", 
            "believe", 
            "feel", 
            "find"
        ], 
        [
            "worked", 
            "stayed", 
            "played", 
            "studied"
        ], 
        [
            "worse", 
            "better", 
            "easier", 
            "sadder"
        ], 
        [
            "hit", 
            "beat", 
            "took", 
            "carried"
        ], 
        [
            "excitement", 
            "happiness", 
            "interest", 
            "fear"
        ], 
        [
            "far", 
            "away", 
            "near", 
            "out"
        ], 
        [
            "coldest", 
            "coolest", 
            "darkest", 
            "brightest"
        ], 
        [
            "students", 
            "classmates", 
            "friends", 
            "children"
        ], 
        [
            "walked", 
            "moved", 
            "climbed", 
            "flew"
        ], 
        [
            "tired", 
            "happy", 
            "angry", 
            "proud"
        ], 
        [
            "will", 
            "can", 
            "could", 
            "shouldn't"
        ], 
        [
            "last", 
            "next", 
            "latest", 
            "second"
        ], 
        [
            "dark", 
            "difficulties", 
            "failure", 
            "success"
        ]
    ], 
    "answers": [
        "B", 
        "B", 
        "C", 
        "B", 
        "A", 
        "D", 
        "C", 
        "D", 
        "D", 
        "C", 
        "A", 
        "C", 
        "A", 
        "B"
    ], 
    "source": "middle1893"
}