{
    "article": "This morning, I got a funny feeling. Today I had to give a report in my  _  , and I had been afraid to do so for a long time. Mom came into the kitchen, asking , \"Are you ready,  _  ?\" \" Yes.\" I answered quietly.  _  On my way  _  school, I could feel my heart beating. I hated this! I went into Mrs. Owens' class. She was smiling, and saying  _  to all her students as she did every morning. \" Hi, Sam,\" she said to me as I walked  into  the classroom. \" Hi,\" I said and quickly sat in my  seat  . I looked at the clock. The time was near. Then Mrs. Owens started, \" Sam, it's time for you to show yourself.\" \"Show  _  ? Oh, no!\" I got up slowly,  looking at  the ground as I walked to the front of the class. Then, I looked up, and everyone was looking at me. Mrs. Owens knew I was  _  , so she came beside me, and put her hand on my back. She said to the class, \"Sam has worked very hard on his  _  ,and I know it is a very interesting report.\" Then she turned to me and asked, \"Sam,  _  did you like best about your report on Hawaii?\" I thought about the fun things I  read  about surfing before, and I started to talk. I talked and talked  in front of  the whole class, and I was not nervous at all. It was great fun. It wasn't frightening. The class cheered as I finished and Mrs. Owens was  _  . In fact, I can do better than I think I can-- if I try! I am proud of myself.", 
    "options": [
        [
            "class", 
            "house", 
            "party", 
            "hometown"
        ], 
        [
            "friends", 
            "classmates", 
            "Owens", 
            "Sam"
        ], 
        [
            "Then", 
            "But", 
            "So", 
            "Or"
        ], 
        [
            "on", 
            "from", 
            "to", 
            "in"
        ], 
        [
            "sorry", 
            "hello", 
            "goodbye", 
            "thanks"
        ], 
        [
            "me", 
            "us", 
            "myself", 
            "ourselves"
        ], 
        [
            "glad", 
            "stressed", 
            "active", 
            "happy"
        ], 
        [
            "dictionary", 
            "magazine", 
            "newspaper", 
            "report"
        ], 
        [
            "what", 
            "who", 
            "where", 
            "whom"
        ], 
        [
            "playing", 
            "dancing", 
            "singing", 
            "smiling"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "B", 
        "C", 
        "B", 
        "C", 
        "B", 
        "D", 
        "A", 
        "D"
    ], 
    "source": "middle1035"
}