{
    "article": "Mel Kiser was driving along a busy highway in Columbus, Ohio. He saw an armored truck  a few cars ahead of him. Suddenly the back door of the armored truck _ , and a blue plastic bag fell out of the truck. A car in front of Mr. Kiser hit the bag. And money spilled  out of it. Then another bag fell out of the truck, and another. Money was _  everywhere.\nAt first, drivers thought the  _  papers on the highway were leaves. Then they realized that the papers were not leaves--they were money! Drivers quickly stopped right in the middle of the highway and jumped out of their cars. They began  picking up  money! They were putting ten, twenty, and one-hundred-dollar bills into their pocket. Mr. Kiser also got out of his car. He took hold of a bag of money, put the bag in his car, and drove away.\nLater, Mr. Kiser _ the money. He had$57000. For the next two hours Mr. Kiser thought about the money. He  _ about spending it. He needed a new TV set for his house. He wanted to take a vacation in Florida. But he decided to return the money. He drove to the police station and gave the police the$57000. There other people _  money, too. But most of the money--almost one million dollars were still missing. The truck company _ a 10 percent reward. \"If you return $1000, for example, we will pay you$100,\"the company said.\nThen the company got some  _  . A man telephoned and said, \"I was driving along the highway when I saw the traffic jam and the money. People were _  everywhere. I had a camera in my car and I took some pictures. Would you like the pictures?\"\n\"Yes!\" answered the truck company. The company gave the pictures to the police. The police looked _  at the pictures. They looked at the cars, the license plates, and the people's  _ . They tried to find the people who had taken the money, but they didn't have much  _ .\nOne man who had taken money _ a Columbus newspaper. The man did not give his name. \"I took two bags of money,\" he said, \"I'm going to take this money and  _ Columbus. I have enough money for the rest of my life. \"", 
    "options": [
        [
            "broke", 
            "dropped", 
            "shut", 
            "opened"
        ], 
        [
            "lying", 
            "falling", 
            "flying", 
            "showing"
        ], 
        [
            "green", 
            "yellow", 
            "red", 
            "white"
        ], 
        [
            "spent", 
            "hid", 
            "counted", 
            "exchanged"
        ], 
        [
            "complained", 
            "dreamed", 
            "worried", 
            "cared"
        ], 
        [
            "made", 
            "received", 
            "refused", 
            "returned"
        ], 
        [
            "paid", 
            "offered", 
            "accepted", 
            "wasted"
        ], 
        [
            "help", 
            "trouble", 
            "money", 
            "time"
        ], 
        [
            "running", 
            "jumping", 
            "watching", 
            "stealing"
        ], 
        [
            "quickly", 
            "carelessly", 
            "angrily", 
            "closely"
        ], 
        [
            "pockets", 
            "faces", 
            "names", 
            "ages"
        ], 
        [
            "chance", 
            "fun", 
            "luck", 
            "experience"
        ], 
        [
            "visited", 
            "helped", 
            "telephoned", 
            "invited"
        ], 
        [
            "leave", 
            "buy", 
            "traveled", 
            "developed"
        ]
    ], 
    "answers": [
        "D", 
        "C", 
        "A", 
        "C", 
        "B", 
        "D", 
        "B", 
        "A", 
        "A", 
        "D", 
        "B", 
        "C", 
        "C", 
        "A"
    ], 
    "source": "middle2187"
}