{
    "article": "A recent poll  shows that fewer and fewer people in the United States believe  in the American dream. The poll asked the question: do you _ you can start out without money in this country, work hard and become rich? Only 64 percent of Americans said \"yes\".\nTrust  in the American dream may be disappearing. But around the world, a new dream has been getting strength--the Chinese dream.\n\"Chinese dream\" has become President Xi Jinping's political slogan . But, _ is the Chinese dream? And how has President Xi started to make that dream come true?\nFor many Chinese people, it is not always _ to believe in the Chinese dream. Some people _ one main reason for this is the country's pollution  problem.\" What is the most important thing you experience ? Pollution. When you're a young couple and you have kids, it's not so easy to dream. _ you have to care about your health.\"\nThe Chinese dream is not just for a _ and more powerful China, but a cleaner China. President Xi and the Chinese government know this. President Xi said,\" Every day we will _ a blue sky, green _ and clear rivers, not just in Beijing, but all across China so that our children will live in an enjoyable environment.\"", 
    "options": [
        [
            "imagine", 
            "get", 
            "know", 
            "believe"
        ], 
        [
            "which", 
            "where", 
            "what", 
            "who"
        ], 
        [
            "difficult", 
            "hard", 
            "easy", 
            "straight"
        ], 
        [
            "shout", 
            "talk", 
            "speak", 
            "say"
        ], 
        [
            "And", 
            "So", 
            "Because", 
            "But"
        ], 
        [
            "bigger", 
            "longer", 
            "richer", 
            "stronger"
        ], 
        [
            "see", 
            "look", 
            "watch", 
            "notice"
        ], 
        [
            "mountains", 
            "houses", 
            "rooms", 
            "streets"
        ]
    ], 
    "answers": [
        "D", 
        "C", 
        "C", 
        "D", 
        "C", 
        "C", 
        "A", 
        "A"
    ], 
    "source": "middle1651"
}