{
    "article": "When we think of Christmas, we probably think of _ , Christmas trees and Santa Claus. But behind all these things lies the true meaning of Christmas: the importance of sharing and giving love and joy to people around us. The story in A Christmas Carol is perhaps the best example of this.\nA Christmas Carol is a famous short novel written by British writer Charles Dickens (1812-1870). It is about an old man named Scrooge who never laughs or smiles. He only thinks about himself and is _ to share things with others. He doesn't treat others nicely. He just cares about whether he can make more money and he hates Christmas. One Christmas Eve, Scrooge sees the ghost of Jacob Marley, his dead business partner. Marley used to be just like Scrooge, so he was _ after he died. He warns Scrooge to change his ways if he doesn't want to end up like him. He also tells Scrooge to expect _ ghosts to visit him.\nThat _ , the ghosts visit Scrooge. First, the Ghost of Christmas Past takes him back to his childhood and reminds him _ his happy days as a child. Then the second ghost, the Ghost of Christmas Present, takes him to see _ others are spending Christmas this year. Everyone is happy, even poor people. The last one, the Ghost of Christmas Yet to Come, takes him to the _ . Scrooge sees that he is dead, but nobody cares. He is so _ that he wakes up in his bed and finds out it is only the next morning -- Christmas Day!\nScrooge decides to change his life and _ to be a kind person. He _ celebrates Christmas with his relatives. He also gives gifts to people in need. He now treats _ with kindness and warmth, spreading love and joy everywhere he goes. And that is the true _ of Christmas!", 
    "options": [
        [
            "prizes", 
            "gifts", 
            "fireworks", 
            "tricks"
        ], 
        [
            "unwilling", 
            "glad", 
            "ready", 
            "impatient"
        ], 
        [
            "praised", 
            "punished", 
            "saved", 
            "recommended"
        ], 
        [
            "two", 
            "three", 
            "four", 
            "five"
        ], 
        [
            "morning", 
            "noon", 
            "afternoon", 
            "night"
        ], 
        [
            "with", 
            "to", 
            "of", 
            "for"
        ], 
        [
            "how", 
            "what", 
            "when", 
            "why"
        ], 
        [
            "past", 
            "present", 
            "future", 
            "front"
        ], 
        [
            "calm", 
            "scared", 
            "angry", 
            "relaxed"
        ], 
        [
            "promises", 
            "fails", 
            "continues", 
            "forgets"
        ], 
        [
            "quietly", 
            "hardly", 
            "sadly", 
            "happily"
        ], 
        [
            "someone", 
            "anyone", 
            "everyone", 
            "nobody"
        ], 
        [
            "friendship", 
            "story", 
            "form", 
            "spirit"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "B", 
        "B", 
        "D", 
        "C", 
        "A", 
        "C", 
        "B", 
        "A", 
        "D", 
        "C", 
        "D"
    ], 
    "source": "middle2304"
}