{
    "article": "On the evening of last Sunday while I was reviewing my lessons in my room, it suddenly began to rain.  _  as usual, I stopped to listen to the rhythm of the rain. For many years, whenever it rains, I couldn't  _  listening to it and thinking of the garden in which I spent my childhood in my hometown. When I was a little girl, my family lived in a big house with a big garden in the countryside. The garden was full of flowers and  _  , with some bamboo in front of the wall. Whenever it rained, I  _  to sit in the front of the house, listening to the rhythm of the rain and watching the  _  raindrops . When small drops of rain fall from the heaven in a row , they  _  ; when the raindrops  _  the ground, a lot of small sprays will splash and then disappear slowly. I have been  _  interested in watching such a scene. Listening to the rhythm of the rain, I feel calm and peaceful in my heart. This feeling of peace makes me think a lot about life. We are the  _  of the earth, and one day we will embrace our earth and stay with her forever. Life is short and we should treasure it. Listening to the rhythm of the rain, I learn to understand the  _  of life.", 
    "options": [
        [
            "Surprised", 
            "Sad", 
            "Excited", 
            "Angry"
        ], 
        [
            "stand", 
            "stop", 
            "like", 
            "think"
        ], 
        [
            "leaves", 
            "animals", 
            "children", 
            "trees"
        ], 
        [
            "happened", 
            "wanted", 
            "wished", 
            "used"
        ], 
        [
            "falling", 
            "singing", 
            "fallen", 
            "broken"
        ], 
        [
            "make", 
            "form", 
            "cause", 
            "rise"
        ], 
        [
            "see", 
            "get", 
            "reach", 
            "cover"
        ], 
        [
            "always", 
            "never", 
            "sometimes", 
            "seldom"
        ], 
        [
            "children", 
            "owner", 
            "friends", 
            "master"
        ], 
        [
            "length", 
            "meaning", 
            "number", 
            "quality"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "D", 
        "D", 
        "A", 
        "B", 
        "C", 
        "A", 
        "A", 
        "B"
    ], 
    "source": "middle35"
}