{
    "article": "There are many ways to help improve your memory, so you shouldn't feel  _  in study.\nMy first  _  is that if you want to remember something well, you have to go over it regularly . You might go over the material two days after you learn it, then a week later, then two weeks later, and then a month later. After a month you will  _  that you can easily remember the material.\nMy second advice is to use a red pen to  _  lines under the important sentences in your book. This will help you in two ways. First, it will help you concentrate  on the most important parts when you learn the  _ . It is always easier to remember only the important sentences. Second, this will make reviewing easier. When you open your book, the underlined parts will  _  you the most important things immediately. In this way, you don't have to go over all the materials again.\nAnother piece of advice is to review all the information in your  _  just before you go to sleep. Your brain is working  _  you are sleeping. If you think about the information before you go to sleep, you might be able to remember it better. Another good  _  for memorizing information is in the morning because you have just rested and your brain is fresh and clear. So you might also  try to  memorize the important information in the morning.", 
    "options": [
        [
            "easy", 
            "upset", 
            "excited", 
            "useful"
        ], 
        [
            "choice", 
            "answer", 
            "advice", 
            "action"
        ], 
        [
            "forget", 
            "mention", 
            "imagine", 
            "find"
        ], 
        [
            "draw", 
            "write", 
            "think", 
            "make"
        ], 
        [
            "word", 
            "knowledge", 
            "advice", 
            "number"
        ], 
        [
            "show", 
            "lead", 
            "take", 
            "decide"
        ], 
        [
            "book", 
            "idea", 
            "dream", 
            "mind"
        ], 
        [
            "before", 
            "while", 
            "after", 
            "until"
        ], 
        [
            "result", 
            "way", 
            "time", 
            "idea"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "D", 
        "A", 
        "B", 
        "A", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "middle1625"
}