{
    "article": "I'm the type of guy who believes you can achieve anything you set your mind to, if you give it your all and don't give up.  _  , when I decided to write a novel, it didn't matter to me that I had never done anything like that before. What did matter to me was that I had a great story in my head, a story that needed to be  _  . What I thought would take a couple of months or a couple of years. After five months of writing, I at last  _  the \"finish line\" - that magical day when you type \"THE END\". Okay, so I wrote a manuscript .The first thing I did was to copy it, followed by sending it out to all of my friends who  _  a lot, to get creative criticism .And then it was back to rewriting the story. Next, I hired a professional ,who gave me great  _  ,which meant more rewriting. I soon learned a lesson in writing - writing is rewriting. There would always be  _  for improvement. I had rewritten the manuscript time and time again for two years, and in the process, I learned  _  to write. Looking back, I had no idea how long it was going to take or how hard it was going to be. Writing the manuscript was the easy part, while going on the way to write a  _  book was the hard part. Pursuing my dreams has made all the difference. Life is a journey. I can't see what  _  ahead, but I know one thing for sure: when I look  _  I see the things that I've achieved and I smile with pride.", 
    "options": [
        [
            "However", 
            "Therefore", 
            "Anyway", 
            "Otherwise"
        ], 
        [
            "made", 
            "organized", 
            "printed", 
            "born"
        ], 
        [
            "reached", 
            "got", 
            "tried", 
            "ran"
        ], 
        [
            "discussed", 
            "understood", 
            "read", 
            "praised"
        ], 
        [
            "confidence", 
            "energy", 
            "comfort", 
            "advice"
        ], 
        [
            "room", 
            "time", 
            "pleasure", 
            "experience"
        ], 
        [
            "who", 
            "when", 
            "how", 
            "why"
        ], 
        [
            "whole", 
            "successful", 
            "thick", 
            "right"
        ], 
        [
            "lies", 
            "lays", 
            "matches", 
            "follows"
        ], 
        [
            "round", 
            "up", 
            "behind", 
            "forward"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "A", 
        "C", 
        "D", 
        "A", 
        "C", 
        "B", 
        "A", 
        "C"
    ], 
    "source": "middle1413"
}