{
    "article": "There are many types of reports. A report only describes something that has happened. The commonest are  _  reports. We get them in newspapers, over the radio, on television and on the web pages. The main aim of a newspaper is to give news to the  _  . If you look at a newspaper closely, you will find that there are all types of news, accidents, floods, fires, wars, sports,  _  and so on. The news reports everything that happens to  _  and their environments. Sometimes there are news items which are very amazing. The big words  _  the news items are called headlines. Their aim is to attract attention  in order that  people will buy the newspaper to read the rest of the news. A news report is usually very short, except when it is about something very  _  , but it has a lot of information. It is often written in short paragraphs . In  _  .the first paragraph is a summary of the news items. It gives all the necessary information: what, when, where, how and why. The other paragraphs give full details of the subject. There may also be  _  with people. Their words are in quotation marks . Often there are  _  to go with the news to make it more interesting.", 
    "options": [
        [
            "news", 
            "science", 
            "weather", 
            "match"
        ], 
        [
            "young", 
            "public", 
            "rich", 
            "old"
        ], 
        [
            "hobbies", 
            "dictionaries", 
            "jobs", 
            "diaries"
        ], 
        [
            "air", 
            "traffic", 
            "people", 
            "villages"
        ], 
        [
            "across", 
            "below", 
            "behind", 
            "above"
        ], 
        [
            "important", 
            "familiar", 
            "exciting", 
            "traditional"
        ], 
        [
            "all", 
            "trouble", 
            "time", 
            "fact"
        ], 
        [
            "memories", 
            "discussions", 
            "jokes", 
            "friendships"
        ], 
        [
            "artists", 
            "photos", 
            "cameras", 
            "Lessons"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "C", 
        "C", 
        "D", 
        "A", 
        "D", 
        "B", 
        "B"
    ], 
    "source": "middle702"
}