{
    "article": "Do you have the ability to live cheaply? Now here's a true story of an American girl, Sarah.  _  she left university, she began to live in New York City on her own. She  found  a job in a publishing house, but the salary was  less than  $30,000 a year. Her parents thought her life would be hard, but Sarah  _  live on her salary and still saved $5,000 in a year. How was that  _  in one of the most expensive cities in the world? Cheap living  _  starts with keeping the big cost small. For most people, that  _  housing. So Sarah chose to share a flat with three other friends. Her next biggest cost was  _  , When she ate out, she went to cheap restaurants.  _  she bought a $9.99 whole chicken at a local restaurant. She then  _  the chicken bones home and made soup out of them. Nowadays, young people often  _  a lot of money on entertainment. But Sarah said,\" I enjoy walking  _  in New York City. I love going to museums and parks.\" Did Sarah feel poor  _  cheap living? Not really. She even managed to take two trips, one to the Netherlands,  the other  to Porland. \"Don't think of saving money as something  _  . It's a kind of game.\" She said.", 
    "options": [
        [
            "Until", 
            "Because", 
            "After", 
            "Unless"
        ], 
        [
            "can", 
            "may", 
            "could", 
            "might"
        ], 
        [
            "difficult", 
            "possible", 
            "useful", 
            "different"
        ], 
        [
            "already", 
            "never", 
            "hardly", 
            "always"
        ], 
        [
            "helps", 
            "becomes", 
            "makes", 
            "means"
        ], 
        [
            "food", 
            "rest", 
            "studying", 
            "playing"
        ], 
        [
            "Soon", 
            "Finally", 
            "Once", 
            "Again"
        ], 
        [
            "prepared", 
            "took", 
            "caught", 
            "picked"
        ], 
        [
            "pay", 
            "lend", 
            "spend", 
            "save"
        ], 
        [
            "along", 
            "up", 
            "down", 
            "around"
        ], 
        [
            "by", 
            "up", 
            "at", 
            "between"
        ], 
        [
            "hard", 
            "interesting", 
            "nice", 
            "great"
        ]
    ], 
    "answers": [
        "C", 
        "C", 
        "B", 
        "D", 
        "D", 
        "A", 
        "C", 
        "B", 
        "C", 
        "D", 
        "A", 
        "A"
    ], 
    "source": "middle459"
}