{
    "article": "The first teacher-parent meeting would be held in the school. To the little boy's disappointment , his mother said she would go. He felt  _  for her face. She was very beautiful,  _  there was a big scar   on her right face. The boy never talked about it with his mother.\nAt the  _ , the people noticed the mother's kindness and beauty  _  she had the scar. But the little boy hid himself. After the meeting, the teacher asked his mother  _ . \"How did you get the scat on your face?\" The mother answered. \" When my son was a baby, he was once in a room that caught fire. Everyone was too afraid to go in  _  the fire was out of control. At that time, I rushed in As I was running towards his bed. I saw a piece of wood coming towards his bed. I threw myself over him to protect him. I was knocked down. Luckily, a  _ came in and saved both of us. But I got the scar.\" She touched  _  face.\" This scar will be here for ever, but I have never felt sorry for what I did.\"\nAt that moment, the little boy came out _  his eyes wet. He held his mothe r's hand for the rest of the day.", 
    "options": [
        [
            "happy", 
            "pleased", 
            "angry", 
            "sorry"
        ], 
        [
            "so", 
            "that", 
            "but", 
            "and"
        ], 
        [
            "road", 
            "meeting", 
            "steet", 
            "market"
        ], 
        [
            "though", 
            "because", 
            "while", 
            "when"
        ], 
        [
            "carefully", 
            "happily", 
            "angrily", 
            "well."
        ], 
        [
            "while", 
            "yet", 
            "so", 
            "because"
        ], 
        [
            "policeman", 
            "fireman", 
            "farmer", 
            "classmate"
        ], 
        [
            "mine", 
            "its", 
            "her.", 
            "his"
        ], 
        [
            "with", 
            "without", 
            "as", 
            "and"
        ]
    ], 
    "answers": [
        "D", 
        "C", 
        "B", 
        "B", 
        "A", 
        "D", 
        "B", 
        "C", 
        "A"
    ], 
    "source": "middle1624"
}