{
    "article": "Do you like shopping on the Internet? I like to buy books online . Usually, the books online aren't _ . You needn't pay  a lot. When I want to know something about a book, I write an e-mail to the online shop for an answer . I am shy . It is not easy for me to talk to the shopkeepers in real  shops.\nSometimes online shops have pictures of the book. They can show you some pages of the book, too. I think this is very _ . I don't like to read books in shops because the shopkeepers may come and talk to me. I don't know _ to say to them.\nI can shop at midnight _ I want to. Real shops close at nine o'clock in the evening. Some people may worry that the postman  may damage  the things they _ from online shops, but I don't worry about that.\nSome people say that shopping in real shops is good because you can go with your friends and look at many different things. They call this window shopping. I don't have any friends and I don't like to talk too much---it makes me _ .\nI am _ my grandmother how to shop online. She cannot walk very far so it will make shopping easy for her if she shops online. My brother _ wants to learn how to do it. He is very busy most of the time. When he has a little free time, he can shop online.", 
    "options": [
        [
            "expensive", 
            "cheap", 
            "high", 
            "much"
        ], 
        [
            "careful", 
            "helpful", 
            "colourful", 
            "beautiful"
        ], 
        [
            "what", 
            "how", 
            "where", 
            "why"
        ], 
        [
            "and", 
            "but", 
            "if", 
            "when"
        ], 
        [
            "have", 
            "borrow", 
            "buy", 
            "sell"
        ], 
        [
            "tired", 
            "cry", 
            "happy", 
            "smart"
        ], 
        [
            "asking", 
            "studying", 
            "teaching", 
            "giving"
        ], 
        [
            "again", 
            "also", 
            "too", 
            "never"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "A", 
        "C", 
        "C", 
        "A", 
        "C", 
        "B"
    ], 
    "source": "middle1493"
}