{
    "article": "What can you do in two minutes? Cyrus Siu, 12, made a great speech in English and  _  the hearts of everyone. Siu studies at Singapore International School in Hong Kong. He  took part in  the Junior high category of the 11 \"21 Century Cup\" National High School and Primary School English Speaking Competition in Xiamen, Fujian on March 22. His speaking skills and good English won him the top  _  . Siu said his first secret to success was  _  many English books. He has read all the seven Harry Potter books, each four to five times. Now he is reading Steve Jobs: A Biography(<<>> ) \"These books may be  _  for my age, but reading helps me to learn new words,\" he said. Siu likes English-speaking movies. Super hero movies,  such as  Iron Man(<<>> ) and The Avengers(<<>> ), are his favorite. \"Every boy has the dream of becoming a super hero one day. Sometimes I imagine  _  to be one of the heroes and shout out the English lines . It's good to combine your  _  with learning English. It's also important to  _  an English-speaking environment for yourself. Siu talks to his classmates and teachers in English all day long at school.  _  his parents talk to him in Cantonese at home, he still tries to answer in English. \"There is no shortcut to studying English. Just practice, practice and practice!\"Siu said.", 
    "options": [
        [
            "won", 
            "lost", 
            "broke", 
            "made"
        ], 
        [
            "shape", 
            "price", 
            "prize", 
            "work"
        ], 
        [
            "selling", 
            "making", 
            "losing", 
            "reading"
        ], 
        [
            "interesting", 
            "difficult", 
            "helpful", 
            "easy"
        ], 
        [
            "herself", 
            "myself", 
            "ourselves", 
            "itself"
        ], 
        [
            "answers", 
            "questions", 
            "interests", 
            "problems"
        ], 
        [
            "buy", 
            "build", 
            "invite", 
            "publish"
        ], 
        [
            "Before", 
            "Though", 
            "Since", 
            "Because"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "D", 
        "B", 
        "B", 
        "C", 
        "B", 
        "B"
    ], 
    "source": "middle1971"
}