{
    "article": "Everybody has one of those days when everything goes wrong. This is what happened to Harry. One morning, he got up very  _  because his clock stopped. He  _  to shave quickly and cut himself. When he got dressed, he got blood all over his  _  , so he had to find another one. The only other shirt that was clean  needed  ironing .While he was ironing it, there was a knock at the door. It was the man to collect money for water. After he paid the water  _  and showed the man out, he found the iron had burnt a hole in his shirt. So he had to wear the one with the blood on it after all. By this time it was very late, so he  _  he couldn't go to work by bus. He  _  for a taxi to take him to work, the taxi arrived and Harry  _  in. In another part of the town, a man had killed a woman  _  a knife and was seen to run away in a taxi. When Harry's taxi stopped outside his office, a policeman  _  to be standing there. He saw the blood on Harry's shirt, and took him to the police station. He was  _  till 3 p.m.  At last  the police found out that he was not the man they wanted. When he finally arrived  _  the office at about 4 p.m., his boss  _  a look at him and told him to find  another  job.", 
    "options": [
        [
            "early", 
            "late", 
            "worriedly", 
            "fast"
        ], 
        [
            "tried", 
            "hoped", 
            "wished", 
            "wanted"
        ], 
        [
            "coat", 
            "sweater", 
            "jacket", 
            "shirt"
        ], 
        [
            "money", 
            "change", 
            "bill", 
            "pay"
        ], 
        [
            "wondered", 
            "thought", 
            "believed", 
            "decided"
        ], 
        [
            "looked", 
            "wished", 
            "waited", 
            "telephoned"
        ], 
        [
            "got", 
            "sat", 
            "came", 
            "entered"
        ], 
        [
            "by", 
            "with", 
            "in", 
            "through"
        ], 
        [
            "seemed", 
            "said", 
            "happened", 
            "appeared"
        ], 
        [
            "stopped", 
            "caught", 
            "left", 
            "kept"
        ], 
        [
            "at", 
            "in", 
            "to", 
            "from"
        ], 
        [
            "took", 
            "gave", 
            "showed", 
            "has"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "D", 
        "C", 
        "B", 
        "D", 
        "A", 
        "B", 
        "C", 
        "D", 
        "A", 
        "A"
    ], 
    "source": "middle389"
}