{
    "article": "Have you ever had a day when everything goes wrong?Not too long ago, I was having one of those days. In low spirits, I was unhappy and  _ . I was thinking about my problems. After all, no one else was  _ the same problems as Iwas.\nI expressed my sad _ to my mother, hoping for some pity. Instead, she said, \"I heard Lily was having a difficult day, _ .Why don't you make her some cookies and we'll take them to her this afternoon?\"I didn't really want to, but decided that I didn't want to go back to my own problems just yet. I made the _ and placed them on a plate. Then I made a card with a sunflower on it and wrote a small warm and sweet note.\n That afternoon , we dropped in at my friend's house. I went to the door and rang the bell. Soon , Lily came to the door.She didn't expect our visit. So she looked at us in surprise. Before she could say _ , I rushed, \"I heard that you were having a hard day and decided to bring you something. I hope your day goes _ .\"The look on Lily's face was getting  bright in that small act, It was as if a dark sky suddenly shone with the golden rays of the sun. Her day was cheered up .\nI got back into the car and for some reason, I felt a lot better myself. That day I experienced the truth\"Those who bring  sunshine to the lives of others cannot keep it from themselves.\"", 
    "options": [
        [
            "excited", 
            "angry", 
            "pleased", 
            "sad"
        ], 
        [
            "experiencing", 
            "expecting", 
            "exercising", 
            "explaining"
        ], 
        [
            "plan", 
            "idea", 
            "state", 
            "result"
        ], 
        [
            "also", 
            "too", 
            "either", 
            "neither"
        ], 
        [
            "hamburgers", 
            "cookies", 
            "cakes", 
            "bread"
        ], 
        [
            "anything", 
            "something", 
            "nothing", 
            "everything"
        ], 
        [
            "bad", 
            "well", 
            "worse", 
            "better"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "C", 
        "B", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "middle1856"
}