{
    "article": "The terrible story of the whale As soon as he finished his homework, Eric jumped on his bicycle and rode off in the direction of the beach. While he was  _  along, he thought about the whales. He hoped he would see them again today. After he got to the beach, Eric  _  his bicycle behind a bush so that no one could see it from the road. Then he ran down to the beach.  _  it was only four in the afternoon, the sky was already getting dark. Eric Frowned . If it  _  , he wouldn't be able to see the whales because they would stay in deeper water. He hurried along the beach  _  the rocks. They were the best places to watch the whales because of their  _  . Before Eric reached the rocks he felt a drop of water on his head. \"Oh no!\" he thought. \"Now the whales will stay in the deep water and I won't be able to  _  them!\" But just then he saw a large shape on the beach. It was a young whale! The whale was too close to the shore and got stuck on the  _  ! At first the whale didn't move at all and Eric thought it was  _  ! Then he saw its tail move weakly. Eric turned and ran in the rain as fast as he could back to his bicycle. He had to get  _  ! If they didn't get the whale back in the water soon, it would die and Eric couldn't let that happen.", 
    "options": [
        [
            "riding", 
            "running", 
            "getting", 
            "walking"
        ], 
        [
            "sent", 
            "hid", 
            "took", 
            "got"
        ], 
        [
            "As", 
            "Since", 
            "Because", 
            "Although"
        ], 
        [
            "shone", 
            "showed", 
            "rained", 
            "blew"
        ], 
        [
            "into", 
            "off", 
            "to", 
            "from"
        ], 
        [
            "length", 
            "size", 
            "height", 
            "shape"
        ], 
        [
            "see", 
            "kill", 
            "catch", 
            "save"
        ], 
        [
            "rock", 
            "beach", 
            "road", 
            "bicycle"
        ], 
        [
            "dead", 
            "pretty", 
            "lovely", 
            "alive"
        ], 
        [
            "care", 
            "water", 
            "medicine", 
            "help"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "D", 
        "C", 
        "C", 
        "C", 
        "A", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "middle2275"
}