{
    "article": "As we all know, the Internet has become part of teenagers  _  . A new reporter on 3,375 students aged from 10 to 18 in seven Chinese cities found that 38 percent of them used the Internet very  _  . Most of them get useful information and use the Internet to help in their studies, but some are not using it in a  _  way .Many are playing online games too much.  A few  even visit websites they should not look at. A teacher from Yucai Middle School says that bad things can happen if young people  _  too much time on the Internet. She had a student who used to be good at school.  But  then he started visiting unhealthy websites. He went mad ,cheated a girl and was taken away by the police. In order to help young people use the Internet  _  a good way, a textbook on good Internet behavior has started to be used in some middle schools this term. The book uses real examples to  _  students about good ways of using the Internet. The book gives useful advice such as to read news or to find helpful  _  to study. Teachers and parents all think the book is very good. The book will be a guide for teens to use the Internet. We believe it will keep students away from bad websites, and teach students  _  to be a good person in the online world.", 
    "options": [
        [
            "study", 
            "life", 
            "food", 
            "work"
        ], 
        [
            "often", 
            "never", 
            "seldom", 
            "less"
        ], 
        [
            "bad", 
            "well", 
            "right", 
            "quick"
        ], 
        [
            "cost", 
            "pay", 
            "take", 
            "spend"
        ], 
        [
            "in", 
            "at", 
            "for", 
            "with"
        ], 
        [
            "speak", 
            "teach", 
            "call", 
            "warn"
        ], 
        [
            "pictures", 
            "persons", 
            "information", 
            "people"
        ], 
        [
            "what", 
            "which", 
            "how", 
            "when"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "D", 
        "A", 
        "B", 
        "C", 
        "C"
    ], 
    "source": "middle386"
}