{
    "article": "Time is very important in our life. However, I had never realized it until I received a beautiful gold watch from my father one day when I was 19 years old. This  _  always tells me the importance of time in my life. It was a cold rainy day. My father asked me to go to the  airport  to pick up my uncle and take him home. I should have arrived there  _  4:30 p.m. We had a basketball match at school that afternoon  _  the match was too exciting. When the match was nearly over, I suddenly remembered my uncle and  _  to the airport. It was too late. He had left the airport and taken a taxi to our house. I was very worried that my father would be  _  with me. As soon as I entered the living room, I saw my uncle in the sofa looking very tired. I dared not  look at  my uncle and father. I said hello to them in a very low voice. My father didn't say  _  . Instead, he asked me to sit next to him. \"Peter, did you have a good time today?\" He  _  very disappointed, but his voice was still calm. I felt so sorry and answered in an even  _  voice. \"Yes, Dad, but I'm really sorry about not  picking up  my uncle. This will  _  happen again. I promise.\" My father handed me a box with a beautiful gold watch inside. It was a gift my uncle bought for him. He gave it to  _  and said, \"I hope you have learned something important today, and this watch will help you remember the importance of him.\" The watch has been with me for 11 years. I wear it not because of its price, but because of  _  I learned from it. It tells me to respect  _  and never be late to do what I have promised to.", 
    "options": [
        [
            "watch", 
            "clock", 
            "bell", 
            "time"
        ], 
        [
            "before", 
            "from", 
            "after", 
            "to"
        ], 
        [
            "though", 
            "because", 
            "and", 
            "so"
        ], 
        [
            "moved", 
            "turned", 
            "hurried", 
            "flew"
        ], 
        [
            "happy", 
            "angry", 
            "sorry", 
            "lucky"
        ], 
        [
            "anything", 
            "something", 
            "nothing", 
            "everything"
        ], 
        [
            "is", 
            "was", 
            "does", 
            "did"
        ], 
        [
            "funnier", 
            "louder", 
            "happier", 
            "lower"
        ], 
        [
            "always", 
            "never", 
            "often", 
            "usually"
        ], 
        [
            "you", 
            "him", 
            "them", 
            "me"
        ], 
        [
            "what", 
            "that", 
            "which", 
            "who"
        ], 
        [
            "culture", 
            "friendship", 
            "time", 
            "family"
        ]
    ], 
    "answers": [
        "A", 
        "A", 
        "C", 
        "C", 
        "B", 
        "A", 
        "B", 
        "D", 
        "B", 
        "D", 
        "A", 
        "C"
    ], 
    "source": "middle2297"
}