{
    "article": "Happiness is for everyone.You don't need to care about those people who have beautiful houses  _  large gardens and swimming pools or those who have nice cars and a lot of money and so on. Why?  _  those who have big houses may often feel lonely and those who have cars may want to walk on the country roads at their  _  time. In fact, happiness is always around you if you put your heart into it. When you are in trouble at school, your friends will  _  you. When you study hard at your lessons, your parents are always taking good care of your life and your health. When you get  _  , your friends will say congratulations to you. When you do something wrong, people around you will help you to correct it. When you do something good to others,you will feel happy,  too  . All these are your happiness. If you notice  a bit  of them, you can see that happiness is always around you. Happiness is not the same  _  money. It is a feeling of your heart. When you are poor, you can also be very happy ,because you have something else that can't be bought with money .When you meet difficulties, you can say  _  you are very happy ,because you have more chance to challenge yourself .So you cannot always say you are poor and you have  _  luck. As the old saying goes : \"Life is like a revolving door, when it closes, it also opens .\"If you take every chance you meet ,you can be a happy and lucky person.", 
    "options": [
        [
            "use", 
            "has", 
            "with", 
            "and"
        ], 
        [
            "After", 
            "Before", 
            "If", 
            "because"
        ], 
        [
            "free", 
            "busy", 
            "happy", 
            "bad"
        ], 
        [
            "give", 
            "help", 
            "take", 
            "carry"
        ], 
        [
            "things", 
            "fruit", 
            "success", 
            "fail"
        ], 
        [
            "like", 
            "in", 
            "of", 
            "as"
        ], 
        [
            "strongly", 
            "loudly", 
            "quietly", 
            "sadly"
        ], 
        [
            "good", 
            "well", 
            "worse", 
            "bad"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "A", 
        "B", 
        "C", 
        "D", 
        "B", 
        "D"
    ], 
    "source": "middle360"
}