{
    "article": "There is an old English saying, \"Laughter is the best medicine.\" One person certainly would have agreed with this is Norman Cousins. Norman Cousins was the editor of a magazine called Saturday Review for almost forty years. He also  _  and spoke about world peace and anti-war issues , traveling to many different countries to share his  _  . In the 1960s, after returning to the United States from a busy and tiring trip to Europe. Mr. Cousins got  _  . He discovered he had a strange disease that caused great pain in his bones . In less than a week after he got back, he could not  _  it. Every move that he made was painful. He was not able to  _  at night. The doctor told Mr. Cousins that they did not know how to cure his problem and he might never  get over  the illness. Mr. Cousins, however, refused to give up hope . Mr. Cousins thought that the illness could be caused by  _  thoughts. He did not want to take  _  to cure himself. Instead, he felt that happy thoughts or laughter might cure his illness. He began to experiment on himself while still in the hospital by watching comedy shows on television. Mr. Cousins quickly found that ten minutes of  _  laughter during the day gave him two hours of pain-free sleep at night. Deciding that the  _  could not help him, Mr. Cousins left the hospital and checked into a hotel room where he could  _  his experiments with laughter. For eight days, Mr. Cousins  _  in the hotel room watching comedy shows on television, reading amusing books, and sleeping whenever he felt  _  . Within three weeks, he felt well enough to take a vacation to Puerto Rico where he began running on the beach for  _  . After a few months, Mr. Cousins was  _  to carry on his work. He had laughed himself back to health.", 
    "options": [
        [
            "laughed", 
            "taught", 
            "wrote", 
            "copied"
        ], 
        [
            "magazines", 
            "subjects", 
            "photos", 
            "ideas"
        ], 
        [
            "rich", 
            "sick", 
            "lonely", 
            "famous"
        ], 
        [
            "stand", 
            "realize", 
            "face", 
            "improve"
        ], 
        [
            "dream", 
            "eat", 
            "shout", 
            "sleep"
        ], 
        [
            "unhappy", 
            "pleasant", 
            "silly", 
            "clever"
        ], 
        [
            "food", 
            "time", 
            "medicine", 
            "money"
        ], 
        [
            "unusual", 
            "false", 
            "real", 
            "wild"
        ], 
        [
            "friends", 
            "laughter", 
            "experiment", 
            "doctors"
        ], 
        [
            "begin", 
            "end", 
            "continue", 
            "report"
        ], 
        [
            "rested", 
            "worked", 
            "studied", 
            "played"
        ], 
        [
            "well", 
            "tired", 
            "afraid", 
            "worried"
        ], 
        [
            "help", 
            "exercise", 
            "freedom", 
            "fun"
        ], 
        [
            "able", 
            "safe", 
            "lazy", 
            "uncertain"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "B", 
        "A", 
        "D", 
        "A", 
        "C", 
        "C", 
        "D", 
        "C", 
        "A", 
        "B", 
        "B", 
        "A"
    ], 
    "source": "middle1923"
}