{
    "article": "There was once a boy who was very rich and clever but nothing could make him feel happy. He had almost everything a boy could ever _ .\nOne day, his parents bought a very old mirror _  a mysterious  old man. When the mirror arrived, the boy went to _  his reflection  in it. He looked very sad indeed. He tried smiling and making funny faces, but his reflection continued with its _ expression .\nSurprised, the boy went off to buy some candy. He came home happily and looked in the mirror, but his reflection was  _  sad-looking. He bought all kinds of toys, _  forever looked sad in that mirror. Feeling angry, the boy put the mirror in a corner.\nOne afternoon he went out to  _ some fruit. On his way he saw a little boy who was _ . The rich boy went over to see what had happened. The little one told him that he had lost his _ .The rich boy bought the little boy some candy  made him happy and helped him look for his parents.  _ , after much walking, they found his parents.\nThe rich boy said goodbye to the little boy and went home _ fruit and money. Entering his room, he _  a shining light in the corner where he had put the mirror. Seeing this, he went over to the mirror, and realized that the light was coming from his own _ , so radiant  with happiness. Then he understood the _  of that mirror, the only mirror which could reflect the true happiness of its owner.", 
    "options": [
        [
            "pay", 
            "give", 
            "want", 
            "help"
        ], 
        [
            "to", 
            "for", 
            "at", 
            "from"
        ], 
        [
            "see", 
            "take", 
            "put", 
            "play"
        ], 
        [
            "relaxed", 
            "sad", 
            "angry", 
            "excited"
        ], 
        [
            "ever", 
            "just", 
            "still", 
            "even"
        ], 
        [
            "and", 
            "but", 
            "so", 
            "if"
        ], 
        [
            "make", 
            "buy", 
            "design", 
            "draw"
        ], 
        [
            "eating", 
            "studying", 
            "crying", 
            "sleeping"
        ], 
        [
            "toys", 
            "money", 
            "home", 
            "parents"
        ], 
        [
            "Especially", 
            "Mostly", 
            "Finally", 
            "Normally"
        ], 
        [
            "with", 
            "except", 
            "besides", 
            "without"
        ], 
        [
            "noticed", 
            "believed", 
            "produced", 
            "remembered"
        ], 
        [
            "family", 
            "body", 
            "experience", 
            "collection"
        ], 
        [
            "trouble", 
            "history", 
            "secret", 
            "problem"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "A", 
        "B", 
        "C", 
        "B", 
        "B", 
        "C", 
        "D", 
        "C", 
        "A", 
        "A", 
        "B", 
        "C"
    ], 
    "source": "middle2156"
}