{
    "article": "If a snake bites you, take a photo with your mobile phone! It may save your life. This is the surprising  _  of a British cook. One day Henry Jackson was working in a restaurant kitchen. He picked up a dish from the table, and  _  A few days earlier, the snake came to the  _  from Asia in a box of bananas. It climbed out of the box and  _  under the dish. \"I went to try to pick it up and it bit me again, I threw it  _  the kitchen, and it landed in the fridge. So I closed the door,\" Mr. Jackson said. Anyway, Mr. Jackson stayed  _  and he took a photo of the snake with his mobile phone. Soon his  _  began to ache and he went to hospital. Then his chest began to hurt. Doctors couldn't say what was wrong  _  they didn't know what kind of snake it was. Then Mr. Jackson remembered his mobile phone photo. The doctors  _  it to London Zoo. When they knew the kind of snake, they could give Mr. Jackson the right medicine, and he left hospital the next day. \"So my advice is this: If a snake bites you, pick up your phone. Take  _  photo first and then show the photo to the doctors,\" suggests Mr. Jackson. \"Oh, and if the snake doesn't smile for the photo, don't worry!\"", 
    "options": [
        [
            "chance", 
            "advice", 
            "excuse", 
            "business"
        ], 
        [
            "suddenly", 
            "nearly", 
            "especially", 
            "fortunately"
        ], 
        [
            "garden", 
            "hospital", 
            "restaurant", 
            "school"
        ], 
        [
            "hung", 
            "hid", 
            "jumped", 
            "ran"
        ], 
        [
            "under", 
            "into", 
            "towards", 
            "across"
        ], 
        [
            "cool", 
            "noisy", 
            "pleased", 
            "afraid"
        ], 
        [
            "foot", 
            "leg", 
            "hand", 
            "mouth"
        ], 
        [
            "but", 
            "though", 
            "so", 
            "because"
        ], 
        [
            "wrote", 
            "sent", 
            "sold", 
            "taught"
        ], 
        [
            "his", 
            "her", 
            "its", 
            "their"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "B", 
        "D", 
        "A", 
        "C", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "middle552"
}