{
    "article": "I was 15 months old, a happy and carefree kid, until the day I fell. It was a bad fall. I  _  on a piece of glass that cut my eye badly. From then on, my ugly, sightless, cloudy grey eye lived on  _  me. Sometimes people asked me embarrassing questions. Whenever the kids played  _  , I was the \"monster\". I was always imagining that everyone looked down on me. Yet mum would say to me, \"Hold your head up high and face the world.\" I began to depend on that  _  . As a child, I thought mum meant, \"Be careful, or you will fall down or run into something  _  because you are not looking.\" As a teenager, I usually looked down to  _  my shame. But I found that when I held my head up high, people liked me. In high school I even became the  _  , but on the inside I still felt like a monster. All I really wanted was to look like everyone else. When things got really bad, I would  _  to my mum and she would look at me with loving eyes and say, \"Hold your head up high and face the world. Let them see the beauty that is  _  instead of your appearance .\" My mum's love was the  _  that made me bright. I had faced hard times, and learned not only to be  _  but also to have deep compassion for others. \"Hold your head up high\" has been heard many times in my home. I tell  _  to my children. The gift my mum gave me will live on.", 
    "options": [
        [
            "stood", 
            "landed", 
            "found", 
            "worked"
        ], 
        [
            "for", 
            "like", 
            "by", 
            "with"
        ], 
        [
            "games", 
            "jokes", 
            "toys", 
            "sports"
        ], 
        [
            "glass", 
            "topic", 
            "reply", 
            "saying"
        ], 
        [
            "immediately", 
            "accidentally", 
            "continuously", 
            "expectedly"
        ], 
        [
            "show", 
            "meet", 
            "behave", 
            "hide"
        ], 
        [
            "president", 
            "teacher", 
            "teenager", 
            "adult"
        ], 
        [
            "write", 
            "add", 
            "cry", 
            "face"
        ], 
        [
            "beside", 
            "outside", 
            "inside", 
            "alongside"
        ], 
        [
            "suggestion", 
            "experience", 
            "sunshine", 
            "introduction"
        ], 
        [
            "confident", 
            "unusual", 
            "similar", 
            "ordinary"
        ], 
        [
            "it", 
            "them", 
            "that", 
            "those"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "A", 
        "D", 
        "B", 
        "D", 
        "A", 
        "C", 
        "C", 
        "C", 
        "A", 
        "A"
    ], 
    "source": "middle1054"
}