{
    "article": "For years scientists have been arguing about whether nature or nurture decides what people will be like. Is it nature-- what people are (  _  ) with-- that decides what they will be like? (  _  ) is it nurture --what(  _  ) to people when they are born --that decides what they will be like? Scientists have been studying twins to (  _  ) if they can find the answer, because twins start out with the (  _  ) DNA. Sometimes twins don't live together at birth and grow up in different (  _  ) and different places-- so the nature is the same for both, but the nurture is different. When scientists (  _  ) these twins in their later life, they some times find some surprising (  _  ). Jim Springer and Jim Lewis were adopted by two different families at birth. They first met each other again thirty-nine years (  _  ) and discovered they had a lot in (  _  ). Both had been (  _  ) twice. Their first wives were both named Linda and their second wives were both named Betty! Each twin had a son -- one called his son James Alan and the (  _  ) called his son James Alan, too. Their children each had a dog called \"Toy\". They even arrived at their first (  _  ) in the same color of car. So far twin (  _  ) seem to show that both nature and nurture are important. What we have from birth, and how and where we live help to build (  _  ) we are.", 
    "options": [
        [
            "born", 
            "grown", 
            "taught", 
            "made"
        ], 
        [
            "So", 
            "And", 
            "If", 
            "Or"
        ], 
        [
            "pretends", 
            "happens", 
            "falls", 
            "depends"
        ], 
        [
            "hear", 
            "win", 
            "see", 
            "plan"
        ], 
        [
            "nice", 
            "same", 
            "full", 
            "free"
        ], 
        [
            "families", 
            "cities", 
            "countries", 
            "nations"
        ], 
        [
            "believe", 
            "suggest", 
            "receive", 
            "compare"
        ], 
        [
            "numbers", 
            "discoveries", 
            "results", 
            "decisions"
        ], 
        [
            "ago", 
            "later", 
            "forward", 
            "behind"
        ], 
        [
            "common", 
            "fact", 
            "danger", 
            "trouble"
        ], 
        [
            "mentioned", 
            "married", 
            "succeeded", 
            "interviewed"
        ], 
        [
            "either", 
            "else", 
            "other", 
            "only"
        ], 
        [
            "competition", 
            "education", 
            "purpose", 
            "meeting"
        ], 
        [
            "studies", 
            "movies", 
            "challenges", 
            "mysteries"
        ], 
        [
            "what", 
            "when", 
            "where", 
            "who"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "B", 
        "C", 
        "B", 
        "A", 
        "D", 
        "C", 
        "B", 
        "A", 
        "B", 
        "C", 
        "D", 
        "A", 
        "D"
    ], 
    "source": "middle1945"
}