{
    "article": "Twelve-year-old Kitty O'Neil asked her coach, \"Let me try.\" She was already on the swim team, but this was different. One of the divers had not arrived, and Kitty needed much help. Her coach looked  _  at her. She had been practicing dives, but could she really stand up to the competition? Besides,  _  was completely deaf. Many people thought a person who was deaf wouldn't be able to dive well. However, Kitty  _  , and she won first place at that swimming meet and went on to win the Junior Olympics in the area. Kitty began diving with Dr. Sammy Lee, a famous coach and former Olympic diving champion. The teenager went to school in the morning and then spent most afternoons diving. It was  _  work, and Kitty often hit the water the wrong way. However, she was able to  _  practicing. While she was diving , Kitty won many gold medals, but she wanted  _  . Perhaps she learned something from her  _  . Kitty lost her hearing at the age of four months. Because she wanted Kitty to lead a normal life, Kitty's mother went to college to  _  about teaching people who are deaf. Kitty's mother finally started a school for those who are deaf. Kitty's life was  _  but normal, and as an athlete, Kitty was much bettter than others. When she gave up diving, she wanted danger and adventure. She raced cars, boats, and motorcycles. Many of these  _  usually require at least some hearing. For example many racers judge their speed by the sound of the engine. Kitty did it by  _  . In 1972 she began to learn doing dangerous action for movies and television. Soon she became one of the  _  women in Hollywood. In 1976 Kitty O'Neil also became the fastest woman in the world in a rocket-powered car that went more than 512 miles per hour.", 
    "options": [
        [
            "up", 
            "down", 
            "carefully", 
            "closely"
        ], 
        [
            "she", 
            "he", 
            "I", 
            "it"
        ], 
        [
            "worked", 
            "did", 
            "practiced", 
            "came"
        ], 
        [
            "easy", 
            "usual", 
            "pleasant", 
            "hard"
        ], 
        [
            "like", 
            "finish", 
            "keep", 
            "begin"
        ], 
        [
            "fewer", 
            "more", 
            "some", 
            "many"
        ], 
        [
            "father", 
            "mother", 
            "coach", 
            "teacher"
        ], 
        [
            "learn", 
            "read", 
            "write", 
            "listen"
        ], 
        [
            "something", 
            "anything", 
            "nothing", 
            "everything"
        ], 
        [
            "classes", 
            "meetings", 
            "activities", 
            "parties"
        ], 
        [
            "listening", 
            "learning", 
            "speaking", 
            "feeling"
        ], 
        [
            "latest", 
            "fastest", 
            "prettiest", 
            "busiest"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "B", 
        "D", 
        "C", 
        "B", 
        "B", 
        "A", 
        "C", 
        "C", 
        "D", 
        "D"
    ], 
    "source": "middle1750"
}