{
    "article": "It's spring now. New leaves come out from the tree. Everything begins to turn green. It makes us feel happy. I watch the apple trees and remember a little story. A long time ago, there was an apple tree and a little boy. The boy came and  _  around it every day. He climbed to the tree top, ate the  _  , and rest under the shadow . He loved the tree and the tree loved him. Time went by ... The little boy  _  up and no longer played around it. The old tree was very sad. It didn't know  _  . The boy said, \"I am not a kid. I want to play with toys. But I don't have money.\" \"You needn't  _  about it. Pick all my apples and sell them, you will have money.\" After that the boy didn't come back. Years later, the boy returned and the tree was happy. But  _  its surprise, the boy cut it down to build a house. Many years later the boy returned again. The old tree was happy and said to him \"Sorry, my boy. I can't give you  _  more. The only thing left is my dying roots. But you can sit down and rest here. This is your forever  _  . This is a story of everyone. The tree is our parents. When we were young, we loved playing with them. When we grow up, we  _  them, and only come to them when we need something or are in trouble. No matter what happens, parents will be there and give what they have to make us  _  . We may say the boy is cruel to the tree but that's how we are treating our parents. Nowadays, many old people feel lonely because their children don't live with them. We hope all of us try to help those old people and manage to make the old have a happy life.", 
    "options": [
        [
            "rest", 
            "played", 
            "play", 
            "eat"
        ], 
        [
            "apples", 
            "leaves", 
            "food", 
            "birds"
        ], 
        [
            "got", 
            "set", 
            "grew", 
            "took"
        ], 
        [
            "what", 
            "who", 
            "how", 
            "why"
        ], 
        [
            "worry", 
            "feel", 
            "talk", 
            "dream"
        ], 
        [
            "in", 
            "to", 
            "on", 
            "of"
        ], 
        [
            "something", 
            "everything", 
            "nothing", 
            "anything"
        ], 
        [
            "home", 
            "tree", 
            "bed", 
            "place"
        ], 
        [
            "love", 
            "leave", 
            "bring", 
            "hate"
        ], 
        [
            "angry", 
            "tired", 
            "happy", 
            "sad"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "D", 
        "A", 
        "B", 
        "D", 
        "A", 
        "B", 
        "C"
    ], 
    "source": "middle166"
}