{
    "article": "\"Wanted: Violin. Can't pay much. Call...\" That advertisement in the newspaper made me remember my childhood. I, too, had wanted a violin, but we didn't have the money. Even though times were  _  , I couldn't wait any longer to ask. \"Daddy, may I have a violin of  _  ?\" Daddy's face looked  _  . But a few weeks later, Daddy went home, with a case in his hand,  _  ,\"Mary, I found this secondhand violin for seven dollars.\" The day when I carried my violin to school for my first lesson , no one could know how  _  I was. I practiced, joined the school orchestra , gave performances......Several years seemed to run even quickly and I found myself in the first violin chair. More years  passed  , and my violin made every move with me, until one day, I carefully  _  it away. Now here  _  this want advertisement, I discovered the case deep in my closet . I put it on the table. Then I picked up the  _  , walked to the telephone and called by the  _  . Later in the day, a man of about 30 knocked at the door. \"I've been expecting someone would  _  my advertisement. My daughter wants a violin so  _  ,\"he said, examining my violin. \"How much are you asking?\" I said, \"Seven dollars.\" \"Are you sure?\" he asked,  as if  he did not believe his ears. \"Seven dollars.\" I  _  and then added,\" I hope your little girl will enjoy it  _  I did.\" I smiled, but I found my tears rolling down my face.", 
    "options": [
        [
            "easy", 
            "hard", 
            "late", 
            "long"
        ], 
        [
            "my", 
            "mine", 
            "myself", 
            "me"
        ], 
        [
            "angry", 
            "happy", 
            "sad", 
            "funny"
        ], 
        [
            "answering", 
            "saying", 
            "asking", 
            "telling"
        ], 
        [
            "surprised", 
            "excited", 
            "interested", 
            "embarrassed"
        ], 
        [
            "carried", 
            "put", 
            "took", 
            "threw"
        ], 
        [
            "about", 
            "by", 
            "in", 
            "for"
        ], 
        [
            "advertisement", 
            "violin", 
            "case", 
            "newspaper"
        ], 
        [
            "date", 
            "name", 
            "number", 
            "address"
        ], 
        [
            "offer", 
            "answer", 
            "receive", 
            "find"
        ], 
        [
            "badly", 
            "easily", 
            "quickly", 
            "luckily"
        ], 
        [
            "repeated", 
            "continued", 
            "reminded", 
            "suggested"
        ], 
        [
            "which", 
            "when", 
            "what", 
            "as"
        ]
    ], 
    "answers": [
        "B", 
        "B", 
        "C", 
        "B", 
        "B", 
        "B", 
        "D", 
        "D", 
        "C", 
        "B", 
        "A", 
        "A", 
        "D"
    ], 
    "source": "middle1212"
}