{
    "article": "There was once a rich and kind store owner. He  _  to leave all his money to an honest young man when he was old. A good friend of his had an idea and  _  him. \"The next time you are giving the customers their change. make sure you give them too much. He who returns the  _  money to you is honest.\" The rich man thought it was a good idea. so he decided to try it. However. a neighbor happened to hear the  _  . He paid a witch to cast spell on the rich old man's coins. Anyone who saw the coins  _  by the old man wouldn't see them as coins. but as something that they wanted most in the world. The neighbor believed that  _  customer would return the old man's money. Indeed. everything went according to the neighbor's  _  . When the old man had almost  given up  trying. the greedy neighbor sent his nephew to the old man's store. He had told the boy to return the old man's money.  _  when the boy received the coins. he saw in them all the money of his uncle. He didn't want to return the money and  _  with the coins. Finally. the rich old man was dying. He decided to give his servants some money so that they could live freely when he was  no longer  with them. Among these servants was a young man. who  _  and respected the old man. He saw in the money a powerful medicine. which was  _  what he most wanted in the world. On seeing this. the young man  _  the money back. saying. \"Take this. sir. It's  _  you. It will make you feel better.\" The old man felt happy that he finally found an honest person. He gave all his money to him.", 
    "options": [
        [
            "encouraged", 
            "asked", 
            "began", 
            "decided"
        ], 
        [
            "advised", 
            "warned", 
            "reminded", 
            "fooled"
        ], 
        [
            "necessary", 
            "extra", 
            "useful", 
            "surprising"
        ], 
        [
            "conversation", 
            "question", 
            "message", 
            "sound"
        ], 
        [
            "designed", 
            "created", 
            "touched", 
            "changed"
        ], 
        [
            "all", 
            "every", 
            "each", 
            "no"
        ], 
        [
            "experience", 
            "plan", 
            "try", 
            "lie"
        ], 
        [
            "So", 
            "But", 
            "And", 
            "Or"
        ], 
        [
            "sat", 
            "talked", 
            "danced", 
            "left"
        ], 
        [
            "surprised", 
            "loved", 
            "described", 
            "pleased"
        ], 
        [
            "probably", 
            "sometimes", 
            "hardly", 
            "truly"
        ], 
        [
            "brought", 
            "pulled", 
            "offered", 
            "wanted"
        ], 
        [
            "with", 
            "for", 
            "on", 
            "beside"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "B", 
        "A", 
        "C", 
        "D", 
        "B", 
        "B", 
        "D", 
        "B", 
        "A", 
        "A", 
        "B"
    ], 
    "source": "middle1704"
}