{
    "article": "A new term has begun. Teachers are  _  about the fact that new students are not easy to handle. They like to bring cellphones and MP3 players to school. What is  _  ,some students even use cellphones to do with out-of-class matters in class,or sometimes just for fun. Some other students listen to MP3 players when they are having a lesson that they are not interested in. Are these new students really that  _  ? 'Yes,' says Delaney Kirk,a professor at Drake University.  _  she adds it's not their fault. Instead, the things that they bring into school---cellphones,MP3 players and so on --- and the teachers are to blame. Kirk first began thinking about students' manners six years ago. 'I had my first class in which students were sleeping or talking to each other. It seemed that learning well  _  nothing to do with them,' she says. 'At first,I got worried about this,but then I said to myself, \"You're teaching  _  ,and you need to manage this...These students need to know more about manners. It's time to help them develop some good  _  . They shouldn't waste time doing nothing when they are young. Sooner or later,they might regret the time they have wasted.\"' Kirk also  _  : * Tell students how they will benefit by taking the class. On the first day of class,emphasize its importance  _  giving some homework that students must turn in next time. * Do not allow them to bring cellphones and MP3 players to the class at all. # Decide  _  formal and informal the class will be.", 
    "options": [
        [
            "excited", 
            "worried", 
            "surprised", 
            "interested"
        ], 
        [
            "bad", 
            "worse", 
            "good", 
            "better"
        ], 
        [
            "rude", 
            "polite", 
            "friendly", 
            "curious"
        ], 
        [
            "But", 
            "However", 
            "And", 
            "Therefore"
        ], 
        [
            "learned", 
            "did", 
            "had", 
            "shared"
        ], 
        [
            "management", 
            "English", 
            "Chinese", 
            "lessons"
        ], 
        [
            "ideas", 
            "speeches", 
            "habits", 
            "classes"
        ], 
        [
            "makes", 
            "brings", 
            "gets", 
            "takes"
        ], 
        [
            "Of", 
            "on", 
            "at", 
            "by"
        ], 
        [
            "what", 
            "how", 
            "which", 
            "Why"
        ]
    ], 
    "answers": [
        "B", 
        "B", 
        "A", 
        "A", 
        "C", 
        "D", 
        "C", 
        "A", 
        "D", 
        "B"
    ], 
    "source": "middle286"
}