{
    "article": "A Box of Memories\nAnton felt unable to smile. The school year would be over soon, and he had to move to a new city. Anton looked out of the window at his backyard. He could recall  all the summers he spent playing there with his _ . He worried about whether he would make new friends at his new school. He found it _ to imagine being away from this town.\nAnton and his father had packed  for many days. Two days before Anton left, his best friend Hector came to help. Hector was _ cheerful . Anton felt better whenever he was with him.\nWhen they were in the garage , Anton _ an old box. \"What is it? It looks strange.\" Hector helped him take it into the yard.\n\"What are you looking at, boys?\" asked Anton's father as he came into the _ . \"Oh, you found my old things,\" Anton's father said. \"We kept moving when I was a kid. I _ my old friends. So I kept things to help me remember them. Even when I was in a new home, I had those old things.\"\nHector realized that Anton was _ just as his father did. He was already thinking of a good way to help Anton.\nThe evening before Anton left, Hector asked their friends to meet at his home. Hector had _ everything.\n\"Let's fill a box with tokens  of friendship for Anton,\" began Hector. \"Our gifts can bring back memories of our years playing together.\"\nSarah put a book into the box. \"Anton likes this book a lot,\" She said. David dropped a piece of paper in. \"This joke made Anton laugh for days,\" He said. \"He can read it again and think of me.\" As more gifts were put into the box, Hector felt _ of their thoughtful actions. He asked Anton's father to hide the box on the truck.\nThree weeks later, Anton called Hector in his new house. \"I like it here. I hope you can visit me and I'll introduce you to my new friends.\" Anton said. \"It was a big surprise when I found the _ on the truck. It really helps me.\"\nWhenever Anton looked in the box, he felt better. The gifts were part of his past. And now they are part of his present.", 
    "options": [
        [
            "mother", 
            "friends", 
            "father", 
            "pets"
        ], 
        [
            "hard", 
            "funny", 
            "exciting", 
            "strange"
        ], 
        [
            "never", 
            "always", 
            "seldom", 
            "sometimes"
        ], 
        [
            "cleaned", 
            "prepared", 
            "repaired", 
            "found"
        ], 
        [
            "garden", 
            "room", 
            "yard", 
            "kitchen"
        ], 
        [
            "trusted", 
            "missed", 
            "understood", 
            "helped"
        ], 
        [
            "talking", 
            "acting", 
            "feeling", 
            "playing"
        ], 
        [
            "known", 
            "got", 
            "done", 
            "planned"
        ], 
        [
            "afraid", 
            "shy", 
            "proud", 
            "tired"
        ], 
        [
            "book", 
            "paper", 
            "card", 
            "box"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "B", 
        "D", 
        "C", 
        "B", 
        "C", 
        "D", 
        "C", 
        "D"
    ], 
    "source": "middle528"
}