{
    "article": "Creativity is the key to a bright future. Here is _ schools and parents can help their children to develop their creativity.\nDrew worked for a company in 1925. At work he invented a kind of material _ enough to hold things together. But his boss told him not to think more about the idea. Drew didn't stop and finally, using his own time, made a kind of tape, which now is used everywhere by many people. And his company learned from its _ .Now the company asked its workers to _ 15 percent of their work time just thinking about and developing new ideas.\nCreativity is not something one is just born with. A person with high intelligence does not mean that he uses it creatively. Creativity is the matter of _ your intelligence to think of new ideas that are good for something.\nWe know that many schools have tried to develop students' creativity, but some teachers only want to develop students' reading, writing and math skills, and have to give up creativity for correct answers. Children from such schools can give correct answers, but they are unable to use _ to work out problems\nIt is important to give children choices. From the earliest age, children should learn to make decisions and understand their _ . Even though it's choosing between two kinds of food _ lunch, decision-making helps thinking skills. As children grow older, parents should let their children decide how to use their time or spend their money, but not help them too much if they make the wrong decision. The child may have a _ time, but that is all right.", 
    "options": [
        [
            "when", 
            "where", 
            "how", 
            "what"
        ], 
        [
            "thick", 
            "wide", 
            "light", 
            "strong"
        ], 
        [
            "mistake", 
            "thought", 
            "suggestion", 
            "effect"
        ], 
        [
            "take", 
            "cost", 
            "spend", 
            "pay"
        ], 
        [
            "finding", 
            "using", 
            "taking", 
            "improving"
        ], 
        [
            "it", 
            "them", 
            "that", 
            "ones"
        ], 
        [
            "meanings", 
            "conversations", 
            "results", 
            "questions"
        ], 
        [
            "with", 
            "to", 
            "of", 
            "for"
        ], 
        [
            "hard", 
            "lucky", 
            "happy", 
            "mad"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "A", 
        "C", 
        "B", 
        "B", 
        "C", 
        "D", 
        "A"
    ], 
    "source": "middle2121"
}