{
    "article": "Receiving money makes me uncomfortable.\nPeople  have written  many books about \"the art of giving\". How about the art of receiving? Sometimes, it can be hard to receive a gift,  _  when you get a gift you don't want.\n\"I remember at the age of about twelve years old, my parents  _ a purple purse for me,\" laughs Guo Xiaojing. \"It really embarrassed me, to tell the truth, the purse was really ugly in my opinion! However, I pretended to like  it as I knew it would make my parents happy.\"\nHan Ling, the twenty-year-old girl agrees. \"That  reminds  me of my grandparents.  Several  years ago, my grandparents gave me an orange sweater _ my birthday. Each time  I visited them, I used to wear it. But I would take it off  as soon as I left their house. Of course, this made me feel guilty. It was a very nice thought, but my taste is totally different from  theirs  . I think it's difficult to buy clothes or other personal things for people.\n In order not to  make things more difficult, some people prefer to  give money. However, in some cultures, people may feel uncomfortable  when receiving  money. \"When I get money from someone as a gift, I just feel they are being lazy,\" says John Wilson from England. \"We also have a saying: It's the thought that counts. When someone gives me money, I don't think they thought at all. I really like to receive a gift that has some thought behind it. I don't mind if the gift is what I don't need. I'm always happy that someone has thought about a gift for me.\"\nThere are many very different thoughts on this subject from different people. So the art of receiving may be  much more  difficult than the art of giving! What's your opinion?", 
    "options": [
        [
            "specially", 
            "especially", 
            "specifically", 
            "particular"
        ], 
        [
            "get", 
            "brought", 
            "bought", 
            "gotten"
        ], 
        [
            "in", 
            "for", 
            "at", 
            "during"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "B"
    ], 
    "source": "middle1021"
}