{
    "article": "On last Christmas Day, our parents' home was full of joys of a close family relationship but this year things are _ . Our father had gone on November 26, and this was our _ Christmas without him. Mother was doing her best to be good, but I could tell this was especially _ for her. I'm not sure _ I should give her my planned Christmas gift.\nA few months earlier I had painted two pictures of my parents. I'd planned to give them as Christmas gifts.\nWhile painting one day, I was surprised by the doorbell ringing. I opened the _ . My father came. I showed _ the paintings. Finally, with tears running down his face, he said, \"I don't believe it. Look, how beautiful your mother is. Will you let me decorate them with frames ?\" I _ offered to send them to the frame shop the next day.\nSeveral _ had passed after my dad died. It seemed all _ was taken away from my mother and me. I finally remembered to call about the paintings and was glad that my father had got a chance to see the pictures _ he died. I was surprised when the shopkeeper told me my father had visited the shop, paid for the frames and had them wrapped.\nAs I looked at my mother's sad eyes and unsmiling face, I _ to give her Daddy's and my gift.\nAfter looking at the paintings and the card, with tear-filled eyes and a wide smile, she said, \" I knew Daddy would be _ us on Christmas Day!\"\nI looked at the gift card with my father's handwriting. \" Mother: Our daughter reminded me why I am so lucky. I'll be looking at you always. Daddy.\"", 
    "options": [
        [
            "usual", 
            "same", 
            "different", 
            "beautiful"
        ], 
        [
            "first", 
            "second", 
            "third", 
            "last"
        ], 
        [
            "interesting", 
            "hard", 
            "easy", 
            "proud"
        ], 
        [
            "why", 
            "if", 
            "because", 
            "so"
        ], 
        [
            "door", 
            "window", 
            "box", 
            "present"
        ], 
        [
            "it", 
            "her", 
            "them", 
            "him"
        ], 
        [
            "happily", 
            "sadly", 
            "surprisely", 
            "loudly"
        ], 
        [
            "minutes", 
            "hours", 
            "weeks", 
            "years"
        ], 
        [
            "character", 
            "luck", 
            "advice", 
            "happiness"
        ], 
        [
            "after", 
            "until", 
            "before", 
            "when"
        ], 
        [
            "happened", 
            "forgot", 
            "promised", 
            "decided"
        ], 
        [
            "for", 
            "with", 
            "on", 
            "at"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "B", 
        "B", 
        "A", 
        "D", 
        "A", 
        "C", 
        "D", 
        "C", 
        "D", 
        "B"
    ], 
    "source": "middle2024"
}