{
    "article": "What do you think a hero is? In this story, a brother and a sister have different ideas.\nIt was on Apri1 10. Kwan was excited. The newspaper was _ a writing contest . The winner's story would be printed in the newspaper!\"It says to write about someone  _ you think is a hero,\" Kwan said. \"I will write about my favorite soccer player. He's _ hero.\"\nKwan's sister, Cho, asked,\"Can I enter the contest?\"\n\"No. You're too little,\" Kwan said.\"You won't win.\" He picked up his soccer ball and went outside.\nCho knew what to do. _ , she took the newspaper. Next, she read the contest rules. Then, she began to write. \"I believe that I can win,\" she said to herself.\nWhen Cho had finished, she found her mother. She told her mother _ the contest. \"Who did you write about?\"asked Mother.\n\"I chose Rosa Parks,\" said Cho. \"She was a true _ . She believed everyone was equa1  . She wanted all people to be treated the same.\"\nOn tht morning of June 3, Kwan ran outside to get the newspaper.\"The contest winner's story will be in today's newspaper!\" he shouted\nTwo minutes _ , Kwan came back inside.\"I guess I need to reconsider  what I said to you, Cho. You are not too _ . You won the contest!\"\n\"Your story taught me a lot,\" Kwan said, \"Rosa Parks was a true hero.\"", 
    "options": [
        [
            "having", 
            "winning", 
            "losing", 
            "watching"
        ], 
        [
            "which", 
            "whose", 
            "who", 
            "what"
        ], 
        [
            "I", 
            "me", 
            "mine", 
            "my"
        ], 
        [
            "First", 
            "Then", 
            "Next", 
            "Finally"
        ], 
        [
            "with", 
            "from", 
            "on", 
            "about"
        ], 
        [
            "friend", 
            "hero", 
            "winner", 
            "actress"
        ], 
        [
            "late", 
            "later", 
            "early", 
            "earlier"
        ], 
        [
            "little", 
            "small", 
            "old", 
            "big"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "D", 
        "A", 
        "D", 
        "B", 
        "B", 
        "A"
    ], 
    "source": "middle1545"
}