{
    "article": "My parents used to tell me how important school was for me, but I didn't think so. I paid little attention to it. But one thing let me finally  _  what my parents meant. One day, when I  walked past  \"Sir, are you hiring people?\" I went  into  the shop and asked. \"Yes, but you should be the man who we need,\" the manager answered. He looked at me for a few  _  from head to foot. \"Do you have a high school diploma ?\"  _  he, \"Or do you have any work experience?\" I felt so ashamed and  _  that I didn't know what to say, so I just turned around and left. I could not fall asleep that night, and I thought a lot about my  _  . \"I must go to school or I can't do anything without a good education,\" I  _  to myself silently. I never went back to the store again  _  I finished my study and got a diploma.  _  looked the same when I returned to the store: the same people and the same design. However, compared with last time, I had more  _  . The manager told me they needed new  _  . So it was a great chance for me. I  _  my diploma to the manager. He looked at it and said, \"Great, you are in.\" Now I am still working in the same store. With this experience, I always  _  people to attend school. Education helps you have a bright future. Now I am not worried about my future because I'm still  _", 
    "options": [
        [
            "realize", 
            "remember", 
            "wonder", 
            "imagine"
        ], 
        [
            "days", 
            "hours", 
            "minutes", 
            "seconds"
        ], 
        [
            "continued", 
            "answered", 
            "warned", 
            "reported"
        ], 
        [
            "uncomfortable", 
            "impolite", 
            "unkind", 
            "impatient"
        ], 
        [
            "hobbies", 
            "future", 
            "parents", 
            "manger"
        ], 
        [
            "shouted", 
            "listened", 
            "said", 
            "cried"
        ], 
        [
            "when", 
            "while", 
            "after", 
            "before"
        ], 
        [
            "Nothing", 
            "Everything", 
            "Nobody", 
            "Everybody"
        ], 
        [
            "grade", 
            "luck", 
            "confidence", 
            "pleasure"
        ], 
        [
            "volunteers", 
            "teachers", 
            "students", 
            "workers"
        ], 
        [
            "sold", 
            "showed", 
            "sent", 
            "shook"
        ], 
        [
            "teach", 
            "allow", 
            "order", 
            "advise"
        ], 
        [
            "learning", 
            "working", 
            "playing", 
            "chatting"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "A", 
        "A", 
        "B", 
        "C", 
        "D", 
        "B", 
        "C", 
        "D", 
        "B", 
        "D", 
        "A"
    ], 
    "source": "middle1368"
}