{
    "article": "\"It's over! Thank goodness!\" school was  _  and I was tired. I  _  at the front of the school bus. Janie, the driver, tries to  _  the uncomfortable atmosphere(,) by striking the match of talks. I try to listen  _  , but usually I am too  _  thinking about my day. On this day, however, her talk was worth  listening to  . \"My father's ill ,\" she said to no one in particular . I could see worry in her  _  . I had never seen her like this before. She always meets students  _  a smile. With a sudden change of interest, I asked, \" What's wrong with him?\" With her eyes wet and her voice  _  , she answered, \"Heart trouble.\" Her eyes lowered as she continued. \"I've already  _  my mum, so I don't think I can stand losing him.\" I couldn't answer. My heart ached for her. I sat on the  _  thinking of the great pain my own mother was thrown into when her father died. I saw how hard it was, and still is, for her. I wouldn't want anyone to go through that. Suddenly I realized Janie wasn't only a bus  _  , that was just her job. She had a whole world of family and cares  too  . I suddenly  _  very selfish. I paid no attention to Janie because she was a bus driver. I had judged her by her job and brushed her off as unimportant. I shouldn't have been so selfish and self-centered.  Understanding  people is an art.", 
    "options": [
        [
            "in", 
            "off", 
            "over", 
            "on"
        ], 
        [
            "ran", 
            "walked", 
            "sat", 
            "stood"
        ], 
        [
            "rest", 
            "break", 
            "close", 
            "open"
        ], 
        [
            "polite", 
            "rude", 
            "politely", 
            "quickly"
        ], 
        [
            "busy", 
            "free", 
            "busily", 
            "freely"
        ], 
        [
            "eyes", 
            "face", 
            "mouth", 
            "ears"
        ], 
        [
            "with", 
            "within", 
            "without", 
            "for"
        ], 
        [
            "usually", 
            "usual", 
            "unusual", 
            "truly"
        ], 
        [
            "remembered", 
            "forgotten", 
            "lost", 
            "missed"
        ], 
        [
            "seat", 
            "house", 
            "room", 
            "desk"
        ], 
        [
            "worker", 
            "driver", 
            "teacher", 
            "doctor"
        ], 
        [
            "felt", 
            "feel", 
            "thought", 
            "was"
        ]
    ], 
    "answers": [
        "C", 
        "C", 
        "B", 
        "C", 
        "A", 
        "A", 
        "A", 
        "C", 
        "C", 
        "A", 
        "B", 
        "A"
    ], 
    "source": "middle314"
}