{
    "article": "Imagine this: your parents go away on business, but you have to stay at home alone . Would life be as easy as when your parents are  _  ? Would it be a perfect holiday for you? Zheng Chenyu says that she would  _  \"Where can I find food? How can I cook it?\" The 14-year-old girl says that she knows  little  about cooking. \"I can have tomato and egg soup , but that's all. I think many of my classmates are the same. We don't know what to do, or how to  look after  ourselves,\" said Zheng. \"And I may forget something important. I may probably  _  television and then burn the soup.\"  _  Zheng believes that basic life skills , such as cooking and washing clothes, are especially important, she doesn't think teenagers get enough practice. \"As soon as I leave home, I'll learn to cook. But now parents do almost  _  for us. We're very lazy,\" she said. Most teenagers only have time for their  _  . They don't learn any life skills until they go to college . However, Sima Yige doesn't think so. \"I think I'd be all right. I wouldn't just eat sandwiches or fruit. I know how to cook some  _  dishes because my mum showed me,\" the 13-year-old boy said. In his opinion, many teenagers depend too much on their parents, and there is much more to learn than cooking, like \"  tidying  up your room or even dressing yourself properly\". For most teenagers it wouldn't be a holiday at all.", 
    "options": [
        [
            "at", 
            "out", 
            "in", 
            "around"
        ], 
        [
            "think", 
            "feel", 
            "worry", 
            "say"
        ], 
        [
            "see", 
            "watch", 
            "look", 
            "listen"
        ], 
        [
            "Although", 
            "However", 
            "Because", 
            "So"
        ], 
        [
            "none", 
            "something", 
            "nothing", 
            "everything"
        ], 
        [
            "housework", 
            "school", 
            "homework", 
            "life"
        ], 
        [
            "nice", 
            "important", 
            "difficult", 
            "easy"
        ]
    ], 
    "answers": [
        "D", 
        "C", 
        "B", 
        "D", 
        "D", 
        "C", 
        "D"
    ], 
    "source": "middle1146"
}