{
    "article": "My daughter saw a colorful rainbow the other day after a thunderstorm. She called me to look out of the window and _ it as well. Looking at it, I was amazed at its beauty and I also _  the first time I ever saw a rainbow as a boy.\nOnce when I was a little boy, I was sitting in the house for an hour waiting _ for the rain to stop so I could go out and play. It had rained hard for long and I thought it would never _ . When it finally did stop I rushed outside and was  _ by the beautiful sight of the rainbow across the sky. I had just recently heard of an old story. It said that there was a pot of gold at the end of a rainbow. _ , I started to run down the streets near my house to find that treasure. The quicker I ran, though, the more rainbow began to  _ . Finally, I found _  running as fast as I possibly could, but it was too  _ By the time I got there, the rainbow and its pot of gold had gone _ .\nSadly that wasn't the last time I found myself running after the false  _ . Over the years, I ran after the fame , success and money. I got  _ of them, however. It  _ me a long time to find the true treasure that doesn't break, disappear or run away. That true treasure is the love between people and it is  _  to all. I welcomed this treasure into my heart and life and shared it with others as well. And the more love I dreamed about , the more love I had in me.", 
    "options": [
        [
            "see", 
            "hear", 
            "feel", 
            "smell"
        ], 
        [
            "chose", 
            "reminded", 
            "remembered", 
            "enjoyed"
        ], 
        [
            "lazily", 
            "happily", 
            "impatiently", 
            "bravely"
        ], 
        [
            "stop", 
            "change", 
            "remain", 
            "keep"
        ], 
        [
            "attacked", 
            "attracted", 
            "hit", 
            "crashed"
        ], 
        [
            "Excitedly", 
            "Peacefully", 
            "Quietly", 
            "Easily"
        ], 
        [
            "show", 
            "appear", 
            "disappear", 
            "shine"
        ], 
        [
            "itself", 
            "myself", 
            "himself", 
            "herself"
        ], 
        [
            "bright", 
            "weak", 
            "high", 
            "late"
        ], 
        [
            "broken", 
            "missing", 
            "bad", 
            "wrong"
        ], 
        [
            "treasure", 
            "rainbow", 
            "pot", 
            "story"
        ], 
        [
            "both", 
            "all", 
            "neither", 
            "none"
        ], 
        [
            "spent", 
            "paid", 
            "took", 
            "cost"
        ], 
        [
            "empty", 
            "useless", 
            "cheap", 
            "free"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "C", 
        "A", 
        "B", 
        "A", 
        "C", 
        "B", 
        "D", 
        "B", 
        "A", 
        "D", 
        "C", 
        "D"
    ], 
    "source": "middle1195"
}