{
    "article": "Bill, a thirteen-year-old boy, thought he had grown up to be a man. But his parents told him, \" You won't be a real man until you begin to  think about  helping others.\" One morning, his parents gave him some money to  _  some milk for them. Outside a shop he saw a homeless old man who looked very  _  . Bill went to him and asked, \" What's wrong with you?\" The old man answered, \" I'm hungry. I haven't had any food for two days.\" All the thought of his parents' words, Bill said to the old man, \"Let's go to the  _  .\" When they got there, Bill asked the waiter to bring out bread and coffee to the old man. The old man finished the meal quickly. After the waiter  took away  the plate and the cup, the old man said, \"Sorry for give you too much  _  . I'm fine now. I'll  _  forget your kindness! You are a very good young man\" Bill was  _  when he heard this. Just when he wanted to pay for the meal, the waiter came. Bill and the old man learned  in surprise  that he food was free  _  it was the birthday of the boss, and they were the first customer that day.", 
    "options": [
        [
            "lend", 
            "buy", 
            "drink", 
            "borrow"
        ], 
        [
            "afraid", 
            "glad", 
            "sick", 
            "angry"
        ], 
        [
            "bank", 
            "library", 
            "hospital", 
            "restaurant"
        ], 
        [
            "excuse", 
            "advice", 
            "trouble", 
            "difficulty"
        ], 
        [
            "never", 
            "always", 
            "usually", 
            "sometimes"
        ], 
        [
            "nervous", 
            "pleased", 
            "sorry", 
            "shy"
        ], 
        [
            "when", 
            "until", 
            "unless", 
            "because"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "D", 
        "C", 
        "A", 
        "B", 
        "D"
    ], 
    "source": "middle537"
}