{
    "article": "\"What can you do when you have done nothing but make your whole life in a mess?\" These were the words I heard when I turned on the TV the other day.They were coming from one of the talk _ that are very popular on TV these days. I started to turn the channel but the words made me stop for a moment. I looked at the speaker. He was even not more than 18 years old, _ he was already writing off his life as a useless waste.\nIt is so sad that many people are like him.There are so many people who like that talk show. There are people _ their teens thinking that their lives are over. There are people in their twenties thinking that they have missed the boat to success and happiness.There are people in their thirties and forties complaining that their life has passed them by. I want to shout to them, \"Wake up! You are not dead!What have you done today?\" If you want a happy life,you can't only think about your _ before. If you want joys and love in your life,you have to start to get _ today.God gives us a new life every day we wake up in the morning. It is for you to get it.\nToday must be the _ of a new life for each of us. We can get joys right now. We can share love today. We can live in happy moment right now.It doesn't matter _ hard your life has ever been.Our life today can be full of joys and our future can be full of _ . It doesn't matter if we are eight _ eighty--we can still make our life wonderful . Life is not over until your last heartbeat. Start today, then,to make your heart beat with joys, love and light.", 
    "options": [
        [
            "show", 
            "shows", 
            "showing", 
            "showings"
        ], 
        [
            "because", 
            "if", 
            "but", 
            "why"
        ], 
        [
            "at", 
            "until", 
            "in", 
            "on"
        ], 
        [
            "wrong", 
            "mistakes", 
            "kindness", 
            "sad"
        ], 
        [
            "it", 
            "this", 
            "that", 
            "them"
        ], 
        [
            "end", 
            "ending", 
            "begin", 
            "beginning"
        ], 
        [
            "how", 
            "what", 
            "when", 
            "why"
        ], 
        [
            "happiness", 
            "sorry", 
            "anger", 
            "worries"
        ], 
        [
            "and", 
            "or", 
            "but", 
            "to"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "C", 
        "B", 
        "D", 
        "D", 
        "A", 
        "A", 
        "B"
    ], 
    "source": "middle2190"
}