{
    "article": "On my way home I knocked into a man when he passed by .\"Oh. I'm terribly sorry,\" I said. 'That's all right. Please excuse me too; I didn't even _ you. I wish  I didn't hurt you.\"\nWe were very _ . We said good-bye and went on our way.\nBut at home we often treat  our loved ones in a different way.\nLater that day, when I was cooking the evening meal, my daughter stood beside me very quietly.\nWhen I turned, I nearly _ her down. \" Move out of the way.\" I shouted. She walked away, tears  in her eyes.\nWhen I lay in bed, I realized  how _ I'd spoken. So I decided to get up to say sorry to my daughter. On the way to her bedroom, to my surprise, I found some _ by the door of the kitchen. At that time my tears began to fall. I quietly went and got down on my knees by her _ She woke up and put her arms around my neck . Then I asked,\" Did you pick these flowers for me?\"\nShe smiled,\" I found them by the tree. I picked them _ they're like you. I knew you'd like them. I stood quietly because I wanted to give you a _ .'\"'Oh dear, I'm really sorry for the way I acted today; I shouldn't have shouted at you.\"\n\"That's okay. Mom. I love you anyway.\"\nI suddenly realized what a clever way it is to explain  the word _ like this:\n( F) ather (A) nd ( M) other, ( I) ( L) ove ( Y) ou !\n:sad  -sadly", 
    "options": [
        [
            "save", 
            "help", 
            "call", 
            "notice"
        ], 
        [
            "sad", 
            "angry", 
            "polite", 
            "happy"
        ], 
        [
            "put", 
            "took", 
            "knocked", 
            "turned"
        ], 
        [
            "sadly", 
            "rudely", 
            "softly", 
            "happily"
        ], 
        [
            "books", 
            "clothes", 
            "flowers", 
            "vegetables"
        ], 
        [
            "bed", 
            "desk", 
            "chair", 
            "door"
        ], 
        [
            "if", 
            "because", 
            "but", 
            "so"
        ], 
        [
            "surprise", 
            "party", 
            "present", 
            "picture"
        ], 
        [
            "father", 
            "mother", 
            "family", 
            "daughter"
        ]
    ], 
    "answers": [
        "D", 
        "C", 
        "C", 
        "B", 
        "C", 
        "A", 
        "B", 
        "A", 
        "C"
    ], 
    "source": "middle1520"
}