{
    "article": "Tom brought a box of biscuits to a summer camp. He ate a few and placed the rest under his bed. After lunch, he found the box was gone. He went to tell his camp  _  about it. The next day, the coach saw a boy eating Tom's biscuit behind a tree. He  came up with  an idea to solve the problem. He found Tom and said to him, \"I know who  took away  your biscuits. Will you help me to teach him a lesson?\" \"Well, yes...are you going to punish  _  , sir?\" Tom asked. \"No, I am not,\" the coach explained  _  . \"That would only make him hate you. I want you to write to your mother and ask for more  _  .\" Tom received another box of biscuits by mail from his mother a few days later. \"Now,\" said the coach, \"go and  _  them with the boy who stole your biscuits.\" Tom didn't understand the coach's intention,  _  he still followed his advice. Half an hour later the coach saw the two boys come up the hill, arm in arm. The boy was trying to ask Tom to  _  his toy robot in payment for the stolen biscuits. And Tom was refusing the gift from his new friend. He said that a few biscuits were not so  _  . In some situations, forgiveness is better than punishment.", 
    "options": [
        [
            "cook", 
            "doctor", 
            "coach", 
            "cleaner"
        ], 
        [
            "me", 
            "him", 
            "us", 
            "them"
        ], 
        [
            "shyly", 
            "angrily", 
            "excitedly", 
            "patiently"
        ], 
        [
            "gifts", 
            "biscuits", 
            "candies", 
            "toys"
        ], 
        [
            "share", 
            "choose", 
            "divide", 
            "fill"
        ], 
        [
            "if", 
            "but", 
            "since", 
            "though"
        ], 
        [
            "steal", 
            "mend", 
            "make", 
            "accept"
        ], 
        [
            "cheap", 
            "delicious", 
            "different", 
            "important"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "D", 
        "B", 
        "A", 
        "B", 
        "D", 
        "D"
    ], 
    "source": "middle643"
}