{
    "article": "There was a boy who was sent by his parents to a boarding school . Before he was sent away, the boy was the  _  student in his class. He was at the top in every exam. But the boy changed after  _  home and studying in the boarding school. His grades started to  drop  . He hated being in a group. He was lonely all the time. And there were especially dark times when he felt like committing suicide . All of this was because he felt no one loved him. His parents started to  worry about  the boy. But they even did not know what was wrong with him. So his father decided to go to the school and talk with him. They sat by the lake near the school. The father started asking him some casual questions about his lessons, teachers and  _  . After some time his father said, \"Do you know, son, why I'm here today?\" \"To  _  my grades,\" the boy replied back. \"No, no,\" his father said. \"I'm here to tell you that you're the most  _  person for me. I want to see you  _  . I don't care about grades. I care about you. I care about your happiness. You're my life.\" These words caused the boy's eyes to be filled with tears. He hugged his father. They didn't say  _  to each other for a long time. Now the boy had everything he wanted. He knew there was someone on the earth who cared for him deeply. And today this young man is in university at the top of his class and no one has ever seen him  _  .", 
    "options": [
        [
            "laziest", 
            "cleverest", 
            "calmest", 
            "worst"
        ], 
        [
            "coming", 
            "returning", 
            "leaving", 
            "going"
        ], 
        [
            "friends", 
            "family", 
            "study", 
            "grades"
        ], 
        [
            "find", 
            "teach", 
            "check", 
            "hear"
        ], 
        [
            "famous", 
            "important", 
            "outstanding", 
            "interesting"
        ], 
        [
            "happy", 
            "serious", 
            "excellent", 
            "honest"
        ], 
        [
            "everything", 
            "something", 
            "nothing", 
            "anything"
        ], 
        [
            "ill", 
            "pleasant", 
            "pleased", 
            "sad"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "C", 
        "B", 
        "A", 
        "D", 
        "D"
    ], 
    "source": "middle1293"
}