{
    "article": "A spring   keeper lived high above a village along the eastern part of the mountain in Europe. The spring keeper was _ a job many years earlier by a young town leader. His job was to take away the leaves from the pools in the mountain. He worked hard.\nThe village soon became an _ place for visitors.\nYears passed. One evening the town leaders had a meeting. _ they reviewed   the money, one man saw how much they paid the spring keeper. He said: \"Who is the old man? _ do we keep him year after year? No one ever sees him. For all we know, he is doingus no good. He isn't _ any longer.\" Then, they fired   the old man.\nFor several weeks, _ changed. By early autumn, however, the tree leaves began to fall and fell into the pools, _ the rushing flow of water. One afternoon someone _ that the spring water had turned yellow. A few days later, swans left, so did the tourists. Diseases reached deep into the village.\nQuickly, the leaders held a special meeting. Realizing their _ , they asked the old keeper of the spring to come back. And after a few weeks, the river of life began to clear up. Then, life _ to the village in the mountain.\nNever look down on the seeming smallness of one's task, job, or life! Even though it is rather small, it does make a difference.", 
    "options": [
        [
            "brought", 
            "offered", 
            "found", 
            "worked"
        ], 
        [
            "attractive", 
            "expensive", 
            "unwelcome", 
            "unpopular"
        ], 
        [
            "Since", 
            "As", 
            "Because", 
            "If"
        ], 
        [
            "How", 
            "When", 
            "Why", 
            "What"
        ], 
        [
            "young", 
            "energetic", 
            "strong", 
            "necessary"
        ], 
        [
            "nothing", 
            "something", 
            "anything", 
            "everything"
        ], 
        [
            "protecting", 
            "preventing", 
            "providing", 
            "producing"
        ], 
        [
            "noticed", 
            "marked", 
            "signed", 
            "recorded"
        ], 
        [
            "feelings", 
            "success", 
            "confidence", 
            "mistake"
        ], 
        [
            "repaired", 
            "replied", 
            "returned", 
            "reached"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "B", 
        "C", 
        "D", 
        "A", 
        "B", 
        "A", 
        "D", 
        "C"
    ], 
    "source": "middle1173"
}