{
    "article": "The hippo is the most dangerous animal in Africa, but that hasn't stopped a South African animal lover from making friends with one. Marius Els is 40 years old. He  _  around 20 different kinds of animals on his ranch ,in South Africa. He has a real soft spot for Humphrey, a 6-year-old hippo that's like a son to him. While all of his friends are too  _  to go near the animal, and his wife told him not to get too close, Marius climbs on Humphrey's back as he swims  _  the lake. Marius has kept the hippo  _  he was just five months old. And over the years, the two have  _  a special relationship that people just don't understand. Marius looks on Humphrey as a son, although the 1,200 ton animal could  eat up  a person with ease. Only sometimes the hippo can throw Marius off his  _  in the water. Humphrey is very friendly to his owner, especially after Marius offers him a dinner of his favorite  _  , apples. Humphrey feels very  _  in his life. He had another good friend, a goat, but she got eaten by a jackal , so now he's all by  _  . Marius says he's been trying to get a female friend for Humphrey, but there's no such thing in Africa right now.", 
    "options": [
        [
            "kept", 
            "swept", 
            "bought", 
            "stayed"
        ], 
        [
            "worried", 
            "tired", 
            "scared", 
            "excited"
        ], 
        [
            "under", 
            "across", 
            "along", 
            "into"
        ], 
        [
            "since", 
            "when", 
            "after", 
            "before"
        ], 
        [
            "invented", 
            "found", 
            "appeared", 
            "developed"
        ], 
        [
            "head", 
            "back", 
            "front", 
            "tail"
        ], 
        [
            "juice", 
            "fish", 
            "bread", 
            "food"
        ], 
        [
            "lonely", 
            "angry", 
            "happy", 
            "funny"
        ], 
        [
            "her", 
            "them", 
            "himself", 
            "us"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "B", 
        "A", 
        "D", 
        "B", 
        "D", 
        "A", 
        "C"
    ], 
    "source": "middle983"
}