{
    "article": "There was once a boy whose greatest dream was to have a rocket , and send it up to the moon. Unluckily, he had little money and couldn't  _  one. One day, at the side of a path, he found a box for one of his  _  kinds of rocket. Opening it, he found there was only one rocket  _  , made of paper, the result of a factory malfunction . The boy was very disappointed, but at least he now finally had a rocket of sorts. He started  preparing  his plans. For many days he collected paper of all the shapes, sizes and colours; and with all his soul he  set about  drawing, cutting, sticking and colouring all the stars and  _  that would turn his rocket into an outer space in paper form. It wasn't an easy job, but the final result was so excellent. From then on, the boy  _  playing with his paper rocket every day. One day, a friend came, and in the boy's bedroom he saw that excellent sight. The friend offered to exchange it with the boy, for a real rocket he had at home. The boy  _  accepted. Since then, each day, playing with his new rocket, the boy would  _  more and more his old paper rocket, with its planets, stars and all the rest.  _  , he had much preferred playing with that one. He realized that it was more fun playing with toys he had made himself, with great  _  and enthusiasm . And so it was, that the boy started  _  all his toys by himself, and when he grew up he became the greatest toy-maker in the whole world.", 
    "options": [
        [
            "make", 
            "borrow", 
            "afford", 
            "sell"
        ], 
        [
            "latest", 
            "favourite", 
            "useful", 
            "best"
        ], 
        [
            "above", 
            "beside", 
            "nearby", 
            "inside"
        ], 
        [
            "moon", 
            "planets", 
            "earth", 
            "sun"
        ], 
        [
            "stopped", 
            "hated", 
            "continued", 
            "enjoyed"
        ], 
        [
            "happily", 
            "sadly", 
            "carefully", 
            "hurriedly"
        ], 
        [
            "take", 
            "care", 
            "miss", 
            "add"
        ], 
        [
            "Really", 
            "However", 
            "Besides", 
            "Interestingly"
        ], 
        [
            "success", 
            "effort", 
            "danger", 
            "difficulty"
        ], 
        [
            "selling", 
            "colouring", 
            "building", 
            "collecting"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "D", 
        "B", 
        "D", 
        "A", 
        "C", 
        "A", 
        "B", 
        "C"
    ], 
    "source": "middle120"
}