{
    "article": "It was my daughter's first day of school. I knew that she would be _ in a few minutes, because she always did that when she was worried about new environment.\nOn the way to school I told her repeatedly how _ her new school life would be and expected she would feel _ . However, when she saw the large group of students everywhere, her face at once fell and the tears came to her eyes. \"You can do this, sweetie. Everyone has a _ in line; let's go to find yours.\"\nWe lined up to enter the school. Just as she was about to hold on to my leg, her friend from preschool _ next to her. Suddenly, she became active and reached out for her friend's hand. And as the teacher began to _ them all into the school, she wasn't crying, but smiling.\nTo tell the truth, 1 was _ to say goodbye when 1 saw those little feet walk into that big building. I hid the tears behind my sunglasses and waved my hand as she walked inside.\nAll day I _ what she was doing. As I waited to pick her up, I felt like a child standing in line to meet Santa. \"1 didn't cry again, Mommy,\" she said _ ,showing me her backpack full of candies.\nDuring two hours of listening to the details of her day, we laughed and talked about all the _ she had on the first school day. I knew my daughter has grown up.", 
    "options": [
        [
            "running", 
            "sleeping", 
            "crying", 
            "waiting"
        ], 
        [
            "amazing", 
            "peaceful", 
            "valuable", 
            "important"
        ], 
        [
            "safe", 
            "relaxed", 
            "interested", 
            "proud"
        ], 
        [
            "place", 
            "name", 
            "list", 
            "picture"
        ], 
        [
            "pulled", 
            "complained", 
            "sat", 
            "stood"
        ], 
        [
            "walk", 
            "send", 
            "rush", 
            "push"
        ], 
        [
            "calm", 
            "happy", 
            "unwilling", 
            "surprised"
        ], 
        [
            "suggested", 
            "asked", 
            "knew", 
            "wondered"
        ], 
        [
            "shyly", 
            "excitedly", 
            "politely", 
            "seriously"
        ], 
        [
            "experiences", 
            "friends", 
            "classes", 
            "excuses"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "B", 
        "A", 
        "D", 
        "A", 
        "C", 
        "D", 
        "B", 
        "A"
    ], 
    "source": "middle325"
}