{
    "article": "In China, there are more and more traffic accidents nowadays. Every day cars kill or hurt many people on roads. Sometimes they drive too fast or do not drive carefully enough. Some of them  _  the traffic rules and  cause accidents.\nAccording to some research, the pedestrians  cause the accident more often than before.They are very  _ . They walk or run across the roads  in front of  the cars. They walk in the roads but not on the walkways.They get into or out of cars in the middle of the roads. Some pedestrians think it wastes time to  wait for  the green lights and simply cross the roads against the lights.\nMany people think accidents often  _  in busy roads in large cities,however, it is not true.For example, Tokyo is one of the world's  largest  cities and probably one of the busiest cities, but there are  _  accidents to pedestrians. The reason is that the police there are very strict and the pedestrians are very careful.They  _  cross against a red light and they always follow traffic lights.\nDo you know drinking wine is  another  main cause of traffic accidents? The alcohol(  )in the wine delays people's response. Those who have drunk too much are  _  in making decisions. They need a few more seconds to react(  ). Alcohol drinking is especially dangerous for motor car drivers. It is not only drivers who may have accidents after drinking, drunk pedestrians may pay their lives in danger too.", 
    "options": [
        [
            "make", 
            "break", 
            "follow", 
            "remember"
        ], 
        [
            "careful", 
            "active", 
            "careless", 
            "excited"
        ], 
        [
            "happen", 
            "cause", 
            "own", 
            "take"
        ], 
        [
            "some", 
            "many", 
            "enough", 
            "few"
        ], 
        [
            "never", 
            "ever", 
            "almost", 
            "always"
        ], 
        [
            "fast", 
            "interested", 
            "slow", 
            "energetic"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "D", 
        "A", 
        "C"
    ], 
    "source": "middle1770"
}