{
    "article": "Anna and I are good friends since we were children. When she was young, her family was very  _  . So she often helped me. But two years ago, her family got into  _  because of a terrible accident. They had no money. Anna was very  _  To cheer her up, I always try my best to  _  her. One day she said she was inviting me to have lunch. On the way, I began to worry: she had no money,  _  if I offered to pay, I would hurt  _  . When we arrived at a small  _  , Anna told me to sit and drink coffee by the window. Then she went into the  _  .After about 30 minutes, she came out and  _  with me. She just paid for one meal and we started to  _  the delicious food together. She told me that the restaurant let people  _  for a meal if they had no money. To my surprise, Anna had work in the kitchen as a volunteer. I still  _  the beautiful afternoon I shared with Anna. I'm still thinking that life can't be  _  to us. But we can still do  _  for our friends and neighbors. The world will be nicer if everybody would like to share happiness with  _  . It will never be dark if there is a little light in everyone's heart.", 
    "options": [
        [
            "rich", 
            "big", 
            "hard", 
            "far"
        ], 
        [
            "bus", 
            "trouble", 
            "nothing", 
            "surprise"
        ], 
        [
            "smart", 
            "happy", 
            "strong", 
            "sad"
        ], 
        [
            "tell", 
            "hurt", 
            "help", 
            "cheat"
        ], 
        [
            "but", 
            "or", 
            "and", 
            "for"
        ], 
        [
            "her", 
            "him", 
            "us", 
            "them"
        ], 
        [
            "park", 
            "hotel", 
            "office", 
            "restaurant"
        ], 
        [
            "station", 
            "bathroom", 
            "kitchen", 
            "school"
        ], 
        [
            "sat", 
            "played", 
            "studied", 
            "lived"
        ], 
        [
            "divide", 
            "enjoy", 
            "clean", 
            "sell"
        ], 
        [
            "look", 
            "wait", 
            "work", 
            "ask"
        ], 
        [
            "hate", 
            "worry", 
            "know", 
            "remember"
        ], 
        [
            "hard", 
            "easy", 
            "poor", 
            "bad"
        ], 
        [
            "all", 
            "something", 
            "cooking", 
            "housework"
        ], 
        [
            "classmates", 
            "families", 
            "relatives", 
            "others"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "D", 
        "C", 
        "A", 
        "A", 
        "D", 
        "C", 
        "A", 
        "B", 
        "C", 
        "D", 
        "B", 
        "B", 
        "D"
    ], 
    "source": "middle536"
}