{
    "article": "Mr. Chen is a farmer who  lives  in western China with his wife and two sons. One year ago, he discovered that he had cancer. The doctor told him that he needed  an operation  at once. And he said the operation would  _  thousands of yuan. It was too much money for Mr. Chen and his wife. They had no job and  both their sons  were at school. The situation seemed  _  . Two weeks later, however, Mr. Chen got some  _  new. He was told about a health care project which provides medical treatment for poor patients in  _  China. They  _  to pay only half the cost or even less. Thanks to the project and the kindness of  _  family and neighbors, he was able to receive an operation just  in time  to prevent the illness from getting worse.  _  he has return to his family. The  _  of this health care project is to improve the situation for poor people in western China. So far, the project has helped more than 5,000 people  _  medical aid. The Chinese government is  also  working together with other countries and international organizations to do this. They hope to develop a new health care model  _  China. As our country develops, we must remember the responsibilities of caring for the weakest members.", 
    "options": [
        [
            "pay", 
            "spend", 
            "have", 
            "cost"
        ], 
        [
            "hopeful", 
            "hopeless", 
            "harmful", 
            "harmless"
        ], 
        [
            "sad", 
            "had", 
            "terrible", 
            "good"
        ], 
        [
            "eastern", 
            "southern", 
            "western", 
            "northern"
        ], 
        [
            "want", 
            "need", 
            "prefer", 
            "like"
        ], 
        [
            "my", 
            "your", 
            "his", 
            "her"
        ], 
        [
            "Already", 
            "Just", 
            "Ever", 
            "Now"
        ], 
        [
            "chance", 
            "advice", 
            "example", 
            "goal"
        ], 
        [
            "receive", 
            "receiving", 
            "received", 
            "receives"
        ], 
        [
            "to", 
            "at", 
            "for", 
            "on"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "D", 
        "C", 
        "B", 
        "C", 
        "D", 
        "D", 
        "A", 
        "C"
    ], 
    "source": "middle2046"
}