{
    "article": "In 1880, fourteen-year-old Matthew Henson loved to hear sailors tell tales of their exciting lives at sea. One day he made up his _  . Baltimore was the nearest large seaport . The next morning he set out on the forty-mile journey to try to find work on a sailing ship.\nIn Baltimore, Henson found a job as a cabin boy on a beautiful ship. For the next five years, Henson _  around the world. _  the help of the ship's captain and other members of the crew, Henson learned mathematics, history, geography, and many other subjects.\nUnable to find work anywhere else, Henson took a job in a _ shop in Washington, D.C. One day in 1887, a man came in to buy a hat. The man, Lieutenant Robert Peary, asked the owner _ he knew anyone with experience at sea or not. Peary would soon travel to South America for the U.S. government. _ the shop owner introduced Peary to Henson. Using his map-reading and sailing skills, Henson proved _ to be a worthy and smart seaman. One day Peary told Henson about his real dream: to be the first man to stand on \"the top of the world\" at the North Pole. He asked Henson to help him make his dream come true .\nOver the next five years, the two explorers  made two trips together to the Arctic . However, they were not  _ to reach the pole either time. The cold, wind, and ice were _ than either of them had ever imagined.\nIn 1908, The two men _ never gave up were ready to make their final challenge at reaching the North Pole. With four guides, they made a mad dash straight across the ice.  _ April 1909, Henson's instruments showed they were standing at the North Pole. Together Henson and Peary planted the American flag in the snow _ .", 
    "options": [
        [
            "decision", 
            "plan", 
            "mind", 
            "way"
        ], 
        [
            "sailed", 
            "drove", 
            "rode", 
            "walked"
        ], 
        [
            "with", 
            "without", 
            "by", 
            "under"
        ], 
        [
            "hat", 
            "food", 
            "book", 
            "shoe"
        ], 
        [
            "if", 
            "whether", 
            "that", 
            "where"
        ], 
        [
            "so", 
            "because", 
            "if", 
            "but"
        ], 
        [
            "myself", 
            "yourself", 
            "himself", 
            "themselves"
        ], 
        [
            "possible", 
            "able", 
            "probable", 
            "successful"
        ], 
        [
            "warmer", 
            "better", 
            "worse", 
            "bigger"
        ], 
        [
            "which", 
            "who", 
            "whom", 
            "what"
        ], 
        [
            "At", 
            "To", 
            "On", 
            "In"
        ], 
        [
            "successfully", 
            "simply", 
            "quickly", 
            "Luckily"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "A", 
        "A", 
        "B", 
        "A", 
        "C", 
        "B", 
        "C", 
        "B", 
        "D", 
        "A"
    ], 
    "source": "middle1584"
}