{
    "article": "A strange thing happened to me last Sunday. It was such a beautiful day that I _ to go for a look in the country.\nOn the way back home, my car stopped. It was out of gas  on a _ road far from a town! I decided to walk until I found someone who could sell some gas. I walked almost a mile before I finally found a _ near the road.\nI knocked at the door and a little old lady with long white hair _ . She said, \"I've waited for you here for a long time. Come in. _ is ready.\"\n\"But I only came for some gas.\" I answered.\n\"Oh, Alfred! Gas? You like tea.\" said she.\nI quickly explained that my car was out of  gas, but she didn't _ to listen to me. She just kept calling me Alfred. She was _ very strangely. As soon as she went to get tea, I went out of the house quickly.\nLuckily, there was another house down the road and I was able to _ the gas. When I told the man about my _ , he said, \"Oh, that's Miss Emily. She lives alone in that big house. She's _ , but she wouldn't hurt anybody. She is still waiting for the man she was going to marry thirty years ago. The man left home and never came back because of the war.\"", 
    "options": [
        [
            "walked", 
            "rode", 
            "hurried", 
            "drove"
        ], 
        [
            "busy", 
            "quiet", 
            "modern", 
            "noisy"
        ], 
        [
            "hotel", 
            "restaurant", 
            "house", 
            "market"
        ], 
        [
            "answered", 
            "returned", 
            "noticed", 
            "served"
        ], 
        [
            "Gas", 
            "Tea", 
            "Juice", 
            "Coffee"
        ], 
        [
            "promise", 
            "remember", 
            "learn", 
            "seem"
        ], 
        [
            "shouting", 
            "crying", 
            "acting", 
            "jumping"
        ], 
        [
            "touch", 
            "buy", 
            "borrow", 
            "sell"
        ], 
        [
            "experience", 
            "advice", 
            "result", 
            "plan"
        ], 
        [
            "famous", 
            "strange", 
            "wonderful", 
            "friendly"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "C", 
        "A", 
        "B", 
        "D", 
        "C", 
        "B", 
        "A", 
        "B"
    ], 
    "source": "middle1408"
}