{
    "article": "For this month's Young World magazine, I interviewed 19-year-old  _  pop star Candy Wang. Candy told me that she used to be really shy and took up singing to deal with her  _  . As she got better, she dared to sing in front of her class, and then for the whole school. Now she's not shy any more and  _  singing in front of crowds. I asked Candy how life was different  _  she became famous. She explained that there are many good things, like being able to travel and meet new people all the time. \"I didn't use to be popular in school, but now I get tons of  _  everywhere I go.\" However, too much attention can also be a bad thing. \"I always have to worry about how I appear to others and I have to be very careful about what to say or do. And I don't have much private time anymore. Hanging out with friends is almost  _  for me now because there are always guards around me.\" What does Candy have to say to all those young people who want to become famous? \"Well,\" she begins slowly, \"you have to be prepared to  give up  your normal life. You can never imagine how  _  the road to success is. Many times I thought about giving up,  _  I fought on. You really require a lot of talent and hard work to succeed. Only  a small number of  people make it to the top.", 
    "options": [
        [
            "Asia", 
            "Asian", 
            "America", 
            "Africa"
        ], 
        [
            "shyness", 
            "illness", 
            "sadness", 
            "happiness"
        ], 
        [
            "refuses", 
            "dislikes", 
            "minds", 
            "loves"
        ], 
        [
            "after", 
            "before", 
            "since", 
            "until"
        ], 
        [
            "money", 
            "chance", 
            "attention", 
            "introduction"
        ], 
        [
            "possible", 
            "possibly", 
            "impossible", 
            "impossibly"
        ], 
        [
            "exciting", 
            "easy", 
            "important", 
            "difficult"
        ], 
        [
            "and", 
            "but", 
            "so", 
            "for"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "D", 
        "A", 
        "C", 
        "C", 
        "D", 
        "B"
    ], 
    "source": "middle2085"
}