{
    "article": "An old carpenter was ready to retire .His boss was _ to see the good worker leave. He asked the carpenter if he could build just one more _ . The carpenter said yes, but his mind was not on his work any more. He used poor materials and _ worked on the house. When the carpenter finished his work, the boss _ the front-door key to him and said, \"This is your house. It's a _ for you.\"\nWhat a surprise! If he had known he was _ his own house, he would have done it differently. Now he had to live in the house he poorly built.\nSo it is with us. Sometimes we build our _ carelessly. At important points we do not try our best. Then with a shame we look at the things we did. We find that we are living in the house we have poorly built _ we don't have a chance to make it all over again.\nThink of _ as the carpenter. Think about your life. Build it carefully and wisely. It is the only life you will ever build because life is a do-it-yourself project.\nYour life today is the _ of  your attitudes and choices you made in the past. Your life tomorrow will be that of your attitude and choices you make today.", 
    "options": [
        [
            "glad", 
            "nervous", 
            "ready", 
            "sorry"
        ], 
        [
            "room", 
            "house", 
            "bridge", 
            "shade"
        ], 
        [
            "carefully", 
            "really", 
            "carelessly", 
            "happily"
        ], 
        [
            "gave", 
            "left", 
            "sold", 
            "bought"
        ], 
        [
            "present", 
            "place", 
            "secret", 
            "question"
        ], 
        [
            "taking", 
            "using", 
            "building", 
            "buying"
        ], 
        [
            "studies", 
            "lives", 
            "jobs", 
            "feelings"
        ], 
        [
            "and", 
            "but", 
            "or", 
            "so"
        ], 
        [
            "himself", 
            "herself", 
            "myself", 
            "yourself"
        ], 
        [
            "mistake", 
            "change", 
            "result", 
            "instruction"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "C", 
        "A", 
        "A", 
        "C", 
        "B", 
        "B", 
        "D", 
        "C"
    ], 
    "source": "middle2093"
}