{
    "article": "The One Moment A large crowd of anxious teenagers tried to crowd into the huge building all at once, but, of course, were unsuccessful. I got out of my mom's silver Volvo and  _  in the middle of the parking lot, examining the old building. What was beyond those  _  , red double doors? I didn't have an answer. My feelings were indescribable. I was nervous, but  _  at the same time. Knots were turning inside my stomach. My curiosity was getting the better of me. I got the  _  to walk up to the doors, but I couldn't open them just yet. I had to pause (stop) and  _  Whatever lay beyond those doors could change my  _  forever! I didn't know what the results would be. I wasn't sure that I wanted to imagine them  _  My trembling arm  reached out  and took hold of the handle. A gust of wind blew into my face  _  I opened the door. My heart was  _  rapidly and I stopped breathing. I stepped forward with my right foot and the door shut  _  me. The nervousness left my stomach, but the excitement  _  with me. I had finally entered high school. I had been waiting for this moment my whole life.", 
    "options": [
        [
            "sat", 
            "stood", 
            "lay", 
            "stopped"
        ], 
        [
            "heavy", 
            "small", 
            "big", 
            "light"
        ], 
        [
            "anxious", 
            "happy", 
            "surprised", 
            "excited"
        ], 
        [
            "strength", 
            "power", 
            "ability", 
            "courage"
        ], 
        [
            "wait", 
            "think", 
            "repair", 
            "doubt"
        ], 
        [
            "thought", 
            "journey", 
            "school", 
            "life"
        ], 
        [
            "either", 
            "too", 
            "yet", 
            "even"
        ], 
        [
            "until", 
            "while", 
            "before", 
            "as"
        ], 
        [
            "jumping", 
            "beating", 
            "hitting", 
            "knocking"
        ], 
        [
            "before", 
            "beside", 
            "behind", 
            "above"
        ], 
        [
            "stayed", 
            "walked", 
            "disappeared", 
            "agreed"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "D", 
        "D", 
        "B", 
        "D", 
        "A", 
        "D", 
        "B", 
        "C", 
        "A"
    ], 
    "source": "middle726"
}