{
    "article": "It was evening. Two travellers were riding their horses through the fields. Suddenly they found they had lost their way. They began to look for a house to stay in. They also tried to find a person to show them the _ way the next morning.\nThey saw a farm house at last. When they came into the house, they found a farmer and his wife were having supper. The farmer asked them to sit down and eat together with them. As they were very hungry, they did so with pleasure .\nWhile eating, the farmer watched the plate without saying a word. This made the travellers feel a little frightened. They thought he was _ because he had not asked them to come.\nAfter supper the farmer's wife asked them to go upstairs   to sleep. They were so tired that they didn't take off their clothes and went to bed. But the younger one was too frightened to sleep. He heard the farmer and his wife talking in the room below. At first he could not hear _ . But then he clearly heard the man say, \"Must we kill them _ ?\" The woman answered, \"Yes, of course.\" A moment later he again heard a man coming up into the room. He quickly went into the washroom. The door slowly opened and the farmer came in with a light in one hand and a long knife in the other . He went to the meat hanging   on the wall, cut off a piece, and returned as quickly as possible.\nThe next morning when they came down for breakfast, they found on the table some meat and chicken. Everything was clear.", 
    "options": [
        [
            "right", 
            "left", 
            "wrong", 
            "same"
        ], 
        [
            "happy", 
            "unhappy", 
            "polite", 
            "surprised"
        ], 
        [
            "anything", 
            "nothing", 
            "something", 
            "everything"
        ], 
        [
            "anybody", 
            "every", 
            "both", 
            "everyone"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "A", 
        "C"
    ], 
    "source": "middle335"
}