{
    "article": "I was always busy and had too many things to do. Whenever my daughter caused me to change my plans, I thought to myself, \"We don't have time for this.\" So the two words I always said to her were: Hurry up .\nThe other day, the two of us rode to a _ near our home. After shopping I bought her an ice cream, and she sat down at a table happily admiring the ice cream in her hand. Suddenly a _ look appeared on her face. \"Do I have to eat it up in a hurry, Mum?\"\nI nearly cried when hearing this--the pains of a hurried life influenced my poor girl so deeply! As she looked at me waiting to know if she could _ her time. I knew I had to make a _ . I thought of the times when I rushed   my child through life, I began _ what really matters in life....\n\"You don't have to hurry. Just enjoy it.\" I said gently. Her whole face brightened and her shoulders _ . We sat side by side talking about things that interested us.\nWhen she got to the last bite  , she held it out to me, \" I _ the last bite for you, Mum,\" she said _ . As the icy taste put out my thirst, I realized I just got the present of a lifetime. I gave my child a little time... and in return, she gave me her last bite and _ me that things taste sweeter and love is easier to get when you stop rushing through life.", 
    "options": [
        [
            "station", 
            "school", 
            "office", 
            "supermarket"
        ], 
        [
            "worried", 
            "tired", 
            "satisfied", 
            "surprised"
        ], 
        [
            "waste", 
            "take", 
            "spend", 
            "spare"
        ], 
        [
            "mark", 
            "plan", 
            "wish", 
            "choice"
        ], 
        [
            "explaining", 
            "forgetting", 
            "discussing", 
            "wondering"
        ], 
        [
            "lifted", 
            "relaxed", 
            "turned", 
            "raised"
        ], 
        [
            "bought", 
            "carried", 
            "saved", 
            "tasted"
        ], 
        [
            "cheerfully", 
            "calmly", 
            "sadly", 
            "wisely"
        ], 
        [
            "supported", 
            "promised", 
            "reminded", 
            "thanked"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "B", 
        "D", 
        "D", 
        "B", 
        "C", 
        "A", 
        "C"
    ], 
    "source": "middle51"
}