{
    "article": "\"How was school?\" Millie's mother asked. \"It was terrible! I never want to go _ again!\" Millie was almost _ .Millie's mother went to the _ and got Millie a glass of milk and some cakes that Millie likes. She also got a box _ tissues for Millie. \"What's up?\" she asked as she sat  _  next to Millie. Millie _ at her mother and said,\"I thought Kitty and Amy were my best friends. I thought we could tell each _ everything, but they were keeping a secret _ me! Today I heard them whispering in class and I saw them  _  notes to each other. I asked them about it at lunch, but they were not my true _ . They said there wasn't any note and I was silly.\" Millie started to cry. \"Poor Millie,\" said Millie's mother, \"it's all right. Now go and get some _ , and tomorrow everything will be fine.\" The next morning, Millie went to school  _ . She did not think she had any friends now. She _ into the classroom and went to her desk, but when she opened her desk she found it was full  _ colourful presents. \"Happy Birthday, Millie!\" Kitty and Amy came to her and shouted excitedly, \"This is our secret--a birthday _ for you! You are our best friend, Millie!\"", 
    "options": [
        [
            "study", 
            "then", 
            "there", 
            "school"
        ], 
        [
            "cry", 
            "crying", 
            "cries", 
            "cried"
        ], 
        [
            "kitchen", 
            "bedroom", 
            "couch", 
            "desk"
        ], 
        [
            "about", 
            "of", 
            "at", 
            "in"
        ], 
        [
            "up", 
            "down", 
            "near", 
            "at"
        ], 
        [
            "saw", 
            "worried", 
            "said", 
            "looked"
        ], 
        [
            "other", 
            "others", 
            "one", 
            "person"
        ], 
        [
            "about", 
            "to", 
            "from", 
            "away"
        ], 
        [
            "gave", 
            "giving", 
            "give", 
            "gives"
        ], 
        [
            "friendships", 
            "friends", 
            "friend", 
            "friendly"
        ], 
        [
            "sleeping", 
            "sleepy", 
            "sleeps", 
            "sleep"
        ], 
        [
            "sad", 
            "sadly", 
            "sadness", 
            "sadder"
        ], 
        [
            "walked", 
            "walks", 
            "walk", 
            "walking"
        ], 
        [
            "at", 
            "of", 
            "with", 
            "in"
        ], 
        [
            "part", 
            "partly", 
            "party", 
            "parties"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "A", 
        "B", 
        "B", 
        "D", 
        "A", 
        "C", 
        "B", 
        "B", 
        "D", 
        "B", 
        "A", 
        "B", 
        "C"
    ], 
    "source": "middle1958"
}