{
    "article": "Tina was the best speed-walking partner I could ever meet. But I could never understand my friend's habit of _ while we walked.\nTogether we walked all over the town and even entered a marathon together,a full 26 miles, but she did give me a list to take with me. She told me that it _ her a lot. I thought it would just slow us down. I _ it along to the starting line. Twenty-six cheering ideas, one for every mile. I wasn't really planning to slow myself down with all those ideas but I didn't want to hurt Tina's feelings, so I kept her _ .\nI walked the first mile of the _ in 12 minutes--a new personal record. I looked at Tina's cheering list when I checked my watch. At the top was simply Yourself. It did give me a good start to the race, I thought. I thanked Tina for her cheering list. If I finished the race, I would thank her for the _ she gave me. By the time I finished the second mile, my husband and kids were cheering me on. It just so happened that \" _ \" was the next one on Tina's cheering list. I had lots of things to be ready for them.\nThe next mile flew by, then the next and the next, each with a cheering idea. But by the time I neared the final mile? I was nearly out of breath. \"I don't know if I can _ the last mile,\" I thought. In despair I looked at the final cheering idea on Tina's list,now sweaty in my hand: You just can make it!\nI finished the marathon in less than six hours. I thought the cheering list would slow me down.   _ , it carried me past the finishing line.", 
    "options": [
        [
            "cheering", 
            "smiling", 
            "shouting", 
            "chatting"
        ], 
        [
            "taught", 
            "saved", 
            "calmed", 
            "helped"
        ], 
        [
            "hid", 
            "gave", 
            "moved", 
            "carried"
        ], 
        [
            "promise", 
            "list", 
            "word", 
            "idea"
        ], 
        [
            "round", 
            "circle", 
            "race", 
            "road"
        ], 
        [
            "task", 
            "strength", 
            "thought", 
            "way"
        ], 
        [
            "Team", 
            "House", 
            "Family", 
            "Home"
        ], 
        [
            "have", 
            "gain", 
            "finish", 
            "put"
        ], 
        [
            "Besides", 
            "Instead", 
            "Later", 
            "Again"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "D", 
        "B", 
        "C", 
        "B", 
        "C", 
        "C", 
        "B"
    ], 
    "source": "middle1662"
}