{
    "article": "Charlie is kind to his friends and they all  _  him. His friend Andy likes drinking. Charlie often tries to stop him doing it. Sometimes Andy listens to him,  _  sometimes he does not. One evening, when Andy had drunk  too much  in a restaurant, he drove his car home. He drove so fast that he hit a big tree and hurt himself. He was sorry for it and  _  to stop drinking. But soon he forgot it. One afternoon he hit an  _  woman who was crossing the street. Hearing this, Charlie  became  angry. He said he would not be his friend unless he stopped drinking. Of course Andy didn't want to lose his best friend. He decided to follow the law and rules and  stop drinking  . And it made his friend happy. One Sunday afternoon it was  _  . Andy was going to swim in the river. He changed his clothes, went into his car and started it. When he was coming near the crossing, he suddenly remembered  _  and went out of the car at once. He began to push his car in the street. It made the policeman  _  and he asked, \"What's the matter with your car, sir?\" \"Nothing, sir,\" answered Andy. \"But why push it, then?\" \"Because I've left my license at home!\"", 
    "options": [
        [
            "worry", 
            "loves", 
            "dislike", 
            "like"
        ], 
        [
            "but", 
            "and", 
            "of", 
            "so"
        ], 
        [
            "forgot", 
            "enjoyed", 
            "decided", 
            "asked"
        ], 
        [
            "young", 
            "old", 
            "smart", 
            "weak"
        ], 
        [
            "cold", 
            "hot", 
            "rainy", 
            "dry"
        ], 
        [
            "anything", 
            "nothing", 
            "something", 
            "everything"
        ], 
        [
            "sad", 
            "surprised", 
            "happy", 
            "surprising"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "C", 
        "B", 
        "B", 
        "C", 
        "B"
    ], 
    "source": "middle1942"
}