{
    "article": "In one way of thinking, failure is part of life. In  _  way, failure may be a way towards success. The \"Spider-story\" is often  _  . Robert Bruce , leader of the Scots in the 13th century, was hiding in a cave from the English. He watched a spider  _  a web. The spider tried to reach across a rough  _  in the rock. He tried six times. On the  _  time he made it and went on to make his web. Bruce is said to have been encouraged by this and to have gone on to  _  the English. Edison, the inventor of the light bulb, made  hundreds of  models that failed before he found the right way to make one. Once he was asked  _  he kept on trying to make a new type of battery when he had failed so often, he replied, \"Failure? I have  _  failure. Now I know 50,000 ways it won't  _  So what? First,always think about your failure. What caused  _  ?Were conditions right? Were you in top from yourself? What can you change? So things will go  _  next time. Second, is the goal you're trying to reach the right one? Try to do some  _  about what your real goals may be. Think about this question. \"If I do succeed in this, where will it get me?\" This may help you prevent failure in things you shouldn't be doing any way. The third thing to keep in  _  about failure is that it's a part of life. Learn to \"live with yourself\" even though you may have  _  .", 
    "options": [
        [
            "other", 
            "another", 
            "first", 
            "second"
        ], 
        [
            "told", 
            "said", 
            "talked", 
            "spoken"
        ], 
        [
            "doing", 
            "taking", 
            "making", 
            "playing"
        ], 
        [
            "room", 
            "house", 
            "place", 
            "soil"
        ], 
        [
            "tenth", 
            "sixth", 
            "eighth", 
            "seventh"
        ], 
        [
            "save", 
            "help", 
            "defeat", 
            "kill"
        ], 
        [
            "why", 
            "when", 
            "what", 
            "who"
        ], 
        [
            "not", 
            "no", 
            "never", 
            "nothing"
        ], 
        [
            "do", 
            "make", 
            "took", 
            "work"
        ], 
        [
            "one", 
            "it", 
            "that", 
            "this"
        ], 
        [
            "high", 
            "large", 
            "right", 
            "bright"
        ], 
        [
            "Thinking", 
            "shopping", 
            "reading", 
            "cleaning"
        ], 
        [
            "heart", 
            "eyes", 
            "ears", 
            "mind"
        ], 
        [
            "failed.", 
            "succeeded", 
            "finished", 
            "passed"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "C", 
        "D", 
        "C", 
        "A", 
        "B", 
        "D", 
        "B", 
        "C", 
        "A", 
        "D", 
        "A"
    ], 
    "source": "middle1797"
}