{
    "article": "Jim is a successful businessman. One day he told the experience of  _ childhood. When he was twelve, his parents  _ . He was alone and didn't get on well with others. People always laughed at him. No one showed kindness*  _  him. His only friend was a dog named Tiger.\nOne day as he walked down the street, a young lady was walking in front of him. Suddenly one of her  _ dropped from her arms. When she stopped to pick it up, She dropped other bags. He came to help her. \"Thank you, dear! You are a nice boy!\" She said kindly, smiling.\nA special feeling came to him. These were the  _ kind words for him. He watched her  _ she went far away, and he took his dog to a river nearby. \"Thank you dear, you are a nice little boy.\" He said the words again and again. Then in a low  _  he said to his dog, \"You are a nice little dog!\" Tiger raised its ear as if it understood. \"Uh! Even a dog likes it!\" he said, \"Well, Tiger, I won't say unkind words to you from now on.\" Tiger waved* its tail*  _ .\nThe boy thought and thought. Finally, he looked at himself in the river. He saw nothing but a dirty boy. He washed his face  _ . Again he looked. He saw a clean nice boy. He was so pleased. From then on, he had a new life.\nAfter telling this, the businessman stopped for a while, and then he said, \"Boys and girls, this is the place where that kind woman planted in me the first seed* of kindness. All of us should learn about kindness, How wonderful it is!\"\nIf you  _  kindness to others, you will be a great man..", 
    "options": [
        [
            "he", 
            "his", 
            "him", 
            "himself"
        ], 
        [
            "die", 
            "died", 
            "dead", 
            "dying"
        ], 
        [
            "at", 
            "to", 
            "with", 
            "about"
        ], 
        [
            "bags", 
            "money", 
            "boxes", 
            "coats"
        ], 
        [
            "first", 
            "second", 
            "third", 
            "last"
        ], 
        [
            "before", 
            "while", 
            "until", 
            "when"
        ], 
        [
            "sound", 
            "noise", 
            "voice", 
            "noisy"
        ], 
        [
            "sadly", 
            "happily", 
            "angrily", 
            "differently"
        ], 
        [
            "careful", 
            "Carefully", 
            "careless", 
            "carelessly"
        ], 
        [
            "buy", 
            "sell", 
            "show", 
            "Receive"
        ]
    ], 
    "answers": [
        "B", 
        "B", 
        "B", 
        "A", 
        "A", 
        "C", 
        "C", 
        "B", 
        "B", 
        "C"
    ], 
    "source": "middle190"
}