{
    "article": "When I finished my work and put away my things, I hurried to drive home for my 30 birthday celebration. My husband called, he would give me a  _  this evening. Then I came up to a red light and stopped. As I was  _  , I saw a young guy standing on my left. He was pale in the face and  _  a cardboard sign with some writing on it. When you're in the heart of downtown, it's pretty  _  to see homeless people asking for money. Generally, I would  _  them, but this time when I looked over the sign, I stopped. I didn't know  _  , but this sign struck me. I can't remember what the sign said  _  , but it was something like: \"Need money /  _  , have stomach cancer, homeless, anything helps.\" The light had just turned green, and there was a line of supper rush hour traffic  _  me. I went back and forth in my mind a hundred times in that next second.\" Should I do something or just  _  ?\" The traffic moved forward, and I went with it. About a block or two away, my heart had sunk simply for this guy. I felt so  _  for him. So, I decided to go back and ask him if I could buy him some food and listen to his  _  . It took me about five minutes to turn around and back on to the same  _  where I had seen him. It was just five minutes--but he had gone. \"Where did he go so fast?\" I wondered. So, there was  _  left to do except going on my driving. Back at home, I just couldn't  _  happy when I thought of the pale face. If you get an idea from inside you, act on it. Don't miss out--for yourself and for that other person.", 
    "options": [
        [
            "kiss", 
            "hand", 
            "donation", 
            "surprise"
        ], 
        [
            "shopping", 
            "waving", 
            "waiting", 
            "standing"
        ], 
        [
            "pulling", 
            "pushing", 
            "holding", 
            "throwing"
        ], 
        [
            "common", 
            "hard", 
            "impossible", 
            "strange"
        ], 
        [
            "help", 
            "pass", 
            "stop", 
            "join"
        ], 
        [
            "how", 
            "when", 
            "where", 
            "why"
        ], 
        [
            "suddenly", 
            "gradually", 
            "exactly", 
            "hardly"
        ], 
        [
            "clothing", 
            "food", 
            "medicine", 
            "house"
        ], 
        [
            "beside", 
            "before", 
            "above", 
            "behind"
        ], 
        [
            "wait", 
            "drive", 
            "walk", 
            "greet"
        ], 
        [
            "upset", 
            "thankful", 
            "impolite", 
            "angry"
        ], 
        [
            "advice", 
            "songs", 
            "jokes", 
            "story"
        ], 
        [
            "street", 
            "house", 
            "light", 
            "store"
        ], 
        [
            "everything", 
            "anything", 
            "something", 
            "nothing"
        ], 
        [
            "remain", 
            "appear", 
            "seem", 
            "become"
        ]
    ], 
    "answers": [
        "D", 
        "C", 
        "C", 
        "A", 
        "B", 
        "D", 
        "C", 
        "B", 
        "D", 
        "B", 
        "A", 
        "D", 
        "A", 
        "D", 
        "B"
    ], 
    "source": "middle653"
}