{
    "article": "Robert is a thirty-five-year-old American. He becomes a _ man in science. Once, he was interviewed by a newspaper reporter who asked him why he could be so much more creative than other people. He said that, in his opinion, it all came from an experience with his _ when he was about two years old.\nThat day, when he was trying to _ a bottle of milk out of the fridge, but he dropped the milk bottle. The milk spilled all over the  _ floor, which turned out to be a sea of milk. He was afraid.\nWhen his mother came into the kitchen, instead of shouting at him, she smiled. She said, \"Robert, what a great and wonderful mess you have made! I have  _ seen such a huge puddle of milk before. Well, since it has already been done, would you like to get down and play in the milk for a moment before we clean it up?\" Robert did _ his mother told him.\nAfter a few minutes, his mother said, \"You know, Robert, whenever you make a mess like this, you have to clean it up at last and put _ to its right place. So, how would you like to do that? We could use a sponge, a towel or a mop . Which do you prefer?\" He _ the sponge and together they cleaned up he milk.\nHis mother then said, \"You'd better learn _ to carry a big milk bottle with two small hands, OK? Let's go out in the back yard and fill the bottle with water and see if you can find a way to carry it without _ it.\"\nThe little boy _ that if he held the bottle at the top near the lip  with both hands, he could make it. What a wonderful lesson!\nIt was at that moment that Robert knew he didn't need to be  _ to make mistakes. Instead, he learned that mistakes were just _ to learn something new, and that is what scientific experiments are all about. _ sometimes the experiment \"doesn't work\", we usually can learn something meaningful from it. Wouldn't it be great if all parents would do the same as Robert's mother does?", 
    "options": [
        [
            "poor", 
            "successful", 
            "lucky", 
            "friendly"
        ], 
        [
            "father", 
            "brother", 
            "mother", 
            "sister"
        ], 
        [
            "pass", 
            "take", 
            "borrow", 
            "hide"
        ], 
        [
            "bedroom", 
            "study", 
            "bathroom", 
            "kitchen"
        ], 
        [
            "always", 
            "often", 
            "never", 
            "sometimes"
        ], 
        [
            "though", 
            "as", 
            "for", 
            "until"
        ], 
        [
            "something", 
            "everything", 
            "nothing", 
            "anything"
        ], 
        [
            "needed", 
            "enjoyed", 
            "lent", 
            "chose"
        ], 
        [
            "how", 
            "where", 
            "why", 
            "when"
        ], 
        [
            "keeping", 
            "throwing", 
            "leaving", 
            "dropping"
        ], 
        [
            "invited", 
            "helped", 
            "learned", 
            "followed"
        ], 
        [
            "afraid", 
            "difficult", 
            "terrible", 
            "dangerous"
        ], 
        [
            "decisions", 
            "suggestions", 
            "chances", 
            "plans"
        ], 
        [
            "Although", 
            "Because", 
            "Since", 
            "If"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "B", 
        "D", 
        "C", 
        "B", 
        "B", 
        "D", 
        "A", 
        "D", 
        "C", 
        "A", 
        "C", 
        "A"
    ], 
    "source": "middle374"
}