{
    "article": "Dad lost his job after arguing with the boss, and when Christmas came that year, we had no money at all. On Christmas Eve, Dad took me out into the park. I had a blanket wrapped around me, so I offered to share  _  with Dad, but he said no thanks. We looked  _  at the sky. Those shining stars were one of the  _  treats for people like us who lived out in the wildness . Rich city people, he'd say, live in fantastic flats, but their air was so polluted that they could not even see the stars. \"  _  out your favorite star.\" Dad said that night. He told me I could have it for keeping. He said it was my Christmas present. \"You can't give me a star,\" I said, \"Nobody  _  the stars.\" \"Right,\" Dad said, \"But you can suppose it is yours. And when you do that, it is yours.\" I  _  my head, looked at the stars, and tried to figure out which was the best one. Then, I found one. \"I  _  that one.\" I said. Dad smiled. \"That's Venus ,\" he said, \"Venus was only a planet. She looked bigger and brighter because she was much  _  than the stars. Poor old Venus didn't even make her own light. She shone only from reflected  _  .\" \"I like it anyway,\" I said, \"I had loved Venus even  _  that Christmas. You could see it in the early evening, and if you got up early, you could still see it in the morning, after all the stars had disappeared.\" Dad said, \"Ok, it's Christmas. I  _  your decision. You can have it if you want.\" And he gave me Venus. We all laughed about the kids who believed in the Santa myth and got nothing for Christmas but a bunch of cheap plastic toys. \"Many years later, when all the junk they got is broken and long forgotten,\" Dad said, \"you will  _  have your star.\"", 
    "options": [
        [
            "it", 
            "me", 
            "us", 
            "him"
        ], 
        [
            "up", 
            "for", 
            "out", 
            "after"
        ], 
        [
            "strange", 
            "special", 
            "important", 
            "impossible"
        ], 
        [
            "Go", 
            "Put", 
            "Take", 
            "Pick"
        ], 
        [
            "owns", 
            "sees", 
            "likes", 
            "reaches"
        ], 
        [
            "lowed", 
            "put", 
            "raised", 
            "rose"
        ], 
        [
            "need", 
            "want", 
            "have", 
            "hope"
        ], 
        [
            "slower", 
            "farther", 
            "closer", 
            "higher"
        ], 
        [
            "sun", 
            "star", 
            "planet", 
            "light"
        ], 
        [
            "when", 
            "before", 
            "after", 
            "until"
        ], 
        [
            "dislike", 
            "refuse", 
            "accept", 
            "consider"
        ], 
        [
            "even", 
            "still", 
            "never", 
            "already"
        ]
    ], 
    "answers": [
        "A", 
        "A", 
        "B", 
        "D", 
        "A", 
        "C", 
        "B", 
        "C", 
        "D", 
        "B", 
        "C", 
        "B"
    ], 
    "source": "middle72"
}