{
    "article": "Many cultures in the world tell stories about dragons. In some cultures they are good and in some they are bad. No matter good or bad, in the stories they are always _ and have supernatural power. Some people say that there used to be real dragons, but most agree that they were imaginary creatures  .\nDragons in China and other Asian countries are usually said to be _ . People say that they bring strength, good luck, and health. In ancient China, the dragon was a _ of the Chinese emperors. Some Chinese people believe that dragons live under water most of the time. Unlike European dragons, they do not have wings, and they _ using magic. The Chinese dragon looks like a long snake with four claws. In the Chinese lunar calendar, people born in the \"Year of the Dragon\" are _ to be lucky, brave, healthy, energetic and excitable. The Dragon person can't make great achievements in life _ he or she knows how to make the best use of his or her energy, intelligence, and talent.\nIn European legends, dragons are usually seen _ greedy   and cruel winged devils  . The European dragon is also described to be a strong and smart creature. Any knight   who killed a dragon was able to get not only its treasure but also its _ . In Christianity  , the devil is sometimes shown as a dragon. It has become popular for the _ of popular stories to fight angry dragons. Dragons continue to live in storybooks. Modern fantasy writers _ write books about heroes fighting dragons. Although dragons appear in many legends around the world, different cultures have different stories about them.", 
    "options": [
        [
            "strong", 
            "awful", 
            "loyal", 
            "proud"
        ], 
        [
            "gentle", 
            "terrible", 
            "kind", 
            "guilty"
        ], 
        [
            "symbol", 
            "dream", 
            "memory", 
            "mystery"
        ], 
        [
            "move", 
            "fly", 
            "rush", 
            "jump"
        ], 
        [
            "considered", 
            "confirmed", 
            "compared", 
            "controlled"
        ], 
        [
            "after", 
            "whenever", 
            "since", 
            "unless"
        ], 
        [
            "with", 
            "for", 
            "as", 
            "by"
        ], 
        [
            "success", 
            "calm", 
            "charm", 
            "wisdom"
        ], 
        [
            "detectives", 
            "heroes", 
            "emperors", 
            "enemies"
        ], 
        [
            "even", 
            "ever", 
            "still", 
            "just"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "A", 
        "B", 
        "A", 
        "D", 
        "C", 
        "D", 
        "B", 
        "A"
    ], 
    "source": "middle829"
}