{
    "article": "From Monday to Friday most people are busy working or studying, but in the evenings and weekends they are free and  _  themselves. Some watch television or go to the movies, others  take part in  sports. This is decided by their own  _  .There are many different ways to spend our  _  time. Almost everyone has some kind of  _  : it may be something from collecting stamps to  _  model planes. Some hobbies are very  _  , but others don't cost anything at all. Some collections are worth  a lot  of money, others are valuable only to their owners. I know a man who has a coin collection worth several  thousand  dollars. A short time ago he bought a rare fifty-cent piece which  _  him $250!He was very happy about this collection and thought the price was all right . On the other hand, my youngest brother collects match boxes. He has almost 600 of them, but I wonder  _  they are worth any money. However,  _  my brother they are quite valuable .  _  makes him happier than to find a new match box for his collection. That's what a hobby means, I think. It is something we  _  to do in our free time just for the  _  of it . The value in dollars is not important. but the pleasure it gives us is.", 
    "options": [
        [
            "love", 
            "work", 
            "enjoy", 
            "play"
        ], 
        [
            "lives", 
            "interests", 
            "jobs", 
            "things"
        ], 
        [
            "working", 
            "free", 
            "own", 
            "whole"
        ], 
        [
            "hobby", 
            "thing", 
            "job", 
            "way"
        ], 
        [
            "driving", 
            "making", 
            "buying", 
            "selling"
        ], 
        [
            "interesting", 
            "exciting", 
            "cheap", 
            "expensive"
        ], 
        [
            "paid", 
            "cost", 
            "took", 
            "spent"
        ], 
        [
            "that", 
            "if", 
            "what", 
            "why"
        ], 
        [
            "to", 
            "on", 
            "with", 
            "in"
        ], 
        [
            "Everything", 
            "Anything", 
            "Nothing", 
            "Something"
        ], 
        [
            "have", 
            "need", 
            "refuse", 
            "like"
        ], 
        [
            "money", 
            "work", 
            "fun", 
            "time"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "B", 
        "A", 
        "B", 
        "D", 
        "B", 
        "B", 
        "A", 
        "C", 
        "D", 
        "C"
    ], 
    "source": "middle0"
}