{
    "article": "One day Mark was walking home from school. Then he noticed a boy in front of him fell down _ dropped all of the books, along with two sweaters, a baseball bat and several other things. Mark went to help the boy  pick up the things. Because they were going the same way, Mark _ to carry some of his things. As they walked, Mark learned some things about the _ . His name was Bill. He loved computer science, P.E. and history. He was having lots of trouble with his _  subjects and he had just been scolded  by his parents.\nThey arrived at  Bill's home and Mark was invited in to have a coke and to watch some television. The afternoon passed  _ with a few laughs, and then Mark went home. They continued to see each other around school, had lunch together, and then both went to the same senior high school. Just three weeks before graduation, Bill asked Mark _ they could talk.\nBill reminded Mark _ the day years ago when they first met. \"Did you ever wonder why I was carrying so many things home that day?\" asked Bill. \"I planned to run away . But after we spent some time together talking and laughing, I changed my mind. So you see, Mark, when you picked up my things that day, you did a lot more. You changed my life.\"", 
    "options": [
        [
            "but", 
            "and", 
            "then", 
            "before"
        ], 
        [
            "wanted", 
            "began", 
            "started", 
            "helped"
        ], 
        [
            "boy", 
            "girl", 
            "name", 
            "trouble"
        ], 
        [
            "own", 
            "other", 
            "math", 
            "Chinese"
        ], 
        [
            "sadly", 
            "slowly", 
            "quietly", 
            "happily"
        ], 
        [
            "why", 
            "when", 
            "where", 
            "whether"
        ], 
        [
            "on", 
            "of", 
            "in", 
            "for"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "A", 
        "B", 
        "D", 
        "D", 
        "B"
    ], 
    "source": "middle1568"
}