{
    "article": "Lisa has always been overweight. She wanted to lose weight, not just because she wanted to  _  more beautiful and he healthier, but also because it would make life easier. For example, it was  _  for Lisa to find ready-made clothes that would fit. She had to ask a tailor  to make  clothes that were large enough. In school, she needed a special chair  _  was bigger and stronger than the other chairs. If she went for a walk, she got tired very quickly. She was also unhappy about the way people treated  _  sometimes. \"People look at me and even make fun of me. That's unfair! It's true that I'm overweight, but I don't think people  _  treat me differently because I'm big. I can't enjoy  having dinner  with my friends because I'm afraid of getting fatter.\" Her friends and family never made fun of her. They tried to help her  _  . They wanted her to be happy and healthy. Sometimes when Lisa was feeling sad, she didn't want to speak to  _  . But now things  _  quite different. Last month her classmates were preparing for the School  _  Week. Someone advised Lisa to play the lead role of the proud Queen who was tall and fat. Lisa  _  and practiced a lot. Soon after the play, Lisa became the star! She did  _  well that everybody remembered the proud Queen. They stood around her and said \"  Congratulations  \" to her. She even won the School Best Actress Award for her wonderful performance. Now Lisa doesn't worry  _  being fat any more. She believes in the English saying \"Every dog has its day.\"", 
    "options": [
        [
            "see", 
            "watch", 
            "notice", 
            "look"
        ], 
        [
            "easy", 
            "difficult", 
            "wrong", 
            "right"
        ], 
        [
            "who", 
            "what", 
            "which", 
            "whose"
        ], 
        [
            "her", 
            "him", 
            "me", 
            "you"
        ], 
        [
            "can", 
            "may", 
            "should", 
            "must"
        ], 
        [
            "however", 
            "instead", 
            "though", 
            "either"
        ], 
        [
            "nobody", 
            "someone", 
            "anyone", 
            "everyone"
        ], 
        [
            "was", 
            "is", 
            "were", 
            "are"
        ], 
        [
            "Sports", 
            "Art", 
            "Science", 
            "Environment"
        ], 
        [
            "agreed", 
            "disagreed", 
            "refused", 
            "allowed"
        ], 
        [
            "very", 
            "too", 
            "such", 
            "so"
        ], 
        [
            "with", 
            "about", 
            "in", 
            "for"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "C", 
        "A", 
        "C", 
        "B", 
        "C", 
        "D", 
        "B", 
        "A", 
        "D", 
        "B"
    ], 
    "source": "middle794"
}