{
    "article": "My son Joey was born with club feet. The doctors said that with treatment he would be able to walk, but would never run very well. The first three years of his life was  _  in hospital. By the time he was eight, you wouldn't know he has a problem when you saw him  _  . Children in our neighborhood always ran around  _  their play, and Joey would jump and ran and play,  _  . We never told him that he probably wouldn't be  _  to run like the other children. So he didn't know. In  _  grade he decided to join the school running team. Every day he trained. He ran more than any of the others,  _  only the top seven runners would be chosen to run for the  _  . We didn't tell him he probably would never make the team, so he didn't know. He ran four to five mile every day--even when he had a fever. I was  _  , so I went to  look for  him after school. I found him running  _  . I asked him how he felt. \"Okay,\" he said. He has two more miles to go. Yet he looked straight ahead and kept  _  . Two weeks later, the names of the team  _  were out. Joey was number six on the list. Joey had  _  the team. He was in seventh grade -- the other six team members were all eighth graders. We never told him he couldn't do it ... so he didn't know. He just  _  it.", 
    "options": [
        [
            "spent", 
            "taken", 
            "cost", 
            "paid"
        ], 
        [
            "talk", 
            "sit", 
            "study", 
            "walk"
        ], 
        [
            "after", 
            "before", 
            "during", 
            "till"
        ], 
        [
            "either", 
            "too", 
            "though", 
            "yet"
        ], 
        [
            "able", 
            "sorry", 
            "glad", 
            "afraid"
        ], 
        [
            "sixth", 
            "seventh", 
            "six", 
            "seven"
        ], 
        [
            "so", 
            "if", 
            "then", 
            "because"
        ], 
        [
            "neighborhood", 
            "family", 
            "school", 
            "grade"
        ], 
        [
            "excited", 
            "tired", 
            "pleased", 
            "worried"
        ], 
        [
            "alone", 
            "away", 
            "almost", 
            "already"
        ], 
        [
            "riding", 
            "walking", 
            "playing", 
            "running"
        ], 
        [
            "jumpers", 
            "runners", 
            "doctors", 
            "teachers"
        ], 
        [
            "got", 
            "kept", 
            "made", 
            "found"
        ], 
        [
            "made", 
            "played", 
            "had", 
            "took"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "C", 
        "B", 
        "A", 
        "B", 
        "D", 
        "C", 
        "D", 
        "A", 
        "D", 
        "B", 
        "C", 
        "D"
    ], 
    "source": "middle351"
}