{
    "article": "Driving a car at a high speed along a highway seems to be fun. You only need to  _  the bright traffic signs beside the highway and it will take you where you wish to go. But to a London taxi driver, driving is not an easy job. A taxi driver needs to have not only good driving skills but also a good  _  of the city of London, from the  _  street to the most popular restaurant around. He has to be at the service of all kinds of passengers at all times. A London taxi driver said the following about his job. During the night it is  _  for him to stop two or three times for some food. He said, \"I never  _  when I'm working, otherwise, I'd lose my license .\" He usually goes home between two and three o'clock in the morning. There are times he has to stay  _  and try to make more runs. He said, \"That's the worst thing about working for yourself. If you don't make money, no one is going to  _  it to you. \" London taxi drivers not only \"take\" but also \"give\". Every summer hundreds of poor  _  from London go for a day at the sea -- by taxi! Their rides are  _  by the taxi drivers. At the sea, they are met by the mayor , and a lunch party is also held for the taxi drivers and the children. After a happy day's running around the  _  and visiting the market there, the children go home again by taxi, free of charge of course!", 
    "options": [
        [
            "catch", 
            "meet", 
            "follow", 
            "throw"
        ], 
        [
            "taste", 
            "knowledge", 
            "dream", 
            "teacher"
        ], 
        [
            "noisiest", 
            "coldest", 
            "dirtiest", 
            "loneliest"
        ], 
        [
            "usual", 
            "strange", 
            "dangerous", 
            "impossible"
        ], 
        [
            "speak", 
            "sing", 
            "run", 
            "drink"
        ], 
        [
            "shorter", 
            "longer", 
            "earlier", 
            "higher"
        ], 
        [
            "give", 
            "lend", 
            "send", 
            "return"
        ], 
        [
            "elderly", 
            "farmers", 
            "patients", 
            "children"
        ], 
        [
            "paid", 
            "borrowed", 
            "sent", 
            "spent"
        ], 
        [
            "buildings", 
            "mountains", 
            "beaches", 
            "roads"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "D", 
        "A", 
        "D", 
        "B", 
        "A", 
        "D", 
        "A", 
        "C"
    ], 
    "source": "middle1446"
}