{
    "article": "Reuben, a 12-year-old boy, saw something in a shop window. But the price--five dollars--was far beyond his means. He couldn't ask his parents  _  the money. His father made a living through  _  in Bay Roberts. His mother, Dora, tried hard to feed and clothe their five children. Hesitating for a few minutes, he opened the  _  and talked to the shopkeeper. \"...I don't have the money right now. Can you please  _  it for me?\" \"I'll try,\" the shopkeeper smiled. Reuben respectfully touched his worn cap and walked out. Hearing the sound of hammering from a side street, he suddenly had a(an)  _  . He ran towards the sound and stopped at a construction site .Reuben knew he could collect the discarded nails and sell them to the factory for five cents  _  . He looked for nails until sunset. Then he ran to the factory and sold them. Reuben tightly clutched the five-cent pieces and ran home. He found a rusty iron can and dropped his  _  inside. Then he rushed into the barn near his house and hid it. It was dinner time when Reuben got home. His father sat at the big kitchen table, working on a fishnet. Dora was at the kitchen stove, ready to serve  _  as Reuben took his place at the table. Looking at his mother, Reuben smiled. Every day after school, Reuben searched the town, trying to finish his  _  task. Finally, the time had come! He ran into the barn, opened the can, poured the coins out and began to count. He still needed 20 cents! He had to sell four nails  _  the day ended. Rushing to the town, Reuben searched every corner. It was getting dark when Reuben arrived at the factory. The man at the factory was about to  lock up  . \"Please, mister. I have to sell these nails now--please.\" \"Why do you need this money so  _  ?\" \"It's a secret.\" The man took the nails, reached into his pocket and put four coins in Reuben's hand. Clutching the can tightly, Reuben  _  for the shop. \"I have the  _  \" he solemnly told the owner. Back home, his mother was cleaning the kitchen. \"Here, Mum! Here!\" Reuben shouted as he ran to her. He  _  a small box in her roughened hand. She opened it carefully. A blue-velvet jewel box appeared. Dora lifted the lid . Tears began to blur her vision. In gold lettering on a small, almond-shaped brooch was the word Mother. It was Mother's Day, 1946.", 
    "options": [
        [
            "about", 
            "for", 
            "of", 
            "with"
        ], 
        [
            "farming", 
            "driving", 
            "fishing", 
            "cleaning"
        ], 
        [
            "door", 
            "shop", 
            "window", 
            "box"
        ], 
        [
            "buy", 
            "watch", 
            "make", 
            "keep"
        ], 
        [
            "task", 
            "goal", 
            "plan", 
            "idea"
        ], 
        [
            "each", 
            "any", 
            "either", 
            "all"
        ], 
        [
            "nails", 
            "cans", 
            "coins", 
            "dollars"
        ], 
        [
            "breakfast", 
            "table", 
            "lunch", 
            "dinner"
        ], 
        [
            "public", 
            "secret", 
            "exciting", 
            "surprising"
        ], 
        [
            "before", 
            "after", 
            "when", 
            "while"
        ], 
        [
            "hurriedly", 
            "hardly", 
            "badly", 
            "immediately"
        ], 
        [
            "went", 
            "looked", 
            "paid", 
            "left"
        ], 
        [
            "pocket", 
            "money", 
            "lid", 
            "time"
        ], 
        [
            "moved", 
            "pulled", 
            "placed", 
            "took"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "D", 
        "D", 
        "A", 
        "C", 
        "D", 
        "B", 
        "A", 
        "A", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "middle1822"
}