{
    "article": "In many big cities in the world, the overuse of cars is thought to be one of the main causes of air pollution.\nWhat will cars be like in the future? Some experts  think that today's cars are in trouble _ they use too much petrol  . They say the cars of the future will be much, much smaller. They will be made _ engines   or air conditioning. They'll have no radio or lights. Tomorrow's car will be an open air car with no doors or _ . It needn't have a pollution control system because it won't use petrol. In fact, this new car will be pushed by the driver's feet. Very few people will be killed in accidents, because the speed will be five miles per hour at most . However, we are also told not to ask for beautiful colors, because the cars will come in grey only.\nOther car experts do not hold the same idea. They are _ that the future will be happier. They think that all our _ will soon be solved by car companies with the production of the Supercar. Tomorrow's car will be _ , faster, and more comfortable than before. The Supercar will have four rooms, TVs, running water, heat, air conditioning, and maybe a swimming pool. Large families will travel on long trips _ . If petrol is in short supply  , the Supercar will run on water.", 
    "options": [
        [
            "but", 
            "because", 
            "although", 
            "until"
        ], 
        [
            "from", 
            "of", 
            "with", 
            "without"
        ], 
        [
            "windows", 
            "walls", 
            "boards", 
            "seats"
        ], 
        [
            "sure", 
            "kind", 
            "excited", 
            "sad"
        ], 
        [
            "questions", 
            "information", 
            "problems", 
            "situation"
        ], 
        [
            "shorter", 
            "less", 
            "smaller", 
            "bigger"
        ], 
        [
            "quickly", 
            "comfortably", 
            "suddenly", 
            "exactly"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "A", 
        "A", 
        "C", 
        "D", 
        "B"
    ], 
    "source": "middle68"
}