{
    "article": "Peter and Paul had a permission from their parents to camp in a field close to their farm. But, being adventurous boys, they knew it would be more _ to camp in the woods that lay beyond the river. Excitedly, the boys went away with their tent and food.\nCarrying their heavy load, the two brothers walked along the riverbank, _ noticing the distance or the sun beating down. They were eager to reach their destination before lunchtime. As they entered the cool, shadowy woods, they began to search for a suitable camping spot. Peter wanted to _ close to the river at the edge of the woods, but Paul, who was older, insisted that they camp further away. _ Peter followed his brother deeper into the woods. \"This really is a wonderful setting!\" said Paul in excitement. They put up the tent, and settled down to eat the sandwiches they had made, then decided to find their way _ to the river to catch some fish.\n\"Are you sure that this is the right way  ?\" whispered Peter shakily. \"I'm sure we passed that hollow tree just a while ago. \" Paul walked _ silently. \"Look, there it is again. We're lost, aren't we?\" complained Peter. Paul had to admit that he didn't know where they were. _ , they were a long distance from where they were supposed to be. They were not even sureof where they had set up their camp. They set in _ for a few minutes until Peter had a bright idea. \"Why don't we look for clues  the way trackers do in the movies? We weren't careful about how we walked, so I'm sure we would have left behindsome broken tree branches and leaves. \"\nCarefully, the boys followed the marks that they had left, until finally they found their campsite. Hurriedly, they packed their belongings and set off _ the direction of the river.\nWhat would their parents think of their adventure?", 
    "options": [
        [
            "surprising", 
            "exciting", 
            "annoying", 
            "frightening"
        ], 
        [
            "hardly", 
            "quickly", 
            "really", 
            "properly"
        ], 
        [
            "live", 
            "lie", 
            "wait", 
            "stay"
        ], 
        [
            "unfriendly", 
            "unluckily", 
            "unwillingly", 
            "uninterestingly"
        ], 
        [
            "forward", 
            "near", 
            "back", 
            "further"
        ], 
        [
            "alone", 
            "about", 
            "in", 
            "on"
        ], 
        [
            "Afterall", 
            "Atlast", 
            "Aboveall", 
            "Atfirst"
        ], 
        [
            "enjoyment", 
            "satisfaction", 
            "disappointment", 
            "imagination"
        ], 
        [
            "for", 
            "to", 
            "at", 
            "in"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "D", 
        "C", 
        "C", 
        "D", 
        "A", 
        "C", 
        "D"
    ], 
    "source": "middle783"
}