{
    "article": "You want to run across the street to catch the bus which is leaving soon? But  _  ! You'd better not. If a policeman sees you, you'll have to pay a fine . New traffic laws say that  _  people cross the street when the light is red, they can be fined as much as 50 yuan. Traffic accidents  _  more than 104,000 people in China last year. Chinese cities have  _  cars than ever. Drivers and pedestrians must work together to make the streets  _  . The law has new rules for drivers and pedestrians. Drivers have to  _  down when they are close to crosswalks. If people are in a crosswalk, cars must  _  to let them pass. There are  _  for bus drivers, too. If bus drivers smoke, drink or make phone calls  _  driving, they can be fined. Buses that carry too many people are  _  against the law. Pedestrians will have to walk more safely under the new law. They must cross streets at crosswalks. Also, they shouldn't climb over the fences  _  streets. Do you ride a bike to school? It's not a good idea to  _  classmates on the back. You could be fined 50 yuan. And stay in the bike lane when you're riding. The big roads are  _  cars and buses. If you see a hit-and -run , tell the police. They may give you a reward . And don't be  _  to help people to the hospital if they are hurt in an accident. Don't worry about money. The new law says that  _  must take care of them even if they can't pay right away.", 
    "options": [
        [
            "hurry", 
            "look", 
            "wait", 
            "listen"
        ], 
        [
            "if", 
            "when", 
            "so", 
            "though"
        ], 
        [
            "did", 
            "killed", 
            "died", 
            "ran"
        ], 
        [
            "fewer", 
            "more", 
            "less", 
            "larger"
        ], 
        [
            "safer", 
            "happier", 
            "lighter", 
            "slower"
        ], 
        [
            "slow", 
            "play", 
            "run", 
            "pass"
        ], 
        [
            "like", 
            "go", 
            "turn", 
            "stop"
        ], 
        [
            "rules", 
            "articles", 
            "letters", 
            "exercises"
        ], 
        [
            "if", 
            "while", 
            "because", 
            "as"
        ], 
        [
            "also", 
            "sometimes", 
            "never", 
            "often"
        ], 
        [
            "through", 
            "across", 
            "into", 
            "along"
        ], 
        [
            "carry", 
            "take", 
            "bring", 
            "move"
        ], 
        [
            "in", 
            "on", 
            "for", 
            "at"
        ], 
        [
            "happy", 
            "afraid", 
            "sad", 
            "great"
        ], 
        [
            "policemen", 
            "doctors", 
            "teachers", 
            "farmers"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "B", 
        "B", 
        "A", 
        "A", 
        "D", 
        "A", 
        "B", 
        "A", 
        "D", 
        "A", 
        "C", 
        "B", 
        "B"
    ], 
    "source": "middle1800"
}