{
    "article": "A little boy knocked on the door of the old house. He waited, and sweated from  _  of seeing the owner, who hardly ever came out. As he was ready to  walk away  , the door slowly opened. \"What do you want?\" the old man asked. \"Uh, sir, I'm  _  magazines for school and I am  _  if you would like to buy one.\" The old man only looked at the boy.  At the same time  , the boy saw many dog figurines inside the house. \"Do you  _  dogs?\" he asked. \"Yes, I have many dog figurines in my house; they are all I have.\" The boy then felt sorry for the man, as it seemed he was very  _  . \"Well, I do have a magazine here for collectors. It is suitable  _  you. I also have one about dogs since you...\" The old man started to close the door, saying  _  \"No, boy. I don't need any magazines of any kind. Now goodbye.\" The boy was sad for the old man being so lonely. He went home and then had an  _  . He had a little dog figurine which didn't  _  much to him since he had a real live dog and a large family. The boy headed back. He knocked on the door again and this time the old man came right to the door. \"Boy, I thought I told you no  _  .\" \"I'm sorry, sir,  _  I want to bring you a gift.\" The boy  _  him the figurine and the old man's face lit up . \"Boy, you have a big heart  _  are you doing this?\" \"I think it means more to you.\" From that day on, the old man started coming out and talking with neighbors.", 
    "options": [
        [
            "excitement", 
            "fear", 
            "sadness", 
            "happiness"
        ], 
        [
            "selling", 
            "collecting", 
            "raising", 
            "designing"
        ], 
        [
            "sure", 
            "sorry", 
            "expecting", 
            "wondering"
        ], 
        [
            "keep", 
            "hate", 
            "kill", 
            "collect"
        ], 
        [
            "lonely", 
            "delightful", 
            "busy", 
            "bored"
        ], 
        [
            "to", 
            "with", 
            "for", 
            "on"
        ], 
        [
            "easily", 
            "coldly", 
            "comfortably", 
            "nervously"
        ], 
        [
            "thought", 
            "opinion", 
            "idea", 
            "mind"
        ], 
        [
            "worth", 
            "mean", 
            "talk", 
            "use"
        ], 
        [
            "noises", 
            "trouble", 
            "Dogs", 
            "magazines"
        ], 
        [
            "so", 
            "and", 
            "or", 
            "but"
        ], 
        [
            "handed", 
            "lent", 
            "offered", 
            "presented"
        ], 
        [
            "How", 
            "When", 
            "Why", 
            "What"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "D", 
        "D", 
        "A", 
        "C", 
        "B", 
        "C", 
        "B", 
        "D", 
        "D", 
        "A", 
        "C"
    ], 
    "source": "middle1229"
}