{
    "article": "What do you think of stress? Is it a good thing or a bad thing? Most of the students think stress can do harm  _  them in some ways. There's a story about a teenager in a middle school. He even  gave up  his study because of the stress from school and family. We also usually  _  that someone turns to psychological doctors because of heavy working stress. There is no doubt that some people think stress is a dangerous wolf. On the other hand, other people argue that stress is not a bad thing. They  _  stress can produce momentum in the end. For them, right attitude and action can reduce stress and make it  _  . When I was a child, my mom always pushed me to study hard. She wished I could go to an ideal  _  for further education. I experienced stress for the first time. To a poor family, I deeply knew  _  was not easy for us, and everything my mom did to me was just to hope I could live a better life in the future.  _  the saying goes, \"No pains, no gains.\" So I did what my mom expected because I didn't want to let her down. At last, I did measure up to my mom's expectation and go to college  _  . Thanks to my mom's push! Thanks to the stress! In this way, I don't think stress is a bad thing. Overall, stress is not a bad thing in  _  . The key is how we deal with it.", 
    "options": [
        [
            "for", 
            "in", 
            "to", 
            "of"
        ], 
        [
            "wonder", 
            "decide", 
            "look", 
            "hear"
        ], 
        [
            "doubt", 
            "believe", 
            "disagree", 
            "forget"
        ], 
        [
            "useful", 
            "difficult", 
            "strange", 
            "terrible"
        ], 
        [
            "company", 
            "college", 
            "factory", 
            "village"
        ], 
        [
            "life", 
            "sport", 
            "opinion", 
            "silence"
        ], 
        [
            "Then", 
            "But", 
            "As", 
            "Or"
        ], 
        [
            "quietly", 
            "wildly", 
            "specially", 
            "successfully"
        ], 
        [
            "himself", 
            "myself", 
            "itself", 
            "yourself"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "B", 
        "A", 
        "B", 
        "A", 
        "C", 
        "D", 
        "C"
    ], 
    "source": "middle2303"
}