{
    "article": "Last Monday, I was walking home. On my way down some steep stone steps, I  _ an elderly lady. There must be something wrong with her  _  She was clearly struggling to get down the steps.\nAs I  _  past, I thought to myself,\"If that was me,  _  would I hope for?\" So I went to the lady and asked her if she needed any  _  .She looked a little surprised and then  _ accepted.\nI took hold of the lady's arm. It took us about ten  _  to slowly get down the steps. This lady told me she was on her way to the  _  for a medical examination on her legs. She could not  _  thanking me and telling me how God had heard her and sent me to help. When we  arrived at  the bottom of the steps, I offered to send her to the bus stop  _ she kindly refused. She said she was over the worst part of the journey and I was  _  enough.\nIt was for the first time that I thought of giving a stranger the act of  _  . I will never forget the look of gratefulness of this lady. I realize that a  _  gesture  can mean so much to others, even if it's just helping with shopping bags, a smile to someone who looks  _  or opening a door. It will make me try to offer help where it is possible.", 
    "options": [
        [
            "saved.", 
            "met", 
            "found", 
            "called"
        ], 
        [
            "eyes", 
            "arms", 
            "legs", 
            "ears"
        ], 
        [
            "jumped", 
            "walked", 
            "rode", 
            "drove"
        ], 
        [
            "what", 
            "that", 
            "which", 
            "who"
        ], 
        [
            "food", 
            "money", 
            "guide", 
            "help"
        ], 
        [
            "thankfully", 
            "carefully", 
            "hardly", 
            "luckily"
        ], 
        [
            "seconds", 
            "minutes", 
            "hours", 
            "days"
        ], 
        [
            "park", 
            "hospital", 
            "city", 
            "museum"
        ], 
        [
            "stop", 
            "enjoy", 
            "begin", 
            "remember"
        ], 
        [
            "and", 
            "so", 
            "or", 
            "but"
        ], 
        [
            "strong", 
            "helpful", 
            "brave", 
            "energetic"
        ], 
        [
            "strength", 
            "wisdom", 
            "kindness", 
            "courage"
        ], 
        [
            "small", 
            "difficult", 
            "creative", 
            "clever"
        ], 
        [
            "satisfied", 
            "pleased", 
            "excited", 
            "worried"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "B", 
        "A", 
        "D", 
        "A", 
        "B", 
        "B", 
        "A", 
        "D", 
        "B", 
        "C", 
        "A", 
        "D"
    ], 
    "source": "middle1172"
}