{
    "article": "Once upon a time, there were two fishermen who were good at fishing. One day they went to a lake to  _  . One of them  enjoyed  fishing alone by himself  _  the other was an outgoing person who loved to  _  friends with different people. When he found that some tourists at the lake couldn't catch any fish. \"I will teach you how to do that\" he said to them. \"If you catch 10 fish, give me one. If you don't get 10, you  needn't  give me anything.\" They feel like old friends at first sight. Both sides come to an a (an)  _  immediately.After he finished teaching a group, he went to teach another, and  also  taught them some fishing skills. He asked one for every 10 fish that the tourists  _  .  At the end  of the day, the fisherman who kindly helped others received a (an)  full  basket of fish, and also got to know a large group of new friends. At the same time, he was respected as  a teacher  . On the other hand,  the other  fisherman didn't have much fun. When the others circled around his camp, he became even more  _  . After fishing for a whole day alone, he looked into the fish basket, and found he had far  _  fish than his friend. If we help others succeed, we harvest both  _  and friends.", 
    "options": [
        [
            "play", 
            "study", 
            "fish", 
            "swim"
        ], 
        [
            "because", 
            "when", 
            "as", 
            "while"
        ], 
        [
            "talk", 
            "be", 
            "teach", 
            "make"
        ], 
        [
            "agree", 
            "disagree", 
            "agreement", 
            "disagreement"
        ], 
        [
            "caught", 
            "give", 
            "gave", 
            "catch"
        ], 
        [
            "helpful", 
            "successful", 
            "dangerous", 
            "lonely"
        ], 
        [
            "fewer", 
            "less", 
            "many", 
            "more"
        ], 
        [
            "success", 
            "money", 
            "fish", 
            "time"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "D", 
        "C", 
        "A", 
        "D", 
        "A", 
        "A"
    ], 
    "source": "middle1582"
}