{
    "article": "Mr. Johnson lives outside the town. He works in a post office. His wife is often ill and six children  _  at school. He works hard but he is often short of  _  . In the end of every month his family are always  _  . One afternoon, on his way home, it suddenly began to  _  . When he got home, he was wet through. He hurried to go  to bed  after supper and his wife washed the clothes and shoes for him.  _  she went to bed, she brought the clothes into the room but  _  the shoes. The next morning Mr. Johnson couldn't find his shoes. His wife found a pair of  _  shoes under the bed for him. Then he went to  police station  and told the policeman about it. \"I  _  ten dollars for my shoes, sir,\" said the man. \"Look! I have to  wear  such a pair of worn-out shoes!\" Several days later the police  _  a thief and found the shoes. They were as worn-out as the  _  which Mr. Johnson was wearing. \"You've fooled us, Mr. Johnson,\" said a policeman. \"The shopkeeper told me a pair of new shoes like them  _  only seven dollars!\" \"You're right, ,sir,\" said Mr. Johnson. \"I've  _  them for five years and I had them mended six times. And I paid three dollars to the shoemaker for mending them!\"", 
    "options": [
        [
            "play", 
            "study", 
            "work", 
            "live"
        ], 
        [
            "water", 
            "food", 
            "clothes", 
            "money"
        ], 
        [
            "full", 
            "afraid", 
            "hungry", 
            "angry"
        ], 
        [
            "rain", 
            "snow", 
            "blow", 
            "shine"
        ], 
        [
            "After", 
            "Before", 
            "While", 
            "Because"
        ], 
        [
            "remembered", 
            "threw", 
            "dropped", 
            "forgot"
        ], 
        [
            "broken", 
            "new", 
            "nice", 
            "cheap"
        ], 
        [
            "borrowed", 
            "paid", 
            "lent", 
            "lost"
        ], 
        [
            "caught", 
            "stopped", 
            "saw", 
            "killed"
        ], 
        [
            "one", 
            "ones", 
            "old", 
            "new"
        ], 
        [
            "cost", 
            "sold", 
            "took", 
            "spent"
        ], 
        [
            "bought", 
            "given", 
            "had", 
            "liked"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "C", 
        "A", 
        "B", 
        "D", 
        "A", 
        "B", 
        "A", 
        "B", 
        "A", 
        "C"
    ], 
    "source": "middle789"
}