{
    "article": "This is a picture of something I did at my school last year. I wrote out 1,986 notes. Each said, \"You're beautiful,\" and I stuck one to every locker in my school.\nIt was almost unbearable   to listen to people put themselves down every day. They would say things like, \"I'm ugly\" or \"No one likes me\". To me, that wasn't the _ . For at least one day, I wanted everyone to know that someone  _ they were beautiful.\nIt took me over 6 hours to write all of the notes, and an hour to stick them with the help of one other friend. It wasn't my original   _ to tell people that I had done it, but words got out after I had been called to the Dean's office. They found me through the school's video surveillance system.\nAfter I _  everything that had happened, there was talk of a possible 3-day suspension from school  . When I went back to my classroom, my teacher _ me what they said, and I told her. This is how the rest of the students found out. Throughout the whole day, words of the possible suspension circulated  , and a group of students came together and formed a petition  . They passed the petition  _ school.\nIn the end, it had over 600 signatures  , from both students and faculty.\nIt amazed me that people would do that for me. For one day, I truly felt _ . And for one day, I managed to make every other kid in my school feel beautiful as well.\nA few days later, after the incident   was not _ , a complete stranger approached me. What she said to me was shocking.\n\"That day, I was planning on killing myself. I had given up completely on society, but because of you, I didn't. You gave me  _ . Thank you.\"\nWhat's more _  than that is the fact that today she has become one of my best friends.", 
    "options": [
        [
            "task", 
            "test", 
            "truth", 
            "treat"
        ], 
        [
            "agreed", 
            "complained", 
            "reported", 
            "thought"
        ], 
        [
            "advice", 
            "plan", 
            "problem", 
            "worry"
        ], 
        [
            "accepted", 
            "believed", 
            "explained", 
            "changed"
        ], 
        [
            "asked", 
            "encouraged", 
            "introduced", 
            "promised"
        ], 
        [
            "from", 
            "around", 
            "through", 
            "during"
        ], 
        [
            "awful", 
            "beautiful", 
            "terrible", 
            "ugly"
        ], 
        [
            "new", 
            "tiny", 
            "true", 
            "usual"
        ], 
        [
            "hope", 
            "luck", 
            "progress", 
            "success"
        ], 
        [
            "friendly", 
            "dangerous", 
            "amazing", 
            "useful"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "B", 
        "C", 
        "A", 
        "B", 
        "B", 
        "A", 
        "A", 
        "C"
    ], 
    "source": "middle2214"
}