{
    "article": "Two men, Mr Smith and Mr Martin were both badly ill. They were in the same hospital room. Mr Smith was able to sit up in his bed for an hour each afternoon. His bed was  next to  the only window of the room. Mr Martin had to spend all his time lying on his back. The men  _  for hours without stopping. They spoke of their families, their times, their jobs.And every afternoon when Mr Smith could  sit up  in his bed, he would pass the time by talking to his roommate about all the things that he could see through the  _  . Mr Martin believed that his world was made \"larger \" by the \"colorful\"  _  world. Out of the window was a  _  with a lovely lake. Mr Smith told Mr Martin about the beautiful ducks swimming freely on the water, happy children playing around, colorful flowers and big old trees around the lake. As Mr Smith told him all this, Mr Martin would close his eyes and tried to make the richest pictures for  _  in his mind...Days and weeks passed, and finally, Mr Smith went back home. Then Mr Martin asked the nurse if he could move to the other bed.  _  for him, the nurse said he could. When everything was done, he tried hard to raise himself a bit to see what was outside. To his  _  , as he looked out of the window, he saw nothing but a wall. Mr Martin asked the nurse what made Mr Smith able to see so many wonderful things outside. The nurse answered that the man was  _  and could not even see the wall.", 
    "options": [
        [
            "danced", 
            "sang", 
            "walked", 
            "talked"
        ], 
        [
            "box", 
            "door", 
            "window", 
            "bed"
        ], 
        [
            "foreign", 
            "outside", 
            "lonely", 
            "green"
        ], 
        [
            "library", 
            "market", 
            "park", 
            "church"
        ], 
        [
            "itself", 
            "yourself", 
            "herself", 
            "himself"
        ], 
        [
            "Unluckily", 
            "Happily", 
            "Worriedly", 
            "Seriously"
        ], 
        [
            "happiness", 
            "joy", 
            "hope", 
            "surprise"
        ], 
        [
            "blind", 
            "old", 
            "poor", 
            "ill"
        ]
    ], 
    "answers": [
        "D", 
        "C", 
        "B", 
        "C", 
        "D", 
        "B", 
        "D", 
        "A"
    ], 
    "source": "middle655"
}