{
    "article": "Once there lived two brothers. The elder was called Simon and the younger Victor. They  _  each other very much, and always took care of one another. Every day they worked from morning  _  night, getting as much grain as possible from their fields. One late autumn evening, after their work in the  _  was done, Simon said to his wife, \"Victor got married last month. He has many bills to pay. I think I will put a bag of rice in his barn . \"Oh, that's a good idea,\" said his wife. \"But please don't tell him,\" said Simon, \"If he knows I put the rice there, he will  _  take it.\" So, late that night Simon took a bag of rice to Victor's barn. The next day, while looking at his own barn, he found  _  strange. \"I took a bag of rice to Victor's house last night,  _  I still have the same number of bags in my barn.  _  did that happen?\" Simon decided to take another bag of rice to his brother's barn that night. But the next morning, he found the  _  number of bags in his barn again! \"This is very strange,\" he thought. That night he  _  again. He carried a large bag of rice on his shoulder ; and walked down the road to his younger brother's house. In the bright moonlight, he could see another  _  coming down the road. He was carrying something on his  _  , too. \"Younger Brother!\" Simon cried, \"What are you doing?\" \"I was  worried about  you, Older Brother,\" said Victor, \"Your family is  _  than mine. I thought you needed more rice.\" The two brothers quickly  _  that they had been taking rice to each other. They  laughed about  what had happened. \"It is good to have a brother like you,\" they both said. And they lived happily ever after.", 
    "options": [
        [
            "disliked", 
            "hated", 
            "loved", 
            "enjoyed"
        ], 
        [
            "until", 
            "at", 
            "through", 
            "with"
        ], 
        [
            "shops", 
            "fields", 
            "hospitals", 
            "factories"
        ], 
        [
            "never", 
            "sometimes", 
            "usually", 
            "ever"
        ], 
        [
            "everything", 
            "anything", 
            "nothing", 
            "something"
        ], 
        [
            "so", 
            "and", 
            "but", 
            "or"
        ], 
        [
            "How", 
            "What", 
            "Why", 
            "Where"
        ], 
        [
            "small", 
            "different", 
            "big", 
            "same"
        ], 
        [
            "planned", 
            "failed", 
            "hoped", 
            "tried"
        ], 
        [
            "brother", 
            "person", 
            "sister", 
            "wife"
        ], 
        [
            "back", 
            "shoulder", 
            "head", 
            "hand"
        ], 
        [
            "smaller", 
            "richer", 
            "larger", 
            "happier"
        ], 
        [
            "remember", 
            "know", 
            "believe", 
            "hope"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "B", 
        "A", 
        "D", 
        "C", 
        "A", 
        "D", 
        "D", 
        "B", 
        "B", 
        "C", 
        "B"
    ], 
    "source": "middle1969"
}