{
    "article": "Soap operas  from South Korea have been popular in China for more than twenty years now. So it is not the _ time for China's soap operas to be less popular. But this time, they are facing more _ , because Descendants of the Sun  and My Love from the Star really made a big success, which even _ some top Chinese officers.\nA senior officer said he sometimes watched soap operas from South Korea\n as well as operas from America. These operas made _ in South Korea and in America have a lot of lovers in China.\nMany people _ that China's soap operas are not much loved by most Chinese, because they are not as interesting as _ from South Korea and America, such as My Love from the Star, a Korean love story between a time-travelling professor and a famous movie star.\nHowever, Korean shows not only  _ soap operas but also some programmings . \"Running Man\" is not an original Chinese show. We learned it from South Korea but some Chinese people aren't aware of the _ .\nActually, China has a closer culture with South Korea. But why do shows from this _ country always seem better? One of the possible reasons is that their stories are more attractive. What's more, those stories tell people the importance of courage, imagination and equality.", 
    "options": [
        [
            "right", 
            "first", 
            "perfect", 
            "last"
        ], 
        [
            "advantages", 
            "progress", 
            "problems", 
            "support"
        ], 
        [
            "attracted", 
            "caught", 
            "controlled", 
            "caused"
        ], 
        [
            "all", 
            "either", 
            "neither", 
            "both"
        ], 
        [
            "agree", 
            "suggest", 
            "announce", 
            "decide"
        ], 
        [
            "movies", 
            "stars", 
            "lovers", 
            "operas"
        ], 
        [
            "prevent", 
            "promise", 
            "provide", 
            "prepare"
        ], 
        [
            "fact", 
            "reason", 
            "case", 
            "detail"
        ], 
        [
            "relative", 
            "neighbour", 
            "partner", 
            "Enemy"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "D", 
        "A", 
        "D", 
        "C", 
        "A", 
        "B"
    ], 
    "source": "middle26"
}