{
    "article": "We kids have different ways to get in touch with each other now. And _ the old, they'd like to go to the market or _ each other's houses, but for the young, we kids needn't follow the _ of doing so.\nThe _ way for us to get in touch and make _ is to use the Internet services, like QQ. A lot of websites such as www.qq.com have appeared   in the last few years and offered such kinds of services for free. So we can make friends _ through the Internet. Maybe we do not _ all these \"friends\" well. We add friends only how we seem cooler with more friends online.\nThen _ do we kids keep in touch with friends online? We make it by sending our _ to each other. At times, \"friends\" _ \"be missing\" for months without a message. Is this the friendship in the 21st century?\nOf course, using these Internet services is not just for saying \"Hi, what's up?\" Some of us have found long-lost classmates and friends _ these websites. And at times we kill a time to go to a movie or get together. What's more, we kids can listen to our friends' favourite music when we are on the Internet.\nBelieve it or not, these Internet services will be _ for a while, and it is _ a convenient way for us to keep in touch.", 
    "options": [
        [
            "for", 
            "about", 
            "of", 
            "with"
        ], 
        [
            "visit", 
            "enjoy", 
            "like", 
            "build"
        ], 
        [
            "chances", 
            "thoughts", 
            "ways", 
            "plans"
        ], 
        [
            "friendliest", 
            "easiest", 
            "worst", 
            "slowest"
        ], 
        [
            "quarrels", 
            "jokes", 
            "sentences", 
            "friends"
        ], 
        [
            "easily", 
            "loudly", 
            "actually", 
            "early"
        ], 
        [
            "learn", 
            "know", 
            "hear", 
            "teach"
        ], 
        [
            "if", 
            "when", 
            "how", 
            "because"
        ], 
        [
            "money", 
            "paper", 
            "positions", 
            "messages"
        ], 
        [
            "must", 
            "will", 
            "may", 
            "shall"
        ], 
        [
            "for", 
            "through", 
            "onto", 
            "into"
        ], 
        [
            "difficult", 
            "popular", 
            "dangerous", 
            "polite"
        ], 
        [
            "very", 
            "real", 
            "really", 
            "much"
        ]
    ], 
    "answers": [
        "A", 
        "A", 
        "C", 
        "B", 
        "D", 
        "A", 
        "B", 
        "C", 
        "D", 
        "C", 
        "B", 
        "B", 
        "C"
    ], 
    "source": "middle1365"
}