{
    "article": "Mr Knight was the manager of a hotel. One weekend all of the hotels in the city were 36 _  because there was an important meeting. On Friday night, three men came into the hotel and asked for rooms. Mr Knight said that there were 37 _  rooms ready for use because of the meeting. The three men were very 38 _  because they had no place to stay.\nMr Knight wanted to help them. He remembered that Room 418, a very small room, was empty. He asked the men 39 _  they would share a room. The three men said they would.\nMr Knight told that the room would be thirty dollars: ten dollars 40 _  each one. Each man gave him ten dollars, and then they went up to the room.\nMr Knight soon began to feel 41 _ . \"Thirty dollars is a lot to ask as a price for that small room.\" He thought. He said to his assistant, \"Here's five dollars. Give it to the men in Room 418. I asked them too 42 _ money for their room.\"\nThe assistant tool the money. 43 While  he was on the way to Room 418, he started to think: \"How can three men divide five dollars? I'll keep two dollars. The men will be happy to get anything back. I'll take a little money and Mr Knight will 44 _  know.\" So the assistant returned one dollar to each man.\nEach man had paid ten dollars. After the assistant returned one dollar to each one, each man had 45 _  paid only nine dollars. There were three men $9x3=$27. The assistant kept $2. $27+$2=$29. Where is the missing dollar?", 
    "options": [
        [
            "quiet", 
            "empty", 
            "full", 
            "noisy"
        ], 
        [
            "no", 
            "some", 
            "many", 
            "three"
        ], 
        [
            "happy", 
            "unhappy", 
            "pleased", 
            "hungry"
        ], 
        [
            "if", 
            "what", 
            "that", 
            "how"
        ], 
        [
            "for", 
            "to", 
            "with", 
            "on"
        ], 
        [
            "sad", 
            "afraid", 
            "boring", 
            "sorry"
        ], 
        [
            "more", 
            "little", 
            "much", 
            "many"
        ], 
        [
            "just", 
            "also", 
            "never", 
            "perhaps"
        ], 
        [
            "actually", 
            "already", 
            "exactly", 
            "extremely"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "B", 
        "A", 
        "A", 
        "D", 
        "C", 
        "C", 
        "A"
    ], 
    "source": "middle1534"
}