{
    "article": "Jane was walking round the department store. She remembered how difficult _ was to choose a suitable Christmas present for her father. She wished that he was as easy to please as her mother, who was always happy with beautiful clothes.\nBesides, shopping _ Christmas Day is quite busy, and at this time of the year it was not _ great fun: people stepped on your feet or pushed you with _ elbows , they just wanted to get to the cheapest goods before others .\nJane stood in front of a counter and some attractive ties were on display. \"They are real silk,\"the assistant tried to attract her. \"They worth double the price.\" but Jane knew clearly that her father hardly liked this kind of present before.\nJane stopped at a small counter. She found some good cigarettes on sale. _ her father smoked only once a week, she knew that they were the presents _ belonged to him. Without thinking for long, she bought them.\nWhen Jane got home, with her small but well-chosen presents in her bag, her parents were having supper at table with lots of dishes. Jane asked _ they had supper so early. Her mother was _ , \"Your father has at last decided to stop smoking.\" Jane was told by her.", 
    "options": [
        [
            "it", 
            "this", 
            "that", 
            "there"
        ], 
        [
            "on", 
            "in", 
            "at", 
            "from"
        ], 
        [
            "an", 
            "a", 
            "the", 
            "/"
        ], 
        [
            "their", 
            "them", 
            "theirs", 
            "they"
        ], 
        [
            "Because", 
            "But", 
            "Although", 
            "So"
        ], 
        [
            "what", 
            "whom", 
            "who", 
            "which"
        ], 
        [
            "what", 
            "when", 
            "how", 
            "why"
        ], 
        [
            "exciting", 
            "excitement", 
            "excite", 
            "excited"
        ]
    ], 
    "answers": [
        "A", 
        "A", 
        "D", 
        "A", 
        "C", 
        "D", 
        "D", 
        "D"
    ], 
    "source": "middle1030"
}