{
    "article": "When I was in the third grade, I was chosen to be the princess in the school play. For weeks my mother had helped me practice my lines . But once on the stage, every word  _  from my head. Then my teacher asked me to change my role to be a narrator for the play.  _  I didn't tell my mother what had happened that day, she noticed my  _  and asked if I wanted to take a walk in the garden. It was a lovely spring day. We could see dandelions popping  _  the grass in bunches . I watched my mother bend down by one of the bunches. \"I think I'll dig up all these weeds ,\" she said. \"From now on, we'll  _  have roses in this garden.\" \"But I like dandelions,\" I protested . \"All the flowers are  _  -- even dandelions!\" My mother looked at me seriously. \"Yes, every flower gives pleasure in its own way, doesn't it?\" she asked thoughtfully. I nodded. \"And that is  _  of people, too.\" She added. When I  _  that she had guessed my pain, I started to cry and told her the truth. \"But you will be a wonderful narrator,\" she said,  _  me of how much I loved to read stories aloud. Thanks to my mother's encouragement, I got to know everybody had his or her own  _  in the world, I felt proud of the role in the play.", 
    "options": [
        [
            "developed", 
            "left", 
            "failed", 
            "disappeared"
        ], 
        [
            "If", 
            "Because", 
            "Though", 
            "Since"
        ], 
        [
            "difficulty", 
            "mistake", 
            "danger", 
            "unhappiness"
        ], 
        [
            "through", 
            "past", 
            "beyond", 
            "behind"
        ], 
        [
            "hardly", 
            "only", 
            "still", 
            "also"
        ], 
        [
            "harmless", 
            "healthy", 
            "beautiful", 
            "fresh"
        ], 
        [
            "true", 
            "kind", 
            "same", 
            "clever"
        ], 
        [
            "remembered", 
            "realized", 
            "explained", 
            "promised"
        ], 
        [
            "representing", 
            "complaining", 
            "recommending", 
            "reminding"
        ], 
        [
            "honour", 
            "progress", 
            "value", 
            "interest"
        ]
    ], 
    "answers": [
        "D", 
        "C", 
        "D", 
        "A", 
        "B", 
        "C", 
        "A", 
        "B", 
        "D", 
        "C"
    ], 
    "source": "middle2066"
}