{
    "article": "What comes to your mind when you talk about donations? You probably think of a group of people with  _  in hand asking people to donate money. But my school came up with a  _  way of raising funds--Fun Night. Fun Night is like a party. Students pay money to get in and have dinner at school. The  _  they pay will go towards helping poor children  in need  . Two months ago, I took part in Fun Night. There were all kinds of  _  in Fun Night. The most popular game was the \"jousting ring\" . I \"jousted\" with several of my  _  and managed to knock plenty of them off the ring.  _  , they developed different strategies to win, such as starting in a crouched position to gather more strength when pushing. Sometimes they attacked me  _  I was ready. It would usually be  _  as cheating , but we didn't care and  _  playing. After all , it was just a game, not  a competition  . The best of Fun Night was not the fun activities. The fact was that we raised a lot of money by having a  _  time. A lot of students at my school wouldn't  _  money if they were simply asked to hand it over. But this kind of event not only made them  _  to give, but also allowed them to have a great time playing games with friends. I realized that  _  can be fun. We raised 2,000 yuan on that night.", 
    "options": [
        [
            "boxes", 
            "books", 
            "schoolbags", 
            "clothes"
        ], 
        [
            "common", 
            "different", 
            "silly", 
            "realistic"
        ], 
        [
            "sit", 
            "attention", 
            "stationery", 
            "money"
        ], 
        [
            "cheeses", 
            "subjects", 
            "games", 
            "lessons"
        ], 
        [
            "neighbours", 
            "cousins", 
            "visitors", 
            "friends"
        ], 
        [
            "However", 
            "Luckily", 
            "Otherwise", 
            "Hopefully"
        ], 
        [
            "before", 
            "unless", 
            "after", 
            "if"
        ], 
        [
            "named", 
            "considered", 
            "described", 
            "discovered"
        ], 
        [
            "finished", 
            "started", 
            "continued", 
            "stopped"
        ], 
        [
            "tiring", 
            "hard", 
            "long", 
            "good"
        ], 
        [
            "save", 
            "make", 
            "donate", 
            "spend"
        ], 
        [
            "afraid", 
            "glad", 
            "sorry", 
            "angry"
        ], 
        [
            "friendship", 
            "knowledge", 
            "charity", 
            "experience"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "D", 
        "C", 
        "D", 
        "A", 
        "A", 
        "B", 
        "C", 
        "D", 
        "C", 
        "B", 
        "C"
    ], 
    "source": "middle587"
}