{
    "article": "Once there was a grasshopper , who was the best hopper in the world. She taught  other  grasshoppers how to hop. Soon all grasshoppers were hopping well, so she felt very proud. Then one day an eagle appeared. She immediately decided to teach the eagle how to hop,  as  she was sure that hopping was the key to  _  . But every time she  _  the eagle to hop, he just said, \"There is no need. You are satisfied with hopping, but I can fly. \" \"Stop this silly talking of flying!\" screamed the grasshopper. \"Flying is  _  in your imagination. \" The next day, some of the grasshoppers went to talk to the eagle. \"How is it that you don't know how to hop, yet you still talk of flying? It is  against  our teacher's orders.\" \"Hopping is useful and can make you happy, but when you can fly, it is no longer  _  .\" said the eagle. \"Tell us more,\" said the grasshoppers. The eagle began telling them what the world  _  the grass fields was like. It was a world that included mountains, rivers and oceans . Then the eagle took one  _  grasshopper in his powerful wings to the sky. The grasshopper could see the mountains, rivers and oceans that the eagle  had described  . After the eagle landed, he saw a spark in the grasshopper's eyes. The grasshopper told others what he had seen in the sky. Therefore, the grasshoppers dreamt of flying in the sky.", 
    "options": [
        [
            "business", 
            "weakness", 
            "happiness", 
            "succeed"
        ], 
        [
            "confused", 
            "told", 
            "advised", 
            "asked"
        ], 
        [
            "just", 
            "even", 
            "hardly", 
            "ever"
        ], 
        [
            "helpful", 
            "dangerous", 
            "necessary", 
            "safe"
        ], 
        [
            "on", 
            "through", 
            "across", 
            "beyond"
        ], 
        [
            "strong", 
            "brave", 
            "attractive", 
            "beautiful"
        ]
    ], 
    "answers": [
        "C", 
        "C", 
        "A", 
        "C", 
        "D", 
        "B"
    ], 
    "source": "middle1858"
}