{
    "article": "To be a good teacher, you need some of the abilities of a good actor. You must be able to  _  the attention and interest of your audience. You must be a clear speaker with a good voice which is fully under your  _  . And you must be able to act what you are teaching in order to make its meaning clear. Watch a good teacher,  _  you will see that he stands the whole time he is teaching, he walks about using his arms, hands and fingers to help him in his explanations and his face to express feelings. When you listen to him, you will hear the loudness and the musical note of his voice  _  changing according to what he is talking about. The  _  that a good teacher has some of the talents of a good actor does not mean that he will indeed be able to act well on the stage for there are very important differences between the teacher's work and the actor's. The actor has to  _  the same words which he has learnt by heart every time he plays a certain role. What he has to do is to make all these carefully learnt words and actions seem  _  on the stage. The good teacher works in a quite different way. His audience take an active part in his play. They ask questions when they do not understand something. So the teacher has to suit his act to the  _  of his audience which is his class. He cannot learn his part by heart, but must  _  it as he goes along. I have known many teachers who were fine actors in class but were  _  to take part in stage-play because their brains could not keep strictly to what another had written.", 
    "options": [
        [
            "pay", 
            "give", 
            "attract", 
            "turn"
        ], 
        [
            "help", 
            "control", 
            "mind", 
            "thoughts"
        ], 
        [
            "and", 
            "but", 
            "or", 
            "so"
        ], 
        [
            "never", 
            "seldom", 
            "sometimes", 
            "always"
        ], 
        [
            "matter", 
            "idea", 
            "fact", 
            "secret"
        ], 
        [
            "remind", 
            "remember", 
            "reply", 
            "repeat"
        ], 
        [
            "correct", 
            "true", 
            "natural", 
            "real"
        ], 
        [
            "questions", 
            "needs", 
            "problems", 
            "complaints"
        ], 
        [
            "invent", 
            "discover", 
            "improve", 
            "increase"
        ], 
        [
            "unwelcome", 
            "unable", 
            "uncomfortable", 
            "unsuitable"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "A", 
        "D", 
        "C", 
        "D", 
        "C", 
        "B", 
        "A", 
        "B"
    ], 
    "source": "middle853"
}