{
    "article": "Fishing with Grandpa\nOne day, my grandfather went fishing, and let me go with him. He handed the rod   to me, held my  _ and taught me how to throw my line into the water. Our bobbers floated   together as we sat there, hoping for a bite. The sun  _  us. We sat and talked, \"I remember when I could sit here and watch the fish _  in the water,\" he said. \"Sometimes, they'd jump out and  _ beside me. I didn't need a rod and bait   at that moment. \" \"We have to be  _ ,\" he continued, \"The fish may come or they may not. It doesn't matter. We're out in the  _ . It's a beautiful day. We're lucky to have the warmth of the sun. If it had rained, we wouldn't be here. \" He sat against a tree. \"Yes, it's a _  day,\" he said. I watched our bobbers.  _ fish pulled them under that day. It didn't matter. I was with Grandpa. I felt grown up. Just being with him was special. He was well loved by everyone and I wanted to  be like him when I grew up. He'd worked hard all his life for what little he had, but he could still find time to laugh. He was a relaxing man. In the short time we had together, he  _ me many things: how to hold a rod, the value of a good time, the value of a good friend, respect for my elders, and the importance of working hard and living harder. The list is long.", 
    "options": [
        [
            "feet", 
            "legs", 
            "arms", 
            "ears"
        ], 
        [
            "warmed", 
            "heated", 
            "shone", 
            "brightened"
        ], 
        [
            "running", 
            "going", 
            "lying", 
            "swimming"
        ], 
        [
            "stand", 
            "sleep", 
            "land", 
            "sit"
        ], 
        [
            "excited", 
            "sad", 
            "worried", 
            "patient"
        ], 
        [
            "day", 
            "sun", 
            "water", 
            "pool"
        ], 
        [
            "funny", 
            "great", 
            "big", 
            "busy"
        ], 
        [
            "Many", 
            "Enough", 
            "Some", 
            "No"
        ], 
        [
            "taught", 
            "gave", 
            "ask", 
            "wish"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "C", 
        "D", 
        "B", 
        "B", 
        "D", 
        "A"
    ], 
    "source": "middle2161"
}