{
    "article": "Vanilla is my best friend. She is a lovely girl with two big, beautiful eyes. But she always hides them  _  a pair of black glasses. One day, however, I  _  ended our friendship. I remember that day clearly. We were  _  in the classroom. The teacher was giving us our results of a Chinese exam. I had done badly. I felt so  _  that I wouldn't talk to anyone. At lunch-time, I even stayed in the classroom alone. Suddenly, I heard a  _  . It was Vanilla. \"You look very unhappy,\" she said. \"What's wrong?\" I looked at her for a while, but said  _  . I knew Vanilla had got a good mark in the exam. I thought she was  laughing at  me. I sat silently, but Vanilla didn't go away, she  _  asking me questions \"Is it because of the exam? Do you want me to tell you the right  _  ?\" I looked away from her. When I looked up again, Vanilla had gone. And so had my exam paper! I didn't know  _  to do. I looked for my paper every where, but couldn't find it. In the afternoon, Vanilla came up to my desk and  _  me my exam paper back. I looked at it and got a big  _  . Vanilla had written the right answers next to every one of my mistakes. How  _  she was! My face turned red. I wanted to hug her, but I only held her hands and said,\" Thank you. \"That afternoon,  _  Vanilla and I were on the way home, I felt quite happy and thanked her again. We are  _  best friends.", 
    "options": [
        [
            "behind", 
            "below", 
            "among", 
            "near"
        ], 
        [
            "slowly", 
            "quickly", 
            "nearly", 
            "happily"
        ], 
        [
            "singing", 
            "sitting", 
            "dancing", 
            "playing"
        ], 
        [
            "happy", 
            "sad", 
            "funny", 
            "excited"
        ], 
        [
            "voice", 
            "sound", 
            "noise", 
            "cry"
        ], 
        [
            "everything", 
            "something", 
            "anything", 
            "nothing"
        ], 
        [
            "forgot", 
            "kept", 
            "practiced", 
            "remembered"
        ], 
        [
            "answers", 
            "exams", 
            "results", 
            "notes"
        ], 
        [
            "that", 
            "who", 
            "which", 
            "what"
        ], 
        [
            "gave", 
            "turned", 
            "carried", 
            "moved"
        ], 
        [
            "pain", 
            "interest", 
            "surprise", 
            "fun"
        ], 
        [
            "kind", 
            "brave", 
            "healthy", 
            "careless"
        ], 
        [
            "whether", 
            "when", 
            "after", 
            "unless"
        ], 
        [
            "still", 
            "yet", 
            "also", 
            "ever"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "B", 
        "B", 
        "A", 
        "D", 
        "B", 
        "A", 
        "D", 
        "A", 
        "C", 
        "A", 
        "B", 
        "A"
    ], 
    "source": "middle1230"
}