{
    "article": "What is school life like for a schoolboy? A schoolboy's life is in preparation for the real battle of life. It is also full of interest. One of the first important  _  in a schoolboy's life is to get as much knowledge and good mind-training as he can . His main business in school is to  _  . He has to read the books that he is  _  in the classes . He has to do the homework assigned to him. Another part in a school boy's life is the strict discipline . At school there are  _  . If he breaks them, he will get punished. This strict discipline is very  _  for him when he enters society. It can teach him some very necessary virtues on the road to a  _  life . School is a place for a schoolboy to learn  _  the life in society is like. For in the classroom and on the playground, he has to be with his schoolmates and not members of his  _  . He cannot do as he does at home. He soon learns the lessons of give-and-take, to be polite and to  _  for others , which is also the way when he has to carry himself in society . A schoolboy's life has its interesting and healthy part. Games and physical exercise not only  _  him strong , but also teach him how to work with others in the spirit of team work .", 
    "options": [
        [
            "ways", 
            "roads", 
            "parts", 
            "ideas"
        ], 
        [
            "learn", 
            "play", 
            "work", 
            "train"
        ], 
        [
            "studied", 
            "taken", 
            "bought", 
            "taught"
        ], 
        [
            "classes", 
            "students", 
            "rules", 
            "grades"
        ], 
        [
            "useless", 
            "good", 
            "exciting", 
            "highly"
        ], 
        [
            "successful", 
            "rich", 
            "challenging", 
            "kind"
        ], 
        [
            "how", 
            "what", 
            "that", 
            "why"
        ], 
        [
            "team", 
            "class", 
            "grade", 
            "family"
        ], 
        [
            "look", 
            "love", 
            "care", 
            "need"
        ], 
        [
            "have", 
            "make", 
            "let", 
            "help"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "C", 
        "B", 
        "A", 
        "B", 
        "D", 
        "C", 
        "B"
    ], 
    "source": "middle2004"
}