{
    "article": "The Other Side of the Wall There was a young woman who took great pride in her flower garden. She was raised by her grandmother who taught her to love and  _  for flowers. So her flower garden was the best. One day, while she was looking through a flower list she often  _  from, a picture of a plant caught her eyes. She had never  _  blooms on a flower like that before. \"I have to have it,\" she said to herself, and she  _  ordered it. When it arrived, she already had a  _  prepared to plant it. She planted it at the back of her yard. It grew well, with beautiful green leaves all over it,  _  there were no blooms. Day after day she continued to water it, feed it, and she even talked to it trying to make it bloom. However, it was  _  . One morning weeks later, when standing before the vine, she felt very  _  that her plant had not bloomed. She was giving thought to  _  it down and planting something else in its place. It was at this point that her neighbor, whose  _  joined hers, called over to her. \"Thank you so much! You can't imagine how much I have  _  the blooms of that vine you planted.\" The young woman walked  _  the gate into her neighbor's yard, and sure enough, she saw that on the other side of the wall the vine was  _  with blooms. There were indeed the most beautiful blooms she had  _  seen. The vine had grown through the crevices and it had not flowered on  _  side of the wall, but it had flowered on the other side. Sometimes one may not see the good result of his effort, but that doesn't mean it isn't successful.", 
    "options": [
        [
            "look", 
            "care", 
            "search", 
            "pay"
        ], 
        [
            "learned", 
            "heard", 
            "ordered", 
            "borrowed"
        ], 
        [
            "seen", 
            "smelt", 
            "sold", 
            "picked"
        ], 
        [
            "finally", 
            "carefully", 
            "suddenly", 
            "immediately"
        ], 
        [
            "place", 
            "box", 
            "cup", 
            "room"
        ], 
        [
            "and", 
            "so", 
            "or", 
            "but"
        ], 
        [
            "endless", 
            "useless", 
            "successful", 
            "hopeful"
        ], 
        [
            "excited", 
            "nervous", 
            "sad", 
            "frightened"
        ], 
        [
            "putting", 
            "cutting", 
            "turning", 
            "taking"
        ], 
        [
            "balcony", 
            "kitchen", 
            "bedroom", 
            "yard"
        ], 
        [
            "enjoyed", 
            "dreamed", 
            "expected", 
            "hated"
        ], 
        [
            "through", 
            "across", 
            "above", 
            "below"
        ], 
        [
            "satisfied", 
            "connected", 
            "filled", 
            "pleased"
        ], 
        [
            "never", 
            "ever", 
            "seldom", 
            "usually"
        ], 
        [
            "its", 
            "his", 
            "her", 
            "their"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "D", 
        "A", 
        "D", 
        "B", 
        "C", 
        "B", 
        "D", 
        "A", 
        "A", 
        "C", 
        "B", 
        "C"
    ], 
    "source": "middle800"
}