{
    "article": "One Friday night, a poor young man stood at a gate of the railway station, playing his violin. Many people put money into the hat  _  in front of him. The next day, the young man came to the  _  of the railway station again, and put his hat on the ground. But different  _  what he always did in the past days, he took out a large piece of paper and laid it on the ground. It said, \"Last night, a gentleman named George Sang put an important thing into my hat by mistake. Please come soon, Mr. Sang.\" About half an hour later, a middle-aged man ran to the young man  _  and said, \"It's you! You do come here. I know that you are an honest man and will certainly  _  here.\" The young man asked, \"Are you Mr. George Sang? Did you lose anything?\" \"A lottery ticket,\" answered the middle-aged man. The young man took out a lottery ticket and gave it to the man. The prize of the lottery ticket was worth $ 500,000. Yesterday when the middle-age man knew he  _  . he was very happy. He took out 50 dollars and put it in the hat. However, the lottery ticket was also  _  in. Later, someone asked the young man, \"You  _  the violin in the railway station every day to make money. Why didn't you just take the prize of the lottery ticket for yourself?\" The young man said, \"Although I don't have  _  money, I live happily. But if I lose  _  , I won't be happy forever.\"", 
    "options": [
        [
            "lying", 
            "sleeping", 
            "bowing", 
            "dropping"
        ], 
        [
            "street", 
            "window", 
            "door", 
            "gate"
        ], 
        [
            "for", 
            "to", 
            "from", 
            "in"
        ], 
        [
            "slowly", 
            "quickly", 
            "strongly", 
            "sleepily"
        ], 
        [
            "hide", 
            "come", 
            "flee", 
            "leave"
        ], 
        [
            "lost", 
            "won", 
            "fell", 
            "chased"
        ], 
        [
            "filled", 
            "pulled", 
            "kicked", 
            "thrown"
        ], 
        [
            "play", 
            "sell", 
            "buy", 
            "repair"
        ], 
        [
            "little", 
            "much", 
            "many", 
            "few"
        ], 
        [
            "job", 
            "pleasure", 
            "honesty", 
            "purse"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "C", 
        "B", 
        "B", 
        "B", 
        "D", 
        "A", 
        "B", 
        "C"
    ], 
    "source": "middle276"
}