{
    "article": "Mr. Smith was hanging some family pictures on the wall of his new house. While he was using a hammer* to knock nails* into the hard _ , some of them fell on the floor.\nMr. Smith's 4-year-old daughter, Kate, was standing nearby. She wanted to _ with her dad and called out to him. However, Mr. Smith didn't finish his work then, so he asked her to go outside and play with her _ . Kate saw the nails lying on the floor. She picked up a nail and went out.\nAfter a while, the son rushed _ . He told his dad that Kate was scratching* the newly bought _ with a nail.\nMr. Smith ran outside and became very _ as soon as he saw it. He took his child's hand and _ it. He didn't realize he was using the hammer that was in his _ . With blood* all over her hand, Kate was taken to a hospital and had an operation* at once.\n _ the operation was done, Kate lay on her bed. Sadly, she said to her father, \"Dad, I feel very _ that I have scratched your car. \"She looked at her hand and asked, \"Dad, when will _ hand get well? I promise that I will never do that again.\"\nAt the doctor's office, the father was told that his daughter would _ lose one finger. He was so hurt and speechless that he couldn't stop crying for hours. Because of his mad action, his daughter might have one finger less.\nMr. Smith went back to the car and kicked it many times. Sitting in front of the car, he looked at the scratches*, to his surprise, he found that his daughter had written: \"LOVE YOU DAD\".", 
    "options": [
        [
            "wall", 
            "chair", 
            "door", 
            "floor"
        ], 
        [
            "cook", 
            "live", 
            "play", 
            "fight"
        ], 
        [
            "mother", 
            "sister", 
            "brother", 
            "cousin"
        ], 
        [
            "in", 
            "out", 
            "away", 
            "down"
        ], 
        [
            "toy", 
            "book", 
            "bike", 
            "car"
        ], 
        [
            "happy", 
            "angry", 
            "brave", 
            "relaxed"
        ], 
        [
            "hit", 
            "washed", 
            "watched", 
            "felt"
        ], 
        [
            "bag", 
            "box", 
            "table", 
            "hand"
        ], 
        [
            "If", 
            "Unless", 
            "Before", 
            "After"
        ], 
        [
            "pleased", 
            "sorry", 
            "lucky", 
            "strange"
        ], 
        [
            "my", 
            "your", 
            "her", 
            "his"
        ], 
        [
            "never", 
            "sure", 
            "possibly", 
            "hardly"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "C", 
        "A", 
        "D", 
        "B", 
        "A", 
        "D", 
        "D", 
        "B", 
        "A", 
        "C"
    ], 
    "source": "middle849"
}