{
    "article": "This was an unforgettable and wonderful experience. It happened about three years ago and it has had a _ effect on me. I would like to show respect   here for the two men I do not know but whose actions gave a new _ to the words -- kind and generous.\nI was walking down a busy street on a cold, windy day in early _ . A homeless man, probably about 60 and without wearing any shoes, was begging for change on a street corner.\nA BMW car stopped on the other side of the street and a man who was well dressed stepped out of the car. He was probably about _ years old.He was wearing a blue business suit with a deep red silk tie. He walked _ the street and over to the homeless man. Without saying anything, he first gave him a lot of _ and then he sat down and took off his leather gloves  , beautiful black leather shoes and his black dress socks. Then he _ them to the homeless man. The homeless man took them and stared   with a(n) _ mouth.\nAs he drove off, I can't _ thinking that it was probably the first time he had pressed  the pedal   of that top-brand BMW car with a bare   foot! I stood there and the looks of _ appeared on my face and the homeless man's.\nTwo men of about the same age _ very different lives had met and the one who was _ in materials had offered _ than his shoes. He had left this BMW car and _ down from his high position. He held up the other man when he offered respect, _ and real generosity.", 
    "options": [
        [
            "strong", 
            "bad", 
            "light", 
            "slow"
        ], 
        [
            "opinion", 
            "idea", 
            "meaning", 
            "suggestion"
        ], 
        [
            "spring", 
            "summer", 
            "autumn", 
            "winter"
        ], 
        [
            "forty", 
            "fifty", 
            "sixty", 
            "seventy"
        ], 
        [
            "on", 
            "across", 
            "through", 
            "above"
        ], 
        [
            "money", 
            "water", 
            "sand", 
            "clothes"
        ], 
        [
            "posted", 
            "handed", 
            "dropped", 
            "threw"
        ], 
        [
            "closed", 
            "full", 
            "open", 
            "Empty"
        ], 
        [
            "stand", 
            "remember", 
            "forget", 
            "stop"
        ], 
        [
            "excitement", 
            "surprise", 
            "sadness", 
            "loneliness"
        ], 
        [
            "but", 
            "or", 
            "and", 
            "before"
        ], 
        [
            "successful", 
            "careful", 
            "useful", 
            "helpful"
        ], 
        [
            "rather", 
            "more", 
            "other", 
            "better"
        ], 
        [
            "broken", 
            "fell", 
            "stepped", 
            "rushed"
        ], 
        [
            "help", 
            "shoes", 
            "gloves", 
            "kindness"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "D", 
        "C", 
        "B", 
        "A", 
        "B", 
        "C", 
        "D", 
        "B", 
        "A", 
        "A", 
        "B", 
        "C", 
        "D"
    ], 
    "source": "middle1001"
}