{
    "article": "A teacher had been made very angry by some of his boys making a high sound during school hours. At last he was forced to  _  any one who should repeat the wrong act. The next morning, a loud sound was heard in the quiet room. The students were very much surprised, and the teacher at once looked around to  _ the person who had made a high nound.\nWhen a boy who was often in bad act, was told he was wrong, he  _ said he hadn't done it, yet  his words were not believed, and he was brought up for punishment. Seeing what was about to take place, Charles, a little boy, got up suddenly from his _ . \"Don't punish John, air. I made the high sound. I'm very sorry, I didn't mean to whistle.\" He held out his hand to be punished. Taking the little boy's  _  , the teacher said \" Charles, you have done right. I can't punish you after you  have acted so nobly.\" Even the youngest child in the school felt  _ of Charles, for every child could see how bravely he had acted.\nCharles was truly a brave boy. He had done _ he knew to be right. True courage may also be shown by  _ to do that which we know to be wrong, _ bad people may laugh at us,", 
    "options": [
        [
            "punish", 
            "praise", 
            "fix", 
            "hurt"
        ], 
        [
            "hide", 
            "discover", 
            "pay", 
            "wake"
        ], 
        [
            "actively", 
            "aloud", 
            "strongly", 
            "softly"
        ], 
        [
            "bag", 
            "board", 
            "desk", 
            "seat"
        ], 
        [
            "hair", 
            "arm", 
            "finger", 
            "hand"
        ], 
        [
            "afraid", 
            "proud", 
            "sure", 
            "careful"
        ], 
        [
            "what", 
            "which", 
            "who", 
            "when"
        ], 
        [
            "refusing", 
            "continuing", 
            "dreaming", 
            "wanting"
        ], 
        [
            "but", 
            "though", 
            "after", 
            "until"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "C", 
        "D", 
        "D", 
        "B", 
        "A", 
        "A", 
        "B"
    ], 
    "source": "middle840"
}