{
    "article": "One day, a father and a son were walking along a road. Suddenly, the father said, \" _ ! There is a tin  . Pick it up.\" The son didn't. The father picked up the tin and put it in his pocket. After a while, the father said again, \"Look at the empty bottles under the tree. Let's pick them up.\" The son said, \"No, I won't. People will laugh at me.\"\nOnce again the father said nothing and pick _ up. Later they decided to have a rest. The father _ the tin and the bottles, and with the little money that he had just got, he bought some cherries .\nThe father and the son _ on their way. It was very hot. The son was very _ . Then, by accident, the father dropped a cherry onto the ground. The son picked it up as if it were a piece of gold and _ it. After a little while, his father dropped another _ , and the  son wasted no time in picking up the tasty _ and putting it into his mouth. The father continued to drop the cherries, and the son continued to pick them up. When all of the cherries were gone, the father said to the son, \"My dear son, if you had bent down to pick up the tin and the bottles, it would not have been _ for you to bend down so many times to pick up the cherries. Always remember that he who does not care about the _ things will find that he cannot do the great things.\"", 
    "options": [
        [
            "Go", 
            "Listen", 
            "Tell", 
            "Look"
        ], 
        [
            "them", 
            "it", 
            "us", 
            "one"
        ], 
        [
            "sold", 
            "examined", 
            "forgot", 
            "memorized"
        ], 
        [
            "turned", 
            "put", 
            "tried", 
            "continued"
        ], 
        [
            "clever", 
            "bright", 
            "thirsty", 
            "cold"
        ], 
        [
            "planted", 
            "drew", 
            "ate", 
            "studied"
        ], 
        [
            "cherry", 
            "pear", 
            "apple", 
            "banana"
        ], 
        [
            "juice", 
            "bread", 
            "milk", 
            "fruit"
        ], 
        [
            "difficult", 
            "important", 
            "necessary", 
            "possible"
        ], 
        [
            "same", 
            "little", 
            "big", 
            "wonderful"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "A", 
        "D", 
        "C", 
        "C", 
        "A", 
        "D", 
        "C", 
        "B"
    ], 
    "source": "middle1672"
}