{
    "article": "To learn a foreign language well, you need to spend a lot of time on it. The  _  time you spend on the language, the faster you will learn. This does not  _  sitting in class looking out of the window, nor listening to other students who do not speak well. This means spending time enjoyably on the  _  you are learning. Listen to the language you are learning on your MP3 player. Read  _  you are listening to. Listen to and read things that you like, things that you can mostly  _  , or even partly understand. One hour of listening or reading is more effective than many hours of class time. If you  _  listening and reading, you will improve yourself. Build up your vocabulary lists, which you'll need lots of. Start to notice words and how they come  _  as phrases. Learn these words and phrases  _  listening and reading. Read online, using online dictionaries, and make your own vocabulary lists. Do not  _  for someone else to show you the language, nor to tell you what to do, and you should discover the language by yourself, like a child growing up. Talk when you feel like it.  _  when you feel like. You are learning and improving. The language will become clearer in your mind. Just make sure you spend enough time on the language.", 
    "options": [
        [
            "worse", 
            "less", 
            "more", 
            "farther"
        ], 
        [
            "mean", 
            "point", 
            "bring", 
            "make"
        ], 
        [
            "song", 
            "report", 
            "news", 
            "language"
        ], 
        [
            "how", 
            "what", 
            "where", 
            "why"
        ], 
        [
            "hear", 
            "write", 
            "understand", 
            "check"
        ], 
        [
            "finish", 
            "stop", 
            "remember", 
            "keep"
        ], 
        [
            "out", 
            "together", 
            "around", 
            "down"
        ], 
        [
            "through", 
            "across", 
            "between", 
            "except"
        ], 
        [
            "look", 
            "care", 
            "wait", 
            "use"
        ], 
        [
            "Speak", 
            "Listen", 
            "Read", 
            "Write"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "B", 
        "C", 
        "D", 
        "B", 
        "A", 
        "C", 
        "D"
    ], 
    "source": "middle633"
}