{
    "article": "Everyone likes the 30-year-old South Korean actor these days. Descendants of the Sun (<<>> ), the South Korean TV drama in  _  he plays the main role, is sweeping across Asia. Song is now the dream man for millions of girls.\nIn the drama, Song plays an army   captain who is smart,  _  and sweet. In real life, Song is known  _  being good-looking, nice and sporty. He  used to  be a speed skater. Also, he did well in his study. He got all A's in high school and studied  _  the famous Sungkyunkwan University  . Is that all for Song? No. He is also a man  _  a heart of gold. He cares about the environment. He narrated   a documentary  called  Tears of the Antarctic, which was about the ecosystem of the South Pole  . He then gave his pay to a charity group that helps  _  children.\n\"The Tears of the Antarctic story about penguins and their love of family really moved me,\" he said. \"My pay will go to a good cause.\"  _ 2011, Song has been giving money to the Korea Childhood Leukemia Foundation, even while he was doing his military service  . His money has helped more than ten children  _  treatment for their cancer  . To show their thanks, the foundation made a blog post last month called \"The Unknown Good Deed of Kind Celebrity Song Joong-ki\".", 
    "options": [
        [
            "which", 
            "what", 
            "how", 
            "when"
        ], 
        [
            "weak", 
            "strong", 
            "nervous", 
            "foolish"
        ], 
        [
            "as", 
            "in", 
            "with", 
            "for"
        ], 
        [
            "to", 
            "on", 
            "about", 
            "at"
        ], 
        [
            "off", 
            "about", 
            "with", 
            "for"
        ], 
        [
            "sick", 
            "sickness", 
            "ill", 
            "illness"
        ], 
        [
            "Before", 
            "If", 
            "When", 
            "Since"
        ], 
        [
            "get", 
            "getting", 
            "got", 
            "getted"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "D", 
        "D", 
        "C", 
        "A", 
        "D", 
        "A"
    ], 
    "source": "middle1743"
}