{
    "article": "We wish that we could be better at sports or more attractive. We wish we had nicer clothes or more money. Everyone likes to feel that he or she is special.   _ , many of us grow up believing that we're not special at all. We believe we are not good enough just as we are.\nMost parents want us to be the best we can be. Very often, they compare  us to others . By doing this, they try to encourage us to do better. They   _   well, but the message we often get is that we're not good enough. We begin to believe that the only way we can be special is    _  being better than someone else, but we are often disappointed . There will always be someone out there who is better than we are at    _ . Plenty of people around may not be as smart as we are, but they are better at sports. Or they may not be as good-looking, but they have more money. It is  _   for us to be better than everyone else all the time.\nWe all want the things that we believe will make us better people. But very often we don't realize that we already have   _   us the very things that we want. These things make us   different from   others. When we are growing up,   _   sometimes forget to tell us that we are special, that we are good enough. Maybe no one told them when they were growing up.  Anyway  , it's up to us to remind them from time to time that each of us, in our own way, is special. What we are is enough.", 
    "options": [
        [
            "Again", 
            "Next", 
            "Otherwise", 
            "However"
        ], 
        [
            "believe", 
            "work", 
            "mean", 
            "show"
        ], 
        [
            "to", 
            "on", 
            "by", 
            "in"
        ], 
        [
            "something", 
            "anything", 
            "everything", 
            "nothing"
        ], 
        [
            "helpful", 
            "impossible", 
            "necessary", 
            "important"
        ], 
        [
            "inside", 
            "among", 
            "around", 
            "for"
        ], 
        [
            "friends", 
            "scientists", 
            "parents", 
            "doctors"
        ]
    ], 
    "answers": [
        "D", 
        "C", 
        "C", 
        "A", 
        "B", 
        "A", 
        "C"
    ], 
    "source": "middle896"
}