{
    "article": "\"Daddy, can I learn to play the violin?\" young Sarah asked her father. She was always  asking for  things and her father was not very pleased. \"You cost me a lot of money, Sarah,\" he said. \"  _  you wanted to leam horse riding, then dancing, then swimming. Now it's the  _  . \" \"I'll play every day, Daddy, \" Sarah said. \"I'Il try very hard. \" \"All right, \" her father said. \" I know  _  . I'll do. I 'll pay for you to have lessons for six weeks. At the end of six weeks you  _  play something for me. If you play well, you can have  _  lessons. If you play badly, I will stop the lessons. \" \"OK. Daddy,\" Sarah said. \"That is  _  . \" He soon found a good violin teacher and Sarah began her lessons. The lessons were very expensive, but her father kept his  _  . The six weeks passed quickly. It was time for Sarah  to play  for her father. She began to play. She played very  _  . She made a terrible noise. Her father had one of his friends with him, and the friend put his hands  _  his ears. When Sarah finished, her father said, \"  Well done  , Sarah. You can have more lessons. \" Sarah ran happily out of the room. Her father's friend turned to him. \"You've spent a lot of money,  _  she still plays very badly, \" he said. \"Well, that's true,\" her father said. \"But since she started learning the violin, I  have been  able to buy five apartments in this building very cheaply. In  another  six weeks I'II own the whole building! \"", 
    "options": [
        [
            "First", 
            "Second", 
            "Next", 
            "Finally"
        ], 
        [
            "guitar", 
            "violin", 
            "piano", 
            "game"
        ], 
        [
            "which", 
            "that", 
            "what", 
            "how"
        ], 
        [
            "must", 
            "can", 
            "may", 
            "might"
        ], 
        [
            "many", 
            "much", 
            "more", 
            "fewer"
        ], 
        [
            "impossible", 
            "unfair", 
            "funny", 
            "fair"
        ], 
        [
            "waming", 
            "promise", 
            "notice", 
            "excuse"
        ], 
        [
            "badly", 
            "well", 
            "better", 
            "worse"
        ], 
        [
            "off", 
            "in", 
            "behind", 
            "over"
        ], 
        [
            "or", 
            "but", 
            "though", 
            "so"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "C", 
        "A", 
        "C", 
        "D", 
        "B", 
        "A", 
        "D", 
        "B"
    ], 
    "source": "middle580"
}