{
    "article": "When I opened the box at my 12th birthday party, I couldn't believe my eyes. I had really gotten a mobile phone!\nAs soon as I got to my school the next morning I _ off my phone and asked everyone for their _ .\nIt felt like I didn't even exist in that class any more. I wouldn't pay much attention to the teachers because I was too busy on my _ . Luckily I didn't get _ using it. I was pretty sure that the teacher didn't _ \nthat I stopped paying attention to her _ a week later we took a test and I failed. To make matters _ , my mom had to sign the test.\nIt was hard to show my mom the _ . She was used to seeing As and Bs on my tests. Well, at last, I showed her and she couldn't _ it. She was angry.\nWeeks passed and my parents started to _ the fact that I had a phone. They would say, \"We have noticed that you never pay attention to us. It's like you have your own little _ now and we don't communicate as much with your phone.\"\nI acted like they were wrong, but then I started to wonder if it was true that I was spending too much _ on the phone.\nA week later I tried _ a whole day without a phone. I had so much _ \nbecause I was actually spending time with my family and paying attention to them. From that day, I had a different opinion towards phones.\nPhones really take you away from the rest of the world. I'm not saying that phones are\n _ and not to use them, but you do have to spare some time to spend with your family. My phone took away time from my homework and from my family. I will keep using my phone, but I will have it under better control.", 
    "options": [
        [
            "took", 
            "put", 
            "turned", 
            "showed"
        ], 
        [
            "numbers", 
            "names", 
            "help", 
            "homework"
        ], 
        [
            "job", 
            "test", 
            "phone", 
            "paper"
        ], 
        [
            "caught", 
            "allowed", 
            "troubled", 
            "asked"
        ], 
        [
            "mention", 
            "notice", 
            "prevent", 
            "punish"
        ], 
        [
            "until", 
            "before", 
            "though", 
            "because"
        ], 
        [
            "clearer", 
            "easier", 
            "worse", 
            "better"
        ], 
        [
            "box", 
            "book", 
            "homework", 
            "paper"
        ], 
        [
            "believe", 
            "receive", 
            "see", 
            "achieve"
        ], 
        [
            "stress", 
            "complain", 
            "accept", 
            "enjoy"
        ], 
        [
            "secret", 
            "idea", 
            "world", 
            "dream"
        ], 
        [
            "time", 
            "force", 
            "money", 
            "control"
        ], 
        [
            "studying", 
            "working", 
            "going", 
            "thinking"
        ], 
        [
            "trouble", 
            "worry", 
            "fun", 
            "improvement"
        ], 
        [
            "good", 
            "bad", 
            "necessary", 
            "useful"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "C", 
        "A", 
        "B", 
        "A", 
        "C", 
        "D", 
        "A", 
        "B", 
        "C", 
        "A", 
        "C", 
        "C", 
        "B"
    ], 
    "source": "middle1577"
}