{
    "article": "Ever since I was little, my favorite season was winter. I loved to play in the snow and enjoy the hot chocolate.  _  winter never gave me the special gift of snow on my birthday. I would ask my grandmother  _  it didn't snow on my birthday. She would laugh and tell me I asked too many questions.  _  one day, she promised that she would make it snow on my next birthday. That year,  _  my birthday, my grandmother died. I was sad but angry because she had promised to make it snow. The day of my sixth birthday, I woke up and ran to the window,  hoping  to see just one snowflake. But there was no snow. I felt mad at my grandmother. She had broken a promise. By my sixteenth birthday, I  had lost  all hope of getting my snow, even though I still wished for  _  . During my party, I stayed with my friends and family and was truly happy. I  _  the best time ever! Then I saw the white snow  falling  down all around. I was so excited that I ran around screaming and laughing. My friends all laughed  _  me, but I didn't care. When I  _  home, my grandpa said he had a gift for me. I was  _  because he had given me a gift. It was a small white box, which looked old. I opened it. There was a crystal snowflake with a card that  _  , \"Happy Birthday.\" How could this be? My grandpa said it was my grandmother's final  _  on my \"sweet sixteenth\". I cried. I was  _  that my smiling grandmother angel was and had been watching over me.", 
    "options": [
        [
            "Certainly", 
            "Unluckily", 
            "Importantly", 
            "Luckily"
        ], 
        [
            "when", 
            "how", 
            "whether", 
            "why"
        ], 
        [
            "But", 
            "Or", 
            "Then", 
            "So"
        ], 
        [
            "on", 
            "after", 
            "before", 
            "in"
        ], 
        [
            "it", 
            "her", 
            "him", 
            "me"
        ], 
        [
            "had", 
            "was", 
            "played", 
            "feared"
        ], 
        [
            "with", 
            "at", 
            "from", 
            "off"
        ], 
        [
            "went", 
            "left", 
            "got", 
            "entered"
        ], 
        [
            "excited", 
            "confused", 
            "pleased", 
            "satisfied"
        ], 
        [
            "wrote", 
            "said", 
            "explained", 
            "appeared"
        ], 
        [
            "order", 
            "mistake", 
            "wish", 
            "decision"
        ], 
        [
            "certain", 
            "angry", 
            "sad", 
            "anxious"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "A", 
        "C", 
        "A", 
        "A", 
        "B", 
        "C", 
        "B", 
        "B", 
        "C", 
        "A"
    ], 
    "source": "middle2218"
}