{
    "article": "For two years my life was a complete mess because I was addicted to(......)drugs. I took my mother's trust and forgiveness for granted. Despite all the times I _ from her, lied to her, and begged her to give me money, she _ left me. Not once did I stop to take her feelings into consideration. I was never _ for any of the things she did for me.\nThen one night, while wandering through the streets, I got pulled over by two police officers. I was _ and they found drugs in my pocket. That night I should have been put into _ ,but they called Child Protective Services and I was placed in a foster home instead.\nThat night reality hit me hard. Away from my mother, I cried myself to sleep. I _ everything she had done for me. I _ her so much. I started thinking about the sound of her voice, the music she listened to, the  _ and taste of her food, even the clothes she would wear.\nI started looking back at all the times she would be singing and I would shout at her to \"shut up\",   _ when she'd hug me and say \"I love you\" and I would _ her away. I took all these things for granted and it was then that I felt _ a big part of my life she really was.\nThat night I prayed for the first time in eight years. I prayed to God for forgiveness for all the things I had done before. But most importantly I prayed to him for turning my life around.\nMy _ has turned around now. I have stopped taking drugs and am living with my family in Baldwin Park. My relationship with my mother is _ than ever. Now I know the feeling of my mother and I know how to thank her.", 
    "options": [
        [
            "heard", 
            "stole", 
            "escaped", 
            "hid"
        ], 
        [
            "never", 
            "always", 
            "ever", 
            "even"
        ], 
        [
            "suitable", 
            "ready", 
            "worried", 
            "thankful"
        ], 
        [
            "hit", 
            "questioned", 
            "searched", 
            "invited"
        ], 
        [
            "bed", 
            "prison", 
            "room", 
            "hospital"
        ], 
        [
            "remembered", 
            "forgot", 
            "found", 
            "expected"
        ], 
        [
            "hated", 
            "discouraged", 
            "missed", 
            "hurt"
        ], 
        [
            "shape", 
            "smell", 
            "weight", 
            "size"
        ], 
        [
            "or", 
            "but", 
            "yet", 
            "since"
        ], 
        [
            "put", 
            "take", 
            "push", 
            "keep"
        ], 
        [
            "what", 
            "how", 
            "that", 
            "which"
        ], 
        [
            "hobby", 
            "attitude", 
            "idea", 
            "life"
        ], 
        [
            "nicer", 
            "better", 
            "worse", 
            "Further"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "D", 
        "C", 
        "B", 
        "A", 
        "C", 
        "B", 
        "A", 
        "C", 
        "A", 
        "D", 
        "B"
    ], 
    "source": "middle777"
}