{
    "article": "One night, a little swallow flew over the city. He was very  _  and wanted to have a good sleep in the city. When he saw the Statue of the Happy Prince , he flew down and got ready to sleep  _  the feet of the Happy Prince. Just as he was putting his head under his wing, some  _  fell on him. He thought it was raining. But when he looked  _  , he found the sky was  _  clear and bright that he could see lots of stars. Suddenly, he saw some tears were running down the Prince's golden  _  . \"  _  are you crying?\" asked the swallow. \"In a little street, there's a poor house. From one of the windows, I see a woman  _  at a table. She's sewing clothes for  _  women to wear. In a bed in the corner of the room, her little boy is sick. He's asking for oranges, but his mother has only water to give him, so he is crying. The boy is so thirsty  _  the mother is so sad. Little swallow, will you please take her the  _  from the top of my sword ?\" \"It is very cold here and I am leaving for a warm place, but I will stay with you and do as you ask.\" The swallow took the bright red jewel from the Prince's sword and flew away with it in his mouth. He flew into the woman's room and  _  it beside the woman's needle.  _  he flew back, he told the Prince what he had done. \"It 's strange,\" he added, \"It's so cold but I feel quite  _  now.\" \"That's  _  you have done a good thing,\" said the Prince. The little swallow began to think about this, and then he fell asleep.", 
    "options": [
        [
            "hungry", 
            "tired", 
            "angry", 
            "sad"
        ], 
        [
            "among", 
            "above", 
            "below", 
            "between"
        ], 
        [
            "water", 
            "snow", 
            "grass", 
            "milk"
        ], 
        [
            "at", 
            "down", 
            "up", 
            "for"
        ], 
        [
            "quite", 
            "so", 
            "such", 
            "very"
        ], 
        [
            "ear", 
            "feet", 
            "hair", 
            "face"
        ], 
        [
            "Where", 
            "How", 
            "When", 
            "Why"
        ], 
        [
            "sitting", 
            "eating", 
            "drinking", 
            "cooking"
        ], 
        [
            "poor", 
            "rich", 
            "young", 
            "old"
        ], 
        [
            "but", 
            "or", 
            "and", 
            "so"
        ], 
        [
            "jewel", 
            "orange", 
            "gold", 
            "diamond"
        ], 
        [
            "forgot", 
            "took", 
            "got", 
            "put"
        ], 
        [
            "Before", 
            "After", 
            "Till", 
            "While"
        ], 
        [
            "cold", 
            "hot", 
            "warm", 
            "cool"
        ], 
        [
            "because", 
            "though", 
            "if", 
            "whether"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "A", 
        "C", 
        "D", 
        "D", 
        "D", 
        "A", 
        "B", 
        "C", 
        "A", 
        "D", 
        "B", 
        "C", 
        "A"
    ], 
    "source": "middle942"
}