{
    "article": "Living in another country can be very lonely. Last year I went to a middle school in America.\nI had no friends there. I was _ alone, and sometimes I felt like I was the only person in the world.\nOne Monday, our teacher _ a boy into the classroom and told us, \"This is Terry King, your new classmate.\" He was tall and fat, and when he _ , his eyes turned into a line. He was always smiling, and it seemed like he had no _ .\nTerry took the seat next to me. Then he looked at me for a second. I didn't realize that we _ become good friends later.\nAfter school that day, I went to a net bar to play my favorite computer game. When I went inside, I got a big surprise: Terry was there and was playing the _ game!\n\"Hey, I'm surprised to see you here,\" I said. I sat down beside him.\n\"Me, too, \"he smiled, and his eyes turned into a line. I turned round and looked at his screen. He was a good _ .\nI hoped we could play _ . I asked excitedly, \"Do you like this game, too?\"\nIn fact, I had never talked to a classmate so freely before, but his _ helped me to open up.\n\"Would you like to play with me?\" I asked.\n\"Sure,\" he answered. He seemedas happy as I was. As we started the game, we started our friendship, too.", 
    "options": [
        [
            "always", 
            "never", 
            "seldom", 
            "luckily"
        ], 
        [
            "met", 
            "brought", 
            "invited", 
            "followed"
        ], 
        [
            "cried", 
            "frightened", 
            "smiled", 
            "shouted"
        ], 
        [
            "friends", 
            "worries", 
            "family", 
            "hobbies"
        ], 
        [
            "should", 
            "must", 
            "could", 
            "might"
        ], 
        [
            "amazing", 
            "boring", 
            "same", 
            "different"
        ], 
        [
            "student", 
            "boy", 
            "guy", 
            "player"
        ], 
        [
            "carefully", 
            "easily", 
            "together", 
            "peacefully"
        ], 
        [
            "smile", 
            "exercise", 
            "advice", 
            "question"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "C", 
        "B", 
        "C", 
        "C", 
        "D", 
        "C", 
        "A"
    ], 
    "source": "middle887"
}