{
    "article": "One Sunday afternoon, my younger brother and I were left alone at home. I was doing my homework  _  my younger brother was watching TV. Suddenly, the doorbell rang. My brother thought it was our parents, so he opened the  _  quickly. A tall man stood outside and  _  politely if our parents were at home. Without thinking, my brother said, \"No. \" When I wanted to close the door, he suddenly  _  the door very hard and came into our house. He took out a  _  and ordered me to tie up my brother's  _  with a rope . I tied up his hands in a special way so my brother could untie himself  _  . The man then tied my hands up and locked  _  of us in the kitchen. Soon, he went upstairs. I taught my brother to  _  his rope with his hands. He then untied  _  . I rushed to the telephone to call the police,  _  the line was cut off. The doors were all locked from outside. It was lucky that the man forgot to  _  the kitchen door. We got out of the house through the window and went to the nearest pay phone to call the police. Soon the police came and  the man  was caught. By the time, my parents had come home. We told them the  _  story. My parents were glad that we were not hurt. They told me that I should stop my brother from  _  the door for the stranger. I learned a lesson on safety.", 
    "options": [
        [
            "when", 
            "before", 
            "after", 
            "while"
        ], 
        [
            "cupboard", 
            "door", 
            "doorbell", 
            "window"
        ], 
        [
            "guessed", 
            "asked", 
            "argued", 
            "cried"
        ], 
        [
            "pushed", 
            "pulled", 
            "knocked", 
            "closed"
        ], 
        [
            "candy", 
            "gift", 
            "knife", 
            "phone"
        ], 
        [
            "feet", 
            "legs", 
            "hands", 
            "arms"
        ], 
        [
            "hardly", 
            "easily", 
            "suddenly", 
            "difficulty"
        ], 
        [
            "all", 
            "each", 
            "neither", 
            "both"
        ], 
        [
            "make", 
            "tie", 
            "untie", 
            "use"
        ], 
        [
            "me", 
            "myself", 
            "him", 
            "himself"
        ], 
        [
            "but", 
            "and", 
            "or", 
            "as"
        ], 
        [
            "break", 
            "lock", 
            "move", 
            "see"
        ], 
        [
            "happy", 
            "whole", 
            "usual", 
            "same"
        ], 
        [
            "turning", 
            "sending", 
            "opening", 
            "closing"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "B", 
        "A", 
        "C", 
        "C", 
        "B", 
        "D", 
        "C", 
        "A", 
        "A", 
        "B", 
        "B", 
        "C"
    ], 
    "source": "middle963"
}