{
    "article": "Many, many years ago most people did not have beautiful books. Some families did not have\nbooks at all. The people  _  did have books had only a few.\nInstead of  reading  books, people told stories. They would remember things  _ \nhappened to them and would retell these tales to friends.\nSome stories you read in books today  were told  to children many years ago by their\nfathers and mothers.  _  those girls and boys grew up, they, in turn, told their children the\nsame tales.\nSometimes the stories changed as one man told  another . That is why today there are\ndifferent beginnings and different endings to the same folk tales. You  will even find  different names\nfor all kinds of characters in the different versions  of the tales. In this way the stories almostseem  to be  different ones and not your favorite tales at all.\nSome people  made up  stories. They would suppose  _  things which had\nhappened could not really have happened. Such people became  known  as storytellers.\nIn many of the tales, animals did the talking. In others, good men came to help bad men.\nStrange, exciting things  happened . The different ideas made interesting stories.\nSome of the early tales,  _  them Mother Goose verses were told in rhyme. The\npoems were learned by boys and girls at home and at school.\nWhat Mother Goose rhymes do you know and remember? Do you think there was\n really  a Mother Goose? Mother Goose stories and rhymes are  such  good ones\nthat we read and enjoy them today, years after they were first told.", 
    "options": [
        [
            "which", 
            "whom", 
            "who", 
            "when"
        ], 
        [
            "who", 
            "that", 
            "what", 
            "where"
        ], 
        [
            "When", 
            "Though", 
            "While", 
            "Which"
        ], 
        [
            "that", 
            "what", 
            "when", 
            "where"
        ], 
        [
            "in", 
            "of", 
            "among", 
            "between"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "A", 
        "A", 
        "C"
    ], 
    "source": "middle487"
}