{
    "article": "For foreigners in China, food isn't simply a meal. It's sometimes a _ . I often fail to order the right food and use chopsticks correctly when I sit down in a restaurant.\nBecause not every dish has a picture on the menu, _ food becomes a guessing game. My father and I often _ what kind of vegetables or meat we're eating. In one of our favourite Sichuan restaurants, it took three waiters 15 minutes to take our order for _ . I simply wanted water, but my father wanted to try one of the fresh juices listed on the menu. There were two _ , however. There were neither pictures nor English on the menu. Finally, he just ordered a Coca Cola.\nOne of our most embarrassing  experiences was at a famous restaurant. It was always _ , so we thought it might be a good restaurant to visit. We had the most difficult time ordering our meal, since there were so many choices. Luckily, the waiter was very _ and successfully understood us. During the dinner, noodles slipped  through my chopsticks onto the table lots of times. Once, I tried to pick up a dumpling for my father, but I _ it on his shorts. We both looked at it as it fell to the floor. I looked behind me and people were _ about my chopsticks skills.\nNo matter how difficult it is for us to understand the menu, the waiters are always very understanding of our _ . They always give us good service, even when they realize they have to clean up the noodles that have slipped through my chopsticks.", 
    "options": [
        [
            "surprise", 
            "challenge", 
            "prize", 
            "mistake"
        ], 
        [
            "cooking", 
            "selling", 
            "sending", 
            "ordering"
        ], 
        [
            "fear", 
            "report", 
            "explain", 
            "guess"
        ], 
        [
            "dessert", 
            "fruit", 
            "drinks", 
            "vegetables"
        ], 
        [
            "problems", 
            "inventions", 
            "chances", 
            "directions"
        ], 
        [
            "noisy", 
            "peaceful", 
            "crowded", 
            "empty"
        ], 
        [
            "honest", 
            "patient", 
            "proud", 
            "brave"
        ], 
        [
            "ate", 
            "dropped", 
            "prepared", 
            "got"
        ], 
        [
            "laughing", 
            "thinking", 
            "arguing", 
            "learning"
        ], 
        [
            "culture", 
            "habit", 
            "conversation", 
            "Situation"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "D", 
        "C", 
        "A", 
        "C", 
        "B", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "middle1281"
}