{
    "article": "It was only October, but my students were already talking about Christmas plans. As each day passed, everyone became more excited waiting for the final school bell. As soon as everyone heard the  _  , they would run for their coats and go home, everyone except David. David was a small boy in old clothes. I had often  _  what kind of home life David had, and what kind of mother could send her son to school dressed so improperly for the cold winter months, without a coat, boots, or gloves, But something made David  _  .I can still remember he was always  _  a smile and willing to help, He always stayed after school to straighten chairs and mop the floor. We never talked much. He would just simply smile and ask what else he could do, then thank me for letting him stay and slowly head for home. Weeks passed and the  _  over the coming Christmas grew into restlessness until the last day of  _  before the holiday break. I smiled in relief as the last of them hurried out the door. Turning around I saw David  _  standing by my desk. \"I have something for you, \" he said and pulled from behind his back a small box, Handing it to me, he said anxiously, \"Open it.\" I took the box from him, thanked him and slowly unwrapped it. I lifted the lid and to my  _  .I saw nothing. I looked at David's smiling face and back into the box and said, \"The box is nice, David, but it's  _  .\" \"Oh no it isn't, \" said David. \"It's full of love. My mum told me before she died that love was something you couldn't see or touch unless you know it's there.\" Tears filled my eyes as I looked at the proud dirty face that I had rarely given attention to. After that Christmas, David and I became good friends and I never forgot the meaning  _  the little empty box set on my desk.", 
    "options": [
        [
            "warning", 
            "calling", 
            "ringing", 
            "shouting"
        ], 
        [
            "admired", 
            "wondered", 
            "realized", 
            "learned"
        ], 
        [
            "special", 
            "kind", 
            "popular", 
            "funny"
        ], 
        [
            "bringing", 
            "enjoying", 
            "wearing", 
            "sharing"
        ], 
        [
            "argument", 
            "arrangement", 
            "movement", 
            "excitement"
        ], 
        [
            "school", 
            "year", 
            "attention", 
            "program"
        ], 
        [
            "weakly", 
            "sadly", 
            "quietly", 
            "helplessly"
        ], 
        [
            "anger", 
            "joy", 
            "appreciation", 
            "surprise"
        ], 
        [
            "cheap", 
            "empty", 
            "useless", 
            "improper"
        ], 
        [
            "from", 
            "behind", 
            "over", 
            "towards"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "A", 
        "C", 
        "D", 
        "A", 
        "C", 
        "D", 
        "B", 
        "B"
    ], 
    "source": "middle1615"
}