{
    "article": "Are you nervous when you stand in front of the public? Are you afraid to make a speech? Li Jun, a middle school boy, felt shy when he was making a speech the other day. Li had thought it would be quite easy to speak in front of  _  classmates. \"I was wrong. It was very different and much  _  than talking to my classmates during playtime,\" Li said. \"I tried, but it was really difficult to speak. I felt like a mute and wanted to leave the classroom  _  \" Li is not  _  . Many middle school students now have the same  _  : they can talk about their ideas freely  _  their best friends after class, but can't speak in public. According to Zhou Hong, a teacher from a university, the main reason is that schools in China pay more attention to writing instead of  _  . Zhou hopes schools can give students more chances to open their  _  , such as speech competitions, English corners and class discussions. Students can join in any one they want to.  _  he also gives some advice to students. \"During your free time you should  _  more. When you're speaking in public, take it  _  . Just imagine you're talking to nobody and speak up your ideas clearly,\" Zhou said. \"That  _  a fine public speech and you'll feel confident. \"", 
    "options": [
        [
            "Her", 
            "my", 
            "your", 
            "his"
        ], 
        [
            "harder", 
            "easier", 
            "better'", 
            "later"
        ], 
        [
            "slowly", 
            "quickly", 
            "sadly", 
            "happily"
        ], 
        [
            "lonely", 
            "alone", 
            "only", 
            "just"
        ], 
        [
            "answer", 
            "subject", 
            "problem", 
            "question"
        ], 
        [
            "except", 
            "beside", 
            "from", 
            "with"
        ], 
        [
            "listening", 
            "speaking", 
            "reading", 
            "singing"
        ], 
        [
            "mouths", 
            "eyes", 
            "minds", 
            "hearts"
        ], 
        [
            "But", 
            "So", 
            "And", 
            "Or"
        ], 
        [
            "play", 
            "practice", 
            "write", 
            "Watch"
        ], 
        [
            "nervous", 
            "easy", 
            "hard", 
            "funny"
        ], 
        [
            "reports", 
            "keeps", 
            "hears", 
            "Makes"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "B", 
        "B", 
        "C", 
        "D", 
        "B", 
        "A", 
        "C", 
        "B", 
        "B", 
        "D"
    ], 
    "source": "middle1495"
}