{
    "article": "Mr. Clinton and his 3-year-old son Tony are basketball fans. Last October 10th was Tony's birthday, so Mr. Clinton decided to _ him to New York, for the first game of the World Series. They had no ticket but hoped to buy a _ from scalpers.\nIt was a two hours' ride. After they arrived, they walked in the street for two hours, carrying a _ that read, \" We need two tickets.\" There were many scalpers around, but the _ ticket was $200. They were about to _ when suddenly a man stopped them. He took out two tickets and _ them to Mr. Clinton.\n\"How much do you want?\"\n\"Just a _ ,\" said the man. \"Enjoy the game.\"\nMr. Clinton wouldn't accept, so the man explained, \"I'm Jackson. Hans is my boss. He and his wife haven't _ a World Series in 18 years. _ he is ill and can't watch the game this time. So he told me to give the two tickets to people who I thought would actually enjoy the game. A lot of people looked as if they might just take the tickets and sell them. Then I saw you and I _ you for a while. You seemed very _ . You made me think of my dad and me when I was a child. I dreamed _ going to a World Series game with my father. But my dream _ came true.\"\nHow do you suppose this made Mr. Clinton and his son feel? Here is what Mr. Clinton said: \"This is the most wonderful thing _ ever happened to us. My boy and I must have turned to each other over 30 times and said, 'I can't believe this.' We still never forget Jackson and Hans.\"", 
    "options": [
        [
            "walk", 
            "fly", 
            "ride", 
            "drive"
        ], 
        [
            "pair", 
            "piece", 
            "slide", 
            "set"
        ], 
        [
            "paper", 
            "letter", 
            "sign", 
            "word"
        ], 
        [
            "earliest", 
            "cheapest", 
            "latest", 
            "dearest"
        ], 
        [
            "leave", 
            "start", 
            "go", 
            "flee"
        ], 
        [
            "brought", 
            "took", 
            "handed", 
            "left"
        ], 
        [
            "joke", 
            "present", 
            "dollar", 
            "match"
        ], 
        [
            "missed", 
            "watched", 
            "played", 
            "caught"
        ], 
        [
            "So", 
            "And", 
            "Or", 
            "But"
        ], 
        [
            "begged", 
            "followed", 
            "asked", 
            "thought"
        ], 
        [
            "excited", 
            "pleased", 
            "disappointed", 
            "bored"
        ], 
        [
            "at", 
            "like", 
            "of", 
            "with"
        ], 
        [
            "always", 
            "often", 
            "usually", 
            "never"
        ], 
        [
            "that", 
            "which", 
            "when", 
            "why"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "C", 
        "B", 
        "A", 
        "C", 
        "B", 
        "A", 
        "D", 
        "B", 
        "C", 
        "C", 
        "D", 
        "A"
    ], 
    "source": "middle1834"
}