{
    "article": "I watched quietly as John, my little brother, was caught in the act. He sat in the corner of the living room, a pen in one hand and my father's brand-new book in the other. As my father walked into the room, my brother cowered slowly. He  _  that he had done something wrong. From a distance I could see that he had  _  my father's new book and scribbled in it. Now, looking at my father  _  , he and I both waited for punishment. My father picked up his prized book, looked at it carefully, and then sat down,  _  saying a word. Books are precious to him. He was a clergyman and for him books were knowledge. What he did next was  _  . Instead of punishing my brother, he sat down, took the pen from my brother's hand, and then  _  in the book himself, alongside the scribbles John had made: John's work, 1959, age 2. \"Wow,\" I thought. \"This is punishment?\" The years and the books came and went. Our family experienced  _  all families go through and perhaps a little bit more: happiness and  _  , laughter and tears. We always knew our parents loved us and that one of the proofs of their love was the  _  . From time to time we would open it, look at the scribbles, read my father's expression of  _  , and feel proud.", 
    "options": [
        [
            "pretended", 
            "imagined", 
            "realized", 
            "suggested"
        ], 
        [
            "dropped", 
            "kept", 
            "carried", 
            "opened"
        ], 
        [
            "fearfully", 
            "carefully", 
            "excitedly", 
            "surprisingly"
        ], 
        [
            "by", 
            "without", 
            "beyond", 
            "before"
        ], 
        [
            "unbelievable", 
            "acceptable", 
            "frightening", 
            "exciting"
        ], 
        [
            "searched", 
            "read", 
            "wrote", 
            "put"
        ], 
        [
            "how", 
            "what", 
            "that", 
            "when"
        ], 
        [
            "fun", 
            "fears", 
            "sadness", 
            "difficulty"
        ], 
        [
            "book", 
            "pen", 
            "room", 
            "photo"
        ], 
        [
            "wish", 
            "warning", 
            "success", 
            "love"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "A", 
        "B", 
        "A", 
        "C", 
        "B", 
        "C", 
        "A", 
        "D"
    ], 
    "source": "middle34"
}