{
    "article": "Right from childhood,my brothers began to play ice hockey with me.They all _ me to become an ice hockey player some day.My mom didn't agree,and she _ me into the skating although I always had a strong hope for ice hockey.\nFinally we reached an agreement that I became the referee of ice hockey.Little did I know that 1 was beginning an activity that would _ my character.At first I only worked with my brothers.Everyone was _ and we got along quite well with each other.I soon realized that I needed to work with other people,and that's when my experience changed.As I began dealing with more coaches who acted in unpleasant ways,all I wanted to do was to get through each game and then be able to _ .without getting into trouble.Although as a referee I tried my best in every match,they sometimes shouted at me.That made me feel _ ,but I decided not to let them drive me away.\nI made the _ to stand up for myself.I never answered rudely to the coaches,but I did not let them destroy my confidence any more.There were still a few situations that made me afraid.0nce I called a penalty and the team ended up losing.I knew I had made the right call,even though I was _ when I saw that team's fans waiting for me at my room. I stood my ground and overcame my fears .\nI've been a referee for six years,but I _ can't say it'S easy.Every game _ me something new and I never know what to expect.Now I have enough preparation to deal with\nthe unexpected.These are the little lessons that I'm thankful to have learned as a woman referee", 
    "options": [
        [
            "invited", 
            "expected", 
            "ordered", 
            "allowed"
        ], 
        [
            "pushed", 
            "knocked", 
            "divided", 
            "joined"
        ], 
        [
            "match", 
            "bring", 
            "discover", 
            "influence"
        ], 
        [
            "lively", 
            "clever", 
            "friendly", 
            "funny"
        ], 
        [
            "train", 
            "refuse", 
            "work", 
            "leave"
        ], 
        [
            "tired", 
            "strong", 
            "sad", 
            "surprised"
        ], 
        [
            "decision", 
            "chance", 
            "progress", 
            "report"
        ], 
        [
            "angry", 
            "afraid", 
            "sorry", 
            "serious"
        ], 
        [
            "yet", 
            "even", 
            "already", 
            "still"
        ], 
        [
            "hands", 
            "protects", 
            "corrects", 
            "follows"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "D", 
        "C", 
        "D", 
        "C", 
        "A", 
        "B", 
        "D", 
        "A"
    ], 
    "source": "middle1174"
}