{
    "article": "The earth is our home. We must take care of it. Life today is easier than it was  _  years ago, but it has brought some new problems. One of the biggest problems is pollution . We can see it, smell it, drink it and even  _  it. Man has polluted the  _  . The more people, the more pollution.Many years ago, the problem was not so serious because there were not so  _  people. When the land was used up , the river was not clean in a place,man went to  _  place. Now man is slowly polluting the whole world  _  pollution is still the most serious, it's bad for  _  things in the world.Many countries don't le t people burn  _  for air in houses and factories in the city. Pollution by SO2 is now the most dangerous kind of  _  pollution. It's caused by heavy traffic. People say it's  _  to ride bikes. When you are  _  , there is no pollution. But even in developed countries, most people don't go to work by bike. It's not  _  bikes are expen sive or people are tired if they ride to work. It's because the number of cars on the roads becomes larger. So more people  _  their bikes and go to work by cars, then things are getting  _  . We should have special roads only for bikes and make it  _  difficult and expensive for drivers to take their cars into the city that they will go back to use their bikes.", 
    "options": [
        [
            "hundred", 
            "hundredsof", 
            "hundredof", 
            "hundreds"
        ], 
        [
            "listen", 
            "listento", 
            "hearof", 
            "hear"
        ], 
        [
            "moon", 
            "star", 
            "earth", 
            "sun"
        ], 
        [
            "lot", 
            "little", 
            "many", 
            "much"
        ], 
        [
            "others", 
            "theothers", 
            "theother", 
            "another"
        ], 
        [
            "Air", 
            "Food", 
            "Water", 
            "Noise"
        ], 
        [
            "life", 
            "live", 
            "living", 
            "lives"
        ], 
        [
            "somethingbad", 
            "badsomething", 
            "somethinggood", 
            "goodsomething"
        ], 
        [
            "water", 
            "air", 
            "noise", 
            "white"
        ], 
        [
            "least", 
            "best", 
            "most", 
            "worst"
        ], 
        [
            "driving", 
            "biked", 
            "riding", 
            "ridden"
        ], 
        [
            "why", 
            "because", 
            "what", 
            "how"
        ], 
        [
            "puton", 
            "lookat", 
            "putaway", 
            "lookup"
        ], 
        [
            "betterandbetter", 
            "moreandmore", 
            "worseandworse", 
            "biggerandbigger"
        ], 
        [
            "quite", 
            "such", 
            "very", 
            "so"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "C", 
        "C", 
        "D", 
        "A", 
        "C", 
        "A", 
        "B", 
        "B", 
        "C", 
        "B", 
        "C", 
        "C", 
        "D"
    ], 
    "source": "middle1937"
}