{
    "article": "Exciting News\n\"I have some exciting news, class,\" said Mrs. Pike.\nIt was almost lunchtime, and Jenny Archer was _ . She drew a piece of apple pie in her notebook.\nSometimes Mrs. Pike's exciting news wasn't very exciting. Once, Mrs. Pike had said it would be exciting to watch a filmstrip called Tommy Tooth and the Whole Truth About Teeth. But it wasn't.\nJenny drew a scoop of ice cream on the apple pie.\n\"We're going to have a _ ,\" said Mrs. Pike.\nJenny put down her pencil. She pushed her glasses back on her nose.\n\"The whole school will take part,\" Mrs. Pike went on. \"We're going to _ empty tin cans to sell to a scrap-metal dealer  . We'll use the money to buy a video camcorder and a TV monitor for the school.\"\n\"What kind of competition is that?\" asked Clifford Stern. \"Just collecting cans?\"\n\"The _ that collects the most cans,\" said Mrs. Pike, \"will use the camera first. We will make our own class movie. You could all be stars!\"\nMe, a movie star! Jenny thought. Now, that was _ . She pictured herself accepting an Academy Award. She would say, \"I tall started when I was in a little school . . .\"\n\"The person in the class who brings in the most cans will direct the first movie,\" Mrs. Pike finished.\nWow! _ a movie might be even better than starring in one. The director could make up the whole story. She would choose the actors and tell everybody what to do. Jenny loved to make up stories. And she was good at telling people what to do.\nShe was sure she'd be a great _ .\nThe whole class was buzzing   now. Jenny forgot she was hungry. She looked over at her friend Beth. Beth's eyes were bright. She thought this was a great idea, too.\n\"You can be the star of my movie,\" Jenny whispered to her.\n\"What do you mean your movie?\" Beth asked.\n\"When I _ the competition,\" Jenny said.\n\"What if I win the competition?\" Beth said.\n\"But I have to win,\" answered Jenny. \"I've always wanted to make a movie.\"\n\"Since when?\" Beth asked.\n\"Well, I just _ it now,\" Jenny admitted  . \"But don't you think I'd make a good director?\"\n\"I think I might make a good director,\" Beth said. \"Why should you be the director?\"\nBeth was one of Jenny's two best friends. Jenny didn't want to fight with her. But she _ wanted to win this competition. She just had to direct the class movie.\n\"Let's not fight,\" Jenny said. \"We'd both be good directors.\"\n\"You're right.\" Beth grinned  . \"We won't fight. Let's just say, may the best can collector win.\"\nJenny shook Beth's hand. \"May the best can collector win,\" she repeated.\nAs long as it's me, she told herself.", 
    "options": [
        [
            "hungry", 
            "angry", 
            "happy", 
            "worry"
        ], 
        [
            "movie", 
            "lesson", 
            "contest", 
            "news"
        ], 
        [
            "give", 
            "collect", 
            "choose", 
            "sell"
        ], 
        [
            "person", 
            "school", 
            "class", 
            "student"
        ], 
        [
            "moving", 
            "surprising", 
            "boring", 
            "exciting"
        ], 
        [
            "Directing", 
            "Collecting", 
            "Accepting", 
            "Fighting"
        ], 
        [
            "collector", 
            "director", 
            "teacher", 
            "star"
        ], 
        [
            "take", 
            "share", 
            "win", 
            "join"
        ], 
        [
            "learned", 
            "knew", 
            "spoke", 
            "realized"
        ], 
        [
            "really", 
            "lovely", 
            "usually", 
            "nearly"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "B", 
        "C", 
        "D", 
        "A", 
        "B", 
        "C", 
        "D", 
        "A"
    ], 
    "source": "middle1237"
}