{
    "article": "One morning a fox was searching for his breakfast. He went down to the lake to  _  some fish. Suddenly he saw a rabbit digging a hole on the bank of the lake and decided to eat it instead. Not wanting the rabbit to discover him, the fox moved  _  towards his meal. As he got closer, he stepped on some dry leaves. The rabbit then  turned around  in fear. When he saw the box, he started to shout. \"Quiet! Why do you rabbits shout so much?\" asked the fox, slightly annoyed that he had lost his  _  \" I am sorry, but you scared me. Your sharp teeth make me  _  \" ,replied the rabbit. \" But I don't want to eat you\". Lied the fox, \" I am only here to help with your  _  .I will be back tomorrow and help you dig your hole.\" The next day, the fox returned to the  _  . There he saw a group of rabbits busily digging holes on the bank. He thought about catching one. At that moment the rabbit he had met the day before started jumping up and down, making a  _  noise to warn his friends. All the rabbits and even the fish quickly  _  . The poor fox could not find anything to catch for food and ended up  _  fruit.", 
    "options": [
        [
            "catch", 
            "buy", 
            "smell", 
            "cook"
        ], 
        [
            "noisily", 
            "quietly", 
            "confidently", 
            "angrily"
        ], 
        [
            "time", 
            "place", 
            "meal", 
            "fish"
        ], 
        [
            "sad", 
            "excited", 
            "nervous", 
            "happy"
        ], 
        [
            "food", 
            "work", 
            "story", 
            "friends"
        ], 
        [
            "breakfast", 
            "house", 
            "lake", 
            "mountain"
        ], 
        [
            "loud", 
            "low", 
            "usual", 
            "dangerous"
        ], 
        [
            "returned", 
            "shouted", 
            "entered", 
            "disappeared"
        ], 
        [
            "growing", 
            "eating", 
            "picking", 
            "selling"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "C", 
        "C", 
        "B", 
        "C", 
        "A", 
        "D", 
        "B"
    ], 
    "source": "middle274"
}