{
    "article": "Jim Green has been in China for more than two years. He has been to many interestin  _  in Beijing, but he has not yet been to many other parts of  China  . Last week he went to Mount Emei in Sichuan with his  _  . Many people like to travel by  _  , but the Greens think that travelling by train is the best. It is much  _  and far more enjoyable than a rushed journey by air. They had a wonderful train ride to Chengdu  _  they went on to Mount Emei by bus. The train was quite nice and tidy, and there weren't too many people in  _  sleeping car. The Greens could stand up and  _  around. It was a long journey,  _  none of them felt tired. They kept  _  the beautiful things out of the window. They talked, laughed and played cards. The conductor kept coming to give them hot water and  _  them newspapers. People nearby  _  with each other. A young man tried to speak English with Mr and Mrs Green. Jim thought the train was like a big moving party. He went to sleep quite  _  . He enjoyed listening to the sound of the running train and then fell asleep. When Jim woke up the next morning, the train was already  _  Chengdu. His train ride seemed really  _  , but his memory of the pleasant journey will last long.", 
    "options": [
        [
            "schools", 
            "places", 
            "villages", 
            "cities"
        ], 
        [
            "friends", 
            "classmates", 
            "father", 
            "family"
        ], 
        [
            "air", 
            "bus", 
            "train", 
            "ship"
        ], 
        [
            "cheaper", 
            "dearer", 
            "dirtier", 
            "quicker"
        ], 
        [
            "before", 
            "when", 
            "after", 
            "while"
        ], 
        [
            "my", 
            "your", 
            "our", 
            "their"
        ], 
        [
            "sit", 
            "walk", 
            "run", 
            "dance"
        ], 
        [
            "and", 
            "so", 
            "also", 
            "but"
        ], 
        [
            "looking", 
            "drawing", 
            "watching", 
            "getting"
        ], 
        [
            "reading", 
            "buying", 
            "selling", 
            "writing"
        ], 
        [
            "talked", 
            "spoke", 
            "told", 
            "said"
        ], 
        [
            "early", 
            "late", 
            "easily", 
            "hard"
        ], 
        [
            "beside", 
            "to", 
            "past", 
            "near"
        ], 
        [
            "quick", 
            "slow", 
            "short", 
            "long"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "A", 
        "A", 
        "A", 
        "D", 
        "B", 
        "D", 
        "C", 
        "C", 
        "A", 
        "B", 
        "D", 
        "C"
    ], 
    "source": "middle756"
}