{
    "article": "Time is very important in our life. It _ our everyday moments. However, time never had any importance in my life until I _ a watch from my father, which organized my life and made me more responsible. It's around my wrist with two silver bands.\nI received this gift on a gray-sky day. I went to the airport a.m. to _ up my uncle Ali and take him to my house. However, I was late because I was _ with my friends. Later, around 11:00 a.m. I _ my uncle , but he had left the airport and taken a taxi to my house. I got to my house at 2:00 p.m. and felt _ of myself at that moment. After I said hello to my angry father and tired uncle, my father asked me to sit next to him and handed me this watch as a gift from him. Then he said, \"Peter, did you have _ with your friends today? I answered, \"Yes, Father, and I apologized for not meeting my uncle Ali.\" He said, \"What you _ was not very nice and you should feel sorry for your action.\" I was ashamed and said, \"Father, I'll never do it again. I promise.\" He said, \"I hope today you learned something important, and this watch will be a _ for you.\" He told me to take this watch and use it as an organizer of my life.\nI learned a very important lesson from my father: to respect time and never to be late to get someone. This watch is _ to me, not because of its price, but because of the lesson that I learned from it.", 
    "options": [
        [
            "makes", 
            "organizes", 
            "orders", 
            "deals"
        ], 
        [
            "received", 
            "accepted", 
            "won", 
            "achieved"
        ], 
        [
            "call", 
            "put", 
            "pick", 
            "bring"
        ], 
        [
            "going", 
            "leaving", 
            "standing", 
            "shopping"
        ], 
        [
            "forgot", 
            "remembered", 
            "saw", 
            "visited"
        ], 
        [
            "ashamed", 
            "frightened", 
            "disappointed", 
            "shy"
        ], 
        [
            "lunch", 
            "quarrel", 
            "chance", 
            "fun"
        ], 
        [
            "said", 
            "did", 
            "thought", 
            "forgot"
        ], 
        [
            "wonder", 
            "hope", 
            "requirement", 
            "reminder"
        ], 
        [
            "useful", 
            "necessary", 
            "important", 
            "helpful"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "D", 
        "B", 
        "A", 
        "D", 
        "B", 
        "D", 
        "C"
    ], 
    "source": "middle264"
}