{
    "article": "Online shopping is very popular among most Internet users. Almost 85% of the Internet users in the US like to  _  online. South Korea, where 99% of the Internet users like shopping online, is one of the  _  where shopping online is popular.\nInternet shopping is easy, fast  _  convenient. People can do their shopping on a _   at home. When a person visits an online shop, chooses something he  _  and then pays with his credit card   he has  _  the process of online shopping. Several days later, his  _  will be sent to his home or his office.\nThere are some  other  advantages of shopping online. Online shopping is very popular during the Christmas shopping season because people can  _  things online at any time of the day, and they don't need to  _  in a long line. That is to say, online shopping can save _ .\nOnline shopping allows a person to shop with enough time,  _  being rushed. You have the chance to save the thing  _  you want and come back to it later to  _  whether or not to buy it. But for ladies, you must be careful when you buy something online. On the one hand, sometimes the color doesn't look the same  _  that on your screen. On the other hand, you can't decide whether the dress fits you or not without trying it on.", 
    "options": [
        [
            "surf", 
            "chat", 
            "shop", 
            "play"
        ], 
        [
            "villages", 
            "towns", 
            "provinces", 
            "countries"
        ], 
        [
            "and", 
            "so", 
            "but", 
            "if"
        ], 
        [
            "book", 
            "computer", 
            "telephone", 
            "TV"
        ], 
        [
            "makes", 
            "sells", 
            "needs", 
            "uses"
        ], 
        [
            "begun", 
            "made", 
            "completed", 
            "found"
        ], 
        [
            "things", 
            "clothes", 
            "food", 
            "shoes"
        ], 
        [
            "buy", 
            "sell", 
            "watch", 
            "enjoy"
        ], 
        [
            "walk", 
            "wait", 
            "come", 
            "go"
        ], 
        [
            "money", 
            "space", 
            "time", 
            "room"
        ], 
        [
            "with", 
            "without", 
            "in", 
            "at"
        ], 
        [
            "what", 
            "which", 
            "who", 
            "where"
        ], 
        [
            "think", 
            "want", 
            "decide", 
            "look"
        ], 
        [
            "as", 
            "with", 
            "at", 
            "in"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "C", 
        "B", 
        "C", 
        "C", 
        "C", 
        "A", 
        "B", 
        "C", 
        "B", 
        "B", 
        "C", 
        "A"
    ], 
    "source": "middle1879"
}