{
    "article": "Jessie was driving home happily when a truck went past her car. The driver was moving much too fast. When Jessie neared her exit , she  _  something and stopped her car to the _ of the highway . An accident had happened on the left side. The truck had  _  a car, but the driver was gone. Jessie thought that the people inside must be badly  _  and she should help them as much as she could.\nNot thinking of the  _ , Jessie hurried to the other side of the road, though few people dared cross such a busy road. Looking into the car, she saw five people --two women and three children. Jessie was  _  to see all of them moving.\nJessie pulled one of the car doors. It wouldn't _ . She went to the next door.  _ , she couldn't move it. She almost thought that all was lost before she got one of the doors to open a little. \"Please get the children out,\" one of the women called. Jessie  _  a little boy from the car and moved him to a  _  place. Then she went to bring the other children to safety.\nAfter the last child was out of the car, Jessie thought of the box in  _  car. She had something in it that could help get that door open. So she went back to get the box quickly. As Jessie was  _  on the door, the driver said, \"Not many people would do what you're doing.\" \"You just take it easy, and I'll have you  _  soon,\" said Jessie. She was as good as her word. As soon as she helped the women out of the car, it caught fire.", 
    "options": [
        [
            "did", 
            "saw", 
            "made", 
            "forgot"
        ], 
        [
            "right", 
            "left", 
            "front", 
            "back"
        ], 
        [
            "hit", 
            "met", 
            "passed", 
            "followed"
        ], 
        [
            "wanted", 
            "treated", 
            "needed", 
            "hurt"
        ], 
        [
            "matter", 
            "trouble", 
            "danger", 
            "dangerous"
        ], 
        [
            "afraid", 
            "happy", 
            "nervous", 
            "worried"
        ], 
        [
            "close", 
            "walk", 
            "open", 
            "drive"
        ], 
        [
            "Again", 
            "Clearly", 
            "Perhaps", 
            "Suddenly"
        ], 
        [
            "picked", 
            "dropped", 
            "collected", 
            "pulled"
        ], 
        [
            "quiet", 
            "cool", 
            "safe", 
            "Clean"
        ], 
        [
            "their", 
            "her", 
            "his", 
            "its"
        ], 
        [
            "working", 
            "turning", 
            "knocking", 
            "setting"
        ], 
        [
            "back", 
            "past", 
            "over", 
            "Out"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "A", 
        "D", 
        "C", 
        "B", 
        "C", 
        "A", 
        "D", 
        "C", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "middle516"
}