{
    "article": "If you are really interested in music festivals, then you have probably heard of the Bestival Music Festival. It takes place every September on the Isle of Wight, the UK. Since it is at the end of summer, people think it's their last _ to go to a festival and have fun before going back to boring work.\nThe dream begins _ you start traveling to the island. To get to the campsite of the Festival, you have to take the ferry . The ferry is _ of happy festival lovers who are ready to take part in the fantastic music party. After you arrive at the campsite, you can put up your _ . There people talk with each other openly. They are not that cold _ those you meet in your everyday life.\nThe festival lasts for four days. During that time you forget all your worries and problems, just like living in a dream. And it is really _ for you to come back to \"reality\" after that.\nIt seems that it is this kind of music event that makes people _ together. It gives people a real sense of unity . I took part in the Festival with my friends the year before last. It was so exciting that we all _ ourselves in the beautiful music. We are family sung by Sister Sledge was my favorite. I'm really looking forward to joining in it for a _ time.\nNow, are you ready to pop over to Bestival this year?", 
    "options": [
        [
            "wish", 
            "choice", 
            "chance", 
            "turn"
        ], 
        [
            "if", 
            "though", 
            "until", 
            "when"
        ], 
        [
            "full", 
            "afraid", 
            "sure", 
            "proud"
        ], 
        [
            "picture", 
            "tent", 
            "bag", 
            "clothes"
        ], 
        [
            "like", 
            "to", 
            "with", 
            "for"
        ], 
        [
            "safe", 
            "possible", 
            "hard", 
            "easy"
        ], 
        [
            "guard", 
            "survive", 
            "hide", 
            "gather"
        ], 
        [
            "hurt", 
            "helped", 
            "dressed", 
            "lost"
        ], 
        [
            "first", 
            "second", 
            "third", 
            "last"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "A", 
        "B", 
        "A", 
        "C", 
        "D", 
        "D", 
        "B"
    ], 
    "source": "middle861"
}