{
    "article": "When I was in my first year of middle school, my father died. And my mother was ill just after I started high school, I had to stop going to school because my mother had no _ to pay for my school bills.\nWe started working in people's gardens to save up enough money _ me to go back to school. After some time, I returned to school. Unluckily, my mother died the next year. Suddenly my world went _ I asked my headmaster _ I could work for the school so I could pay my bills. He was a nice man and let me work  in the school garden during the _ . I had not been able to study well because of my mother's _ . _ the end of my second year, I Failed most of my exams and was told I would have to repeat   the year. After another   summer working in the school garden, I went back to lessons again. But suddenly  I fell _ .\nBecause of my illness, I was weak and couldn't work at school. I was hopeless. My headmaster told me not to give up  . And my teachers and classmates helped me a lot . Now I'm feeling better and will finish my third year.\nMy life is still not easy . A few students laugh at my poor clothes. They also call me 'farmer' because I work in the school garden. But I know I have to do with such problems.", 
    "options": [
        [
            "time", 
            "money", 
            "help", 
            "friends"
        ], 
        [
            "for", 
            "of", 
            "to", 
            "by"
        ], 
        [
            "bright", 
            "late", 
            "dark", 
            "wrong"
        ], 
        [
            "what", 
            "which", 
            "if", 
            "when"
        ], 
        [
            "afternoon", 
            "holidays", 
            "night", 
            "morning"
        ], 
        [
            "illness", 
            "death", 
            "rest", 
            "work"
        ], 
        [
            "Near", 
            "In", 
            "At", 
            "By"
        ], 
        [
            "tired", 
            "asleep", 
            "up", 
            "ill"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "C", 
        "B", 
        "B", 
        "C", 
        "D"
    ], 
    "source": "middle334"
}