{
    "article": "A couple of years ago, I went to a lady's house to buy some medicine. Upon entering the house, I  _  that there was a piano in the living room beside the wall.Being a piano music lover and player, I asked if the woman played. She said \"Yes\" and  _  that she had been taking lessons--at the age of 54! \"I have been  _  for 8 years now.\" I said, after hearing her words. \"Then you must play a song for me before you leave,\" she requested . I thought she was kidding and I  _  smiled. When I had bought the medicine, she asked me to play some music. I thought for a moment and  _  to play David Lanz's Return to the Heart,  _  she had so much passion for and interest in music, and it's one of my favourite songs. I played the song to the best of my ability , putting as much emotion into it as possible. She  _  it. As I was about to step out of the door, I heard a weak voice calling, \"Young man!\" I  turned around  , and saw an old lady taking one little step at a time with the help of another woman. \"I wanted to come out to thank you for the  _  song that you played. I have been very sick, and it's very hard for me to get out of bed, but I really wanted to thank you for the song. It made me feel good.\" she said. With that, she turned around and walked slowly back to her room. I was deeply touched by her  _  and felt a deeper understanding for the song. It was  _  to its name, returning to one's heart to  _  and joy.", 
    "options": [
        [
            "noticed", 
            "heard", 
            "learned", 
            "knew"
        ], 
        [
            "explained", 
            "added", 
            "dreamed", 
            "wished"
        ], 
        [
            "waiting", 
            "writing", 
            "practising", 
            "playing"
        ], 
        [
            "simply", 
            "proudly", 
            "shyly", 
            "happily"
        ], 
        [
            "promised", 
            "agreed", 
            "decided", 
            "hoped"
        ], 
        [
            "since", 
            "until", 
            "because", 
            "if"
        ], 
        [
            "hated", 
            "remembered", 
            "heard", 
            "loved"
        ], 
        [
            "valuable", 
            "pretty", 
            "beautiful", 
            "popular"
        ], 
        [
            "kindness", 
            "experience", 
            "appreciation", 
            "condition"
        ], 
        [
            "correct", 
            "true", 
            "right", 
            "real"
        ], 
        [
            "sadness", 
            "happiness", 
            "peace", 
            "honesty"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "D", 
        "A", 
        "C", 
        "A", 
        "D", 
        "C", 
        "C", 
        "B", 
        "C"
    ], 
    "source": "middle799"
}