{
    "article": "It was seven o'clock on August 26th. The Kelly family were going to Brighton, a town by the sea. \"Can we have breakfast  _  we leave?\" asked Gina Kelly. \"No,\" said her mother. \"We must  _  now, or the traffic will be terrible. We'll have breakfast when we  get to  the beach.\" Gina ran downstairs. \"I'm ready,\" she said. The family climbed into the  _  , and Dad started driving. In the front of the car was Mike. He was eleven. He didn't talk but just  listened to  music. In the back of the car were Gina, her mother and Ellen. Gina was nine and Ellen was three. Dad drove very fast. \"You're driving too fast,\" said Mum. \"You don't have to drive so fast. It's  _  .\" Dad laughed and drove  more slowly  . There wasn't too much traffic, and they reached Brighton at nine o'clock. It was a sunny day, and the sea  _  very blue. \"There's a cafe,\" said Gina. \"Can we have breakfast there?\" \"Yes,\" said Mum. They went into the cafe, and ate a very big breakfast. \"Oh dear, I am full,\" said Gina. \"  _  can I swim when I've got all that food inside me?\" \"Easy,\" shouted Mike. \"Just watch me!\" He ran towards the sea, followed by Gina happily. What a (n)  _  day it was going to be!", 
    "options": [
        [
            "before", 
            "after", 
            "while", 
            "when"
        ], 
        [
            "leaving", 
            "leaves", 
            "leave", 
            "left"
        ], 
        [
            "bus", 
            "car", 
            "train", 
            "ship"
        ], 
        [
            "late", 
            "great", 
            "busy", 
            "early"
        ], 
        [
            "sounded", 
            "tasted", 
            "looked", 
            "felt"
        ], 
        [
            "Where", 
            "How", 
            "Whether", 
            "Why"
        ], 
        [
            "exciting", 
            "boring", 
            "useful", 
            "noisy"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "B", 
        "D", 
        "C", 
        "B", 
        "A"
    ], 
    "source": "middle14"
}