{
    "article": "Once a small boy lived on the farm which seemed so far away from everywhere. He needed to get up _ sunrise every morning to help his father on the farm. During sunrise he would take a break and climb up on the fence  along the side of the farm. He could see a house with golden windows. \" If they could _ golden windows, then there must be other nice things inside the house.\" He _ how great it would be to live there. Then he _ himself, \" Some day I will go there and see this wonderful place.\"\nOne morning his father would go to town _ told him to stay at home for a rest. Knowing that this was his _ , he took a sandwich and headed across the field _ the house with the golden windows.\nAs the afternoon went on, he began to realize how _ he was. The house was much farther than he had expected. As he went near the house, he saw _ golden windows but instead a place in bad _ of painting. A small girl very close to his _ came out of the poor house and stood by the broken fence. He asked her _ she had seen the house with the golden windows. The girl said,\" Sure, I know,\" and invited him to sit on the porch . As he sat there, he looked back from _ he just came. There he saw the _ turned the windows of his house to gold! Now he understood that everyone had his own house with golden windows.", 
    "options": [
        [
            "before", 
            "after", 
            "until", 
            "when"
        ], 
        [
            "see", 
            "repair", 
            "pay", 
            "afford"
        ], 
        [
            "thought", 
            "knew", 
            "guessed", 
            "imagined"
        ], 
        [
            "asked", 
            "promised", 
            "enjoyed", 
            "helped"
        ], 
        [
            "when", 
            "and", 
            "but", 
            "so"
        ], 
        [
            "time", 
            "meal", 
            "chance", 
            "job"
        ], 
        [
            "between", 
            "near", 
            "forward", 
            "towards"
        ], 
        [
            "wrong", 
            "lucky", 
            "clever", 
            "happy"
        ], 
        [
            "the", 
            "any", 
            "no", 
            "some"
        ], 
        [
            "use", 
            "help", 
            "need", 
            "trouble"
        ], 
        [
            "age", 
            "body", 
            "place", 
            "eyes"
        ], 
        [
            "when", 
            "how", 
            "that", 
            "if"
        ], 
        [
            "what", 
            "where", 
            "who", 
            "why"
        ], 
        [
            "sunrise", 
            "sunburn", 
            "sunflower", 
            "sunset"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "D", 
        "B", 
        "B", 
        "C", 
        "D", 
        "A", 
        "C", 
        "C", 
        "A", 
        "D", 
        "B", 
        "D"
    ], 
    "source": "middle1539"
}