{
    "article": "Do you know the big city _ Zootopia? It's Disney's latest cartoon film. Many different kinds of animals live a _ life in the zootopia. Zootopia is from the two words:\"zoo\" and \"utopia\"  . The main character Judy Hopps, a rabbit, is a policewoman who is a green hand. She often messes things up .On _ first day, she was given a duty to write parking tickets by a cold and serious boss----a buffalo  Who believes that Judy is _ successful. Judy tries to prove to the belief of police that she's as good as any other police officer, and is given a heavy task. Her mission is to find a missing atter ,who  happens to be one of the fourteen missing animals in a big case that no other police offers can solve. However, _ her wisdom and kindness, she made it and won a good fame. Not only did she make her dream come true .but also she changed her parents' view on her decision to be a policewoman.\nIt tells us that we shouldn't be afraid to step outside of our comfortable place as we reach our goals. We should never _ up our dreams. Judy  faces  the common _ of any new gradutes in a new city----dumpy apartment, entry-level job, disapproving, as well as over--protective parents. _ Judy  is a\"try-er\" who keeps optimistic and confident in herself.As the lyrics of the theme song express,\"I messed up tonight ,I lost another fight. Lost to myself but I'll just start again .I won't give up, and I won't give in. Till I reach the end\". As _ as we stick to our dreams, we will make it one day.", 
    "options": [
        [
            "called", 
            "found", 
            "made", 
            "pulled"
        ], 
        [
            "hard", 
            "happy", 
            "poor", 
            "rich"
        ], 
        [
            "his", 
            "hers", 
            "their", 
            "her"
        ], 
        [
            "possibly", 
            "truly", 
            "impossibly", 
            "really"
        ], 
        [
            "of", 
            "from", 
            "for", 
            "with"
        ], 
        [
            "put", 
            "get", 
            "give", 
            "look"
        ], 
        [
            "problems", 
            "questions", 
            "changes", 
            "chances"
        ], 
        [
            "though", 
            "But", 
            "Because", 
            "And"
        ], 
        [
            "far", 
            "soon", 
            "long", 
            "possible"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "D", 
        "C", 
        "D", 
        "C", 
        "A", 
        "D", 
        "C"
    ], 
    "source": "middle744"
}