{
    "article": "It was Mother's Day, but the young mother was a little unhappy. _ she was 800 miles away from her parents. In the morning she phoned her mother to wish her a happy Mother's Day, and her mother told her _ the beautiful lilacs  in the garden.\nLater that day, when her husband knew that she liked lilacs, he said, \"I know where we _ find all that you want. Get the children and come on.\" So they went, driving down the country roads. There on a small hill, they saw _ of beautiful purple lilacs. The young woman ran quickly to enjoy the flowers. _ , she picked a few here and a few there. On their way home there was a smile on her face. When they were passing an Old People's home, the young woman saw an old granny sitting in a chair. She had no _ with her. They stopped the car and the young woman walked to the old woman, put the flowers in her hands, and smiled at her. The old granny was very _ and she thanked here again and again. She smiled happily, too.\"\nWhen the young mother came back to her car, her children asked her, \"Who is that old granny? Why did you give flowers to _ ?\" I don't know her.\" Their mother said, \"But it's Mother's Day, and she looks very lonely. I have all of you, and I still have my mother. Just think how much those flowers mean to her.\"", 
    "options": [
        [
            "And", 
            "Or", 
            "Because", 
            "If"
        ], 
        [
            "about", 
            "on", 
            "at", 
            "of"
        ], 
        [
            "must", 
            "can", 
            "could", 
            "may"
        ], 
        [
            "hundred", 
            "thousand", 
            "thousands", 
            "million"
        ], 
        [
            "Carefully", 
            "Careful", 
            "Careless", 
            "Care"
        ], 
        [
            "people", 
            "children", 
            "person", 
            "human"
        ], 
        [
            "sad", 
            "nervous", 
            "happy", 
            "mad"
        ], 
        [
            "she", 
            "herself", 
            "hers", 
            "her"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "B", 
        "C", 
        "A", 
        "B", 
        "C", 
        "D"
    ], 
    "source": "middle1168"
}