{
    "article": "Life is important. You should always have fun and new experiences, because you never know what day will be your last. You  _  hold grudges . You never know what could  _  next. I learned all this at the age of 9. It was the  _  before fifth grade. My best friend Neesah and I were playing. We got into an argument and had a  _  . My older cousin, Tiffany, broke up our fight. I remember Neesah storming out of my grandmother's house saying, \"I hope we never speak again!\" I replied, \"Good, I don't need you as a friend!\" I went into the house and tried to calm myself. Then I  _  people screaming and shouting. My cousin rushed in. She said that Neesah had been hit by a street sweeper as she crossed the road. The driver didn't see her. I felt  _  . I wished it had been  _  instead. It could have been avoided if we hadn't had that argument! When the ambulance arrived a few minutes later, they said she was  _  . I was a real mess. I had to see a psychologist for the rest of the summer. I miss Neesah so much and I  think of  her always. She taught me how precious life is and that you should never hold a grudge  _  you never know when you'll see that person again.", 
    "options": [
        [
            "shouldn't", 
            "mustn't", 
            "needn't", 
            "couldn't"
        ], 
        [
            "consider", 
            "realize", 
            "happen", 
            "lose"
        ], 
        [
            "spring", 
            "summer", 
            "autumn", 
            "winter"
        ], 
        [
            "mistake", 
            "waste", 
            "present", 
            "fight"
        ], 
        [
            "listened", 
            "heard", 
            "watched", 
            "saw"
        ], 
        [
            "happy", 
            "lonely", 
            "sad", 
            "sleepy"
        ], 
        [
            "me", 
            "it", 
            "them", 
            "her"
        ], 
        [
            "alive", 
            "dead", 
            "wrong", 
            "honest"
        ], 
        [
            "when", 
            "until", 
            "because", 
            "though"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "B", 
        "D", 
        "C", 
        "C", 
        "A", 
        "B", 
        "C"
    ], 
    "source": "middle1255"
}