{
    "article": "Liu Ming didn't know _ to expect when he volunteered for the Special Olympics World Summer Games in Shanghai, back in October 2002. Now he thinks it was the most _ experience of his life. \"It's fantastic to work as a volunteer!\" he says.\nThe Special Olympics World Summer Games give children and adults with intellectual disabilities a chance to show their skills to the world. They _ many events similar to _ in the Olympics, such as basketball, football and swimming.\nOver 40,000 people gave up their spare time for the 2007 Special Olympics World Games. It was  necessary for these volunteers to receive training before doing the tasks. Then they provided support for the athletes and helped make the events a great _ \n\"I was the swimming coach for a young boy from North China called Li Hai ,\" says Liu Ming. \"He was born with intellectual disabilities. It was very brave of him to join the competition. To Li Hai, the most important thing is not to win a gold _ a silver, but to take part. Li Hai tried his best and finished fourth. He feels more confident now because of the Special Olympics World Games.\"\nThe Special Olympics World Games also bring people together, Athletes and volunteers from different backgrounds feel like part of one big family.\" It's great for us to work closely with these special athletes. You get to help them achieve their dreams, \" says Liu Ming.", 
    "options": [
        [
            "how", 
            "where", 
            "when", 
            "what"
        ], 
        [
            "boring", 
            "amazing", 
            "happiest", 
            "terrible"
        ], 
        [
            "included", 
            "including", 
            "include", 
            "includes"
        ], 
        [
            "those", 
            "that", 
            "this", 
            "these"
        ], 
        [
            "successful", 
            "succeed", 
            "successfully", 
            "success"
        ], 
        [
            "and", 
            "for", 
            "to", 
            "by"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "C", 
        "A", 
        "D", 
        "B"
    ], 
    "source": "middle749"
}