{
    "article": "Don't break kid's heart\nI ran into a stranger as he passed by. \"Oh, excuse me please\" was my reply. He said,\" Please excuse me too.1 wasn't even watching for you.\"\nWe were very _ ,this stranger and I. We went on our way and said goodbye.\nBut at home _ story is told-how we treat our loved ones, young and old. Later that day, cooking the evening meal, my daughter stood beside me very still. When I turned, I nearly knocked her down. \"Move out of the way,\" I shouted at her. My daughter walked away, her little heart broken. I didn't realize how rudely I had spoken.\nWhile l was _ in bed. God's small voice came to me and said, \"When dealing with a  _ ,common manners you use, but the children you love, you seem to be rude. Look on the kitchen floor, and you will find some _ there by the door. Those are the flowers your daughter brought for you. She picked them herself, pink, yellow and blue. Your daughter stood  _ not to spoil the surprise, and you never saw the tears in her eyes.\"\nBy this time, I felt very small, and now my _ began to fall. I quietly went and knelt  by her bed; \"Wake up, my little baby, wake up,\" I said.\n\"Are these the flowers you _ for me?\" My daughter smiled, \"I found them out by the tree. I picked them _ they are pretty like you. I knew you would like them, especially the blue.\"\nI said, \"Daughter, I am sorry for the way I acted today: I should not have shouted at you that way.\" My daughter said, \"Oh, Mom, that's okay. I love you anyway.\"\nI said, \"Daughter, I love you too, and I do like the flowers, especially the _ .\"", 
    "options": [
        [
            "happy", 
            "angry", 
            "polite", 
            "selfish"
        ], 
        [
            "same", 
            "different", 
            "funny", 
            "exciting"
        ], 
        [
            "awake", 
            "asleep", 
            "alive", 
            "afraid"
        ], 
        [
            "friend", 
            "classmate", 
            "enemy", 
            "stranger"
        ], 
        [
            "newspapers", 
            "books", 
            "flowers", 
            "sweets"
        ], 
        [
            "excitedly", 
            "quietly", 
            "sadly", 
            "angrily"
        ], 
        [
            "surprises", 
            "flowers", 
            "tears", 
            "knees"
        ], 
        [
            "picked", 
            "took", 
            "bought", 
            "gave"
        ], 
        [
            "until", 
            "if", 
            "unless", 
            "because"
        ], 
        [
            "pink", 
            "blue", 
            "red", 
            "yellow"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "A", 
        "D", 
        "C", 
        "B", 
        "C", 
        "A", 
        "D", 
        "B"
    ], 
    "source": "middle1517"
}