{
    "article": "With a determined look on his face, Chicago's Michael McCarthy held on to the banister and climbed to the top of the Willis Tower not long ago. The Tower stands 1,451 feet(442 meters) tall, the  _  building in the US. As he got to the last step, McCarthy  _  fell down, but that didn't stop him. The 14-year-old boy finally finished climbing the 2,109 steps and arrived at the top, where he  _  cheers from many people. \"I just want to show people that  _  a kid with no legs can do it, anyone can do it,\" McCarthy said. McCarthy, who was born without legs, has to wear prosthetic legs and use a stick to walk. But McCarthy has a strong  _  . He believes having a disability shouldn't stop anyone  _  achieving his or her success. He has been in a special school  _  he was four. When he decided to climb the Willis Tower, his teacher, Jeff Kohn, was  _  by his determination and offered to help train him. They  _  more than ten hours practicing climbing stairs and keeping balance with the prosthetics and sticks on the steps every day. \"  _  seems that he never knows how difficult it is.  _  I was so tired that I asked him to rest for a day,\"said Kohn. \"But he said he was still full of energy and wanted more  _  .\" Kohn always walked with McCarthy for the climb. \"I  _  the last 10 floors, he went faster,\" said Kohn. \"He's the most craven sportsman I've ever trained.\" McCarthy said he was  _  of himself and that the tower now holds special meaning. \"When I'm older, I'll  _  to the building and say 'Look at this building I climbed',\" he said.", 
    "options": [
        [
            "largest", 
            "highest", 
            "earliest", 
            "latest"
        ], 
        [
            "seldom", 
            "hardly", 
            "always", 
            "almost"
        ], 
        [
            "enjoyed", 
            "needed", 
            "made", 
            "kept"
        ], 
        [
            "while", 
            "after", 
            "if", 
            "though"
        ], 
        [
            "heart", 
            "hope", 
            "body", 
            "love"
        ], 
        [
            "by", 
            "for", 
            "in", 
            "from"
        ], 
        [
            "as", 
            "since", 
            "until", 
            "before"
        ], 
        [
            "pleased", 
            "beaten", 
            "moved", 
            "asked"
        ], 
        [
            "used", 
            "spent", 
            "took", 
            "wasted"
        ], 
        [
            "Here", 
            "There", 
            "He", 
            "It"
        ], 
        [
            "However", 
            "Sometimes", 
            "Again", 
            "Then"
        ], 
        [
            "friends", 
            "helpers", 
            "time", 
            "exercise"
        ], 
        [
            "tried", 
            "saw", 
            "did", 
            "met"
        ], 
        [
            "thinking", 
            "talking", 
            "worried", 
            "proud"
        ], 
        [
            "point", 
            "go", 
            "turn", 
            "hurry"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "A", 
        "C", 
        "A", 
        "D", 
        "B", 
        "C", 
        "B", 
        "D", 
        "B", 
        "D", 
        "B", 
        "D", 
        "A"
    ], 
    "source": "middle769"
}