{
    "article": "I got out of the train station with my father. A woman came to him and said that her money had been stolen . She asked if he could  _  her some money to go back home. My father gave her what she asked for and told her not to worry about paying it back. I was  _  . How could my father be so silly? Anyone could see that she was telling a lie , staying at the station all day long  _  for money. \"She was lying!\" I said. \"  _  did you give her the money? \" My father looked at me. He was a bit angry. \"And what would you like me to do?\" he said. \"Should I tell her that I am a college professor and I can see through her scam( )?\" I did not  _  his meaning at all, and then he told me something that I have  _  forgotten. \"First, she would not do this  _  she didn't need the money. Second. I made her day, because now she thinks that she's  _  than me. It is more important to  _  than the money, but I don't mind this.\" A week later, we were at the same station, and the same woman came to my father with the same story. \"Not this time,\" my father told her. \"In your business. you should learn to recognize people. Try another  _  on me next week.\"", 
    "options": [
        [
            "borrow", 
            "keep", 
            "lend", 
            "pay"
        ], 
        [
            "excited", 
            "angry", 
            "sad", 
            "surprised"
        ], 
        [
            "asking", 
            "looking", 
            "waiting", 
            "going"
        ], 
        [
            "Where", 
            "When", 
            "Why", 
            "How"
        ], 
        [
            "find", 
            "know", 
            "hear", 
            "believe"
        ], 
        [
            "never", 
            "sometimes", 
            "always", 
            "usually"
        ], 
        [
            "because", 
            "until", 
            "as", 
            "if"
        ], 
        [
            "smarter", 
            "younger", 
            "taller", 
            "better"
        ], 
        [
            "them", 
            "her", 
            "you", 
            "me"
        ], 
        [
            "coat", 
            "story", 
            "station", 
            "man"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "A", 
        "C", 
        "B", 
        "A", 
        "D", 
        "A", 
        "B", 
        "B"
    ], 
    "source": "middle1922"
}