{
    "article": "The friendship between us never fades . Mary Allen was my best friend--like a sister I never _ . We did everything together: piano lessons, movies, swimming, horseback riding, and so on.\nWhen I was 13, my family moved. Mary and I _ in touch through letters, and we saw each other on special days-- like my wedding and Mary's. Soon we were _ with children and moving to new homes, and we wrote less. One day a card that I sent came back, _ \"Address Unknown.\" I had no idea how to find Mary.\nOver the years, I thought of Mary often. I wanted to _ stories of my children and then grandchildren. I needed to share my sadness when my brother and then my mother died. There was an empty place in my heart that only a friend like Mary could _ .\nOne day I was reading a newspaper _ I noticed a picture of a young woman who looked a lot like Mary and whose last name was Wagman-- Mary's married name. \"There must be thousands of   Wagmans,\" I thought, _ I wrote to her anyway.\nShe _ as soon as she got my letter. \"Mrs. Tobin!\" she said excitedly, \"Mary Allen Wagman is my mother.\" Minutes later I heard a voice that I knew very much, even after 40 years. We laughed and cried and asked about each other's _ .\nNow the empty place in my heart is filled, and there is one thing that Mary and I know for sure: We won't lose each other again!", 
    "options": [
        [
            "had", 
            "loved", 
            "left", 
            "met"
        ], 
        [
            "got", 
            "kept", 
            "lost", 
            "fell"
        ], 
        [
            "comfortable", 
            "careful", 
            "easy", 
            "busy"
        ], 
        [
            "told", 
            "writing", 
            "read", 
            "saying"
        ], 
        [
            "tell", 
            "share", 
            "write", 
            "remember"
        ], 
        [
            "stay", 
            "hide", 
            "fill", 
            "live"
        ], 
        [
            "when", 
            "while", 
            "if", 
            "though"
        ], 
        [
            "and", 
            "since", 
            "but", 
            "so"
        ], 
        [
            "called", 
            "laughed", 
            "cried", 
            "shouted"
        ], 
        [
            "future", 
            "progress", 
            "weddings", 
            "lives"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "D", 
        "D", 
        "B", 
        "C", 
        "A", 
        "C", 
        "A", 
        "D"
    ], 
    "source": "middle1566"
}