{
    "article": "A young, rich girl was getting ready  _  bed when she  heard  a low crying coming  _  her window. She went over to the window and leaned out,  Another  girl was standing there. It was a cold winter, but the girl had no quilt , only old newspapers. The rich girl suddenly came up with a helpful idea. She told her to go to her front door. The homeless girl was  _  and she could only manage  to nod  .There she gave her a(an)  _  quilt and a pillow . Watching the true happiness alight upon the other girl's face, she went to bed happily. The next morning a knock came on the door. The rich girl flew to the door. She opened it and found the little girl. Her face looked  _  , and she smiled,. \"I  _  you want these back.\" The rich little girl opened her mouth just saying that she could keep them when another idea appeared in her mind ,\" \"Yes , I want them back. \"The homeless girl said , \"Thank you!\", laid down the things , and turned to leave when the rich girl shouted, \" Wait! Stay right there.\" She saw the rich girl  _  up the stairs and then turn back quickly. She brought a new quilt and a pillow to her. \" Have these,\" she said  _  . These were her own personal belongs( )  made of  silk and down feathers. One day, the rich girl ,  _  was now a rich woman got a call from a lawyer ( ), who told her: Forty years ago , when she was nine years old ,she helped a  _  girl in need. That girl grew into a  _  woman with a husband. She had recently died and left something for her in her will: It was a new pillow with diamonds and a wool quilt with gold thread .", 
    "options": [
        [
            "to", 
            "for", 
            "in", 
            "with"
        ], 
        [
            "through", 
            "across", 
            "cross", 
            "over"
        ], 
        [
            "surprise", 
            "surprising", 
            "surprised", 
            "surprises"
        ], 
        [
            "old", 
            "new", 
            "big", 
            "small"
        ], 
        [
            "sad", 
            "happy", 
            "sadly", 
            "happily"
        ], 
        [
            "tell", 
            "wish", 
            "suppose", 
            "know"
        ], 
        [
            "runs", 
            "running", 
            "ran", 
            "run"
        ], 
        [
            "sad", 
            "sadly", 
            "quiet", 
            "quietly"
        ], 
        [
            "which", 
            "whom", 
            "who", 
            "what"
        ], 
        [
            "little", 
            "few", 
            "rich", 
            "small"
        ], 
        [
            "poor", 
            "rich", 
            "homeless", 
            "good"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "A", 
        "B", 
        "C", 
        "D", 
        "D", 
        "C", 
        "A", 
        "B"
    ], 
    "source": "middle1002"
}