{
    "article": "The story was a true one and still moved me deeply. Thirty years ago,I got to know a _ lady named Rose. She had no kids and lived alone. _ I went to visit her, I always took Rose some coffee and food. One day she said she was inviting me to have hunch.\nWe walked from my work place to a little restaurant on David Street. _ the way, I began to worry: I knew that she had no money, but if I offered  to pay for the lunch,I was afraid I would hurt her.\nThere were many people in the _ and all of them were happy. Rose told me to sit and drink coffee by the window. Then she went to _ in the kitchen. After about 20 minutes, she came out and sat with me. She just paid for one meal and we started to _ the delicious food together. She told me that the restaurant let people work for a meal if they had no money, or would give them a free meal if they were not able to work. To my surprise, she also explained that the workers who were working there were all _ .\nI still  remember the beautiful afternoon I shared with Rose. _ we had a meal together only once, it was paid by Rose's work. The weather was _ and bright, and everyone's smile was warm and bright as well.\nI'm still thinking that life cannot be easy to us, but we can still do _ for our friends and neighbors. The world will never be dark if there is a light in everyone's heart.", 
    "options": [
        [
            "rich", 
            "poor", 
            "strange", 
            "crazy"
        ], 
        [
            "When", 
            "After", 
            "Before", 
            "While"
        ], 
        [
            "By", 
            "In", 
            "On", 
            "Under"
        ], 
        [
            "park", 
            "restaurant", 
            "hotel", 
            "bar"
        ], 
        [
            "sit", 
            "rest", 
            "stay", 
            "work"
        ], 
        [
            "buy", 
            "cook", 
            "enjoy", 
            "drink"
        ], 
        [
            "volunteers", 
            "workers", 
            "doctors", 
            "cooks"
        ], 
        [
            "So", 
            "But", 
            "Though", 
            "Because"
        ], 
        [
            "hotter", 
            "cold", 
            "cool", 
            "warm"
        ], 
        [
            "something", 
            "anything", 
            "nothing", 
            "Everything"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "B", 
        "D", 
        "C", 
        "A", 
        "C", 
        "D", 
        "A"
    ], 
    "source": "middle862"
}