{
    "article": "Mr. White is seventy years old. He has been staying at home since he retired. Last year his wife  _  .He was very sad. He has four children, but they all have their own families. Now he lives in an old house  _  . Sometimes he feels lonely. One day, one of his children bought a parrot for him. It could  _  and usually gave it nice  _  . But one afternoon, a cat ate the parrot. He was very sad and  _  to buy another one. He also bought a strong and beautiful cage for it and began to  _  it to speak. Every morning, as soon as he got up, he said\"Good morning\"  _  the bird. The bird had a look at him but said  _  . He kept on teaching it but the parrot didn't learn anything. He felt sorry for it and lost his patience . One evening his  _  called and told him that his granddaughter was  _  in hospital. He went to see her  at once  . When he got there, she was being operated on and he didn't see her. The doctors asked him to go home. He was so worried about her that he couldn't  fall asleep  the whole night. The next morning, when he was passing by the parrot, he  _  to say \"Good morning\" to the bird. Suddenly he  _  someone saying,\"What happened to you this morning?\" He looked  _  . There was nobody except himself in the room. It was the bird.", 
    "options": [
        [
            "tired", 
            "went", 
            "left", 
            "worked"
        ], 
        [
            "happily", 
            "alone", 
            "angrily", 
            "carefully"
        ], 
        [
            "say", 
            "shout", 
            "tell", 
            "speak"
        ], 
        [
            "house", 
            "clothes", 
            "food", 
            "words"
        ], 
        [
            "asked", 
            "liked", 
            "hoped", 
            "decided"
        ], 
        [
            "want", 
            "teach", 
            "have", 
            "with"
        ], 
        [
            "to", 
            "with", 
            "at", 
            "about"
        ], 
        [
            "anything", 
            "everything", 
            "nothing", 
            "something"
        ], 
        [
            "parrot", 
            "friend", 
            "wife", 
            "son"
        ], 
        [
            "ill", 
            "serious", 
            "bad", 
            "worried"
        ], 
        [
            "forgot", 
            "remembered", 
            "planned", 
            "stopped"
        ], 
        [
            "thought", 
            "knew", 
            "heard", 
            "found"
        ], 
        [
            "up", 
            "around", 
            "down", 
            "over"
        ]
    ], 
    "answers": [
        "B", 
        "B", 
        "D", 
        "C", 
        "D", 
        "B", 
        "A", 
        "C", 
        "D", 
        "A", 
        "A", 
        "C", 
        "B"
    ], 
    "source": "middle2185"
}