{
    "article": "(15,l,15) It Seemed Like a Good Idea at the Time I really only meant it as a joke. I wasn't trying to steal anything. My friend Matthew started bringing his new cell phone to class last week. He was walking around bragging about it to everyone. He was saying, \"My cell phone can download the newest  _  off the internet. \"Then he  _  everyone by downloading a game and starting to play it. The pictures and sound were really  _  .  _  class, he used his cell phone to watch TV. The rest of us didn't have a phone like  _  , so we had to crowd around him. I was just trying to see the screen,  _  there were so many other kids that I could not see it clearly. I was getting really jealous . But then yesterday, he forgot his cell phone at the end of class. He left it right on his desk.  _  noticed it was there except me. I decided to teach him a lesson. I took his phone quietly off the desk, and put it in my own bag. My  _  was to give it back to him the next day. I  _  wanted to see his reaction . Maybe he would stop being such a show-off. But this morning he rushed into class, screaming and yelling . He was very  _  and almost mad. He started accusing different people of  _  his phone, but I had it in my  _  the whole time. He even started fighting with another classmate  _  Matthew was sure that person had taken it. The teacher sent them to the headmaster's office. They  _  got in a lot of trouble. Now I don't know what to  _  ! If I tell him that I took the cell phone, he'll think I stole it. If I don't tell him, then I really did steal it. How did I get into such a trouble?", 
    "options": [
        [
            "ads", 
            "songs", 
            "films", 
            "games"
        ], 
        [
            "gave", 
            "showed", 
            "lent", 
            "asked"
        ], 
        [
            "good", 
            "bad", 
            "noisy", 
            "unclear"
        ], 
        [
            "After", 
            "During", 
            "In", 
            "From"
        ], 
        [
            "hers", 
            "ours", 
            "his", 
            "theirs"
        ], 
        [
            "and", 
            "but", 
            "then", 
            "so"
        ], 
        [
            "Everybody", 
            "Somebody", 
            "Anybody", 
            "Nobody"
        ], 
        [
            "plan", 
            "suggestion", 
            "dream", 
            "action"
        ], 
        [
            "always", 
            "hardly", 
            "just", 
            "sometimes"
        ], 
        [
            "happy", 
            "quiet", 
            "sad", 
            "angry"
        ], 
        [
            "losing", 
            "stealing", 
            "playing", 
            "using"
        ], 
        [
            "desk", 
            "hand", 
            "bag", 
            "pencilcase"
        ], 
        [
            "if", 
            "because", 
            "until", 
            "though"
        ], 
        [
            "both", 
            "all", 
            "neither", 
            "none"
        ], 
        [
            "say", 
            "take", 
            "see", 
            "do"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "A", 
        "A", 
        "C", 
        "B", 
        "D", 
        "A", 
        "C", 
        "D", 
        "B", 
        "C", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "middle2028"
}