{
    "article": "Tony and Maria were twins. When they were seven, their parents gave them a parrot  _  their birthday. Its name was Chico and they kept it in a large cage in the living-room. Chico soon learned to say  a few  words. When the children were at home, Chico's cage door  was opened  and the parrot flew out. Sometimes he landed on Maria's arm, sometimes he landed on Tony's shoulder. One day he became tired and very nearly fell into the fire. Tony put the parrot on his arm. He  pointed to  the fire and said, \"Fire-bad\" over and over again. Chico learned the words, and said \" Fire-bad\" if anyone carried him near the fire. One very  _  night, just before bed-time, Tony put lots of coal on the living-room fire, but he forgot to put the fireguard in front of the fire. Dad then turned off the light and went to bed. Soon  _  in the house was fast asleep. Chico was first  to wake up  He at once saw that a bit of burning coal had fallen out of the fire on the rug. Smoke and flames were rising from the rug. \" Fire-bad! Fire-bad! \" Screamed Chico, as he jumped  _  about his cage. Dad heard this and ran downstairs. Then came Mum, Tony and Maria. Mum and Dad filled the pails with water and threw it on the  _  rug. Tony put the fireguard in front of the fire, Maria spoke quietly to Chico to keep  _  calm. In a few minutes, the fire was put out. But if Chico had not cried out, the house might have been burned. \" Thank you, Chico. You're a hero\". said Tony.", 
    "options": [
        [
            "in", 
            "at", 
            "for", 
            "to"
        ], 
        [
            "cold", 
            "hot", 
            "warm", 
            "cool"
        ], 
        [
            "anybody", 
            "somebody", 
            "everybody", 
            "anyone"
        ], 
        [
            "wild", 
            "wildly", 
            "soft", 
            "softly"
        ], 
        [
            "burning", 
            "burnt", 
            "burn", 
            "burns"
        ], 
        [
            "her", 
            "she", 
            "he", 
            "him"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "C", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "middle2332"
}