{
    "article": "One day something went wrong with a man's bicycle chain . The man could not repair it, so he looked  _  for help. The only house nearby belonged to a woman who had  _  there a few months earlier. The man knocked at the door, but the woman did not answer. The door had clear glass in it, and the man  _  see that the woman was home. He decided to knock again. Finally the woman came to the door. The man immediately explained his  _  . \"I can fix the chain,\" the woman said. Later when the bike was  _  to go, the man said, 'Thanks. I hope I can help you some day.\" \"I never need help,\" the woman said. The following week the man was riding his bike  _  he noticed the woman walking down the street. A strong wind suddenly lifted her hat and sent it into the branches of an old tree. The woman tried to get her hat with a stick, but she failed. She seemed  _  because she clearly was not dressed for tree-climbing. The man hurried over, quickly climbed up to the hat and  _  it into the woman's waiting hands. When she put on her hat, she  _  the man as he climbed back on his bike. 'I think I told you I never need help,\" the woman said, \"I'm glad you didn't  _  me. Thanks.\" Then they both smiled.", 
    "options": [
        [
            "out", 
            "up", 
            "down", 
            "around"
        ], 
        [
            "left", 
            "moved", 
            "waited", 
            "stopped"
        ], 
        [
            "could", 
            "might", 
            "couldn't", 
            "didn't"
        ], 
        [
            "idea", 
            "plan", 
            "problem", 
            "message"
        ], 
        [
            "hard", 
            "ready", 
            "slow", 
            "unable"
        ], 
        [
            "when", 
            "before", 
            "after", 
            "though"
        ], 
        [
            "bored", 
            "relaxed", 
            "frightened", 
            "worried"
        ], 
        [
            "dropped", 
            "put", 
            "collected", 
            "brought"
        ], 
        [
            "saved", 
            "passed", 
            "studied", 
            "chose"
        ], 
        [
            "excuse", 
            "notice", 
            "find", 
            "believe"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "A", 
        "C", 
        "B", 
        "A", 
        "D", 
        "A", 
        "B", 
        "D"
    ], 
    "source": "middle469"
}