{
    "article": "In North America people are always in a hurry. Children have  _  lessons or sports activities after school. Parents often work late and don't get home  _  7 or 8 o'clock at night. More than 50% of the women work at full -time jobs, and many people do part-time work.. It isn't a  _  that the North American families don't have time to eat many meals together. When a family takes the time to eat a meal  _  , often there isn't enough time to  _  the food. That is  _  \"fast food\" is so popular in North America. People spend about 40% of their food dollars  _  fast food. Fast food is food such as pizza, sandwiches, or fried chicken. People usually  _  the food from a restaurant chain such as Pizza Hut, McDonald's, or Kentucky Fried Chicken. Fast food  _  work and time,  _  it is not very healthy. Fast food is  _  in many countries . American fast-food companies now have restaurants all over the world. But not everyone is happy about the  _  of North American fast food. A group of people in Italy want to  _  against the spread of American fast food. They do not want any more fast -food chains to open restaurants in  _  country. Their group is  _  the Slow Food Movement. They plan to fight against the spread of fast food everywhere in the world.", 
    "options": [
        [
            "special", 
            "double", 
            "normal", 
            "modern"
        ], 
        [
            "as", 
            "after", 
            "until", 
            "unless"
        ], 
        [
            "shock", 
            "surprise", 
            "pity", 
            "decision"
        ], 
        [
            "alone", 
            "once", 
            "together", 
            "again"
        ], 
        [
            "cover", 
            "serve", 
            "create", 
            "prepare"
        ], 
        [
            "how", 
            "what", 
            "when", 
            "why"
        ], 
        [
            "about", 
            "on", 
            "in", 
            "at"
        ], 
        [
            "share", 
            "fetch", 
            "buy", 
            "sell"
        ], 
        [
            "gives", 
            "saves", 
            "provides", 
            "wastes"
        ], 
        [
            "but", 
            "and", 
            "or", 
            "so"
        ], 
        [
            "fantastic", 
            "different", 
            "natural", 
            "popular"
        ], 
        [
            "spirit", 
            "situation", 
            "spread", 
            "price"
        ], 
        [
            "turn", 
            "fight", 
            "press", 
            "hold"
        ], 
        [
            "their", 
            "his", 
            "her", 
            "its"
        ], 
        [
            "called", 
            "spelled", 
            "thought", 
            "know"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "B", 
        "C", 
        "D", 
        "D", 
        "B", 
        "C", 
        "B", 
        "A", 
        "D", 
        "C", 
        "B", 
        "A", 
        "A"
    ], 
    "source": "middle295"
}