{
    "article": "Ronny's Book\nRonny looked like every other kid in the first-grade classroom where I volunteered as the Reading Mom. However, Ronny was different from his classmates in other ways. He had a speech problem so he couldn't _ like other kids in his grade.\nI worked with all the students in Ronny's class one by one to improve their reading skills. On the days when it was Ronny's _ , I'd give him a silent smile, and he'd fly out of his chair. He sat very close to me and opened the book as if he was opening a treasure nobody had ever seen.\nI watched his fingers move slowly under each letter as he struggled   to read out. Every time he _ to read a word with a strange pronunciation, the biggest smile would spread across his face and his eyes would shine with _ . It broke my heart each and every time.\nA few weeks _ the school year ended, I held an awards ceremony  . I _ Ronny with a book -- one of those Little Golden Books that only cost $5. Tears  ran down his face as he held the book close to him and went _ to his seat. I stayed with the class for the rest of the day. Ronny never let go of   the _ , not once. It never left his hands.\nA few days later, I returned to the school to visit. I _ Ronny on a chair near the playground, the book open in his lap. His teacher said, \" He hasn't put that book down since you gave it to him. Do you know that's his _ book he's ever actually owned?\"\nKeeping back my tears, I walked towards Ronny, placed my hand on his shoulder and asked, \"Will you read me your book, Ronny?\" And then, for the next few minutes, he read to me more _ than I'd ever thought possible from him. The pages were already dog-eared  , like the book had been read thousands of _ already. When he finished reading, Ronny closed his book and said with great satisfaction, \" _ book!\"\nWhat a powerful contribution the writer of that Little Golden Book had made in the life of a disadvantaged child. At that moment, I knew I would get _ about my own writing and do what that writer had done, and probably still does -- care enough to write a story that changes a child's life, care enough to make a difference.", 
    "options": [
        [
            "read", 
            "copy", 
            "write", 
            "listen"
        ], 
        [
            "team", 
            "term", 
            "turn", 
            "tour"
        ], 
        [
            "forgot", 
            "decided", 
            "refused", 
            "managed"
        ], 
        [
            "fear", 
            "pride", 
            "promise", 
            "silence"
        ], 
        [
            "after", 
            "before", 
            "since", 
            "when"
        ], 
        [
            "covered", 
            "shared", 
            "presented", 
            "compared"
        ], 
        [
            "out", 
            "up", 
            "away", 
            "back"
        ], 
        [
            "hand", 
            "class", 
            "book", 
            "chair"
        ], 
        [
            "followed", 
            "noticed", 
            "heard", 
            "realized"
        ], 
        [
            "first", 
            "second", 
            "third", 
            "fourth"
        ], 
        [
            "coldly", 
            "slowly", 
            "clearly", 
            "quietly"
        ], 
        [
            "mistakes", 
            "sales", 
            "chances", 
            "times"
        ], 
        [
            "Small", 
            "Good", 
            "New", 
            "old"
        ], 
        [
            "serious", 
            "nervous", 
            "worried", 
            "surprised"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "D", 
        "B", 
        "B", 
        "C", 
        "D", 
        "C", 
        "B", 
        "A", 
        "C", 
        "D", 
        "B", 
        "A"
    ], 
    "source": "middle1320"
}