{
    "article": "It has been over eleven years now. It was a snowy afternoon. Laura, our tenyearold daughter, sat quietly, and was busy with her work. Suddenly, she asked how to spell a name of someone in our  _  , and then wrote the notes one by one. Next, she  _  some flowers with grass, a red sun, and the blue sky on them. That evening. I noticed a \"mailbox\" on the doors to each of our bedrooms. There was one for Steve, one for Tom. She hadn't forgotten Sam or baby Paul. My heart felt  _  when I saw that Reed, her dad, and I also  _  one. For the next few weeks, we received notes that showed  _  love for each of us. When Steve lost a baseball game, there was a note telling him she thought he was the best  _  player in the world. After I had a busy day, there was a note thanking me for my hard work, with a smiling face on it. In baby Paul's notes, there were lots of colorful  _  including flowers with happy faces. \"He can't  _  yet,\" she said. \"But he can look at the pictures.\" However, one night, I noticed the mailbox that Laura had made for herself. Suddenly, I  _  that our little angel's mailbox had been  _  but the others had enjoyed her love notes. My eyes were filled with tears. \"I'll take care of it,\" Reed said. And in the following weeks, her  _  wrote the sweetest of love notes to this little girl, our daughter.  _  this little girl is grown now, driving to the college every day, some things about her have  _  changed. One afternoon only about a week ago, I found a love note on my bed. \"  Thanks for  always being there for me. Mom,\" it read, \"I'm glad that we're the best of friends.\" I always remember the nice child whose smile and  _  have brought me thousands of hours of joy during these years. There are angels among us. I know, I live with one.", 
    "options": [
        [
            "class", 
            "office", 
            "family", 
            "company"
        ], 
        [
            "drew", 
            "bought", 
            "picked", 
            "planted"
        ], 
        [
            "warm", 
            "worried", 
            "sad", 
            "afraid"
        ], 
        [
            "gave", 
            "borrowed", 
            "had", 
            "pushed"
        ], 
        [
            "his", 
            "her", 
            "our", 
            "my"
        ], 
        [
            "basketball", 
            "football", 
            "volleyball", 
            "baseball"
        ], 
        [
            "pictures", 
            "books", 
            "clothes", 
            "toys"
        ], 
        [
            "write", 
            "read", 
            "speak", 
            "sing"
        ], 
        [
            "laughed", 
            "said", 
            "realized", 
            "told"
        ], 
        [
            "empty", 
            "full", 
            "beautiful", 
            "dirty"
        ], 
        [
            "sister", 
            "boy", 
            "mom", 
            "dad"
        ], 
        [
            "And", 
            "Though", 
            "So", 
            "But"
        ], 
        [
            "never", 
            "always", 
            "often", 
            "usually"
        ], 
        [
            "voice", 
            "study", 
            "reason", 
            "love"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "A", 
        "C", 
        "B", 
        "D", 
        "A", 
        "B", 
        "C", 
        "A", 
        "D", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "middle1347"
}