{
    "article": "Driving in China\nI have been driving cars since I reached the pedals . In Canada you must be 16 to get a driver's license. I _ myself to be a very good driver.\nI visited China 20 years ago. I with my wife was in Shanghai to give a paper at a conference. We were amazed at the number of bicycles on the roads and the few cars. In Canada almost each family has one car, but it was _ that most Chinese depended on bicycles.\nI have been to Shanghai and to other Chinese cities many times since then and have watched the fast changes on the roads. There are far fewer bicycles now but _ cars. The roads are crowded, the government has been forced to limit the number of days some cars can be driven and the traffic jams are almost constant  . So are the accidents. On a recent visit I saw four or five\n _ within a two-week period.\nTo get a driver's license in Canada, you must drive, with an examiner, on real roads and in real traffic. However, in China you learn on a closed course, _ real traffic, get a license and only then are able to drive under real roads.\nDriving in Canada and driving in China _ two different experiences. In Canada there are traffic jams but they aren't so bad. We have more traffic lights; we obey them and drivers are usually\n _ , allowing other cars to cut in front of them knowing it won't make much difference. In China, if you stop to let another car cut in front of you will probably be there for a long time because once one car gets in, dozens of _ will follow.\nI would rather take the bus than drive my car in downtown Shanghai and Beijing. Because it's _ and stronger than most things that might run into it.", 
    "options": [
        [
            "regard", 
            "wonder", 
            "consider", 
            "think"
        ], 
        [
            "impossible", 
            "clear", 
            "similar", 
            "useless"
        ], 
        [
            "fewer", 
            "more", 
            "less", 
            "many"
        ], 
        [
            "cars", 
            "bicycles", 
            "accidents", 
            "people"
        ], 
        [
            "in", 
            "without", 
            "with", 
            "under"
        ], 
        [
            "be", 
            "is", 
            "am", 
            "are"
        ], 
        [
            "polite", 
            "impolite", 
            "angry", 
            "unhappy"
        ], 
        [
            "ones", 
            "another", 
            "other", 
            "others"
        ], 
        [
            "smaller", 
            "bigger", 
            "brighter", 
            "lighter"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "B", 
        "C", 
        "B", 
        "D", 
        "A", 
        "D", 
        "B"
    ], 
    "source": "middle1214"
}