{
    "article": "Last summer a snowstorm hit a small town nearby. I saw, in the local newspaper, a picture of a young woman, a little boy and a younger _ standing in front of a totally destroyed  house, eyes wide open with fear. I noticed their clothing _ closely matched ours. This would be a good chance to teach my children to help those unlucky ones.\nI _ their situation to my seven-year-old twins, Brad and Martin, and encouraged the boys to donate some of their less favorite toys. My little daughter, Meghan, _ quietly when the boys piled up the old toys. After a while, Meghan walked up with Lucy, her much-loved doll, hugged tightly  in her arms. She put her round little _ into Lucy's, giving her a final kiss, and then put her down _ on top of the others. \"Oh, honey\", I said, \"you don't have to give Lucy. You love her so much.\"\nMeghan nodded, trying to hold back her tears . \"Lucy makes me happy, Mummy. Maybe she'll make that little girl happy, too.\"\nThe boys watched in surprise as their baby sister put Lucy in the _ . When I stared  at Meghan, thinking over my donation, they went, without a word, to their room and both _ with their loved items. Martin thought for a short while, then looked over at Meghan and put his model car next to Lucy. Amazed, I took my old jacket out of the box, and put in it a new one I had bought the week before, hoping the young woman would _ it as much.\nAnyone can give away what they no longer require, but true generosity is giving what you _ . I, who had meant to teach, was taught.", 
    "options": [
        [
            "man", 
            "woman", 
            "boy", 
            "girl"
        ], 
        [
            "styles", 
            "colors", 
            "sizes", 
            "prices"
        ], 
        [
            "announced", 
            "explained", 
            "showed", 
            "translated"
        ], 
        [
            "watched", 
            "behaved", 
            "counted", 
            "waited"
        ], 
        [
            "eyes", 
            "ears", 
            "face", 
            "head"
        ], 
        [
            "gently", 
            "quickly", 
            "happily", 
            "gratefully"
        ], 
        [
            "car", 
            "box", 
            "room", 
            "picture"
        ], 
        [
            "played", 
            "dealt", 
            "returned", 
            "disappeared"
        ], 
        [
            "wash", 
            "keep", 
            "wear", 
            "love"
        ], 
        [
            "buy", 
            "need", 
            "mean", 
            "dislike"
        ]
    ], 
    "answers": [
        "D", 
        "C", 
        "B", 
        "A", 
        "C", 
        "A", 
        "B", 
        "C", 
        "D", 
        "B"
    ], 
    "source": "middle679"
}