{
    "article": "Dear Dad, I'm writing to you because it's not easy to talk about it. I still  _  clearly how my uncle died two years ago. In fact, I seriously want to ask you to stop smoking. I've looked up a lot of information about smoking and I found out something  _  . You know that smoking is bad for your  _  and can cause cancer. I've learnt that it causes many other  _  too. Do you know that over ten thousand people die from smoking every year in Britain? When mum asks you to smoke  _  , you think she's angry. Well, it's true that she doesn't like the  _  of smoke in the house. When you smoke, it's also  _  for mum and me. In other words, when we  _  in your smoke, it's like we're smoking ourselves.  As a result  , we can also get disease. Doctors are finding that more and more  _  are falling ill because of the others' smoking. I know that it's very  _  to stop smoking, but you must give it up. Please see the doctor and ask him  _  help. We will do anything we can to help you. You must try to  _  your own life. We don't want to  _  you because you are so important to us.  _  you, who can help me with my maths homework or mend my bike? Please don't smoke! Your daughter, Meimei", 
    "options": [
        [
            "remember", 
            "forget", 
            "think", 
            "feel"
        ], 
        [
            "interesting", 
            "terrible", 
            "boring", 
            "strange"
        ], 
        [
            "health", 
            "study", 
            "work", 
            "mind"
        ], 
        [
            "things", 
            "mistakes", 
            "feelings", 
            "illnesses"
        ], 
        [
            "nowhere", 
            "anywhere", 
            "outside", 
            "inside"
        ], 
        [
            "color", 
            "smell", 
            "shape", 
            "taste"
        ], 
        [
            "useless", 
            "useful", 
            "bad", 
            "good"
        ], 
        [
            "move", 
            "rest", 
            "arrive", 
            "breathe"
        ], 
        [
            "doctors", 
            "nurses", 
            "non-smokers", 
            "smokers"
        ], 
        [
            "difficult", 
            "easy", 
            "important", 
            "dangerous"
        ], 
        [
            "on", 
            "from", 
            "of", 
            "for"
        ], 
        [
            "save", 
            "waste", 
            "refuse", 
            "accept"
        ], 
        [
            "trouble", 
            "lose", 
            "hurt", 
            "keep"
        ], 
        [
            "With", 
            "Without", 
            "Behind", 
            "By"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "A", 
        "D", 
        "C", 
        "B", 
        "C", 
        "D", 
        "C", 
        "A", 
        "D", 
        "A", 
        "B", 
        "B"
    ], 
    "source": "middle1474"
}