{
    "article": "I know my brother better than anyone else in the world. Since the moment of his birth,I've been part of his life. I had spent seven  _  years in the world with the attention of those around me. But when Rohan was born, life  _ . Suddenly I had to  _  my toys and there were no more bedtime stories or my own choice of food.\nFinally, I felt my  _  at my mother. The poor baby had no idea what had made me so unhappy. Maybe he found me  _ , the only person in this house who did not like him. Whatever the reason was, he loved  _  me around. However, I seldom talked to him and  _  asked him to leave me alone.\nThen all that changes. I hardly remember everything of that day six years ago,  _  I do remember that I was feeling very angry. Somehow my feet led me to my brother's bed. My hand, completely  _  from my mind, reached through the bars  . At once, he reached his small hand and softly touched  _ . And that was allI needed. Through all the unhappiness of the day, that one moment changed  _ .How could I hate someone who made me feel so important? For the  _  time, I saw my brother, not through the eyes of a child who was no longer favored  , but through the eyes of a  _ .To this day, I can't imagine life  _  my brother. It is unbelievable how much I have  _  about life from a seven-year-old boy. Above all, Rohan has taught me that one shouldn't care only for himself.", 
    "options": [
        [
            "happy", 
            "hard", 
            "lonely", 
            "busy"
        ], 
        [
            "began", 
            "continued", 
            "changed", 
            "saved"
        ], 
        [
            "collect", 
            "choose", 
            "hide", 
            "share"
        ], 
        [
            "fun", 
            "anger", 
            "fear", 
            "worry"
        ], 
        [
            "friendly", 
            "quiet", 
            "strange", 
            "outgoing"
        ], 
        [
            "showing", 
            "carrying", 
            "meeting", 
            "following"
        ], 
        [
            "always", 
            "already", 
            "hardly", 
            "almost"
        ], 
        [
            "but", 
            "so", 
            "or", 
            "for"
        ], 
        [
            "far", 
            "sick", 
            "different", 
            "free"
        ], 
        [
            "one", 
            "both", 
            "mine", 
            "them"
        ], 
        [
            "nothing", 
            "everything", 
            "something", 
            "anything"
        ], 
        [
            "first", 
            "second", 
            "last", 
            "next"
        ], 
        [
            "student", 
            "parent", 
            "teacher", 
            "sister"
        ], 
        [
            "except", 
            "besides", 
            "without", 
            "through"
        ], 
        [
            "cared", 
            "learned", 
            "talked", 
            "heard"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "D", 
        "B", 
        "C", 
        "D", 
        "A", 
        "A", 
        "D", 
        "C", 
        "B", 
        "A", 
        "D", 
        "C", 
        "B"
    ], 
    "source": "middle28"
}