{
    "article": "Every scientist has a childhood dream. A scientist in China once had a(n)  _  . He wished to grow a new type of rice which could produce a lot. This person is Yuan Longping  _  was born in 1930. He graduated from the Southwest Agricultural University in 1953. Yuan Longping came up with an idea for a hybrid rice in the 1960s. Since then, he has devoted himself to the research and development of new varieties . In 1973, together with other people, he  _  in the development of hybrid rice. This made China be a worldwide leader in rice production. For this, he was called Father of Hybrid Rice. In 1980, the technology for hybrid rice was  _  to the United States.  Because of  Professor Yuan's hard work, China now produces enough rice to  _  her people every year. In his spare time, he loves playing  _  violin and listening to music. Every night, he reads  _  half an hour before he goes to sleep. He likes swimming, too. It is said that Professor Yuan is one of the  richest  people in China. And he cares about  _  but his research. Now Professor Yuan is working on developing super hybrid rice. He goes to the fields twice a day.", 
    "options": [
        [
            "dream", 
            "idea", 
            "thought", 
            "meaning"
        ], 
        [
            "where", 
            "whom", 
            "which", 
            "who"
        ], 
        [
            "success", 
            "succeeded", 
            "successfully", 
            "successful"
        ], 
        [
            "given", 
            "grown", 
            "showed", 
            "introduced"
        ], 
        [
            "offer", 
            "feed", 
            "send", 
            "provide"
        ], 
        [
            "an", 
            "/", 
            "a", 
            "the"
        ], 
        [
            "on", 
            "in", 
            "for", 
            "to"
        ], 
        [
            "everything", 
            "anything", 
            "nothing", 
            "something"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "B", 
        "D", 
        "B", 
        "D", 
        "C", 
        "C"
    ], 
    "source": "middle1723"
}