{
    "article": "Once, a circle lost a piece of its own. The circle wanted to be whole, so it went around, looking for its  _  piece. But because it was not complete, it could only roll very slowly. It enjoyed the flowers and the sunshine  _  the way. It talked with worms. It found lots of different pieces, but  none  of them fit. So it left them all by the side of the road and kept on  looking  for the lost piece. Then one day the circle found a piece that fit  _  . The circle put the piece into  _  . It could be whole with nothing lost. It was so happy and began to roll. As it was a perfect circle, it could roll very fast, too fast to see flowers or talk to worms. It realized how different the world was when it rolled so quickly. It felt so sad  _  it stopped, left its found piece by the side of the road and rolled very slowly. Sometimes we are perfect when we lose something. A man who  _  everything is poor in some ways. He will never have hopes, dreams or something  _  . He will never know someone loves him or someone is giving him something he has always wanted or never had. We couldn't be perfect. But we must be brave enough to love, strong enough to forgive, kind enough to share  _  with others and clever enough to know there is enough love around us and then we can always have a wonderful time in our life.", 
    "options": [
        [
            "miss", 
            "lose", 
            "missing", 
            "losing"
        ], 
        [
            "at", 
            "of", 
            "in", 
            "along"
        ], 
        [
            "perfectly", 
            "perfect", 
            "part", 
            "partly"
        ], 
        [
            "it", 
            "itself", 
            "them", 
            "themselves"
        ], 
        [
            "which", 
            "whether", 
            "that", 
            "what"
        ], 
        [
            "own", 
            "has", 
            "owned", 
            "have"
        ], 
        [
            "bad", 
            "worse", 
            "good", 
            "better"
        ], 
        [
            "kindness", 
            "sadness", 
            "happiness", 
            "illness"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "A", 
        "B", 
        "C", 
        "B", 
        "D", 
        "C"
    ], 
    "source": "middle287"
}