{
    "article": "Lucy lives in Shanghai with her parents, Mr and Mrs King. Mr King  _ in a factory . Mrs. King is a teacher in our schoo1. She teaches _ English. All of us are _ to her and she loves us, too. Lucy likes eating Chinese food very much.  _ Sunday morning she usually goes to the shop and helps their mother _ the shopping. They often buy a lot of things.\nBut Lucy's brother lives in a town in France. It is a wonderful but busy town. People there are very kind. On the old streets, there are many _ . You can eat a lot of delicious food there. He is a _ in a restaurant. He makes Chinese food for it. It is very _ to go shopping because there are many supermarkets and shops. There is a big cinema near his home, _ he can see great films there. People in the town will _ feel bored because there are a lot of things to do. Also, it is easy for them to take a bus to get to the city centre from their town.\nHowever , I like the nature   _ . So I would like to live in the country . Here, I can hear the birds sing every day. Sometimes rabbits run into my garden. I think it's very _ to be in this kind of beautiful place.\n Welcome to my home! You will feel very happy here.", 
    "options": [
        [
            "studies", 
            "plays", 
            "works", 
            "shops"
        ], 
        [
            "our", 
            "us", 
            "we", 
            "ours"
        ], 
        [
            "warm", 
            "bright", 
            "friends", 
            "friendly"
        ], 
        [
            "/", 
            "On", 
            "At", 
            "By"
        ], 
        [
            "carry", 
            "take", 
            "go", 
            "do"
        ], 
        [
            "hospitals", 
            "restaurants", 
            "museums", 
            "schools"
        ], 
        [
            "postman", 
            "worker", 
            "cooker", 
            "cook"
        ], 
        [
            "busy", 
            "hard", 
            "easy", 
            "heavy"
        ], 
        [
            "after", 
            "so", 
            "if", 
            "but"
        ], 
        [
            "always", 
            "usually", 
            "often", 
            "never"
        ], 
        [
            "good", 
            "best", 
            "well", 
            "very"
        ], 
        [
            "difficult", 
            "close", 
            "bad", 
            "comfortable"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "D", 
        "B", 
        "D", 
        "B", 
        "D", 
        "C", 
        "B", 
        "D", 
        "B", 
        "D"
    ], 
    "source": "middle908"
}