{
    "article": "Once there was a rich man in a village. He never gave anything to help  others  . The villagers didn't like him. One day he said to them, \"I know you don't like me. I will give everything I have  _  you when I die. Then everyone will be happy.\" But nobody  believed  him. The rich man couldn't understand why they didn't believe him. One day he went for a walk by a lake. Under a big tree he happened to hear a pig and a cow  _  The pig  _  to the cow, \"Why everyone likes you and nobody likes me? After I die. I provide people with pork, ham, etc. I give three or four things to them. But you give  only  one thing--milk. Why do people like you all the time and not me?\" The cow said, \"Look, I give them milk while I'm  _  . They see that I'm generous with what I have. But you don't give them anything before you die. You give them ham, pork and so on only after you're dead. People don't believe in the  _  ; they believe in the present. If you give something  _  you are living, people will like you. It is quite simple.\" From that moment on, the rich man did his  _  to help the poor.", 
    "options": [
        [
            "for", 
            "with", 
            "to", 
            "after"
        ], 
        [
            "fighting", 
            "talking", 
            "shouting", 
            "joking"
        ], 
        [
            "sang", 
            "told", 
            "asked", 
            "said"
        ], 
        [
            "lives", 
            "live", 
            "lived", 
            "alive"
        ], 
        [
            "future", 
            "past", 
            "present", 
            "now"
        ], 
        [
            "while", 
            "where", 
            "what", 
            "how"
        ], 
        [
            "good", 
            "better", 
            "best", 
            "well"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "D", 
        "D", 
        "A", 
        "A", 
        "C"
    ], 
    "source": "middle600"
}