{
    "article": "One day I was putting some donated tents into my truck when something sharp  got into my left eye. Immediately I fell down and knew it was _ \nI was taken to a _ and the doctors there operated on me but couldn't _ my eye. When they told me the news, I really wanted to die. Everything seemed _ in front of me.\nEven after I got my man-made eye, I still felt very sad. To make things worse, I lost my _ as a transportation officer because of worries about my driving ability.\nBut one morning, I woke up and the _ was on, and there was a 16-year-old girl. She had been seriously burned on her legs and was learning to _ again. She wore a big smile, saying, \"You can never give up. \" It seemed that she said this specially to _ . At that moment, I felt _ and thought,\" This is just an eye. Get over it.\"\nSoon I really got over it and _ myself. It's almost 12 years since my accident, and now I can do anything that I used to do. No one can even _ I have a man-made eye, because the new one is so good. And _ I haven't got my old job back, I've got my driving license again.\nSo be cheerful in face of any bad _ . You will never truly know yourself until you have been tested by a very difficult situation. No matter how _ your problem is, just keep up. Now I have only one eye, but I see things a lot more _", 
    "options": [
        [
            "safe", 
            "bad", 
            "true", 
            "careful"
        ], 
        [
            "store", 
            "school", 
            "hotel", 
            "hospital"
        ], 
        [
            "test", 
            "open", 
            "save", 
            "cover"
        ], 
        [
            "dark", 
            "natural", 
            "wonderful", 
            "meaningful"
        ], 
        [
            "truck", 
            "tent", 
            "job", 
            "license"
        ], 
        [
            "light", 
            "radio", 
            "recorder", 
            "TV"
        ], 
        [
            "sing", 
            "walk", 
            "write", 
            "read"
        ], 
        [
            "doctors", 
            "drivers", 
            "me", 
            "herself"
        ], 
        [
            "encouraged", 
            "frightened", 
            "tired", 
            "pleased"
        ], 
        [
            "changed", 
            "hurt", 
            "taught", 
            "helped"
        ], 
        [
            "describe", 
            "find", 
            "explain", 
            "promise"
        ], 
        [
            "because", 
            "after", 
            "though", 
            "unless"
        ], 
        [
            "behaviour", 
            "luck", 
            "influence", 
            "habit"
        ], 
        [
            "serious", 
            "simple", 
            "strange", 
            "silly"
        ], 
        [
            "difficultly", 
            "carefully", 
            "differently", 
            "clearly"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "C", 
        "A", 
        "C", 
        "D", 
        "B", 
        "C", 
        "A", 
        "A", 
        "B", 
        "C", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "middle33"
}