{
    "article": "People use their mouths for many things. They eat, talk, shout,  _  and smile. So there are many expressions about mouth. For example, if you say  _  things about a person, the person will be unhappy and say \"Do not bad mouth me.\" Sometimes, people say something to a friend or family member that later they regret  _  they hurt that person's feelings. The speaker might say: \" I really put my foot in my mouth this time.\" If this happens, the speaker might feel down in the mouth. Information is  _  spread through the mouth. This is general communication  _  people, like friends talking to each other. \"How did you hear about that movie?\" Someone might ask. The  _  may be : \"Oh, by word of mouth.\" A more official way of getting information is through a company or government mouthpiece. Sometimes, a person has a bad or unpleasant  _  with another person. He might say: \"It left a bad taste in my mouth.\" Or a person might have a very  _  experience, like being chased by an angry dog. He might say: \"I had my  _  in my mouth.\" Some people have lots of money because they were  _  into a very rich family. You might say such a person \"was born with a silver spoon in his mouth. \" And this rich person is the opposite of a person who lives from hand to mouth.", 
    "options": [
        [
            "dance", 
            "sing", 
            "walk", 
            "think"
        ], 
        [
            "beautiful", 
            "nervous", 
            "bad", 
            "crazy"
        ], 
        [
            "because", 
            "so", 
            "and", 
            "until"
        ], 
        [
            "never", 
            "seldom", 
            "sometimes", 
            "often"
        ], 
        [
            "with", 
            "between", 
            "during", 
            "on"
        ], 
        [
            "letter", 
            "answer", 
            "key", 
            "report"
        ], 
        [
            "experiment", 
            "expression", 
            "experience", 
            "explanation"
        ], 
        [
            "frightening", 
            "surprising", 
            "pleasing", 
            "exciting"
        ], 
        [
            "eye", 
            "tongue", 
            "finger", 
            "heart"
        ], 
        [
            "taken", 
            "brought", 
            "grown", 
            "born"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "D", 
        "B", 
        "B", 
        "C", 
        "A", 
        "D", 
        "D"
    ], 
    "source": "middle676"
}