{
    "article": "When I was nine years old, I used to go to the post office with my mother, sending greeting cards to my aunt in Singapore. To me, these trips were really  _  memories. And receiving mail through a mailbox outside our gate was just as exciting. My small hands could  _  get the mail without using a key! I always couldn't wait to see how much I was  _  . Oh, a letter! From Singapore! I would run back home and show it to my  _  . When there was a letter for me, I wouldn't run--I would open it right there. After my family moved back to Singapore, I  _  going to the post office. Years later, my company sent me to Shanghai, and the post office found me again. Two years ago I celebrated my  _  with five friends on top of the mountain in Longsheng, China. At sunrise we  _  up to a beautiful view from the mountain top. Later in the afternoon, as we were going  _  the mountain and returning from the sunrise viewing place, a  _  shop caught our attention. It only sold noodles, coffee and had a China  _  sign. We asked the owner if she could really send mail. She happily said yes. It seemed hard to believe,  _  we were at the highest top of the mountain. I picked one postcard out and asked my friends to write  _  a birthday note. We bought a stamp, wrote some notes and gave the shop owner the postcard. Three weeks later, I arrived home and  _  my mailbox: Hello, postcard! I broke into a big smile. That birthday postcard attracted me again to the post office and all its delights. I had  _  the post office all these years. Today I  _  send postcards to friends. And every time I am at the post office buying stamps, I cannot help but smile--how one postcard will make its way across the world and brighten up someone's day.", 
    "options": [
        [
            "bad", 
            "poor", 
            "good", 
            "short"
        ], 
        [
            "easily", 
            "simply", 
            "hardly", 
            "specially"
        ], 
        [
            "weighing", 
            "getting", 
            "selecting", 
            "accepting"
        ], 
        [
            "friend", 
            "aunt", 
            "mother", 
            "owner"
        ], 
        [
            "enjoyed", 
            "stopped", 
            "hated", 
            "considered"
        ], 
        [
            "wedding", 
            "return", 
            "success", 
            "birthday"
        ], 
        [
            "broke", 
            "woke", 
            "grew", 
            "stood"
        ], 
        [
            "around", 
            "over", 
            "up", 
            "down"
        ], 
        [
            "cold", 
            "dirty", 
            "small", 
            "modern"
        ], 
        [
            "Traffic", 
            "Life", 
            "Police", 
            "Post"
        ], 
        [
            "because", 
            "though", 
            "while", 
            "when"
        ], 
        [
            "him", 
            "me", 
            "her", 
            "them"
        ], 
        [
            "bought", 
            "repaired", 
            "painted", 
            "opened"
        ], 
        [
            "missed", 
            "influenced", 
            "studied", 
            "visited"
        ], 
        [
            "just", 
            "seldom", 
            "still", 
            "never"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "B", 
        "C", 
        "B", 
        "D", 
        "B", 
        "D", 
        "C", 
        "D", 
        "A", 
        "B", 
        "D", 
        "A", 
        "C"
    ], 
    "source": "middle1088"
}