{
    "article": "Rudi Matt lived in a small village in the Swiss Alps in 1865. What he wanted most in the world was to climb the highest peak   in the Alps. Rudi's mother and his uncle, Franz, a mountain guide, wanted him to stop _ and start working in a hotel. Rudi would not give up his dream and secretly got in touch with an English mountain climber _ was planning to climb the highest peak.\nFranz was very angry when he found out what Rudi had done, but he finally agreed to let Rudi go if he went climbing, _ . Franz also didn't want to see Emil Saxo, a guide from another village, got to the top _ him.\nRudi turned out to be a very good climber, _ as they got close to the top, the Englishman got sick and could go no farther. Franz stayed behind to take care of him, but Saxo continued, wishing to be the _ to the top. Rudi went after Saxo, hoping to beat him to the top. When they met, Saxo fought with Rudi and fell down by accident. Saxo was helpless and hurt. Rudi must _ whether to carry Saxo back down to safety or to continue alone to the top.\nHe decided Saxo's life was more _ than his dream and helped him down. During that time, the Englishman and Franz _ the climb, and finally they reached the top. Later, when they returned to the village, they told people that Rudi was the real conqueror   of the mountain.", 
    "options": [
        [
            "learning", 
            "playing", 
            "climbing", 
            "talking"
        ], 
        [
            "what", 
            "which", 
            "whom", 
            "who"
        ], 
        [
            "again", 
            "too", 
            "once", 
            "instead"
        ], 
        [
            "after", 
            "behind", 
            "before", 
            "over"
        ], 
        [
            "but", 
            "so", 
            "or", 
            "for"
        ], 
        [
            "first", 
            "second", 
            "third", 
            "last"
        ], 
        [
            "wonder", 
            "remember", 
            "ask", 
            "decide"
        ], 
        [
            "important", 
            "successful", 
            "popular", 
            "interesting"
        ], 
        [
            "stopped", 
            "continued", 
            "enjoyed", 
            "finished"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "B", 
        "C", 
        "A", 
        "A", 
        "D", 
        "A", 
        "B"
    ], 
    "source": "middle133"
}