{
    "article": "\"Happy Birthday!\" David awoke to the voice of his mother. \"It's time to get up and drive out to  _  grandfather's farm.\" \"Why do we have to go there? And how long is the drive?\" he asked with a sad look in his eyes. \"About two hours...and don't worry, we' ll bring your birthday  _  with us.\" His mother walked away and left him to get ready. In less than an hour, David and his parents were on their way.  _  of what the colorful birthday packages had inside filled his head. He was  _  that one had the baseball glove he wanted, while others would have amazing things that he had dreamed about. Thinking of his grandfather, David  _  what his birthday present from him might be. \"Since my grandfather has a large farm, he must have a lot of money, and the bigger his present for me will be,\" David said to himself. Finally they  _  . Hugging his grandfather, David excitedly shouted, \"I've missed you! You know, today's my birthday. Did you get me a present?\" \"I have missed you, too. And I have a very  _  present for you.\" Placing a small box in David's hand, he quietly said, \"This is a very important gift. I hope you will treasure it as  _  as I have.\" David looked at the small box, thinking money or jewels might be inside.... When he opened the box, David was  _  to see only a stone. It was a very beautiful stone, but was it valuable? Grandfather spoke more slowly than before, \"David, when your grandma and I were first married, we had very little money. She wanted to give me something special for my birthday, so she found this beautiful rock and polished it day and night  _  it shined. It was the greatest gift I ever  _  because it came from your grandma's heart. Now, I want you to have it because it comes from my heart.\" David held the stone in his hand and  _  the love of his grandfather. \"This is a wonderful gift...thank you, Grandfather.\" He knew he had received the best gift ever.", 
    "options": [
        [
            "my", 
            "your", 
            "her", 
            "his"
        ], 
        [
            "cakes", 
            "cards", 
            "CDs", 
            "gifts"
        ], 
        [
            "Thoughts", 
            "Opinions", 
            "Facts", 
            "Results"
        ], 
        [
            "certain", 
            "proud", 
            "sorry", 
            "afraid"
        ], 
        [
            "worried", 
            "expected", 
            "wondered", 
            "considered"
        ], 
        [
            "moved", 
            "arrived", 
            "stopped", 
            "finished"
        ], 
        [
            "expensive", 
            "special", 
            "interesting", 
            "perfect"
        ], 
        [
            "soon", 
            "hard", 
            "much", 
            "far"
        ], 
        [
            "excited", 
            "pleased", 
            "satisfied", 
            "surprised"
        ], 
        [
            "until", 
            "although", 
            "since", 
            "unless"
        ], 
        [
            "shared", 
            "made", 
            "received", 
            "brought"
        ], 
        [
            "showed", 
            "felt", 
            "passed", 
            "got"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "A", 
        "A", 
        "C", 
        "B", 
        "B", 
        "C", 
        "D", 
        "A", 
        "C", 
        "B"
    ], 
    "source": "middle1769"
}