{
    "article": "One day, I am reading a newspaper when my wife calls me in the kitchen, \"Will you  _  here and make your daughter eat her food?\" I throw the  _  away and run to my 8-year-old daughter, Millie. In front of her is a bowl of rice. She says to me: \"Dad, I want to do a special thing.  _  I eat all the rice, will you let me do it?\" \"OK.\" I say. \"Dad, I want to cut all my hair from my  _  this Sunday.\" She says. I feel a little surprised . \"Millie, why don't you ask for something else? We will be  _  when we see your cleanshaven head.\" \"Dad, you say you will let me  _  it!\" Millie cries. On Monday morning, I  _  her to school. I watch my hairless daughter walking to her classroom. I see a boy with a hairless head. He  gets out of  another car, and shouts: \"Millie, please  _  for me.\" \"Sir, your daughter is  _  .\" A woman gets out of the  _  , and says, \"That boy is my son, Harish. He is ill. He lost all his hair because of chemotherapy .He doesn't  _  to go to school. Millie visits him and I don't know she would cut her hair  _  my son! \" I stand there, and I can't  _  anything. \"Thank you, my little angel! You are teaching me what love is!\" I think. My daughter is a  _  girl. She lives for her friends.", 
    "options": [
        [
            "come", 
            "go", 
            "ride", 
            "drive"
        ], 
        [
            "book", 
            "magazine", 
            "picture", 
            "newspaper"
        ], 
        [
            "But", 
            "Before", 
            "And", 
            "If"
        ], 
        [
            "head", 
            "foot", 
            "hands", 
            "legs"
        ], 
        [
            "happy", 
            "sad", 
            "healthy", 
            "excited"
        ], 
        [
            "do", 
            "have", 
            "eat", 
            "drink"
        ], 
        [
            "fly", 
            "ride", 
            "walk", 
            "drive"
        ], 
        [
            "look", 
            "ask", 
            "wait", 
            "answer"
        ], 
        [
            "interesting", 
            "bright", 
            "great", 
            "clever"
        ], 
        [
            "bus", 
            "taxi", 
            "train", 
            "car"
        ], 
        [
            "want", 
            "need", 
            "hate", 
            "have"
        ], 
        [
            "about", 
            "for", 
            "of", 
            "in"
        ], 
        [
            "say", 
            "speak", 
            "tell", 
            "talk"
        ], 
        [
            "kind", 
            "bad", 
            "strong", 
            "healthy"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "D", 
        "A", 
        "B", 
        "A", 
        "D", 
        "C", 
        "C", 
        "D", 
        "A", 
        "B", 
        "A", 
        "A"
    ], 
    "source": "middle136"
}