{
    "article": "The elephant is the biggest four-legged animal in the world. It's also, perhaps, the gentlest ,  _  not always. Elephants are like us in some ways. They  _  for a long time--fifty or sixty years. They can  _  things very well. They never forget great sadness or happiness. A female elephant  dies  , her daughters and her granddaughters are sad for many months. They stay with the dead  _  . Then they carry a bit of it away with them. They never forget a  _  friend. Elephants are like us, but they're also  _  .They live in families; families or females. There will be a few young males-a few \"baby boy\". But they will soon be  _  away by their mothers or sisters. An elephant family  _  only its daughters, mothers and grandmothers and its great grandmothers. The females stay together for fifty, sixty or a hundred years.The older animals  look after  the young ones. The mothers teach their daughters and set a good example.And  _  happens to male elephant? Well, the young males stay with their mothers for a time. Then they must  _  the family. The females just send them away. A bull elephant does not often have a friend ,He lives  _  ,away from the family, and away from other bulls. Sometimes the females call a bull. He can  _  them then, and they stay for a time. But soon his \"wives\" and \"sisters\" send him away again. The females have a very  _  family life. What do the bulls think about it? We don't know.", 
    "options": [
        [
            "and", 
            "but", 
            "so", 
            "yet"
        ], 
        [
            "play", 
            "work", 
            "live", 
            "sleep"
        ], 
        [
            "remember", 
            "practice", 
            "talk", 
            "change"
        ], 
        [
            "head", 
            "legs", 
            "body", 
            "feet"
        ], 
        [
            "terrible", 
            "dad", 
            "young", 
            "dear"
        ], 
        [
            "different", 
            "same", 
            "special", 
            "popular"
        ], 
        [
            "thrown", 
            "sent", 
            "kicked", 
            "posted"
        ], 
        [
            "hopes", 
            "keeps", 
            "Allows", 
            "frightens"
        ], 
        [
            "how", 
            "who", 
            "which", 
            "what"
        ], 
        [
            "leave", 
            "stay", 
            "hear", 
            "walk"
        ], 
        [
            "sadly", 
            "hard", 
            "alone", 
            "noisily"
        ], 
        [
            "visit", 
            "beat", 
            "hide", 
            "receive"
        ], 
        [
            "dangerous", 
            "happy", 
            "beautiful", 
            "clever"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "C", 
        "D", 
        "A", 
        "B", 
        "C", 
        "D", 
        "A", 
        "C", 
        "A", 
        "B"
    ], 
    "source": "middle1359"
}