{
    "article": "(10,l,10) ,,A, B, C, D. A wise man was visiting a village with his students. He found a group of family members  _  in anger at each other. He turned to his students and asked: \"Why do people shout in anger at each other?\" His students thought for a while, and one of them said: \"Because when we lose our calm, we shout.\" \"But, why should you shout when the other person is just next to you? You can just as well tell him  _  you have to say in a soft manner,\" said the wise man. Students gave some other answers but  _  were any good. \"When two people are angry at each other, their hearts become distanced ,\" the wise man  _  , \" To cover that distance they must shout to be able to hear each other. The  _  they are, the louder they will have to shout to hear each other and cover that great distance.\" The wise man then gave an  _  : \"What happens when two people fall in love? They don't shout at each other but talk softly because their hearts are very  _  . When they love each other even more, what happens? They don't need to talk. They  _  look at each other and that's all. That is how close two people are when they love each other.\" He looked at his students and said: \"  _  when you argue, do not let your hearts get distant. Do not say words that distance you from others. Or there will come a day when the distance is so great that you will not find the  _  to return.\"", 
    "options": [
        [
            "smiling", 
            "crying", 
            "shouting", 
            "fighting"
        ], 
        [
            "what", 
            "why", 
            "where", 
            "how"
        ], 
        [
            "neither", 
            "all", 
            "both", 
            "none"
        ], 
        [
            "explained", 
            "suggested", 
            "reported", 
            "expected"
        ], 
        [
            "happier", 
            "satisfied", 
            "angrier", 
            "nervous"
        ], 
        [
            "excuse", 
            "example", 
            "advise", 
            "advertisement"
        ], 
        [
            "far", 
            "strange", 
            "common", 
            "close"
        ], 
        [
            "only", 
            "hardly", 
            "never", 
            "seldom"
        ], 
        [
            "If", 
            "So", 
            "But", 
            "And"
        ], 
        [
            "instruction", 
            "cause", 
            "path", 
            "partner"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "A", 
        "C", 
        "B", 
        "D", 
        "A", 
        "B", 
        "C"
    ], 
    "source": "middle103"
}