{
    "article": "It was the last day of the examination in a large eastern university. On the steps of one building , a group of students were talking about the exam that was going to begin soon. This was their  _  exam---then on to graduation and jobs. On their faces was  _  . With four years' hard study in the college, they felt  _  and able to take it. The coming exam, they knew, would be an  _  one, as the professor had said they could bring  _  books or notes they wanted, requesting only that they did not  _  from each other during the exam.  _  they walked into the classroom. The professor gave  _  the papers. And the students found there were only five questions. Three hours had passed, the professor began to collect papers. The students no longer looked confident. The professor looked at the  _  faces before him, and then asked: \"How many  _  all five questions?\" ,No hand was  put up  . \"How many answered four?\" Still no hand. \"Three? Two?\" Still no one. \"One, then?\" But the class  _  silent. The professor put down the papers. \"That is exactly what I  _  \", he said. \"I just want you to know that, although you have completed four years of study, there are still many things you don't know.\" Then, smiling, he added, \"You will all  _  this course, but remember----even though you are now college graduates, your education has just  _  . \"", 
    "options": [
        [
            "first", 
            "next", 
            "final", 
            "main"
        ], 
        [
            "pleasure", 
            "confidence", 
            "surprise", 
            "interest"
        ], 
        [
            "glad", 
            "ready", 
            "sorry", 
            "nervous"
        ], 
        [
            "interesting", 
            "important", 
            "easy", 
            "unusual"
        ], 
        [
            "both", 
            "either", 
            "neither", 
            "all"
        ], 
        [
            "listen", 
            "look", 
            "talk", 
            "copy"
        ], 
        [
            "Normally", 
            "Peacefully", 
            "Quickly", 
            "Carefully"
        ], 
        [
            "up", 
            "away", 
            "down", 
            "out"
        ], 
        [
            "worried", 
            "scared", 
            "moved", 
            "tired"
        ], 
        [
            "regarded", 
            "considered", 
            "completed", 
            "replied"
        ], 
        [
            "refused", 
            "reported", 
            "remained", 
            "reminded"
        ], 
        [
            "learned", 
            "enjoyed", 
            "hated", 
            "expected"
        ], 
        [
            "pass", 
            "fail", 
            "take", 
            "start"
        ], 
        [
            "achieved", 
            "finished", 
            "started", 
            "succeeded"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "B", 
        "C", 
        "B", 
        "D", 
        "B", 
        "D", 
        "A", 
        "C", 
        "C", 
        "D", 
        "A", 
        "C"
    ], 
    "source": "middle1107"
}