{
    "article": "There are many places to go on safari  in Africa, but riding a horse _ the flooded waters of Botswana's Okavango Delta  must be one of the world's most exciting wildlife _ .\nSeveral safari camps operate as the base for this adventure, _ special rides twice a day to explore deep into the delta. The camps have excellent horses, professional guides and lots of support workers.\nThe morning ride, when the guides take you to beautiful, shallow lakes full of water lilies , tends to be more active. It isn't like any other riding experience. With rainbows forming in the splashing water around you and the sound of huge drops of water bouncing off your body and face, it is _ exciting. You are very likely to see large wild animals, too. On horseback it is _ to get quite close to elephants, giraffes and many other animals. The sense of excitement and tension  levels rise suddenly _ you move closer to them.\nIn the evening, rides are usually slower and more unhurried, with golden light streaming across the grassy delta and the animals coming out to eat and drink.\n _ and peaceful though they are, rides at this time of day are still very impressive. As the sun's rays pass through the dust kicked up by the horses, the romance of Africa comes to life.\nLooking back on your day, you will find _ hard to deny  that a horseback Safari is as close as you will ever come to answering the call of the wild.", 
    "options": [
        [
            "over", 
            "on", 
            "towards", 
            "through"
        ], 
        [
            "lessons", 
            "journeys", 
            "celebrations", 
            "sports"
        ], 
        [
            "providing", 
            "preventing", 
            "protecting", 
            "presenting"
        ], 
        [
            "much", 
            "such", 
            "truly", 
            "likely"
        ], 
        [
            "possible", 
            "able", 
            "impossible", 
            "unable"
        ], 
        [
            "until", 
            "while", 
            "when", 
            "before"
        ], 
        [
            "Hurried", 
            "Worried", 
            "Stressed", 
            "Relaxed"
        ], 
        [
            "this", 
            "that", 
            "it", 
            "them"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "A", 
        "C", 
        "A", 
        "C", 
        "D", 
        "C"
    ], 
    "source": "middle373"
}