{
    "article": "A group of men, highly successful in their jobs, went to visit their old teacher. Soon they began to _ about the stress in work and life.\nThe old teacher went to the kitchen and returned _ a pot of coffee and different kinds of cups: glass, plastic; nice-looking ones, ugly ones; some _ , some cheap. He told them to help _ to the coffee.\nWhen all the students were holding a cup of coffee, the teacher said: \"I've found that all the nice-looking expensive cups were _ and you've left behind the ugly and cheap _ . While it is _ for you to take only the best for yourselves, your problems and stress come along.\nYou know that the cup itself adds no quality to the coffee, what you _ wanted was coffee, not the cup, but you _ went for the best cups.\nNow think _ this: life is the coffee. The jobs and money are the cups. They are just outlooks of our life, and the type of cup does not _ the quality of life. Sometimes, we care too much about the cup, and we fail to enjoy the coffee that life offers us. Life hands us the coffee, not the cups. Please enjoy your coffee!\"\nThe happiest people don' t have the _ of everything. They just make the best of everything.\nSo please speak kindly, live _ , and love deeply.", 
    "options": [
        [
            "think", 
            "complain", 
            "worry", 
            "say"
        ], 
        [
            "by", 
            "at", 
            "with", 
            "for"
        ], 
        [
            "expensive", 
            "good", 
            "beautiful", 
            "strange"
        ], 
        [
            "yourself", 
            "yourselves", 
            "them", 
            "themselves"
        ], 
        [
            "taken", 
            "changed", 
            "broken", 
            "lost"
        ], 
        [
            "one", 
            "cup", 
            "ones", 
            "coffee"
        ], 
        [
            "necessary", 
            "usual", 
            "normal", 
            "often"
        ], 
        [
            "first", 
            "true", 
            "really", 
            "just"
        ], 
        [
            "still", 
            "only", 
            "unless", 
            "though"
        ], 
        [
            "for", 
            "of", 
            "to", 
            "about"
        ], 
        [
            "make", 
            "improve", 
            "change", 
            "have"
        ], 
        [
            "worst", 
            "better", 
            "best", 
            "worse"
        ], 
        [
            "shortly", 
            "quickly", 
            "simply", 
            "clearly"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "D", 
        "A", 
        "C", 
        "C", 
        "C", 
        "A", 
        "D", 
        "C", 
        "C", 
        "C"
    ], 
    "source": "middle378"
}