{
    "article": "Some people have very good memories and can easily learn quite long poem by heart. Some people have  _  memories and can only  _  things that they have said again and again. The  _  English writer Charles Dickens said that he could walk down  _  street in London and then tell you the name of every shop on  _  sides of the street. Great men in the world have wonderful memories. A good memory is a great help in learning a language. Everybody learns  _  language by remembering what he hears  when  he is a small child. Some children live with their parents in foreign countries and they seem  to learn  two languages as  _  as one. In school it is not so easy to learn foreign languages  _  students have little time  _  it and they are busy with other subjects as well. A man's mind is quite like a camera but it  _  photos of what we see and it can also take photos of what we feel, hear, smell and taste. When we take a real photo  _  a camera there is much work  to do  before the photo is finished and ready to show to our friends.  _  the same way there is much work to do before we can keep a picture forever in our mind.", 
    "options": [
        [
            "wonderful", 
            "better", 
            "poor", 
            "badly"
        ], 
        [
            "speak", 
            "study", 
            "know", 
            "remember"
        ], 
        [
            "nice", 
            "beautiful", 
            "famous", 
            "kind"
        ], 
        [
            "any", 
            "some", 
            "many", 
            "the"
        ], 
        [
            "every", 
            "each", 
            "both", 
            "all"
        ], 
        [
            "her", 
            "his", 
            "one's", 
            "their"
        ], 
        [
            "badly", 
            "hard", 
            "easily", 
            "happily"
        ], 
        [
            "because", 
            "why", 
            "what", 
            "when"
        ], 
        [
            "like", 
            "for", 
            "to", 
            "in"
        ], 
        [
            "leaves", 
            "takes", 
            "gets", 
            "receives"
        ], 
        [
            "in", 
            "by", 
            "with", 
            "through"
        ], 
        [
            "In", 
            "On", 
            "With", 
            "As"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "C", 
        "A", 
        "C", 
        "B", 
        "C", 
        "A", 
        "B", 
        "B", 
        "C", 
        "A"
    ], 
    "source": "middle159"
}