{
    "article": "I was on my way to work. Arriving at the station I found my train was _ because of the bad weather. I had to _ for two hours at the bus station.A lady sat beside me. I could notice how _ she looked. She seemed very worried. I asked her if she was waiting for the next train. She didn't _ . I asked her again. She replied, \"Uhuh. Yes.\" Then she wiped  her eyes.\nI said, \"Hey dear, what is wrong? Why are you crying?\" She told me her story. She told me that her father _ the year before . She used to have a job, but she wanted to look after her sick mother who lived alone, _ she stopped working. Her family was _ and she could not pay the doctor's bills   of her mother .Then she said she even planned to kill herself. I was shocked!\nShe stayed another half an hour while I tried to comfort her to be brave. I told her I would try to get her a good _ that would pay well. And I told her to believe she could have a better life.\nI passed her my _ and asked her to ring me if she needed help. She smiled and said, \"Thanks for your _ and I promise I won't have any more terrible thoughts. I will live long and well\"", 
    "options": [
        [
            "crowded", 
            "expensive", 
            "late", 
            "fast"
        ], 
        [
            "sleep", 
            "study", 
            "explain", 
            "wait"
        ], 
        [
            "excited", 
            "bored", 
            "sad", 
            "calm"
        ], 
        [
            "smile", 
            "answer", 
            "run", 
            "write"
        ], 
        [
            "worked", 
            "returned", 
            "succeeded", 
            "died"
        ], 
        [
            "so", 
            "or", 
            "but", 
            "thought"
        ], 
        [
            "rich", 
            "poor", 
            "old", 
            "quiet"
        ], 
        [
            "job", 
            "present", 
            "house", 
            "hospital"
        ], 
        [
            "bad", 
            "ticket", 
            "card", 
            "jacket"
        ], 
        [
            "lesson", 
            "kindness", 
            "service", 
            "love"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "C", 
        "B", 
        "D", 
        "A", 
        "B", 
        "A", 
        "C", 
        "B"
    ], 
    "source": "middle919"
}