{
    "article": "Our world is full of rules. Everyone needs to obey them. But  _  your idea about your school rules? Now many students like to talk about the rules that they have  in school  . At their school, they  have to  wear uniforms every day. The problem is that all the students think the uniforms are  _  . They think young people should look smart and so they would like to wear their own clothes.  _  , their teachers believe that if they did that, they would think  _  of their clothes than their study.  _  the students disagree. They would feel more comfortable and that is good for  _  . If they can't do that, they  should be allowed to  design their own uniforms. That would be a good way to  _  both teachers and students happy. It's also probably a good idea for parents to allow teenagers to study in groups during the evening. Although they get  _  sometimes, they can learn a lot from each other. They also think that vacations should be longer. At present they're too  _  . Longer vacations would give them time to do things like volunteering. On Friday afternoons, many students are sleepy after a long week of classes. They think it's better to have Friday afternoons  _  to volunteer and help others.  For example  , it is helpful for students to go to an old people's home to sing and perform a play for them. It will help them understand the meaning of love. It's also better to volunteer at the local hospital. It would be a good  _  for them because some of them want to be doctors when they grow up. What do you think of your school rules?", 
    "options": [
        [
            "how's", 
            "what's", 
            "how're", 
            "what're"
        ], 
        [
            "comfortable", 
            "smart", 
            "ugly", 
            "nice"
        ], 
        [
            "Although", 
            "However", 
            "Yet", 
            "Still"
        ], 
        [
            "much", 
            "more", 
            "little", 
            "less"
        ], 
        [
            "And", 
            "So", 
            "Or", 
            "But"
        ], 
        [
            "studying", 
            "studies", 
            "health", 
            "healthy"
        ], 
        [
            "keeping", 
            "be", 
            "keep", 
            "being"
        ], 
        [
            "quietly", 
            "quickly", 
            "happily", 
            "noisy"
        ], 
        [
            "shorter", 
            "longer", 
            "long", 
            "short"
        ], 
        [
            "off", 
            "of", 
            "on", 
            "down"
        ], 
        [
            "teacher", 
            "experience", 
            "doctor", 
            "rule"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "B", 
        "B", 
        "D", 
        "A", 
        "C", 
        "D", 
        "D", 
        "A", 
        "B"
    ], 
    "source": "middle943"
}