{
    "article": "Every Friday I went to a senior nursing home. It seemed as if it needed _ , but little did I know it would help me too.\nDuring my first visit I helped to polish   some ladies' nails . One woman asked me many questions. After she was satisfied with my _ , she started to share some of her hidden _ . By listening to her, I realized I had helped her a lot: she looked _ from some of her past pains.\nWhen she was finished, she told me something that _ me to visit the nursing home every week. She said, \"You're the only person I was able to tell this to. The other volunteers are too busy to listen to me. You'll come back next week, right?\" After _ blowing on her newly coated nails , I smiled and _ , \"Yes, I'll see you next Friday.\"\nThat day, I was gladdened by the _ that I had helped somebody. I realized an action as _ as listening became something much more.\nDuring every second I spent there, I realized how much of a difference my _ could have on the lives of others. The hardest part of living there is that it breaks the human _ between those in today's society and the nursing home.\nEvery moment I spend chatting is a chance to _ that connection again, to share their worries, and to shape someone's life. In turn, that _ also shapes me. I not only learn about life and experiences outside of school, but also receive the _ of being part of this process - this connection between humans.", 
    "options": [
        [
            "courage", 
            "money", 
            "help", 
            "repair"
        ], 
        [
            "answers", 
            "performances", 
            "appearance", 
            "behaviors"
        ], 
        [
            "secrets", 
            "hurt", 
            "facts", 
            "truths"
        ], 
        [
            "aware", 
            "sure", 
            "scared", 
            "relaxed"
        ], 
        [
            "forced", 
            "invited", 
            "allowed", 
            "encouraged"
        ], 
        [
            "gently", 
            "hurriedly", 
            "simply", 
            "comfortably"
        ], 
        [
            "admitted", 
            "promised", 
            "shouted", 
            "greeted"
        ], 
        [
            "belief", 
            "dream", 
            "courage", 
            "fact"
        ], 
        [
            "certain", 
            "simple", 
            "smart", 
            "modern"
        ], 
        [
            "methods", 
            "actions", 
            "experiences", 
            "hopes"
        ], 
        [
            "memory", 
            "personality", 
            "connection", 
            "custom"
        ], 
        [
            "tie", 
            "find", 
            "continue", 
            "break"
        ], 
        [
            "thought", 
            "situation", 
            "activity", 
            "moment"
        ], 
        [
            "welcome", 
            "message", 
            "gift", 
            "invitation"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "B", 
        "D", 
        "D", 
        "A", 
        "B", 
        "D", 
        "B", 
        "B", 
        "C", 
        "A", 
        "D", 
        "C"
    ], 
    "source": "middle682"
}