{
    "article": "Growing up is not always easy. When facing difficulties, courage and a spirit of independence  can be more useful than crying for help. That's what's the story I've heard recently tells me .\nThe young man was born in 1982 in a _ family in a small town .When he was only 11, his father became mentally ill and one day came back with an abandoned baby   girl .A year later, his _ left home with his younger brother because she couldn't _ hard life and pressure from her mad husband. The 12-year-old boy began to _ his whole family: he took care of not only his sick father, but also the little girl. At the same time ,he didn't give up studying. Later he went to college. To care for the little girl, he rented a room near his college and _ her education by doing part-time jobs.\nAfter the young man's story went public, people were deeply impressed by his behavior.\n _ his life was hard, he didn't abandon his father and his sister because _ needed his help very much. And he _ donations from others. He said he felt _ because of kind offers, but he could depend on his own work. With his hard -won money, he _ helped other students in trouble .\nToday when many young people worry more about their own happiness, this young man's behavior reminds us of what we don't usually pay attention to : love and care for others. Nobody could continue to live _ these .\nThrough his hard life, the young man is regarded as a _ . So when facing difficulties, don't complain about bad luck. Consider what more you could do for your family and society, and you'll find the world smiling back .", 
    "options": [
        [
            "rich", 
            "happy", 
            "poor", 
            "sad"
        ], 
        [
            "father", 
            "mother", 
            "sister", 
            "brother"
        ], 
        [
            "understand", 
            "stand", 
            "believe", 
            "think"
        ], 
        [
            "support", 
            "organize", 
            "hate", 
            "like"
        ], 
        [
            "planted", 
            "afforded", 
            "ended", 
            "went"
        ], 
        [
            "Since", 
            "Unless", 
            "If", 
            "Although"
        ], 
        [
            "they", 
            "he", 
            "she", 
            "you"
        ], 
        [
            "received", 
            "expected", 
            "refused", 
            "got"
        ], 
        [
            "sorry", 
            "worried", 
            "encouraged", 
            "sad"
        ], 
        [
            "even", 
            "hardly", 
            "still", 
            "too"
        ], 
        [
            "with", 
            "without", 
            "by", 
            "for"
        ], 
        [
            "fool", 
            "volunteer", 
            "hero", 
            "boy"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "B", 
        "A", 
        "B", 
        "D", 
        "A", 
        "C", 
        "C", 
        "A", 
        "B", 
        "C"
    ], 
    "source": "middle240"
}