{
    "article": "Yesterday, our former   President of our nation passed away while he was making an inspiring lecture to thousands of students in an important institution. He was a great man who encouraged _ every student in our nation through his simple lifestyle though he _ high positions in public life.\nHe was _ in a poor family, mediocre   in school studies and never married through his whole life of 83 years. He once said the following sentences to encourage millions of students.\n\" _ shall have dreams. The real dream is not the one we get while we are in sleep, _ the dream which does not let us sleep _ it is realized in the end.\"\nIt is obviously _ . We have many dreams and goals to realize or reach. But in that process we face so many _ . The people who keep trying would _ their dreams.\n _ reaching the winning point, there is _ a breaking point for human energy. The hard work to be done, the long awaited time and the difficulties in the journey towards success cause fatigue   to people who are in the race. Many people lose patience at that point. They give up halfway during the race. But the final winners never lose at that breaking point. They try hard even the physical and emotional fatigue pulls back. With great _ , they reach the winning point.\nThis is the basic _ between losers and winners. Every human being on the earth has almost _ chances to succeed, but it is their positive attitude and restless hard work that make them winners.", 
    "options": [
        [
            "just", 
            "correctly", 
            "almost", 
            "exactly"
        ], 
        [
            "held", 
            "dropped", 
            "contained", 
            "hung"
        ], 
        [
            "educated", 
            "worked", 
            "born", 
            "married"
        ], 
        [
            "Nobody", 
            "Somebody", 
            "Both", 
            "Everybody"
        ], 
        [
            "or", 
            "and", 
            "but", 
            "also"
        ], 
        [
            "even", 
            "until", 
            "since", 
            "because"
        ], 
        [
            "true", 
            "wrong", 
            "interesting", 
            "boring"
        ], 
        [
            "chances", 
            "comfort", 
            "difficulties", 
            "situations"
        ], 
        [
            "make", 
            "lose", 
            "realize", 
            "find"
        ], 
        [
            "When", 
            "So", 
            "After", 
            "Before"
        ], 
        [
            "always", 
            "seldom", 
            "hardly", 
            "never"
        ], 
        [
            "trouble", 
            "efforts", 
            "wealth", 
            "inventions"
        ], 
        [
            "change", 
            "word", 
            "chance", 
            "difference"
        ], 
        [
            "equal", 
            "different", 
            "strange", 
            "great"
        ]
    ], 
    "answers": [
        "C", 
        "C", 
        "C", 
        "D", 
        "C", 
        "B", 
        "C", 
        "C", 
        "C", 
        "D", 
        "A", 
        "B", 
        "D", 
        "A"
    ], 
    "source": "middle1257"
}