{
    "article": "Yesterday my grandfather told me about his early days. When he left school, he found a job in a post office. He worked hard in the  post office  . Soon he had more money than his friends  because of  his hard work. It seemed that he would have a bright future. When he was 25 years old, however, he began to  _  his job. He wanted a more exciting one, so he left the post office. Two months later, he found a new job in a big company. Workers in this company  _  traveled a lot. At first he really enjoyed the traveling.  _  after a year, he began to hate it. He had to  move around  and he was always in a car or on a train. The worst thing was he couldn't make any new friends! Even so, his boss was not satisfied with him. Two years later he had to leave the company. He was  _  at that time, so he sold his house. He had to accept a part time job in a book shop. He was surprised to find he loved it! He made new friends every day and he enjoyed reading books. Three years later, he  _  the shop owner's daughter. Soon they had their first child. In the next ten years, they had another three  _  and four more book shops! He became very rich indeed. \"Life is  _  ,\" he told me. \"The most important thing is that you should always try your best. Never give up!\"", 
    "options": [
        [
            "dislike", 
            "love", 
            "like", 
            "enjoy"
        ], 
        [
            "almost", 
            "usually", 
            "seldom", 
            "never"
        ], 
        [
            "So", 
            "And", 
            "But", 
            "Though"
        ], 
        [
            "happy", 
            "energetic", 
            "rich", 
            "poor"
        ], 
        [
            "married", 
            "understood", 
            "met", 
            "visited"
        ], 
        [
            "sisters", 
            "brothers", 
            "children", 
            "cousins"
        ], 
        [
            "boring", 
            "important", 
            "necessary", 
            "wonderful"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "C", 
        "D", 
        "A", 
        "C", 
        "D"
    ], 
    "source": "middle1843"
}