{
    "article": "Once, in a small village, lived a family with eight children. Two of the children loved  _  very much, but the family was so poor that it was impossible to send  _  of them to study at the art college at the same time. After many discussions, the two boys finally  worked out  ) a coin. The loser would go  _  into the mines and, with his earnings ,  _  his brother studying at the college. Then, when the brother who won the toss finished his studies, after four years, he would support the other brother studying at the  _  James won the toss and Jack went down into the mines. James worked with all his heart and his paintings were much  _  than those of most of his teachers, and by the time he  _  , he was beginning to make a lot of money for his paintings.  _  James returned, the family held a big dinner for his great success. Soon after the meal began, James  _  up from his seat to drink a toast to his dear  _  He said, \"Jack, now you can go to the art college and your  _  will come true. I will take care of you. \" But Jack said  _  , \"Brother, the four years in the mines has done too much to my hands, so it' s too  _  Now I can' t even hold a glass. \" To show his great love and respect, James drew his brother' s hands with  _  towards the sky. He called his drawing \"The Praying Hands\", which became very famous years later.", 
    "options": [
        [
            "painting", 
            "books", 
            "school", 
            "money"
        ], 
        [
            "any", 
            "all", 
            "both", 
            "neither"
        ], 
        [
            "off", 
            "away", 
            "up", 
            "down"
        ], 
        [
            "support", 
            "agree", 
            "follow", 
            "let"
        ], 
        [
            "home", 
            "mine", 
            "college", 
            "school"
        ], 
        [
            "better", 
            "worse", 
            "cheaper", 
            "older"
        ], 
        [
            "arrived", 
            "graduated", 
            "walked", 
            "waited"
        ], 
        [
            "Before", 
            "When", 
            "Though", 
            "While"
        ], 
        [
            "picked", 
            "turned", 
            "looked", 
            "stood"
        ], 
        [
            "brother", 
            "sister", 
            "father", 
            "mother"
        ], 
        [
            "way", 
            "idea", 
            "dream", 
            "practice"
        ], 
        [
            "happily", 
            "surprisedly", 
            "angrily", 
            "softly"
        ], 
        [
            "early", 
            "late", 
            "good", 
            "helpful"
        ], 
        [
            "legs", 
            "feet", 
            "arms", 
            "fingers"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "D", 
        "A", 
        "C", 
        "A", 
        "B", 
        "B", 
        "D", 
        "A", 
        "C", 
        "D", 
        "B", 
        "D"
    ], 
    "source": "middle1442"
}