{
    "article": "Benjamin was  _  . He didn't know why. He was having a fever and tired and didn't feel like eating. His stomach hurt from time to time. At first he paid very little  _  to it, thinking he would be all right in  a week  . But he didn't. After three weeks, he had to go to Dr. Barkley. The doctor did a few  _  . Then he asked Benjamin if he had gone  _  and drunk dirty water. Benjamin said he hadn't been camping since he was a soldier in the army. He asked if Benjamin had eaten at any fast food restaurants in the past month, or eaten from one of the  many  lunch trucks in the Los Angeles area. Benjamin said that he ate fast food or lunch truck food every day at noon. \"That's probably the  _  of your illness. You have hepatitis A, and you most likely got it from a food worker who didn't wash his hands thoroughly after using the  restroom  . It happens a lot.\" \"God! I'm not going to die, am I?\" The doctor told him not to  _  . A viral infection that  _  the liver , hepatitis A kills only about 100 people every year in the US. He told Benjamin to see him every two weeks, and to be  _  to take three months  _  from work so that he could rest, rest, rest. There is no  _  to hepatitis A. You survive , or you don't. \"But there is one good thing about hepatitis A,\" Dr. Barkley said. \"  _  you get it, you're immune to it for the  _  of your life.\"", 
    "options": [
        [
            "energetic", 
            "sleepy", 
            "sick", 
            "tired"
        ], 
        [
            "money", 
            "dollars", 
            "attention", 
            "focus"
        ], 
        [
            "chores", 
            "tests", 
            "seconds", 
            "movements"
        ], 
        [
            "fishing", 
            "camping", 
            "hiking", 
            "sightseeing"
        ], 
        [
            "resource", 
            "cause", 
            "research", 
            "search"
        ], 
        [
            "think", 
            "eat", 
            "worry", 
            "cry"
        ], 
        [
            "hurts", 
            "breaks", 
            "kills", 
            "removes"
        ], 
        [
            "OK", 
            "ready", 
            "necessary", 
            "relaxing"
        ], 
        [
            "away", 
            "to", 
            "off", 
            "getting"
        ], 
        [
            "solution", 
            "answer", 
            "hope", 
            "need"
        ], 
        [
            "Unless", 
            "Until", 
            "Once", 
            "Twice"
        ], 
        [
            "other", 
            "rest", 
            "whole", 
            "part"
        ]
    ], 
    "answers": [
        "C", 
        "C", 
        "B", 
        "B", 
        "B", 
        "C", 
        "A", 
        "B", 
        "C", 
        "A", 
        "C", 
        "B"
    ], 
    "source": "middle772"
}