{
    "article": "One afternoon, Tommy was on his way home from school. When he was passing by his neighbor, Mr. Adamson's house, he found thick _ coming from the window of the house. He was _ He thought the house must be on fire and it might be burnt down. He didn't know whether Mr. Adamson was in the house, _ he knew he must put out the fire at once. So he ran to his own house, rushed into the bathroom and _ a big barrel  with water. He was in such a hurry that he forgot to turn off the water before he ran back to Mr. Adamson's house. When he reached the window where the smoke was still coming out, he threw the water _ the house by the window without looking for where the smoke was. The smoke stopped immediately. But at the same time, there was an angry cry from inside the house. _ was Mr. Adamson. He was standing by the window with so big a pipe   in his hand looking at Tommy _ Tommy then understood that it must be the pipe. He stood there, and could not _ a word.\nTommy was very sorry for it. He helped Mr. Adamson clean the floor. However, worst was yet to come. When he went home later, he found his own _ was flooded  .", 
    "options": [
        [
            "water", 
            "smoke", 
            "wind", 
            "fire"
        ], 
        [
            "afraid", 
            "sad", 
            "excited", 
            "happy"
        ], 
        [
            "since", 
            "or", 
            "but", 
            "because"
        ], 
        [
            "filled", 
            "covered", 
            "lived", 
            "left"
        ], 
        [
            "out", 
            "away", 
            "into", 
            "up"
        ], 
        [
            "This", 
            "It", 
            "One", 
            "Who"
        ], 
        [
            "angrily", 
            "quickly", 
            "lazily", 
            "happily"
        ], 
        [
            "tell", 
            "write", 
            "say", 
            "talk"
        ], 
        [
            "school", 
            "window", 
            "car", 
            "house"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "A", 
        "C", 
        "B", 
        "A", 
        "C", 
        "D"
    ], 
    "source": "middle631"
}