{
    "article": "Crabs are very interesting creatures. If you put several of them in a bucket, the moment one of them starts crawling out, the other crabs will pull him back down. So none of the crabs ever  _  in getting out. They just keep stopping each other from climbing higher than the rest of them. We humans are  _  more like crabs than we think. We try to get even with our enemies, and ahead of our  _  . But we have to realize that \"when we're green with envy( ) , we're also ripe for problems\". Whether we admit it or not, most of us want other people to be just a little less successful than we are. Friends are always  _  about your success, as long as you're not more successful than they are ! But one of the first secrets to success is not to compare your life with others. It's strange that many of us seem to know  _  to live everybody else's lives but our own. Even though what happens in someone else's life has  _  to do with ours. Successful people look at life through a telescope and see how great it can be,  _  jealous people look at life through a microscope and only see the faults and mistakes of others. Being jealous of others is just a slow way of suicide that will  _  both your health and happiness. You have a special  _  and personality that no one else has. So use yours the best way possible. Stop comparing yourself with others. Birds don't  _  . Pigs don't climb trees. And crabs don't fly. Enjoy your own natural abilities and develop your own style.", 
    "options": [
        [
            "succeeds", 
            "arrives", 
            "checks", 
            "gives"
        ], 
        [
            "hardly", 
            "perhaps", 
            "nearly", 
            "still"
        ], 
        [
            "classmates", 
            "meighbours", 
            "friends", 
            "families"
        ], 
        [
            "worried", 
            "happy", 
            "serious", 
            "mad"
        ], 
        [
            "where", 
            "when", 
            "what", 
            "how"
        ], 
        [
            "something", 
            "anything", 
            "nothing", 
            "everything"
        ], 
        [
            "and", 
            "or", 
            "so", 
            "but"
        ], 
        [
            "kill", 
            "protect", 
            "separate", 
            "improve"
        ], 
        [
            "ability", 
            "mermory", 
            "skill", 
            "thought"
        ], 
        [
            "sing", 
            "fly", 
            "swim", 
            "sleep"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "C", 
        "B", 
        "D", 
        "C", 
        "D", 
        "A", 
        "A", 
        "C"
    ], 
    "source": "middle1333"
}