{
    "article": "Jack was a milkman. He and his horse, Pierre, worked _ every day. They were great friends and took _ to people together for years and years. After a while, Jack didn't have to do much any more because Pierre knew where and when to _ . The two friends went on with their _ until one morning. Jack came into work one day to find his boss waiting for him. \"Jack,\" said his boss, \"I have some _ news. This morning Pierre died in his stall.\" Tears started to ran down Jack's face. \"I will never see my friend _ ,\" said Jack tearfully. \"I understand what you _ now. You may have the day off if you like.\" \"No, I have something to do,\" and with that Jack walked off. He was given a new horse and carriage . That day, Jack was in a bad _ . His carriage was hit by a truck. When the boss got to the place, he asked, \"Is Jack _ ?\" \"No, he died in the crash,\" said the doctor. \"I don't _ ,\" said the driver of the truck. \"It was like he didn't even see me.\" \"That's because he didn't. This man has been _ for 5 years,\" said the doctor. \"I never knew!\" said Jack's boss. \"He didn't _ you?\" said the doctor. Just then, Jack's boss _ what Jack said about Pierre. \"No, but someone else knew.\" \" _ ?\" asked the doctor. \"A friend of Jack's. His name was Pierre. I think that it was just a little _ between friends.\"", 
    "options": [
        [
            "hardly", 
            "badly", 
            "angrily", 
            "happily"
        ], 
        [
            "milk", 
            "newspaper", 
            "food", 
            "money"
        ], 
        [
            "rest", 
            "start", 
            "play", 
            "stop"
        ], 
        [
            "job", 
            "way", 
            "meal", 
            "holiday"
        ], 
        [
            "sad", 
            "old", 
            "strange", 
            "usual"
        ], 
        [
            "much", 
            "again", 
            "often", 
            "home"
        ], 
        [
            "think", 
            "want", 
            "mean", 
            "feel"
        ], 
        [
            "road", 
            "trouble", 
            "accident", 
            "weather"
        ], 
        [
            "dangerous", 
            "OK", 
            "afraid", 
            "weak"
        ], 
        [
            "know", 
            "understand", 
            "drive", 
            "watch"
        ], 
        [
            "ill", 
            "blind", 
            "lonely", 
            "careless"
        ], 
        [
            "see", 
            "tell", 
            "ask", 
            "mind"
        ], 
        [
            "forgot", 
            "thought", 
            "remembered", 
            "wrote"
        ], 
        [
            "Whose", 
            "What", 
            "When", 
            "Who"
        ], 
        [
            "joke", 
            "mistake", 
            "friendship", 
            "Secret"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "D", 
        "A", 
        "A", 
        "B", 
        "D", 
        "C", 
        "A", 
        "B", 
        "B", 
        "B", 
        "C", 
        "D", 
        "D"
    ], 
    "source": "middle17"
}