{
    "article": "As a teenager,I am often asked what I am going to be in the future. A lawyer?A doctor?Or a scientist?No,my ideal career is to be a teacher. One of the  _  for that is I want to be a teacher like Mr. Chen. \"Look!Do you know what it is?A-ha,it's the  _  !And it will always move around the sun.\" Mr. Chen said and pointed to his head. He then touched the nose and  _  , \"Can you tell me the name of this mountain? It is the highest mountain on Earth! What's the  _  of it? Yes, it's 8844.43 metres.\" I'll never forget my first geography lesson. He was  _  humorous that we all fell in love with his lessons  at once  . It's Mr. Chen who opened the door of geography for us. Generally speaking, most of the teachers are strict  _  students and sometimes a little bit demanding , not so with Mr. Chen. He is a lighthouse, showing us the way to the treasure of knowledge. He is a friend and easy to get  _  with, always encouraging us to speak out loud without  _  our shyness and other disadvantages. He is an example, volunteering his time to students and other teachers. One day I happened to meet him in the hospital. Seeing the cut on his arm, I realized he was donating his  _  . I was moved and was  _  another lesson, a lesson of love and devotion. Every time I see my globe , it would  _  me of Mr. Chen. He is the most unforgettable teacher I have  _  met and he will always be. Someday I hope I am  _  to be a teacher like him. Thank you, Mr. Chen, thank you for making learning not a job but a joy. Thank you for helping me to discover what I do best and to do it even  _  Thank you for understanding all of us and giving us the time and care each of us needs.", 
    "options": [
        [
            "replies", 
            "reasons", 
            "rewards", 
            "results"
        ], 
        [
            "moon", 
            "earth", 
            "star", 
            "sun"
        ], 
        [
            "advised", 
            "announced", 
            "added", 
            "answered"
        ], 
        [
            "distance", 
            "weight", 
            "size", 
            "height"
        ], 
        [
            "very", 
            "too", 
            "really", 
            "so"
        ], 
        [
            "with", 
            "to", 
            "in", 
            "for"
        ], 
        [
            "away", 
            "together", 
            "angry", 
            "along"
        ], 
        [
            "thinking", 
            "caring", 
            "considering", 
            "supposing"
        ], 
        [
            "money", 
            "blood", 
            "clothes", 
            "time"
        ], 
        [
            "taught", 
            "given", 
            "taken", 
            "had"
        ], 
        [
            "remembers", 
            "represents", 
            "warns", 
            "reminds"
        ], 
        [
            "just", 
            "never", 
            "ever", 
            "yet"
        ], 
        [
            "able", 
            "about", 
            "allowed", 
            "available"
        ], 
        [
            "well", 
            "good", 
            "better", 
            "best"
        ]
    ], 
    "answers": [
        "B", 
        "B", 
        "C", 
        "D", 
        "D", 
        "A", 
        "D", 
        "C", 
        "B", 
        "B", 
        "D", 
        "C", 
        "A", 
        "C"
    ], 
    "source": "middle986"
}