{
    "article": "There are times in our lives when we remember. Remembering the good things of  the past  is a most precious time; these memories are  _  in the corner of my mind. When I was four years old, I often went to a kindergarten . I  _  many toys and friends that made me laugh and cry. The teachers were  _  and friendly. They taught us many interesting songs and games. We played all day long. We did not know what learning was at that time,  _  we were learning every day. When I was  _  years old, I started school. I was very  _  because I became a school student and began to learn school subjects. My favourite subject was  _  . I remember, the first day, our science teacher told us the sun was like a big fire ball and  _  was very, very far away. Nobody could stay close to that \"ball\". We were quite surprised and kept our mouths open. We began to wonder at the  _  of the universe . Later on, more ideas  _  weather, planes, railways, wildlife, deserts and even pollution came to our ears. We began to learn  _  . When I was about ten years old, I  _  quite a lot of things. I began to read newspapers, keep a diary, visit museums  _  make many friends. Every day was something new. Every day was interesting and exciting. Now I am in the middle school. Each day is new to me. Happily I am still learning, which is like a journey to me. I have finished the first part, but there is still a long  _  for me to go. I hope I will become a learned person someday.", 
    "options": [
        [
            "sometimes", 
            "seldom", 
            "never", 
            "always"
        ], 
        [
            "borrowed", 
            "bought", 
            "had", 
            "saved"
        ], 
        [
            "beautiful", 
            "old", 
            "kind", 
            "young"
        ], 
        [
            "as", 
            "but", 
            "if", 
            "before"
        ], 
        [
            "three", 
            "seven", 
            "eleven", 
            "fifteen"
        ], 
        [
            "angry", 
            "excited", 
            "tired", 
            "worried"
        ], 
        [
            "English", 
            "Physics", 
            "Science", 
            "Maths"
        ], 
        [
            "they", 
            "I", 
            "he", 
            "it"
        ], 
        [
            "size", 
            "colour", 
            "shape", 
            "place"
        ], 
        [
            "about", 
            "to", 
            "with", 
            "for"
        ], 
        [
            "quietly", 
            "carelessly", 
            "slowly", 
            "suddenly"
        ], 
        [
            "kept", 
            "bought", 
            "knew", 
            "took"
        ], 
        [
            "and", 
            "but", 
            "so", 
            "or"
        ], 
        [
            "time", 
            "trip", 
            "way", 
            "road"
        ]
    ], 
    "answers": [
        "D", 
        "C", 
        "C", 
        "B", 
        "B", 
        "B", 
        "C", 
        "D", 
        "A", 
        "A", 
        "C", 
        "C", 
        "A", 
        "C"
    ], 
    "source": "middle1943"
}