{
    "article": "My mother says she probably wouldn't love butterflies today if it weren't for Mr. Patti. When my mother Ada was a kid, she loved playing baseball and she wanted to  _  for the New York Yankees. Then her brother Howie pointed out that there weren't any women playing major league baseball . Ada realized he was right. That made her so angry that she started throwing baseballs into the air and hitting them as  _  as she could. One day Ada hit a ball through Mr. Patti's window. She was about to run away when a bright yellow butterfly flew through the hole in the window. A blue butterfly  _  . Then a lot of colourful butterflies flew out like a rainbow . Ada  _  to open her arms and catch the butterflies. It was too bad she didn't  _  she heard Mr. Patti shouting, \"Hey! You there!\" Ada almost jumped 12 feet. When she landed, Mr. Patti handed her a net and a box. He pointed to the butterflies. \"One hundred butterflies. We need to get them all back. Go!\" Running with the net, Ada began to catch some of the butterflies. By the end of the day, her  _  was filled with butterflies -- including the bright yellow butterfly. There were still 13 butterflies missing. Mr. Patti showed Ada pictures  _  had taken of the missing butterflies. The photographs were so beautiful that she could hardly catch her breath. \"  _  do you get them to stay still(,)?\" Ada asked. \"I'll show you,\" Mr. Patti replied. And he did. He taught my mother everything he knew about photographing butterflies. That's her  _  now. It is good because there still aren't any women playing in the major leagues. \"I'll never forget that day,\" my mother says. \"Breaking that window changed my  _  .\" Then she goes into her workroom, which is filled with swirling butterflies.", 
    "options": [
        [
            "cheer", 
            "play", 
            "work", 
            "act"
        ], 
        [
            "carefully", 
            "high", 
            "hard", 
            "proudly"
        ], 
        [
            "appeared", 
            "joined", 
            "followed", 
            "reached"
        ], 
        [
            "offered", 
            "wanted", 
            "agreed", 
            "refused"
        ], 
        [
            "so", 
            "because", 
            "after", 
            "though"
        ], 
        [
            "net", 
            "box", 
            "room", 
            "yard"
        ], 
        [
            "she", 
            "they", 
            "I", 
            "he"
        ], 
        [
            "How", 
            "When", 
            "Why", 
            "Where"
        ], 
        [
            "job", 
            "hobby", 
            "pleasure", 
            "way"
        ], 
        [
            "project", 
            "purpose", 
            "life", 
            "Plan"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "C", 
        "B", 
        "B", 
        "B", 
        "D", 
        "A", 
        "A", 
        "C"
    ], 
    "source": "middle891"
}