{
    "article": "Sometimes you may not understand your parents. One minute they are friendly, the next minute they're shouting and screaming loudly enough for the whole street to hear. So who makes them so  _  ? You, probably! Is your room untidy? Do you leave things on the floor? You may find it hard enough to keep one room tidy. So imagine what  _  like for your mum and dad trying to keep a whole house in order. When you take your clothes off, remember to  hang them up  . Get into the habit if taking glasses and plates down to the kitchen. Before long you'll be doing it without thinking. Even though you may not realize it, your parents have bought you many clothes. But they're not buying themselves new things every week, are they? The simple truth is that there are more  _  things to spend money on, like the electricity bill and food. You may hate missing a party to visit some boring old relatives. They may go on and on about what a sweet baby you were. You have no choice but to listen. Even if you  _  , your parents won't change their minds. Parents like to show off their family. The best thing you can do is to help entertain(......) your relatives. Your parents will be so pleased with you afterwards that they'll probably allow you to go to the next two  _  . You might not want to eat, but think of it from the parents' point of view. If you cook two meals a day, it  _  730 meals a year. Can you imagine how boring this can get? Imagine how your parents feel when you say you're not really hungry.  In addition  , your parents are probably worried that you aren't eating enough. Eat  _  snacks and leave room for your meals. Finally, offer to  wash the dishes  after the meal. Your offer may not be accepted, but your parents will be pleased.", 
    "options": [
        [
            "friendly", 
            "lonely", 
            "changeable", 
            "comfortable"
        ], 
        [
            "it's", 
            "it", 
            "they're", 
            "that's"
        ], 
        [
            "interesting", 
            "difficult", 
            "important", 
            "surprising"
        ], 
        [
            "agree", 
            "complain", 
            "listen", 
            "win"
        ], 
        [
            "concerts", 
            "meetings", 
            "classes", 
            "parties"
        ], 
        [
            "takes", 
            "costs", 
            "spends", 
            "means"
        ], 
        [
            "more", 
            "less", 
            "fewer", 
            "many"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "C", 
        "B", 
        "D", 
        "D", 
        "C"
    ], 
    "source": "middle2027"
}