{
    "article": "(l5,l;l5) ,,A, B, C, D. This morning I got an e-mail from Roy. It seems that my boy really enjoys his new life at Harvard University. The  _  made me think of the first day when we moved into this house. Little Roy ran around the new house with great  _  and tried to move his own things into the house, such as his toys, books and clothes.  _  , his little hand knocked over a bottle of paint on the shelf. The paint made the tidy floor and white wall a terrible mess. \"Oh, my God!\" My wife rushed in  _  I looked at my son, and his small face was filled with  _  . I  _  and held his hand, \"Take it easy, Roy. Now let's do something to make it look  _  .\" I took out a  _  . \"You see, Dad is a magician, I can change it into a big tree.\" His mother soon helped paint some butterflies and flowers on the wall. We spent the whole afternoon  painting  and laughing. The wall became a beautiful forest with plants, birds and small animals. Blue sky and white clouds  were painted  by Roy. On that day, everybody in the house knew something  _  happened. The night before Roy left for Harvard, he asked me  _  I still remembered the day when he had knocked over the paint. \"Since then I've  _  worried about  making  mistakes,\" he continued, \"I believe I can always  find out  ways to solve the problems.\"", 
    "options": [
        [
            "call", 
            "e-mail", 
            "card", 
            "letter"
        ], 
        [
            "worries", 
            "excitement", 
            "surprise", 
            "sadness"
        ], 
        [
            "Suddenly", 
            "Luckily", 
            "Gladly", 
            "Gradually"
        ], 
        [
            "happily", 
            "sadly", 
            "surprisingly", 
            "angrily"
        ], 
        [
            "joy", 
            "hope", 
            "pleasure", 
            "fear"
        ], 
        [
            "cried", 
            "smiled", 
            "shouted", 
            "laughed"
        ], 
        [
            "nice", 
            "bad", 
            "wrong", 
            "strange"
        ], 
        [
            "drum", 
            "brush", 
            "guitar", 
            "clock"
        ], 
        [
            "dangerous", 
            "basic", 
            "boring", 
            "special"
        ], 
        [
            "when", 
            "what", 
            "why", 
            "if"
        ], 
        [
            "never", 
            "always", 
            "sometimes", 
            "often"
        ]
    ], 
    "answers": [
        "B", 
        "B", 
        "A", 
        "D", 
        "D", 
        "B", 
        "A", 
        "B", 
        "D", 
        "D", 
        "A"
    ], 
    "source": "middle1931"
}