{
    "article": "When Amy wrote her first novel in secondary school, she never imagined that she would become a writer one day. Like many  other  writers on the Internet, the  28-year-old  woman got into this online world accidentally . Three years ago, Amy worked in a medical industry. Her job kept her busy for six months and left her almost  _  to do for the rest of the year. To fill the time, she started writing  _  on the Internet. Her first novel was about her neighbours and their life  _  she is familiar with. Amy has been interested in writing  _  she was a child. At first, she just wanted to share her novels  _  people she knew. Then one day an editor of a famous website emailed her, asking her  if  she would like to sell the electronic copyright of one of her novels. She  _  immediately and the novel was moved to the VIP section of the website. She got $ 1,500 for that. Now Amy is a full-time  _  . So far her eight novels have come out online, and five of them  were printed  . \"The Internet made me famous and brought me  _  ,\" she said. \"I earn much more money now-- about $60,000 a year. I am  _  with my career, but there is one problem -- that my talent might run out after five years and I'll have to  _  to work in the medical industry.\" \"Before that day comes, I'll keep  writing  for the readers with my light and close-to-everyday-life writing style,\" said Amy with a smile.", 
    "options": [
        [
            "something", 
            "anything", 
            "everything", 
            "nothing"
        ], 
        [
            "reports", 
            "novels", 
            "diaries", 
            "plays"
        ], 
        [
            "who", 
            "which", 
            "that", 
            "whom"
        ], 
        [
            "when", 
            "while", 
            "since", 
            "until"
        ], 
        [
            "about", 
            "of", 
            "to", 
            "with"
        ], 
        [
            "agreed", 
            "disagreed", 
            "refused", 
            "left"
        ], 
        [
            "housewife", 
            "editor", 
            "saleswoman", 
            "writer"
        ], 
        [
            "success", 
            "succeed", 
            "successful", 
            "successfully"
        ], 
        [
            "unhappy", 
            "angry", 
            "satisfied", 
            "proud"
        ], 
        [
            "come", 
            "go", 
            "return", 
            "get"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "C", 
        "C", 
        "D", 
        "A", 
        "D", 
        "A", 
        "C", 
        "C"
    ], 
    "source": "middle15"
}