{
    "article": "Swimming is enjoyed by people of all ages, from the young to the old. All over the  _  people swim for fun. There are many  _  where people can enjoy swimming. People swim in lakes, oceans, and  _ . Some swim in pools. Many schools, apartment buildings and clubs  _  indoor or outdoor pools. Some families have pools in their  _ .\nSwimming is one of  the best  forms of exercise. It can improve heart action. It helps blood circulate  . Swimming can  _  develop strong muscles . It will even strengthen the lungs . People who are  _  and can't enjoy other sports can keep their bodies in better condition by  _ .\nIt is a good idea for  _  to learn to swim at an early age. This will be an activity that the children can enjoy for the rest of  _  lives. There are some basic rules for water safety that you must  _ . First of all, know how to swim. Many  _  give lessons to children. Adults can learn to swim at public pools or recreation  centers. Another rule to remember is never swim  _ . Always swim with a friend and know that person is in the water at all times. It is best to swim only in places  _  there is a lifeguard. If you swim in the ocean or a river, it is good to know about tides  and currents .", 
    "options": [
        [
            "village", 
            "earth", 
            "world", 
            "street"
        ], 
        [
            "gardens", 
            "fields", 
            "floors", 
            "places"
        ], 
        [
            "rivers", 
            "hotels", 
            "restaurants", 
            "hospitals"
        ], 
        [
            "like", 
            "have", 
            "want", 
            "help"
        ], 
        [
            "rooms", 
            "playgrounds", 
            "yards", 
            "kitchens"
        ], 
        [
            "too", 
            "also", 
            "either", 
            "never"
        ], 
        [
            "clever", 
            "stupid", 
            "healthy", 
            "disabled"
        ], 
        [
            "playing", 
            "swimming", 
            "running", 
            "exercising"
        ], 
        [
            "boys", 
            "girls", 
            "children", 
            "adults"
        ], 
        [
            "her", 
            "his", 
            "our", 
            "their"
        ], 
        [
            "know", 
            "swim", 
            "play", 
            "leave"
        ], 
        [
            "hospitals", 
            "libraries", 
            "schools", 
            "shops"
        ], 
        [
            "together", 
            "alone", 
            "happily", 
            "sadly"
        ], 
        [
            "which", 
            "that", 
            "where", 
            "how"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "A", 
        "B", 
        "C", 
        "B", 
        "D", 
        "B", 
        "C", 
        "D", 
        "A", 
        "C", 
        "B", 
        "C"
    ], 
    "source": "middle2312"
}