{
    "article": "Monty was the son of a horse trainer. When he was in his ninth grade, he was asked to write a  _  about what he wanted to be and do when he grew up. That night he wrote a seven-page paper saying that someday he'd  _  a horse ranch . He wrote about his dream in great detail and he  _  drew a picture of a 200-acre ranch with all the buildings. He put a great deal of his  _  into the project and the next day he handed it in  _  his teacher. Two days later he received his paper back. On the front page was a large red F with a  _  that read, \"See me after class.\" The boy with the dream went to see the teacher after class and asked, \"  _  did I receive an F?\" The teacher said, \"This is an  _  dream for a young boy like you. You come from a poor family. Owning a horse ranch requires a lot of  _  . You have to buy the land. You have to pay for other things. There is no  _  you could ever do it.\" Then the teacher added, \"  _  you rewrite this paper with a more realistic goal, I will reconsider your grade.\" The boy went home and thought about  _  long and hard. He asked his father what he should do. His father said, \"Look, son, you have to make up your own mind on this. However, I think it is a very important  _  for you.\" Finally, after sitting with it for a week, the boy turned in the  _  paper, making no changes at all. He said to the teacher, \"You can keep the F and I'll keep my  _  .\"", 
    "options": [
        [
            "speech", 
            "paper", 
            "notice", 
            "diary"
        ], 
        [
            "paint", 
            "win", 
            "own", 
            "sell"
        ], 
        [
            "just", 
            "almost", 
            "ever", 
            "even"
        ], 
        [
            "heart", 
            "life", 
            "advice", 
            "trust"
        ], 
        [
            "to", 
            "with", 
            "from", 
            "for"
        ], 
        [
            "word", 
            "letter", 
            "note", 
            "post"
        ], 
        [
            "How", 
            "Why", 
            "When", 
            "Where"
        ], 
        [
            "unusual", 
            "unforgettable", 
            "unimportant", 
            "unrealistic"
        ], 
        [
            "money", 
            "time", 
            "space", 
            "effort"
        ], 
        [
            "wonder", 
            "way", 
            "problem", 
            "matter"
        ], 
        [
            "Though", 
            "since", 
            "Until", 
            "If"
        ], 
        [
            "himself", 
            "him", 
            "it", 
            "itself"
        ], 
        [
            "change", 
            "gift", 
            "message", 
            "decision"
        ], 
        [
            "long", 
            "thick", 
            "same", 
            "correct"
        ], 
        [
            "grade", 
            "dream", 
            "duty", 
            "secret"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "D", 
        "A", 
        "A", 
        "C", 
        "B", 
        "D", 
        "A", 
        "B", 
        "D", 
        "C", 
        "D", 
        "C", 
        "B"
    ], 
    "source": "middle2179"
}