{
    "article": "The back door of the ambulance was suddenly shut and the driver ran to the front, jumped into his seat, and started the engine. Inside were the _ parents, Mr. and Mrs. Green, the mother holding their baby daughter Ally. The little girl had _ food stuck in her throat and could hardly breathe.\nThe driver, Mr. White, turned on his siren and flashing light, and started speeding towards the nearest hospital, fighting against _ . The cars ahead of him pulled out of the way as he drove through the busy traffic . From the back of the _ the parents were shouting at him to _ , since Ally had almost stopped breathing. In front of him he saw some traffic lights, with the red \"STOP\" light shining. Mr. White knew that he had _ time to lose, so he drove straight past the traffic lights, looking to his left and right as he did so.\nComing towards him from his right was a taxi. The driver had the windows _ , since the car was air-conditioned, and he was playing his radio. He did not notice the ambulance. The lights were green, so he drove straight on into the path of the ambulance.\nMr. White tried to stop his ambulance but it was too late. It hit the taxi. Everybody was shaken but no one was hurt. Mr. White turned around to see _ little Ally was. He was surprised to see relief instead of _ on the faces of the parents.\n\"Look!\" cried Mrs. Green. \"She is _ again.\"\n\"It _ have been the crash .\" said her husband. \"It made the food out of her throat.\" The baby's color was turning to _ , and she was crying loudly but healthily. They were all joyful, and quite forgot about the accident, the taxi, and the lines of cars all around them.", 
    "options": [
        [
            "worried", 
            "angry", 
            "happy", 
            "surprised"
        ], 
        [
            "little", 
            "some", 
            "no", 
            "few"
        ], 
        [
            "police", 
            "life", 
            "lights", 
            "time"
        ], 
        [
            "street", 
            "cars", 
            "traffic", 
            "ambulance"
        ], 
        [
            "hurry", 
            "slow", 
            "stop", 
            "drive"
        ], 
        [
            "some", 
            "not", 
            "no", 
            "any"
        ], 
        [
            "open", 
            "clean", 
            "up", 
            "down"
        ], 
        [
            "who", 
            "where", 
            "how", 
            "what"
        ], 
        [
            "pleasure", 
            "anger", 
            "fear", 
            "surprise"
        ], 
        [
            "crying", 
            "breathing", 
            "smiling", 
            "speaking"
        ], 
        [
            "must", 
            "should", 
            "need", 
            "can't"
        ], 
        [
            "usual", 
            "common", 
            "ordinary", 
            "normal"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "D", 
        "D", 
        "A", 
        "C", 
        "C", 
        "C", 
        "C", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "middle438"
}