{
    "article": "\"I will think of it.\"It is easy to say this; but do you know what great things have come from\n _ ? We can not see our own thoughts, or hear, or taste, or feel them; but we do feel the _  our thoughts have!\nSir Isaac Newton was seated in his garden _ a summer's evening. He was thinking about something else when he saw an apple fall from a tree. He began to think. In trying to understand why the apple fell, he _  how the earth, the sun, the moon and the stars were kept in their places.\nA boy named James Watt sat quietly by the fireplace, watching the lid   of the tea kettle as it moved up and down. He began to think; he wanted to find out  why the steam in the kettle moved the heavy lid. From that time he went on thinking and thinking; and when he became a man, he _ the steam engine successfully. From then on it could do the work of many horses _ .\nNext time when you see a steam boat or a steam mill, remember that it would _ have been built without the hard thinking of someone.\nBoys, when you have a _ lesson to learn, don't feel discouraged, and help yourselves before asking someone to help you. Think, and by thinking you will learn how to think to some purpose.", 
    "options": [
        [
            "saying", 
            "thinking", 
            "writing", 
            "reading"
        ], 
        [
            "power", 
            "method", 
            "pressure", 
            "reason"
        ], 
        [
            "in", 
            "at", 
            "on", 
            "for"
        ], 
        [
            "described", 
            "invented", 
            "complained", 
            "discovered"
        ], 
        [
            "increased", 
            "improved", 
            "repaired", 
            "influenced"
        ], 
        [
            "hardly", 
            "busily", 
            "heavily", 
            "easily"
        ], 
        [
            "never", 
            "ever", 
            "still", 
            "yet"
        ], 
        [
            "possible", 
            "difficult", 
            "simple", 
            "useful"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "D", 
        "B", 
        "D", 
        "A", 
        "B"
    ], 
    "source": "middle1340"
}