{
    "article": "The definition of pop music is always changing. Whatever, the most popular music at the time is called  _  music.  _  the early 1900s in America, the popular music was called Ragtime. People played it on piano and was very fast. Some of the songs had  _  and were easy  to sing  . Some of the songs were only music but were easy to dance, too. In the 1920s, a style called \"crooning\" was popular. Men sang it with a very gentle voice. In the 1930s and 1940s, \"jazz\" became popular. Jazz is often fast and people usually play it with a piano and horns. It wasn't stopping  _  the 1950s when people created \"rock and roll\". Elvis Presley is called the \"King of Rock and Roll\". He had many popular songs throughout the years. Rock music changed as the years went  _  . Some different kinds of pop music in the 1960s were called Motown and beach music. In the 1960s, there was also a movement in the United States called the British Invasion. That was when the group The Beatles  became  popular. They were one of the most important  _  in American music history. Today, pop music can be Hip Hop, Rap, R & B, or Country. American young people  _  like listening to pop music. People  _  as Michael Jackson, Madonna and Britney Spears are some of the most well-known singers.", 
    "options": [
        [
            "rock", 
            "jazz", 
            "country", 
            "pop"
        ], 
        [
            "On", 
            "At", 
            "In", 
            "Between"
        ], 
        [
            "words", 
            "fan", 
            "grammar", 
            "sentence"
        ], 
        [
            "until", 
            "when", 
            "while", 
            "in"
        ], 
        [
            "in", 
            "by", 
            "to", 
            "with"
        ], 
        [
            "singer", 
            "music", 
            "songs", 
            "bands"
        ], 
        [
            "especially", 
            "fast", 
            "very", 
            "not"
        ], 
        [
            "so", 
            "see", 
            "example", 
            "such"
        ]
    ], 
    "answers": [
        "D", 
        "C", 
        "A", 
        "A", 
        "B", 
        "D", 
        "A", 
        "D"
    ], 
    "source": "middle440"
}