{
    "article": "My mind seems always to return to the day when I met Carl. The city bus stopped at a corner to  pick up  the passengers .1 was included. After getting on the bus, I looked for a place to sit. At last, I found a seat near the back. The passenger of the  _  next to the one I was going for was an old man in a grey suit. Seated myself, I began to read the book I had been carrying which was Jack Kerouac's On the Road. The man in the seat next to me introduced himself by asking if I  had read  any other book like the one I was holding. When I told him I had, he seemed to become  _  and so did I. He said he was Carl. And asked if I like jazz ,and l told him that I didn't really listen to it and that I like rock and roll. Waiting for Carl to tell me that I  _  listen to real music, I was shocked when he just smiled and nodded. He said, \"You  _  me of myself when I was your age. I remember how my parents hated jazz, how they couldn't see how I could listen to that terrible noise. I bet your parents say the same thing, don't they?\" Now it was my  _  to smile and nod. As the bus took us from one side of the city to the' other, Carl and I talked about a lot of different things. The more we talked, the more amazed I became at  how much  the two of us really had in common, although we had the  _  difference. I haven't seen him  _  we parted, but the thought of our relationship that day never leaves my mind.", 
    "options": [
        [
            "seat", 
            "bus", 
            "city", 
            "book"
        ], 
        [
            "worried", 
            "silent", 
            "interested", 
            "bored"
        ], 
        [
            "mustn't", 
            "shouldn't", 
            "must", 
            "should"
        ], 
        [
            "remember", 
            "warn", 
            "make", 
            "remind"
        ], 
        [
            "turn", 
            "time", 
            "day", 
            "honor"
        ], 
        [
            "race", 
            "age", 
            "sex", 
            "color"
        ], 
        [
            "after", 
            "when", 
            "since", 
            "before"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "D", 
        "D", 
        "A", 
        "B", 
        "C"
    ], 
    "source": "middle2230"
}