{
    "article": "Do you hope to do a lot of homework every evening? Are you interested in your English classes?  _  do you want to teach you? Maybe you have lots of questions to think about  _  school starts. Well, I want to give you some good advice on these problems. First, don't worry about all the questions you have. Put yourself into learning, and you can find  _  you are interested in. Do it actively. Second, try your best to finish your homework  _  . Don't spend a lot of time on it. Do more reading or writing in English. Think about the problems you have and work out them at once. Don't  _  Up late, or you can't study well the next day. Third, invent something instead of copying or repeating. If you can  _  the words in your way, you can tell your  _  you don't like the way of copying them again and again. Be sure that you must  _  the test. I think your teachers will agree with you. And they can give you some  _  work to do. School is really a good place for us to learn.  _  in your teachers and yourself. You are the best one and you can do everything well.", 
    "options": [
        [
            "What", 
            "Which", 
            "Who", 
            "How"
        ], 
        [
            "after", 
            "before", 
            "when", 
            "if"
        ], 
        [
            "everything", 
            "anything", 
            "nothing", 
            "something"
        ], 
        [
            "quickly", 
            "correctly", 
            "honestly", 
            "carefully"
        ], 
        [
            "get", 
            "wake", 
            "stay", 
            "pull"
        ], 
        [
            "remember", 
            "read", 
            "put", 
            "write"
        ], 
        [
            "parents", 
            "classmates", 
            "teachers", 
            "friends"
        ], 
        [
            "take", 
            "finish", 
            "have", 
            "pass"
        ], 
        [
            "more", 
            "interesting", 
            "exciting", 
            "busy"
        ], 
        [
            "Join", 
            "Trust", 
            "Fit", 
            "Believe"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "D", 
        "A", 
        "C", 
        "A", 
        "C", 
        "D", 
        "B", 
        "D"
    ], 
    "source": "middle92"
}