{
    "article": "Computer games are very popular. It is natural for people to want to  _  , so playing against a computer or against a friend on the computer can be  _  to stop. \" Just one more game, \" often turns into another game, then another. Computer games do have their  _  . They are excellent for training hand or eye coordination .Surgeons  _  played computer games as children are often skilled. Computer games can  _  be great for teaching students. The students are open to learning while playing. They can study for longer than a teacher would be able to teach. But like anything  _  in life, things should be balanced. .Too much time on the computer can  _  your eyes. Regular breaks are needed. If students cannot  _  playing computer games, they won't do as well in other areas in their life--not just schoolwork, but in developing important social skill such as how to talk with people and how to work with others. And if they are no longer taking regular exercise,  _  health will become worse. Computer games have their place,  _  people must also remember it is important to have a balanced lifestyle.", 
    "options": [
        [
            "win", 
            "lose", 
            "fight", 
            "beat"
        ], 
        [
            "easy", 
            "necessary", 
            "natural", 
            "difficult"
        ], 
        [
            "rules", 
            "suggestions", 
            "advantages", 
            "freedom"
        ], 
        [
            "who", 
            "which", 
            "when", 
            "where"
        ], 
        [
            "only", 
            "just", 
            "also", 
            "ever"
        ], 
        [
            "else", 
            "specific", 
            "special", 
            "enjoyable"
        ], 
        [
            "relax", 
            "hurt", 
            "close", 
            "open"
        ], 
        [
            "enjoy", 
            "start", 
            "stop", 
            "keep"
        ], 
        [
            "our", 
            "their", 
            "her", 
            "your"
        ], 
        [
            "then", 
            "so", 
            "and", 
            "but"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "C", 
        "A", 
        "C", 
        "A", 
        "B", 
        "C", 
        "B", 
        "D"
    ], 
    "source": "middle2337"
}