{
    "article": "An eight-year-old girl heard her parents talking about her little brother. All she knew was that he was very sick and they had no money. Only a very expensive operation   could _ him now and there was no one to lend them the money.\nWhen she heard her daddy say to her tearful mother, \"Only a miracle   can save him now,\" the little girl went to her bedroom and pulled all her money from its hiding place and counted it _ .\nShe hurried to a drugstore with the money _ her hand.\n\"And what do you want? asked the salesman. \"It's for my little brother,\" the girl answered. \"He's really, really _ and I want to buy a miracle.\"\n\"Pardon?\" said the salesman.\n\"My brother Andrew has _ bad growing inside his head and my daddy says only a miracle can save him. So how much does a miracle _ ?\" \"\n _ we don't sell a miracle here, child. I'm sorry,\" the salesman said with a smile .\n\"Listen, _ it isn't enough, I can try and get some more. Just tell me how much it costs.\"\nA well-dressed man heard it and asked, \"What kind of  miracles does your brother need?\"\n\"I don't know,\" she answered with her eyes full of _ \"He's really sick and mum says he needs an operation. But my daddy can't pay for it, so I have brought all my money.\"\n\"How much do you have?\" asked the man. \"$ 1.11,but I can try and get some _ money,\" she answered.\n\"Well, what a luck \" smiled the man. \"$ 1.11, the price of a miracle for little brothers.\"He took up the girl's hand and said, \"Take me to where you live. I want to see your _ and meet your parents. Let's see if I have the kind of miracle you need.\"\nThat well-dressed man was Dr. Carlton Armstrong, a famous _ The operation was _ and it wasn't long before Andrew was home again.", 
    "options": [
        [
            "give", 
            "save", 
            "lend", 
            "bring"
        ], 
        [
            "happily", 
            "carefully", 
            "easily", 
            "politely"
        ], 
        [
            "in", 
            "with", 
            "through", 
            "out"
        ], 
        [
            "healthy", 
            "sick", 
            "strong", 
            "sad"
        ], 
        [
            "something", 
            "anything", 
            "nothing", 
            "everything"
        ], 
        [
            "spend", 
            "take", 
            "cost", 
            "pay"
        ], 
        [
            "Or", 
            "So", 
            "Though", 
            "Butood"
        ], 
        [
            "before", 
            "after", 
            "if", 
            "when"
        ], 
        [
            "joy", 
            "happiness", 
            "tears", 
            "hope"
        ], 
        [
            "more", 
            "much", 
            "many", 
            "lessm"
        ], 
        [
            "sister", 
            "friend", 
            "classmate", 
            "brotherc"
        ], 
        [
            "actor", 
            "scientist", 
            "doctor", 
            "artist"
        ], 
        [
            "beautiful", 
            "successful", 
            "small", 
            "big"
        ]
    ], 
    "answers": [
        "B", 
        "B", 
        "A", 
        "B", 
        "A", 
        "C", 
        "D", 
        "C", 
        "C", 
        "A", 
        "D", 
        "C", 
        "B"
    ], 
    "source": "middle2040"
}