{
    "article": "At present, almost everyone has a mobile phone, but have you ever thought that cell phones  _  be bad for your health? A study shows that heavy mobile phone use may cause hearing loss . This study shows that people who use cell phones for about an hour a day have a  _  time hearing some similar sounds, especially in their right ears. It is getting harder for  _  to tell the difference between the sounds of\"s\"and\"f\",and\"t\"and\"z\". Researchers studied 100 people who used cell phones and  _  them with 50 people who did not. The study lasted for 12 months. What the researchers found was that cell phone users had more hearing  _  than those who did not use cell phones. Besides this, our ears have many little  _  inside them. Too much noise will cause these hairs to get weak and  _  die. When these hairs die, it affects our ability to listen. However, cell phone users don't care too much  _  this study. One man said,\"I'd be more worried about people who  _  MP3 players. They put those earphones in their ears and listen to very  _  music. I think that is more likely to cause hearing loss than a cell phone.\"", 
    "options": [
        [
            "should", 
            "need", 
            "might", 
            "must"
        ], 
        [
            "busier", 
            "happier", 
            "harder", 
            "shorter"
        ], 
        [
            "us", 
            "you", 
            "it", 
            "them"
        ], 
        [
            "compared", 
            "suggested", 
            "showed", 
            "taught"
        ], 
        [
            "advantages", 
            "problems", 
            "rules", 
            "experiences"
        ], 
        [
            "noises", 
            "pains", 
            "hairs", 
            "pimples"
        ], 
        [
            "hardly", 
            "actually", 
            "clearly", 
            "finally"
        ], 
        [
            "to", 
            "with", 
            "about", 
            "of"
        ], 
        [
            "produce", 
            "use", 
            "discover", 
            "see"
        ], 
        [
            "beautiful", 
            "soft", 
            "loud", 
            "light"
        ]
    ], 
    "answers": [
        "C", 
        "C", 
        "D", 
        "A", 
        "B", 
        "C", 
        "D", 
        "C", 
        "B", 
        "C"
    ], 
    "source": "middle356"
}