{
    "article": "Norman Bethune is one of China's most famous heroes, but he wasn't Chinese--he was Canadian. He gave his life to helping Chinese people. Norman Bethune  was  born in 1890. He became a  _  in 1916, and he went to the front to look after injured soldiers in the First World War. He saw many soldiers die in the war. Later he invented new treatments to  _  soldiers, and medical tools to use outside hospitals. In 1938 he came to China to treat the Chinese soldiers in the mountains north of Yan'an. There were  _  doctors, so he had to work very hard. He opened hospitals to give treatment to local people and soldiers, and to train doctors and nurses. He also wrote books so that doctors can learn about new treatments. Dr Bethune worked very hard without stopping to  _  . Once, he performed operations  _  69 hours without stopping, and saved 112 people. He  _  working in spite of cutting his hand during an operation. In the end, he died because he did not take care of his  _  . Dr Bethune's work with the Chinese soldiers made  _  a hero in China. There are books and films about him, and he is  _  remembered in both Canada and China.", 
    "options": [
        [
            "doctor", 
            "nurse", 
            "teacher", 
            "worker"
        ], 
        [
            "understand", 
            "believed", 
            "help", 
            "count"
        ], 
        [
            "little", 
            "few", 
            "much", 
            "many"
        ], 
        [
            "rest", 
            "act", 
            "with", 
            "for"
        ], 
        [
            "from", 
            "since", 
            "with", 
            "for"
        ], 
        [
            "allowed", 
            "continued", 
            "forgot", 
            "stopped"
        ], 
        [
            "face", 
            "leg", 
            "foot", 
            "hand"
        ], 
        [
            "his", 
            "he", 
            "him", 
            "one"
        ], 
        [
            "still", 
            "never", 
            "hardly", 
            "regularly"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "B", 
        "A", 
        "D", 
        "B", 
        "D", 
        "C", 
        "A"
    ], 
    "source": "middle2207"
}