{
    "article": "I am sitting in an empty football field after my last high school football game that finished a few hours ago. I'm the mid-field player on my team. But in fact that's not  _ now. I was the mid-field player because, as I said, this was my  _ game. That's a good way to end a high school football career  , especially if you win, but even though you don't, it's  _ to leave at a high point.\nI was eight when I first started playing football. My dad _ football, and he used to practice with me at home - passing, catching, running. We used to practice almost every evening  _ it got too dark. He tried to teach me everything he knew about the _ . \"Just remember: don't ever give up .\" \"Stay in the game. Don't lose your concentration  .\" \"Go out there and give 110 percent every time.\" Well, that was a long time ago, but I still hear his words _ in my ears.\nI had a lot on my mind _ the game today. I don't like things to end, I guess, and this was the last game. I was talking to myself and warning myself about what to do and not to do. I didn't sleep at all last night , and when the sun came up this morning, I reached the point where  _ just wanted it all to be over, finished, done. But then when the game started, my mind became _ . I just lived in this game, this moment. I didn't hear the crowd, I didn't feel the cold or the pain, I never felt tired. I just kept my eyes on the _  , and it was just me and the ball and, inside, a soft, white light _ me the way to the goal. It was a beautiful, empty feeling.\nIt's all over now, and it's really getting cold here. It's starting to snow. The sun's almost gone, and I can _ see the goal. Now it's dark and I'm sitting here all alone. Well, I guess it's time to say good-bye and move on.", 
    "options": [
        [
            "true", 
            "wrong", 
            "strange", 
            "clear"
        ], 
        [
            "first", 
            "last", 
            "worst", 
            "favorite"
        ], 
        [
            "good", 
            "bad", 
            "lucky", 
            "painful"
        ], 
        [
            "needed", 
            "hated", 
            "missed", 
            "loved"
        ], 
        [
            "until", 
            "when", 
            "unless", 
            "although"
        ], 
        [
            "football", 
            "game", 
            "goal", 
            "score"
        ], 
        [
            "ringing", 
            "saying", 
            "falling", 
            "coming"
        ], 
        [
            "from", 
            "before", 
            "through", 
            "after"
        ], 
        [
            "we", 
            "they", 
            "I", 
            "he"
        ], 
        [
            "empty", 
            "full", 
            "asleep", 
            "awake"
        ], 
        [
            "way", 
            "field", 
            "ball", 
            "match"
        ], 
        [
            "sending", 
            "teaching", 
            "pointing", 
            "showing"
        ], 
        [
            "already", 
            "hardly", 
            "never", 
            "clearly"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "A", 
        "D", 
        "A", 
        "B", 
        "A", 
        "B", 
        "C", 
        "A", 
        "C", 
        "D", 
        "B"
    ], 
    "source": "middle647"
}