{
    "article": "Nicole, a 67-year-old Scot, has taught in Jinan for 15 years. He  _  living and working in China a lot. In 1997, Nicole was teaching Latin and Greek in a Scotland school when he was offered a job to teach in Shandong Economic University for  one year  . Even though Nicole had no idea of what kind of  _  Jinan was, he decided to give it a try, because he thought if things weren't good enough, he could always return to Scotland in one year. However, things  turned out  to be quite different. The result: he has been enjoying the city and his work both for 15 years. During his 15 years in Jinan, Nicole has set up his own teaching  _  . He always encourages his students who want to improve their  _  English to speak out  _  in classes. \"As an  _  language teacher, I do think grammar is important in writing,\" Nicole says. \"Many English teachers don't have real experience of teaching. They do know something is wrong, but they don't know how to  _  it.\" In Nicole's classes, nobody is  _  to speak Chinese. If students cannot express themselves with one example, they are asked to try  _  example until they understand. Another reason for Nicole's popularity  _  his students is that he is more of a kind-hearted \"grandpa\" to them.  _  he learns that some students cannot afford tuition , he helps them overcome the difficulty and continue with their college education. Though Nicole has  _  15 years in Jinan, he is not sure how many more years he will be in the city. But he is sure that his days in Jinan have in many ways been the  _  of his life.", 
    "options": [
        [
            "hates", 
            "hopes", 
            "enjoys", 
            "wants"
        ], 
        [
            "country", 
            "city", 
            "town", 
            "village"
        ], 
        [
            "plan", 
            "activity", 
            "aim", 
            "style"
        ], 
        [
            "writing", 
            "written", 
            "speaking", 
            "spoken"
        ], 
        [
            "happily", 
            "carefully", 
            "politely", 
            "bravely"
        ], 
        [
            "exchanged", 
            "old", 
            "experienced", 
            "unusual"
        ], 
        [
            "explain", 
            "read", 
            "speak", 
            "teach"
        ], 
        [
            "advised", 
            "allowed", 
            "asked", 
            "told"
        ], 
        [
            "more", 
            "another", 
            "other", 
            "some"
        ], 
        [
            "among", 
            "between", 
            "of", 
            "in"
        ], 
        [
            "Wherever", 
            "Whenever", 
            "Whoever", 
            "However"
        ], 
        [
            "spent", 
            "taken", 
            "cost", 
            "paid"
        ], 
        [
            "saddest", 
            "loneliest", 
            "happiest", 
            "loveliest"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "D", 
        "D", 
        "D", 
        "C", 
        "A", 
        "B", 
        "B", 
        "A", 
        "B", 
        "A", 
        "C"
    ], 
    "source": "middle1848"
}