{
    "article": "If we take a close look at successful language learners, we may discover a few techniques   which make language learning easier for them.\n First of all , successful language learners are independent learners. They do not depend on books or teachers; they _ their own way to learn the language. They try to find the patterns and the rules for themselves instead of waiting for the teacher to explain everything. They are good guessers who look for clues and form their _ conclusions which are very different from others'.\nSuccessful language learning is an _ learning. Therefore, successful learners do not wait for\na _ to use the language; they look for such a chance. They find people who speak the language and ask these people to correct them _ they make mistakes. They will try anything to communicate. When communication is difficult, they can _ information that is incomplete  .It is more important for them to learn to _ in the language than to know the _ of every word.\nFinally, successful language learners are learners with a _ .They want to learn a language because they are interested in the language and the people who _ it. It is necessary for them to learn the language in order to communicate with these people and to learn from them. They find it _ to practise using the language regularly because they want to learn with it.", 
    "options": [
        [
            "explain", 
            "invent", 
            "discover", 
            "change"
        ], 
        [
            "correct", 
            "own", 
            "only", 
            "main"
        ], 
        [
            "ideal", 
            "informal", 
            "early", 
            "active"
        ], 
        [
            "place", 
            "way", 
            "person", 
            "chance"
        ], 
        [
            "until", 
            "whether", 
            "before", 
            "when"
        ], 
        [
            "break", 
            "check", 
            "download", 
            "accept"
        ], 
        [
            "agree", 
            "ask", 
            "think", 
            "read"
        ], 
        [
            "usage", 
            "meaning", 
            "grammar", 
            "pronunciation"
        ], 
        [
            "purpose", 
            "certificate", 
            "guide", 
            "question"
        ], 
        [
            "say", 
            "talk", 
            "call", 
            "speak"
        ], 
        [
            "interesting", 
            "easy", 
            "hard", 
            "impossible"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "D", 
        "D", 
        "D", 
        "D", 
        "C", 
        "B", 
        "A", 
        "D", 
        "B"
    ], 
    "source": "middle1455"
}