{
    "article": "Teenagers usually experience changes on all levels --- physical and emotional . Some may feel uncomfortable when in new situations, such as talking to strangers. But with small talk, you may  _  fit into the new environment. Small talk is a light conversation for social occasions .  _  it usually doesn't have much detail , it is the starting point for friendships Children can use small talk to  _  a conversation in many different ways. Asking open questions is one of the most useful ways. For example, you are at someone's birthday party, but you know  _  people. How do you break the ice? You can start a conversation with \"This is a great party. How do you know the host?\" This way is also  _  in many other situations, such as school clubs or picnics. Sometimes, simply an  _  works, especially to help find common ground with others. For example, when going into a new environment, you can introduce yourself by saying \"I am in Class 2. My  _  teacher is Mr Black.\" The other person may say, \"Oh, really? He is also my math teacher. He is very strict ...\" See? A good conversation begins. The third way is to find your strong points and  _  it to others. This is useful when you want to  _  a group. For example, you see boys playing soccer on the school playground. Just say, \"Do you need more players? I am a very good goalkeeper .\" So next time, don't be  _  when meeting strangers. Just try small talk. A stranger may become your next friend.", 
    "options": [
        [
            "nearly", 
            "slowly", 
            "easily", 
            "hardly"
        ], 
        [
            "But", 
            "Although", 
            "Because", 
            "And"
        ], 
        [
            "have", 
            "start", 
            "end", 
            "stop"
        ], 
        [
            "some", 
            "any", 
            "little", 
            "few"
        ], 
        [
            "helpful", 
            "helpless", 
            "interesting", 
            "boring"
        ], 
        [
            "information", 
            "action", 
            "education", 
            "introduction"
        ], 
        [
            "Chinese", 
            "history", 
            "math", 
            "English"
        ], 
        [
            "show", 
            "give", 
            "sell", 
            "offer"
        ], 
        [
            "take", 
            "join", 
            "know", 
            "love"
        ], 
        [
            "surprised", 
            "comfortable", 
            "nervous", 
            "relaxed"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "B", 
        "D", 
        "A", 
        "D", 
        "C", 
        "A", 
        "B", 
        "C"
    ], 
    "source": "middle357"
}