{
    "article": "Some people bring out the best in you in a way that you might never have fully realized on your own. My mom was one of those people. My father died when I was nine months old, making my mom a single mother at the age of eighteen. While I was growing up, we lived a very  _  life. We had little money, but my mom gave me a lot of love. Each night, she sat me on her lap and spoke the words that would  _  my life, \"Kemmons, you are certain to be a great man and you can do anything in life if you work hard enough to get it.\" At fourteen, I was hit by a car and the doctors said I would never  _  again. Every day, my mother spoke to me in her gentle, loving voice, telling me that no matter what those doctors said, I could walk again if I didn't want to be bad enough. She  _  that message so deep into my heart that I finally believed her. A year later, I returned to school-walking on my own! When the Great Depression  _  , my mom lost her job. Then I left school to support both of us. At that moment, I decided never to be  _  again. Over the years, I experienced various levels of business success. But the real  _  point happened on a vacation I took with my wife and five kids in 1916. I was dissatisfied with the second-class hotels for families and was angry that they charged an extra $2 for each child. That was too  _  for most American families. I told my wife that I was going to open a hotel for families that would never charge extra for  _  . There were plenty of doubters at that time. Not  _  , mom was one of my strongest supporters. She worked behind the desk and even designed the room style. As in any business, we experienced a lot of hard time. But with my mother's words deeply rooted in my heart, I  _  doubted we would succeed. Fifteen years later, we had the largest hotel system in the world - Holiday Inn. In 1979 my company had 1,759 inns in more than fifty countries with an income of $1 billion a year. You may not have started out life in the best situations. But if you can find a  _", 
    "options": [
        [
            "quiet", 
            "boring", 
            "hard", 
            "strange"
        ], 
        [
            "accept", 
            "change", 
            "disturb", 
            "check"
        ], 
        [
            "study", 
            "speak", 
            "listen", 
            "walk"
        ], 
        [
            "drove", 
            "expected", 
            "explained", 
            "covered"
        ], 
        [
            "did", 
            "hit", 
            "cut", 
            "fit"
        ], 
        [
            "excited", 
            "brave", 
            "patient", 
            "poor"
        ], 
        [
            "leading", 
            "breaking", 
            "turning", 
            "celebrating"
        ], 
        [
            "expensive", 
            "fantastic", 
            "different", 
            "special"
        ], 
        [
            "husband", 
            "parents", 
            "children", 
            "wife"
        ], 
        [
            "successfully", 
            "surprisingly", 
            "interestingly", 
            "importantly"
        ], 
        [
            "always", 
            "sometimes", 
            "almost", 
            "never"
        ], 
        [
            "task", 
            "hotel", 
            "company", 
            "wor"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "D", 
        "A", 
        "B", 
        "D", 
        "C", 
        "A", 
        "C", 
        "B", 
        "D", 
        "A"
    ], 
    "source": "middle1042"
}