{
    "article": "A team of students who were successful in their work got together to visit their old teacher after graduating from college many years later. The talk soon turned into complaints about _ in work and life.\nBefore offering his students coffee, the teacher went to the kitchen and returned with a large pot of coffee and different kinds of cups--plastic, glass, porcelain , crystal , some common and cheap, some beautiful and _ --telling them to help themselves to the coffee.\nAfter all the guests had a cup of coffee in hand, the teacher said: \"If you noticed, all the nice-looking expensive cups were taken, leaving behind the common and cheap ones. While it is _ for you to want only the best for yourselves, that is where your problems and stress come from. We all know that the cup itself _ no quality to the coffee. In most cases _ is just more expensive and in some cases even hides what we drink. What all of you _ wanted was coffee, not the cup, but you all went for the best cups. And then you began looking at each other's cups.\"\nNow consider this: _ is the coffee; the jobs, money and position in society are the cups. They are just tools to hold life, and the type of cup we have does not decide, nor change the quality of life we live. Sometimes, by only paying attention to the cup, we _ to enjoy the coffee God has provided us.\nGod makes the coffee, not the cups. Enjoy your coffee!\n\"The _ people don't have the best of everything. They just _ the best of everything.\"\nLive simply. Love generously. Care deeply. Speak kindly. Leave the rest to God.", 
    "options": [
        [
            "stress", 
            "difficulty", 
            "sadness", 
            "loss"
        ], 
        [
            "excellent", 
            "bright", 
            "expensive", 
            "comfortable"
        ], 
        [
            "careful", 
            "natural", 
            "polite", 
            "formal"
        ], 
        [
            "increases", 
            "affords", 
            "adds", 
            "provides"
        ], 
        [
            "this", 
            "it", 
            "either", 
            "one"
        ], 
        [
            "possibly", 
            "generally", 
            "really", 
            "hardly"
        ], 
        [
            "Life", 
            "Joy", 
            "Chance", 
            "Success"
        ], 
        [
            "fail", 
            "hope", 
            "need", 
            "learn"
        ], 
        [
            "coolest", 
            "richest", 
            "saddest", 
            "happiest"
        ], 
        [
            "have", 
            "use", 
            "make", 
            "put"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "B", 
        "C", 
        "B", 
        "C", 
        "A", 
        "A", 
        "D", 
        "C"
    ], 
    "source": "middle2311"
}