{
    "article": "What do Chinese college graduates have in common with ants? The book \"Ant Family\" is about the _ of some young people who go to Beijing after leaving university.\nThe book, which is based on two years on interviews _ about 600 low-income college graduates in Beijing, came out in mid-September.\nThe setting  of the book is several so-called \"villages for college students\" in outskirts of Beijing, where a large number of college graduates _ . Most of these graduates work for small or medium-sized businesses, getting less then 2,000 yuan a month. They live together because it's cheap. Many of them travel several _ a day for short-term jobs or job interviews.\n According to the book, around 60% of these college graduates are _ rural areas and smaller towns around China.. Back home, many of them are the pride of their families and possibly the best hope for the family. Many of them _ their jobs during the financial crisis in late 2008.\nDeng Kun, a 24- year-old college graduate, is an \"ant\" featured in the book. _ graduating from his university in Yunnan Province, he came to Beijing and lived in Tangjialing which is a small village 20 km from Tian'anmen Square because of the low _ of living there. Though he had many setbacks over the past two years, he is still _ .\nThanks to this book, the idea of \"ant family\" has been widely known among Chinese college graduates.", 
    "options": [
        [
            "life", 
            "time", 
            "dream", 
            "work"
        ], 
        [
            "for", 
            "among", 
            "with", 
            "without"
        ], 
        [
            "play", 
            "live", 
            "travel", 
            "study"
        ], 
        [
            "minutes", 
            "seconds", 
            "times", 
            "hours"
        ], 
        [
            "to", 
            "in", 
            "from", 
            "with"
        ], 
        [
            "got", 
            "lost", 
            "left", 
            "forgot"
        ], 
        [
            "For", 
            "If", 
            "Before", 
            "After"
        ], 
        [
            "price", 
            "situation", 
            "cost", 
            "pay"
        ], 
        [
            "hopeful", 
            "disappointed", 
            "excited", 
            "sad"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "B", 
        "D", 
        "C", 
        "B", 
        "D", 
        "C", 
        "A"
    ], 
    "source": "middle1526"
}