{
    "article": "One afternoon I took a trip to an art museum while waiting for my husband to finish a business meeting. I was expecting  a _ view of the masterpieces .\nA young couple looking at the _ in front of me chatted non-stop. I watched them for a moment and realized the wife was doing all the talking. I admired this man for being so _ with her. Bored by their noise, I moved on.\nI met them several times as I moved through those rooms of art. Each time I heard her voice, I moved away quickly.\nI was standing at the museum gift shop buying some cards when the couple walked to the exit .\n\" He's a brave man, \" the clerk said. \"Most of us would give up our interests if we were blind at such a young age. But behind his wife he comes in _ here's a new art show. \"\n\"But he can't see. \" I said in surprise.\n\" His wife _ each painting so that he can see it in his head. \"\nI learned _ about patience, courage and love that day. I saw the patience of a young wife describing paintings to a person withoutsightand the courage of a husband who would not allow blindness to change his _ . And I saw the love shared by two people as I _ this couple walk away holding each other's hands.", 
    "options": [
        [
            "crowded", 
            "quiet", 
            "noisy", 
            "silent"
        ], 
        [
            "gifts", 
            "maps", 
            "books", 
            "Paintings"
        ], 
        [
            "strict", 
            "patient", 
            "careful", 
            "excited"
        ], 
        [
            "whatever", 
            "wherever", 
            "whenever", 
            "whether"
        ], 
        [
            "talks", 
            "shows", 
            "describes", 
            "tells"
        ], 
        [
            "nothing", 
            "everything", 
            "something", 
            "anything"
        ], 
        [
            "mind", 
            "eyes", 
            "life", 
            "decision"
        ], 
        [
            "met", 
            "knew", 
            "researched", 
            "Watched"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "B", 
        "C", 
        "C", 
        "C", 
        "C", 
        "D"
    ], 
    "source": "middle1191"
}