{
    "article": "Qi Haoran, a Junior One student at High School was quite busy over the last winter vacation, not just with homework. Qi, together with ten other classmates made a  _  group to call on people to join the Clean Your Plate Campaign . The  _  students went to many restaurants and told the people the importance of  _  food. \" Excuse me, do you know that 950 million people around the world still haven't got enough to  _  ? Could you please not  _  food? \" They would say this kind of thing hundreds of times every day.  _  ,the activity has got the support of many people. In a restaurant in Xinjing, the owner gives the guests who have eaten all the food they ordered a ticket. People can enjoy a  _  meal when they have ten tickets. More than 750 restaurants in Beijng have begun to offer  _  dishes and encourage their guests to take leftovers home. Wasting food is a serious problem around the  _  , not only in China. It's said that 1.3 billion tons of food ends up as waste last year. This is as  _  as one third of all the food in the world. The UN Environment Program and the Food and Agriculture Organization held a \" Think, Eat, Save\" program in January, 2013 to help reduce food waste.", 
    "options": [
        [
            "volunteer", 
            "band", 
            "dance", 
            "sport"
        ], 
        [
            "ten", 
            "eleven", 
            "twelve", 
            "thirteen"
        ], 
        [
            "planting", 
            "cooking", 
            "buying", 
            "saving"
        ], 
        [
            "eat", 
            "wear", 
            "spend", 
            "sleep"
        ], 
        [
            "buy", 
            "waste", 
            "order", 
            "sell"
        ], 
        [
            "Luckily", 
            "Slowly", 
            "Unluckily", 
            "Quietly"
        ], 
        [
            "delicious", 
            "sweet", 
            "free", 
            "rich"
        ], 
        [
            "larger", 
            "smaller", 
            "cleaner", 
            "cheaper"
        ], 
        [
            "city", 
            "country", 
            "world", 
            "restaurant"
        ], 
        [
            "often", 
            "expensive", 
            "many", 
            "much"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "D", 
        "A", 
        "B", 
        "A", 
        "C", 
        "B", 
        "C", 
        "D"
    ], 
    "source": "middle1596"
}