{
    "article": "I always felt sorry for people in wheelchairs. Some people, old and weak, cannot get around by themselves. others seem perfectly healthy, dressed in business suits. But whenever I saw someone in a wheelchair, I didn't want to treat him or her as a real person.\nThen I fainted  at Euro Disney because of low blood pressure. This was the first time I had ever fainted, and my parents said that I must _ for a while after First Aid. _ I stepped towards the door, I saw my dad pushing a wheelchair in my direction!\nI could not believe this was happening to me. Wheelchairs were _ for other people but not for me. As my father wheeled me out into the main street, people began to treat me differently at once. People looked down at me, pity in their eyes. Then they would look away, maybe because they thought the _ they forgot me, the better I will feel.\n\"I am just like you!\" I wanted to scream. \"The only _ is that you've got legs, and I have wheels. \"\nLooking out at the faces, I finally understood: I was once just like them. I _ people in wheelchairs exactly the way they did not want to be treated. I realized it is some of us with two healthy legs who are _ disabled. We should respect every one.", 
    "options": [
        [
            "sleep", 
            "break", 
            "leave", 
            "rest"
        ], 
        [
            "as", 
            "until", 
            "after", 
            "before"
        ], 
        [
            "sad", 
            "fine", 
            "light", 
            "cheap"
        ], 
        [
            "faster", 
            "happier", 
            "sooner", 
            "harder"
        ], 
        [
            "choice", 
            "advantage", 
            "difference", 
            "difficulty"
        ], 
        [
            "needed", 
            "thought", 
            "greeted", 
            "treated"
        ], 
        [
            "badly", 
            "truly", 
            "mostly", 
            "likely"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "B", 
        "A", 
        "C", 
        "D", 
        "B"
    ], 
    "source": "middle767"
}