{
    "article": "I used to watch a little girl  play  basketball every day from my kitchen window.One day I asked her why she practised so  _  .She said: \"I would like to go to college.The only way is  to get  A scholarship.I like basketball and I want to be the  _  player in college.My dad told me: 'If the dream is big enough, the facts don't count.' \" She  _  changed her mind.I watched her through those junior high years and into senior high school.One day before she graduated  _  high school, I saw her sitting on the grass  _  .I asked her what was wrong.She told me her coach said she was such a  _  girl that she couldn't be a good basketball player, so she should  stop  dreaming about going to college.She was heartbroken and it  also  made me feel sad.Then she smiled and told me her father said that coach was wrong.He did not understand the power of dream.Her father said to her: \"If you really want to  play for  the scholarship of a good college, nothing but you  _  can stop your dream.\" The next year, she and her team went to a big game.She  was seen  by a coach of a famous college team and was offered a scholarship to the  _  basketball team of their college.She was about to get the college education that she had dreamed  _  And worked towards for all those years.\"If the dream is big enough, the facts don't count.\" It is true.", 
    "options": [
        [
            "many", 
            "much", 
            "little", 
            "few"
        ], 
        [
            "most", 
            "good", 
            "best", 
            "better"
        ], 
        [
            "never", 
            "ever", 
            "always", 
            "already"
        ], 
        [
            "in", 
            "to", 
            "from", 
            "into"
        ], 
        [
            "sad", 
            "sadly", 
            "happily", 
            "happy"
        ], 
        [
            "tall", 
            "short", 
            "strong", 
            "creative"
        ], 
        [
            "your", 
            "yourself", 
            "own", 
            "yours"
        ], 
        [
            "women's", 
            "woman's", 
            "womans'", 
            "woman"
        ], 
        [
            "to", 
            "on", 
            "of", 
            "for"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "C", 
        "B", 
        "B", 
        "B", 
        "A", 
        "C"
    ], 
    "source": "middle1480"
}