{
    "article": "Once I spoke at a high school. After the speech, the principal asked me to see a special student. An  _  had kept the boy home, but he had expressed an interest in meeting me, and it would mean a great deal to him. I agreed. He was Matthew.  _  he was born, the doctor told his parents that he would not live to see five, then they were told  _  would not make it to ten. Now he was thirteen. He wanted to meet me because I was a gold-medal weight lifter. I spent over an hour talking to Matthew. He spoke about  _  and succeeding and seeking his dreams. When we finished talking, I went to my  _  and pulled out the first gold medal I won and put it around his neck. I told him he was more of a winner and knew more about  _  and overcoming obstacles than I ever would. He looked at it for a while, then took it off and handed it  _  to me. He said, \"You are a champion. You earned that medal. Someday when I get to the Olympics and win my own medal, I will show it to you.\" Last summer I got the news that Matthew had  passed away  and a letter Matthew had written to me a few days before: Dear Rick, My mom said I should send you a thank-you letter. The doctors are  _  to tell me that I don't have long to live any more. But I still smile as much as I can. I told you that in the future I was going to the Olympics and win a gold medal. But I know now I'll  _  . I know I'm a champion, and God knows that too. When I get to Heaven, God will give me my medal and when you get there, I will show it to you. Thank you for loving me. Your friend Matthew", 
    "options": [
        [
            "excuse", 
            "effect", 
            "operation", 
            "illness"
        ], 
        [
            "While", 
            "When", 
            "Although", 
            "Because"
        ], 
        [
            "they", 
            "he", 
            "she", 
            "him"
        ], 
        [
            "winning", 
            "teaching", 
            "playing", 
            "working"
        ], 
        [
            "home", 
            "desk", 
            "classroom", 
            "bag"
        ], 
        [
            "failure", 
            "success", 
            "luck", 
            "smile"
        ], 
        [
            "around", 
            "in", 
            "back", 
            "down"
        ], 
        [
            "surprised", 
            "brave", 
            "sorry", 
            "happy"
        ], 
        [
            "never", 
            "ever", 
            "often", 
            "seldom"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "B", 
        "A", 
        "D", 
        "B", 
        "C", 
        "C", 
        "A"
    ], 
    "source": "middle994"
}