{
    "article": "Yesterday my son and I went to the supermarket. A little girl with her mother was in line in front of _ The little girl was asking her mother for a box of Smarties. The polite way she was asking _ broke the mother's heart. \"Sorry, honey. But we haven't enough money to get it.\"\nMy son heard that dialogue. By the way, he had made some money to _ himself a bike by cleaning our garden once a week. As he watched the mother and daughter leave the _ , he rushed to the candy counter  and bought a box of Smarties with his money. Then he ran quickly and caught up with the little girl and her mother, and sent them the _ . He came back and told me what he told them, \"Every kid should have a pack of Smarties because they can _ you smart.\"\nI was so _ that I bought a pack of Smarties for my son. I told him that I was proud of him because of his good action just now. He replied, \" When we do nice things for others, we shouldn't wish to be returned.\" I explained, \"When you do something nice for someone, you shouldn't expect to get anything, but when you get something from others, you should be very _ \"", 
    "options": [
        [
            "her", 
            "him", 
            "us", 
            "me"
        ], 
        [
            "almost", 
            "hardly", 
            "sometimes", 
            "never"
        ], 
        [
            "pay", 
            "spend", 
            "take", 
            "buy"
        ], 
        [
            "supermarket", 
            "house", 
            "square", 
            "centre"
        ], 
        [
            "money", 
            "box", 
            "garden", 
            "bike"
        ], 
        [
            "set", 
            "make", 
            "build", 
            "move"
        ], 
        [
            "careful", 
            "excellent", 
            "happy", 
            "interesting"
        ], 
        [
            "bright", 
            "different", 
            "thankful", 
            "useful"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "A", 
        "B", 
        "B", 
        "C", 
        "C"
    ], 
    "source": "middle1355"
}