{
    "article": "Will you put others' needs before your own? _ will you get if you do? Here is an experience of mine.\nIt was a wet day and I had a _ time. I was busy and everyone I talked to was in a bad mood. What's more, I went to work without breakfast and I left my _ at home. So I couldn't get lunch and was terribly hungry.\nWhen I _ work,I called to ask my wife to meet me at the door with some money so that I could quickly go to buy _ . Then I quickly made my way home in hope of eating my _ meal of the day at 5:00 p.m.\nAs I was halfway home, my wife told me by phone that a friend of ours was in _ and needed a lift home. My mind said,\"I will help him _ I get the meal.\" But my mouth said,\"All right, I'll give him a _ .\"\nHe jumped in the car with a smile on his face and repeated how _ he was that I would drive him home. He told me he usually walked home from his company but that day the _ stopped him from making that journey because he didn't have an umbrella.\nThere _ a lot of traffic. A drive to him normally took 10 minutes but that day it took 30 minutes.\nNow you would guess the person that I was helping is a _ friend of mine. But,in fact,he is a friend of a friend.\nI wonder if I will see this person again but I feel glad that I was there when he _ me.\nSo you will feel yourself helpful and useful when you _ more about others.", 
    "options": [
        [
            "How", 
            "Which", 
            "Why", 
            "What"
        ], 
        [
            "fun", 
            "quiet", 
            "hard", 
            "good"
        ], 
        [
            "keys", 
            "glasses", 
            "wallet", 
            "notebook"
        ], 
        [
            "finished", 
            "over", 
            "complete", 
            "finishing"
        ], 
        [
            "gifts", 
            "clothes", 
            "fruit", 
            "dinner"
        ], 
        [
            "hot", 
            "first", 
            "simple", 
            "free"
        ], 
        [
            "trouble", 
            "danger", 
            "fear", 
            "treatment"
        ], 
        [
            "since", 
            "after", 
            "before", 
            "when"
        ], 
        [
            "choice", 
            "greeting", 
            "ride", 
            "suggestion"
        ], 
        [
            "sorry", 
            "thankful", 
            "surprised", 
            "pleased"
        ], 
        [
            "rain", 
            "time", 
            "work", 
            "traffic"
        ], 
        [
            "had", 
            "have", 
            "were", 
            "was"
        ], 
        [
            "new", 
            "lovely", 
            "close", 
            "common"
        ], 
        [
            "chose", 
            "phoned", 
            "joined", 
            "needed"
        ], 
        [
            "learn", 
            "worry", 
            "care", 
            "talk"
        ]
    ], 
    "answers": [
        "D", 
        "C", 
        "C", 
        "A", 
        "D", 
        "B", 
        "A", 
        "B", 
        "C", 
        "B", 
        "A", 
        "D", 
        "C", 
        "D", 
        "C"
    ], 
    "source": "middle855"
}