{
    "article": "Life is short.Are you doing what you love? Are you living actively?\nIf not, why? I am guessing most people will answer , \"I have to earn more money to _ cars and beautiful buildings.My kids are asking for money.\"To be honest, in our society, people have to do plenty of _ things.They even have to make sacrifices .\nTo tell the truth, you make a mistake.It is very crucial to deal with  _ you do.Take care of your duties and be happy with your job all the time.You spend over 1/3 of our day, at least five days a week working for our lives.In my opinion, you are wasting time, because you don't like it in the _ Why not spend the time doing something you are really interested in instead of something _ bores you?\nThere is only one main reason that you are _ of failure .You _ about what the other people say too much.Besides that, you are afraid you are in trouble, but your friends will not help you _ .I'm very glad to hear what you worry about.You will fail at times and sometimes others will think you are crazy , but believe you will succeed in the end as long as you hold on .Some famous people have given us many good examples.\nInterest is the best teacher. _ all the people are not willing to do what they do, our society will not develop.", 
    "options": [
        [
            "afford", 
            "lift", 
            "exchange", 
            "develop"
        ], 
        [
            "important", 
            "interesting", 
            "convincing", 
            "necessary"
        ], 
        [
            "how", 
            "when", 
            "what", 
            "where"
        ], 
        [
            "end", 
            "way", 
            "slightest", 
            "case"
        ], 
        [
            "where", 
            "that", 
            "what", 
            "how"
        ], 
        [
            "pleased", 
            "tired", 
            "worried", 
            "terrified"
        ], 
        [
            "care", 
            "hear", 
            "tell", 
            "drop"
        ], 
        [
            "off", 
            "out", 
            "with", 
            "up"
        ], 
        [
            "Though", 
            "If", 
            "Until", 
            "Unless"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "C", 
        "C", 
        "B", 
        "D", 
        "A", 
        "B", 
        "B"
    ], 
    "source": "middle152"
}