{
    "article": "Street art is a very popular form of art. It is  _  quickly all over the world. You can find it on buildings and street signs from Beijing to Paris. Art experts say that the movement began in New York in the 1960s. Young adults would use paint in specialcans to put their words and other images on walls and cars  _  the city. One well-known street artist is Swoon. She  cuts out  paper images of people and puts them on walls. Swoon didn't start her career as a street artist. She studied art, but  _  time went on, she got bored with the works she saw in museums or galleries . The people in New York enjoy Swoon's strong and interesting  _  . Street artists do their work for a reason. Some of them choose street art because it is  _  to the people. Some artists try to express their opinions in their works. Advertising companies also use street art in their advertisements because it gives the deep impression and energy. The New York store Saks Fifth Avenue  _  used a street artist's design for their shop windows and shopping bags. In today's world the Internet has a big  _  on street art. Artists can show their pictures to the audience all over the world on the Internet. Many people,  _  , say that seeing a picture on the Internet is never as good as seeing it live. Street art lives with the energy and life of a big  _  . There it will continue to change and grow.", 
    "options": [
        [
            "watching", 
            "making", 
            "spreading", 
            "searching"
        ], 
        [
            "behind", 
            "by", 
            "over", 
            "around"
        ], 
        [
            "as", 
            "after", 
            "before", 
            "while"
        ], 
        [
            "style", 
            "story", 
            "problem", 
            "program"
        ], 
        [
            "safer", 
            "lower", 
            "closer", 
            "stranger"
        ], 
        [
            "hardly", 
            "recently", 
            "seldom", 
            "never"
        ], 
        [
            "success", 
            "discount", 
            "present", 
            "influence"
        ], 
        [
            "anyway", 
            "however", 
            "otherwise", 
            "therefore"
        ], 
        [
            "museum", 
            "country", 
            "city", 
            "street"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "A", 
        "A", 
        "C", 
        "B", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "middle733"
}