{
    "article": "Sheila bought a new lunch bag for school. On the way to school, she looked inside. She hoped that a new lunch bag meant something new for lunch,  _  she found the same lunch as always---a sandwich. When the lunch bell rang. Sheila found her bag and carried it to the dining hall. She opened it and  _  two pieces of fried chicken, several strawberries, and an egg. \"Wow!\" Sheila said, \"That's what I call  lunch  !\" The next morning, Sheila opened her lunch bag and looked inside. Sure enough, she found another  _  . But when she opened the bag at lunchtime in the dining hall, she discovered a piece of pizza, an orange, and a cake. \"My lunch bag  _  be magic,\" Sheila said. \"There's no such thing as magic,\" her friend Douglas  _  . \"There is,\" Sheila said. \"My mother  _  packs me a sandwich. But ever since I got this new lunch bag, the sandwich has changed into something I like.\" \"Maybe your mother's packing  _  things for a change.\" \"No,\" Sheila said. \"I checked in the morning. The sandwich changes  during school  .\" \"You are not the  _  one with a magic lunch bag,\" Beatrice said, turning around from the table behind her. \"I have one, too. See? This is my magic bag.\" \"Hey,\" Sheila said. \"My lunch bag really looks like yours.\" \"Mine is magic,\" said Beatrice. \"Every day my dad  _  leftovers , but at lunchtime I find a sandwich---my favorite!\" Sheila started  _  . \"What's so funny?\" Beatrice asked. \"That's the sandwich my mother packs,\" Sheila said. \"We've been getting our lunch bags  _  up.\" Sheila and  Beatrice  shared their lunches every day after that. Sheila loved making new discoveries each time she opened her lunch bag. But her best discovery was magically finding a new  _  .", 
    "options": [
        [
            "and", 
            "so", 
            "but", 
            "or"
        ], 
        [
            "showed", 
            "discovered", 
            "wanted", 
            "offered"
        ], 
        [
            "sandwich", 
            "chicken", 
            "egg", 
            "orange"
        ], 
        [
            "can", 
            "must", 
            "may", 
            "need"
        ], 
        [
            "disturbed", 
            "discovered", 
            "disappeared", 
            "disagreed"
        ], 
        [
            "never", 
            "seldom", 
            "often", 
            "ever"
        ], 
        [
            "different", 
            "same", 
            "easy", 
            "delicious"
        ], 
        [
            "last", 
            "next", 
            "extra", 
            "only"
        ], 
        [
            "packs", 
            "cooks", 
            "leaves", 
            "checks"
        ], 
        [
            "shouting", 
            "nodding", 
            "laughing", 
            "finding"
        ], 
        [
            "fixed", 
            "used", 
            "broken", 
            "mixed"
        ], 
        [
            "friend", 
            "classroom", 
            "classmate", 
            "school"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "A", 
        "B", 
        "D", 
        "C", 
        "A", 
        "D", 
        "A", 
        "C", 
        "D", 
        "A"
    ], 
    "source": "middle1351"
}