{
    "article": "There was once a millionaire .He loved money more  _  anything else in the world. He didn't know exactly how  _  he had. So he asked a little girl to count  _  his money for him. It  _  the little girl six days to count his money. When she told the millionaire  _  he had forty-two million dollars, he was very glad  _  asked, \"How much pay do you want ?\"He  _  that she was only a child, he could cheat her. The little girl said, \"Well, I worked  _  six days, so I think you  should  pay me for six days. Give me two pennies for the first day. Each day after that,  _  give me the amount you gave the day before multiplied by itself.\" The millionaire thought that in this way he would only had to give her very few dollars. What a  _  little girl! So he immediately asked his lawyer to make a contract . He was afraid that she would change  her mind  . On the first day, the millionaire paid her two pennies, and on the second day,  _  pennies. He did what he had planned. And on the sixth day the foolish millionaire  _  to give the clever little girl all his money. At last, it was more than he had .Do you know why? If you have  _  in it, you may try to work out this math problem..", 
    "options": [
        [
            "as", 
            "so", 
            "than", 
            "then"
        ], 
        [
            "many", 
            "much", 
            "often", 
            "far"
        ], 
        [
            "both", 
            "some", 
            "most", 
            "all"
        ], 
        [
            "cost", 
            "spent", 
            "used", 
            "took"
        ], 
        [
            "that", 
            "what", 
            "how", 
            "if"
        ], 
        [
            "and", 
            "but", 
            "so", 
            "or"
        ], 
        [
            "asked", 
            "thought", 
            "told", 
            "spoke"
        ], 
        [
            "in", 
            "on", 
            "for", 
            "at"
        ], 
        [
            "still", 
            "just", 
            "really", 
            "finally"
        ], 
        [
            "kind", 
            "foolish", 
            "lovely", 
            "clever"
        ], 
        [
            "two", 
            "four", 
            "six", 
            "eight"
        ], 
        [
            "need", 
            "had", 
            "must", 
            "may"
        ], 
        [
            "interest", 
            "interested", 
            "interesting", 
            "interests"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "D", 
        "D", 
        "A", 
        "A", 
        "B", 
        "C", 
        "B", 
        "B", 
        "B", 
        "B", 
        "D"
    ], 
    "source": "middle1072"
}