{
    "article": "Is music enjoyed simply for being a nice little tune? No, there are things  far more  important to learn about than whether you really like the song, for example, the story of the singer himself. Many singers had had hard  _  before they became famous. Xiao Huangqi, a pop singer and songwriter from Taiwan, is one of them. Up till now, he has made five albums and  _  several music awards. Among his hit songs, the most popular one is \"You Are My Eyes\", a song that  _  his own true story, a blind man who loves music and the world so much. Xiao was born blind. At the age of four, he got some eyesight through an operation. He couldn't be  _  because he could see the world with his own eyes. He began to practice Judo and learned to play the saxophone and the guitar. But fate  played a joke on  him. He became blind again ten years later because he had used his eyes too much. It was a great blow. But Xiao is so  _  and optimistic that he soon got out of his sadness. He began writing songs and found a colorful world within. He hears and feels the world and  _  his thoughts and feelings into music. \"When one door closes, another door opens.\"  _  opened the door for Xiao and has  _  him into a wonderful and colorful world.", 
    "options": [
        [
            "time", 
            "life", 
            "experiences", 
            "memory"
        ], 
        [
            "won", 
            "held", 
            "produced", 
            "presented"
        ], 
        [
            "reads", 
            "tells", 
            "sings", 
            "says"
        ], 
        [
            "happy", 
            "happier", 
            "sad", 
            "sadder"
        ], 
        [
            "proud", 
            "clever", 
            "honest", 
            "strong"
        ], 
        [
            "turns", 
            "decides", 
            "considers", 
            "has"
        ], 
        [
            "Mum", 
            "Knowledge", 
            "Music", 
            "Love"
        ], 
        [
            "took", 
            "led", 
            "connected", 
            "left"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "B", 
        "B", 
        "D", 
        "A", 
        "C", 
        "B"
    ], 
    "source": "middle1604"
}