{
    "article": "I had always cared about sick children and tried to help them. But when my little grandson received third degree burns, I learned first-hand how  _  a loving adult feels when his/her child is suffering and he/she can't take the pain away. This experience  _  me to feel sorry for parents with sick children. One mom told me that she  _  like running into the street and screaming, \"My child is sick. Would somebody please help us?\" It breaks my  _  that these parents are so anxiously searching for someone to care and help them  _  the hard times of watching their helpless child suffer. So I decided to do something to help them. Two years ago, I almost lost my eyesight. Luckily, I regained some eyesight, but I was no longer able to work.  _  I had a lot of time. At first, I thought that my life was  _  because I couldn't do any of the things I used to do. I believed that my life had no purpose and I was no  _  to anybody anymore. I began to be interested in surfing the Internet for information. One day I received several emails asking for help for sick children. I decided to post their stories and pictures on a webpage. What began as a  _  has grown into a fulltime job I enjoy doing every day. Since my website was built, I've received tens of emails from worried parents asking me to put their child's story online. And over 325 volunteers have  _  me to send children \"happy mail\" without being paid.", 
    "options": [
        [
            "bored", 
            "puzzled", 
            "helpless", 
            "hopeful"
        ], 
        [
            "made", 
            "advised", 
            "guided", 
            "led"
        ], 
        [
            "seemed", 
            "felt", 
            "looked", 
            "sounded"
        ], 
        [
            "heart", 
            "head", 
            "legs", 
            "face"
        ], 
        [
            "over", 
            "with", 
            "across", 
            "through"
        ], 
        [
            "But", 
            "Though", 
            "So", 
            "Since"
        ], 
        [
            "meaningless", 
            "meaningful", 
            "interesting", 
            "boring"
        ], 
        [
            "point", 
            "sense", 
            "good", 
            "hope"
        ], 
        [
            "picture", 
            "wish", 
            "hobby", 
            "website"
        ], 
        [
            "paid", 
            "joined", 
            "invited", 
            "advised"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "B", 
        "A", 
        "D", 
        "C", 
        "A", 
        "C", 
        "C", 
        "B"
    ], 
    "source": "middle996"
}