{
    "article": "Today ,I want to tell you a story about something I did when I was 14 years old. I made some friends in school  _  they turned out to be bad. They were some boys who stole  _  and sold them. Whenever we were stealing a bike , a boy named John would break the lock  _  two other boys were watching out. Then one of us would  _  the bike to a cave . The next day ,we would meet there and repaint the bike. When we stole four or five bikes ,we would sell them  _  a few hundred dollars. One  _  afternoon ,we went to an apartment in Bukit Batok. We found a bike on the fifth floor and started to work on the  _  . It was hard to break. We spent 10 minutes  breaking  it. We were about to escape with the bike when the owner of the bike came out of the elevator. \" My bike !\" he  _  . We dropped the bike and ran down but two policemen nearby  _  us. We were taken to the police station. Our parents were called and our teachers were told what had happened. The police took down what we had done. The next day ,a bright Sunday, I  was sent  to the Boys' Home. Life in the Boys' Home was very hard but it  _  me a very important lesson. I learnt that stealing was not right. At the Boys' Home ,the officers helped me and encouraged me  to change  my ways. I decided to  give up  stealing. To this day , I feel so  _  for what I have done. I hope you will learn something from my story.", 
    "options": [
        [
            "and", 
            "or", 
            "but", 
            "so"
        ], 
        [
            "bikes", 
            "books", 
            "Suitcases", 
            "backpacks"
        ], 
        [
            "When", 
            "while", 
            "since", 
            "after"
        ], 
        [
            "fetch", 
            "Pull", 
            "fill", 
            "take"
        ], 
        [
            "To", 
            "with", 
            "by", 
            "for"
        ], 
        [
            "Tuesday", 
            "Friday", 
            "Saturday", 
            "Sunday"
        ], 
        [
            "floor", 
            "lock", 
            "elevator", 
            "bike"
        ], 
        [
            "said", 
            "walked", 
            "Shouted", 
            "stopped"
        ], 
        [
            "saw", 
            "pointed", 
            "impressed", 
            "caught"
        ], 
        [
            "offered", 
            "taught", 
            "told", 
            "passed"
        ], 
        [
            "scared", 
            "sorry", 
            "confident", 
            "excited"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "B", 
        "D", 
        "D", 
        "C", 
        "B", 
        "C", 
        "D", 
        "B", 
        "B"
    ], 
    "source": "middle1842"
}