{
    "article": "Young people are often unhappy when they are with their parents. They  _  that their parents don't understand them. They often think their parents are too strict  _  them. Parents often find  _  difficult to win their children's trust and they seem to forget how they themselves felt when they were young. For example, young people like to do things without  _  . It's one of their ways to show that they grow up and they can  solve  any difficult problems. Older people worry more easily. Most of them like to plan things ahead and don't like their plans to be known. So when you want your parents to let you do  _  , you will have better success if you ask before you really start doing it. Young people often make their parents angry by the clothes they wear, the music they enjoy, and something else. But they  don't mean  to cause any trouble. They just feel that in this way they can be cut off from the old people's world and they want to make a new culture  _  their own. And if their parents don't like their music or clothes or their ways of speech, the young people feel very sad. Sometimes  instead of  going out with their parents, they just want to stay at home alone and do what they like. If you plan to do something, you'd better win your parents over and get them to understand you.  If so  your parents will certainly let you do what you want to do.", 
    "options": [
        [
            "think", 
            "hope", 
            "say", 
            "know"
        ], 
        [
            "with", 
            "in", 
            "to", 
            "over"
        ], 
        [
            "that", 
            "this", 
            "one", 
            "it"
        ], 
        [
            "thinking", 
            "speaking", 
            "seeing", 
            "reading"
        ], 
        [
            "everything", 
            "something", 
            "nothing", 
            "anything"
        ], 
        [
            "at", 
            "to", 
            "over", 
            "of"
        ]
    ], 
    "answers": [
        "A", 
        "A", 
        "D", 
        "A", 
        "B", 
        "D"
    ], 
    "source": "middle670"
}