{
    "article": "I learned how to accept life as it is from my father.  _  . he did not teach me acceptance when he was strong and healthy, but rather when he was  _  and ill . My father was  _  a strong man who loved being active. But a terrible illness  _  all that away. Now he can no longer walk. And he must sit quietly in a chair all day. Even talking is  _  . One night, I went to visit him with my sisters. I told them about one of my beliefs. I said that we must very often give things up  _  we grow our youth, our beauty, our friends, but it always  _  that after we give something up,we gain something new in its place. Then suddenly my father spoke up, \"But, Peter, I gave up  _  !What did I gain?\" I thought and thought, but I could not think of anything to say.  _  he answered his own question: \"I  _  the love of my family.\" I looked at my sisters and saw tears in their eyes along with hope and thankfulness. I was also  _  by his words. After that, when I began to feel irritated at someone, I would remember his words and become  _  . If he could replace his great pain with a feeling of love for others, then I should be  _  to give up my small irritations. In this  _  ,I learned the power of acceptance from my father. Sometimes I  _  what other things I could have learned from him if I had listened more carefully when I was a boy. For now, though I am grateful for this one gift.", 
    "options": [
        [
            "Certainly", 
            "Therefore", 
            "However", 
            "Meanwhile"
        ], 
        [
            "tired", 
            "weak", 
            "poor", 
            "slow"
        ], 
        [
            "already", 
            "still", 
            "only", 
            "once"
        ], 
        [
            "took", 
            "threw", 
            "sent", 
            "put"
        ], 
        [
            "stressful", 
            "difficult", 
            "impossible", 
            "hopeless"
        ], 
        [
            "as", 
            "since", 
            "before", 
            "till"
        ], 
        [
            "suggests", 
            "promises", 
            "seems", 
            "requires"
        ], 
        [
            "something", 
            "anything", 
            "nothing", 
            "everything"
        ], 
        [
            "surprisingly", 
            "immediately", 
            "naturally", 
            "certainly"
        ], 
        [
            "had", 
            "accepted", 
            "gained", 
            "enjoyed"
        ], 
        [
            "touched", 
            "astonished", 
            "attracted", 
            "warned"
        ], 
        [
            "quiet", 
            "calm", 
            "relaxed", 
            "happy"
        ], 
        [
            "ready", 
            "likely", 
            "free", 
            "able"
        ], 
        [
            "case", 
            "form", 
            "method", 
            "way"
        ], 
        [
            "doubt", 
            "wonder", 
            "know", 
            "guess"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "D", 
        "A", 
        "B", 
        "A", 
        "C", 
        "D", 
        "A", 
        "C", 
        "A", 
        "B", 
        "D", 
        "D", 
        "B"
    ], 
    "source": "middle270"
}