{
    "article": "When Alesia Reuis was nine years old, she had an accident that left her unable to walk for years. Now Alesia is telling the story of the first day she  _  again. I remember the very first time I walked by myself. My sister Alexis was in high school then. She was on the basketball team, and she was going to take me to her practice. She went to drive the car to the front door for me while I was sitting in my room, but we were going to be late, so I said to myself, \"Let me help her out a little.\" I  _  I would try to walk to the  _  door.  _  else was at home, so I had to do it by myself. I was a little afraid, but I wanted to do it, so I pushed up off the arms of my wheelchair and  stood up  . There wasn't going to be anything for me to hold on to .  _  if I leaned over to catch the table, I would fall. So I put my mind on walking and nothing else, and I just took a step, and another one, and then about three more, and I was at the door of my  _  . I stood  _  the wall and started smiling. I was so  _  I'd made it that far. I  looked up  to the sky and said, \"Thank you.\" I stayed there for a minute. I was hoping I wouldn't have anything wrong with my  _  , so I practiced  moving  it a little bit, and then I started across the living room. I looked straight ahead, and I made it to the next wall, and I said \"  Thank you.  \" again. Then I had to walk just  a few  more steps to get to the door -- and I did it! I said, \"I made it, I made it, thank you!\" I looked out to see where Alexis was. She was driving to the house. She was so surprised that I was standing there waving at her. She laughed  _  and gave me a great big hug. That's to say: impossible is nothing.", 
    "options": [
        [
            "stood", 
            "walked", 
            "played", 
            "run"
        ], 
        [
            "thought", 
            "knew", 
            "suggested", 
            "hoped"
        ], 
        [
            "very", 
            "first", 
            "back", 
            "front"
        ], 
        [
            "Nobody", 
            "Anybody", 
            "Somebody", 
            "Everybody"
        ], 
        [
            "however", 
            "but", 
            "because", 
            "so"
        ], 
        [
            "wheelchair", 
            "car", 
            "room", 
            "house"
        ], 
        [
            "against", 
            "on", 
            "near", 
            "beside"
        ], 
        [
            "surprised", 
            "nervous", 
            "happy", 
            "afraid"
        ], 
        [
            "hand", 
            "arm", 
            "foot", 
            "knee"
        ], 
        [
            "happily", 
            "quickly", 
            "suddenly", 
            "luckily"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "D", 
        "A", 
        "C", 
        "C", 
        "A", 
        "C", 
        "D", 
        "A"
    ], 
    "source": "middle1749"
}