{
    "article": "It was a cold winter's afternoon. Robert stopped for a moment as he crossed the bridge and looked down at the river below. There were hardly any  _ on the river. Near the bridge, however, almost right  _ ,there was a canoe , with a boy in it. He was  _  wearing many clothes, Robert noticed. He felt extremely cold and walked  _ .\nJust then he heard a cry, \"Help! Help!\" The cry came from the river. Robert looked  _ . The boy was in the water and his canoe was slowly running away. \"Help! Help!\" he called again.\nRobert was a good swimmer. Taking  _  his clothes, he jumped into the river. The cold water made him tremble  all over, but in a few seconds he  _  the boy. \"Don't be  _ ,\"he said and started to swim towards the river bank, pulling the boy with him. But at that moment he  _  a large motor boat under the bridge. There were several people on the boat, all looking in his direction. Robert decided to swim towards the  _ .\n\" _  me a hand.\" he shouted as he got near the boat. He looked  _  into a row of faces. \"It's funny.\" he thought. \"They look so  _ .\" silently they helped the  _ into the boat and wrapped him in a blanket. But they didn't move to help Robert.\n\"Aren't you going to pull me out too?\" Robert asked.\n\"You!\" said one of the men. \"You! Why, we were making a film and you spoiled a whole afternoon's work! You can  _  in the water!\"", 
    "options": [
        [
            "fish", 
            "boats", 
            "waves", 
            "ducks"
        ], 
        [
            "above", 
            "over", 
            "below", 
            "up"
        ], 
        [
            "just", 
            "not", 
            "only", 
            "luckily"
        ], 
        [
            "on", 
            "in", 
            "out", 
            "down"
        ], 
        [
            "up", 
            "outside", 
            "down", 
            "inside"
        ], 
        [
            "off", 
            "down", 
            "away", 
            "out"
        ], 
        [
            "arrived", 
            "reached", 
            "went", 
            "came"
        ], 
        [
            "worry", 
            "annoyed", 
            "afraid", 
            "calm"
        ], 
        [
            "felt", 
            "touched", 
            "noticed", 
            "smelled"
        ], 
        [
            "bank", 
            "bridge", 
            "boat", 
            "boy"
        ], 
        [
            "Give", 
            "Return", 
            "Take", 
            "Borrow"
        ], 
        [
            "down", 
            "right", 
            "left", 
            "up"
        ], 
        [
            "happy", 
            "disappointing", 
            "angry", 
            "embarrassing"
        ], 
        [
            "boy", 
            "swimmer", 
            "mail", 
            "Robert"
        ], 
        [
            "jump", 
            "run", 
            "stay", 
            "walk"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "B", 
        "A", 
        "C", 
        "A", 
        "B", 
        "C", 
        "C", 
        "C", 
        "A", 
        "D", 
        "C", 
        "A", 
        "C"
    ], 
    "source": "middle1490"
}