{
    "article": "Would you mind looking after your sick mum and brother at home every day? Somebody may say yes. But to me, it is hard but full of pleasure. My name is Charlie and I'm 15 years old. At school, I _ like most other people of my age. At home, things are a bit _ .\nMy mum is badly ill. She can't go out. I was nine _ my mum got ill. I just thought she was different to everyone else's mum. She didn't ever go out or take _ to the park. I didn't talk to her or anyone else about it.\nI take care of my mum every day after _ . I go into town and pay her bills. It' s hard to deal with the pressure sometimes. I try to go for a _ when I'm stressed or write poems.\nAlso, I'm _ a second mummy. My brother is 11 years old and he has a special illness, too. So I have to look after him besides my mum.\nThe hardest thing is that I don't really spend _ with anyone outside of school. I'm more grown up than other people of my  _ . I stay at home and look after my mum and my brother.\nI'm  _ on going to college after school to study childcare, and I really want to be a photographer. Although it's hard, I do get pleasure from knowing how much I'm helping my mum and my brother.", 
    "options": [
        [
            "work", 
            "study", 
            "play", 
            "look"
        ], 
        [
            "easy", 
            "good", 
            "different", 
            "difficult"
        ], 
        [
            "when", 
            "where", 
            "if", 
            "how"
        ], 
        [
            "her", 
            "him", 
            "you", 
            "me"
        ], 
        [
            "work", 
            "meals", 
            "school", 
            "games"
        ], 
        [
            "rest", 
            "walk", 
            "play", 
            "visit"
        ], 
        [
            "in", 
            "with", 
            "about", 
            "like"
        ], 
        [
            "time", 
            "money", 
            "life", 
            "food"
        ], 
        [
            "home", 
            "family", 
            "age", 
            "day"
        ], 
        [
            "working", 
            "studying", 
            "trying", 
            "planning"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "D", 
        "C", 
        "B", 
        "D", 
        "A", 
        "C", 
        "D"
    ], 
    "source": "middle2063"
}