{
    "article": "Chairman Mao once said,\"It is not hard to do one good deed. It is hard to do good deeds all your life. \" Guo Mingyi, a 52-year-old worker in Anshan, Liaoning did just that. Over the past 20 years, Guo  has donated  60,000 mL of blood . That is the blood of 10 people put together. Once,  _  the cold winter of 2009,Guo got a call from the hospital. The doctors told him  _  a patient needed a blood donation. Guo didn't have time to have lunch. He traveled in the snow to  get to  the hospital. When he finished donating the blood, he was  _  tired that he fell asleep on the hospital bed. Guo and his family live a  _  life. They live in a house of only 40 square meters.  _  they don't have a lot of money, Guo saves money to support poor children. In the past 16 years, he has given away over 100,000yuan to more than 180 poor students. When the parents met him, many cried,\"He looks  _  than us. \"they said. Guo has also offered help to thousands of workers, friends and strangers. His warm heart has moved many people. They  _  him a \"Modern-Day Lei Feng\". Recently, Chinese leaders called on people to learn from Guo. They say young people especially should learn his selfless devotion . But Guo said he did these things in order not to get famous. \"It's just that some people need some help, and there should be someone standing out to give  _  a hand. \" he said.", 
    "options": [
        [
            "in", 
            "on", 
            "at", 
            "above"
        ], 
        [
            "which", 
            "that", 
            "what", 
            "who"
        ], 
        [
            "such", 
            "very", 
            "too", 
            "so"
        ], 
        [
            "simple", 
            "unhappy", 
            "rich", 
            "happily"
        ], 
        [
            "So", 
            "And", 
            "Because", 
            "Though"
        ], 
        [
            "richer", 
            "poorer", 
            "better", 
            "kinder"
        ], 
        [
            "say", 
            "shout", 
            "call", 
            "speak"
        ], 
        [
            "them", 
            "him", 
            "her", 
            "their"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "D", 
        "A", 
        "D", 
        "B", 
        "C", 
        "A"
    ], 
    "source": "middle245"
}