{
    "article": "In a history class, our teacher, Mrs. Bartlett asked us to make a poster   in groups about the culture that we were studying. She told us to write the names of three friends we wanted in one group and she would think about our _ .\nThe next day, I was told to be in a group I would _ want ---the boy who was too weak in English, and the two girls who wore strange clothes. Oh, how I wanted to be with my _ !\nWith tears in my eyes, I walked up to Mrs. Bartlett. She looked at me and seemed to know what I was there for. I told her I should be in the \"good\" group. She gently   _ a hand on my shoulder  . \"I know what you want, Karma,\" she said, \"but your group needs you. I need you to help them. Only you can help them.\" I was _ and moved. Her words encouraged me.\n\"Will you help them?\" she asked. \"Yes,\" I replied. Then I _ walked over to my group. I sat down and we started. Each of us did a part according to our interests. Halfway through the week, I felt _ enjoying our group. We did a good job together. My group members weren't thought to be good just because no one cared enough about them _ Mrs. Bartlett.\nAt last, our group got an A. But I think we should hand the A back to Mrs. Bartlett. She was the one who should truly _ it. Mrs. Bartlett brought out the potential   in four of her students.", 
    "options": [
        [
            "classes", 
            "books", 
            "choices", 
            "clothes"
        ], 
        [
            "often", 
            "never", 
            "always", 
            "sometimes"
        ], 
        [
            "boys", 
            "girls", 
            "friends", 
            "teachers"
        ], 
        [
            "placed", 
            "pushed", 
            "washed", 
            "pulled"
        ], 
        [
            "useful", 
            "surprised", 
            "thirsty", 
            "asleep"
        ], 
        [
            "hardly", 
            "deeply", 
            "lazily", 
            "bravely"
        ], 
        [
            "myself", 
            "herself", 
            "yourself", 
            "himself"
        ], 
        [
            "around", 
            "with", 
            "for", 
            "except"
        ], 
        [
            "receive", 
            "start", 
            "give", 
            "throw"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "C", 
        "A", 
        "B", 
        "D", 
        "A", 
        "D", 
        "A"
    ], 
    "source": "middle584"
}