{
    "article": "Smiles and tears are part of life. But do you find enough time for  _  ? I'm not asking if you experience lots of good times. Of course, we should laugh during the happy times. But do you  also  laugh during the difficult times? Erma Bornbeck is know for her funny looks. But she wrote  _  about a more serious subject--cancer in children. The book is titled, I WANT TO GROW  _  , I WANT TO GROW UP. Erma talks with many children who  have  cancer and learns important lessons from them. She learns, for example, that cancer survivors know how they should smile at life, though they are receiving chemotherapy . She tells about the experience of  15-year-old  Jessica. Jessica's leg was cut off at the knee because of cancer. She was learning to wear a prosthesis . Jessica told about playing soccer. She hit the ball hard  _  her foot. The ball flew off in one direction  _  her man-made leg flew another way. Then the brave girl lay on the floor, laughing happily. As the saying goes, \"There's a time to cry and a time to laugh.\" Do our find  plenty of  . time to laugh? You can ... if you find reasons to laugh during the difficult times. Survivors know  how to laugh  . If you can laugh even when you're in trouble, you will make it. Remember, laugh and the whole world laugh with you. Cry and you cry alone.", 
    "options": [
        [
            "calling", 
            "laughing", 
            "crying", 
            "cry"
        ], 
        [
            "it", 
            "one", 
            "ones", 
            "first"
        ], 
        [
            "HAIR", 
            "NAILS", 
            "GRASS", 
            "finger"
        ], 
        [
            "in", 
            "with", 
            "under", 
            "below"
        ], 
        [
            "while", 
            "whenever", 
            "whether", 
            "if"
        ]
    ], 
    "answers": [
        "B", 
        "B", 
        "A", 
        "B", 
        "A"
    ], 
    "source": "middle2113"
}