{
    "article": "Jane had two children to raise. She had to pay for the housing and _ clothes. She had a lot of bills. She worked in a _ every day and got $600 a week. Even when she was _ , she went to work.\nJane worked hard and did a great job. She depended on tips   to help her get enough money to pay the bills.\nOne night, after Jane had served dinner to a family, _ left a big tip on the table. It was\n _ . Jane was taking care of another family at their table. When she turned back, she found the money had been taken away .\nJane saw a woman at another table staring at her when she looked around the restaurant. Jane went to ask her what food she wanted. She _ just a sandwich. She did not leave a tip after eating and Jane heard that she paid with a $20 bill. Jane was sure the woman had stolen her _ , but she couldn't prove   it.\nThe next night, the _ woman came into the restaurant. She gave Jane $50. She said, \"I was so sorry I took your money last _ . I had a bad day. Someone stole my wallet. So I was angry. So I took your money. _ that was not right. People should _ good things. Not bad things. So I want you to take the money.\"\n\"I'll take the $20 but you keep the _ . I know you need it,\" said Jane.\n\"You should have called the police,\" the manager said to Jane.\nJane said, \"No. We should forgive   when someone says _ and wants to make it right. We should try to help each other.\"", 
    "options": [
        [
            "buy", 
            "design", 
            "make", 
            "wash"
        ], 
        [
            "bookstore", 
            "hospital", 
            "restaurant", 
            "school"
        ], 
        [
            "angry", 
            "afraid", 
            "happy", 
            "tired"
        ], 
        [
            "he", 
            "she", 
            "we", 
            "they"
        ], 
        [
            "$20", 
            "$30", 
            "$40", 
            "$50"
        ], 
        [
            "ordered", 
            "made", 
            "sold", 
            "served"
        ], 
        [
            "book", 
            "money", 
            "dinner", 
            "wallet"
        ], 
        [
            "old", 
            "beautiful", 
            "same", 
            "strange"
        ], 
        [
            "night", 
            "week", 
            "month", 
            "year"
        ], 
        [
            "And", 
            "But", 
            "So", 
            "Or"
        ], 
        [
            "accept", 
            "borrow", 
            "cook", 
            "share"
        ], 
        [
            "money", 
            "promises", 
            "rest", 
            "words"
        ], 
        [
            "hello", 
            "thanks", 
            "goodbye", 
            "Sorry"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "D", 
        "D", 
        "A", 
        "A", 
        "B", 
        "C", 
        "A", 
        "B", 
        "D", 
        "C", 
        "D"
    ], 
    "source": "middle89"
}