{
    "article": "_ years and years people have been saying that railways are dead. \"We can do without railways,\" people say, as if cars and planes have made railways unnecessary. We all keep hearing that trains are slow, _ money and are dying. But this is far from the _ . In these days of expensive _ , railways have become highly competitive with cars and planes. If you want to carry people or things from place to place, they're cheaper than planes. And they have much in _ with planes. A plane goes in a straight line and _ does a railway. What is more, a railway takes you from the heart of a city center. It doesn't stop as a car does on crowded roads. And no plane or car can ever carry as many goods  as one train _ .\nFar from being dead, railways are much _ . Modern railway lines give you a comfortable journey. Where else can you eat well, sleep comfortably, feel safe and enjoy the scene while you are traveling at the same time ? And we are only the beginning, for we have just _ the age of super-fast trains, which can travel almost 200 _ an hour or more. Soon we will be wondering _ we spent so much on highways and planes we can't fly in because we don't have enough money to buy the oil.", 
    "options": [
        [
            "For", 
            "Since", 
            "In", 
            "Of"
        ], 
        [
            "win", 
            "make", 
            "lose", 
            "shut"
        ], 
        [
            "background", 
            "truth", 
            "secret", 
            "business"
        ], 
        [
            "electricity", 
            "water", 
            "oil", 
            "time"
        ], 
        [
            "same", 
            "similar", 
            "total", 
            "common"
        ], 
        [
            "so", 
            "as", 
            "this", 
            "also"
        ], 
        [
            "carry", 
            "do", 
            "does", 
            "did"
        ], 
        [
            "spare", 
            "painful", 
            "sad", 
            "alive"
        ], 
        [
            "entered", 
            "gone", 
            "left", 
            "got"
        ], 
        [
            "meters", 
            "kilograms", 
            "miles", 
            "pounds"
        ], 
        [
            "that", 
            "whether", 
            "how", 
            "why"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "B", 
        "C", 
        "D", 
        "A", 
        "C", 
        "D", 
        "A", 
        "C", 
        "D"
    ], 
    "source": "middle2334"
}