{
    "article": "Up to two-thirds of children don't get as much sleep as they should do and this can make them nervous and slower at school, researchers say. So  how long  should young people sleep each night? The answer is between 8 and 10 hours. If you don't get enough sleep at night, you'll have  _  energy the next day. But the researchers say many children have missed out on 4,500 hours of sleep by the time they are 7 years old. They say that children miss sleep because they have TVs and computers in their rooms and  _  parents don't read to their younger children at night any more. The traditional \"bedtime story\" helps children to relax and fall asleep  _  . Children with TVs and computers in their bedrooms are more likely to sleep badly and to get less than 8 hours sleep. Even  _  one hour's sleep a night can mean that children do less well at school. German scientists think that your  _  keeps working while you are asleep. To show that they were  _  , they gave two groups of people a problem to work out. One group went to sleep and the other group stayed  _  . The result? The people who slept worked out the answer more quickly, suggesting that their brains had been trying to  find out  the answer while the people were asleep. So, make sure you get enough sleep tonight,  _  you'll be at your best tomorrow.", 
    "options": [
        [
            "more", 
            "less", 
            "few", 
            "little"
        ], 
        [
            "proud", 
            "free", 
            "poor", 
            "busy"
        ], 
        [
            "peacefully", 
            "carefully", 
            "happily", 
            "sadly"
        ], 
        [
            "losing", 
            "lost", 
            "loser", 
            "loss"
        ], 
        [
            "head", 
            "brain", 
            "heart", 
            "thought"
        ], 
        [
            "perfect", 
            "bright", 
            "right", 
            "great"
        ], 
        [
            "awake", 
            "alive", 
            "asleep", 
            "absent"
        ], 
        [
            "or", 
            "but", 
            "if", 
            "and"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "A", 
        "A", 
        "B", 
        "C", 
        "A", 
        "D"
    ], 
    "source": "middle1637"
}