{
    "article": "Until last year, the saddest thing of my life was that my wife Alice and I couldn' t have any children. So we always _ all the children in our street to our house for Christmas breakfast.\nLast year, Alice died. I was very _ and decided not to invite the children for Christmas breakfast. But Kathy and Peter, my next door neighbors,  asked me to _ them for dinner on Christmas Eve.\nAs soon as I arrived, Kathy asked me, \"Do you have any milk at your house?\"\n\"Yes,\" I replied. \" _ you need some, I'll go and get it right away.\"\n\"Oh, that's all right. Come and sit down. Just give Peter your _ and let him do it.\"\nAfter a happy dinner with them, I went home. When I opened my door, I found my house had been decorated by Peter! It was  just as _ as each Christmas before. At that moment, I wished that I could still _ the Christmas breakfast, but I had made no preparations.\nEarly the next morning, a little boy with a bag of candies _ my bell. Before I could ask him what was _ , he was joining by two of his friends. Within fifteen minutes, my house was full of _ , and I had all the food I needed. I had a happy breakfast with the children again.", 
    "options": [
        [
            "took", 
            "invited", 
            "sent", 
            "led"
        ], 
        [
            "happy", 
            "lazy", 
            "sad", 
            "poor"
        ], 
        [
            "help", 
            "join", 
            "pay", 
            "meet"
        ], 
        [
            "Unless", 
            "As", 
            "Since", 
            "If"
        ], 
        [
            "money", 
            "milk", 
            "keys", 
            "things"
        ], 
        [
            "beautiful", 
            "dirty", 
            "colorless", 
            "empty"
        ], 
        [
            "buy", 
            "enjoy", 
            "sell", 
            "serve"
        ], 
        [
            "rang", 
            "answered", 
            "required", 
            "painted"
        ], 
        [
            "boiling", 
            "ending", 
            "singing", 
            "happening"
        ], 
        [
            "gifts", 
            "children", 
            "flowers", 
            "candies"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "B", 
        "D", 
        "C", 
        "A", 
        "D", 
        "A", 
        "D", 
        "B"
    ], 
    "source": "middle283"
}