{
    "article": "Arnold Pointer, a professional fisherman from the south of Australia, set free a big female white shark that was  _  in his large fishing nets. He thought she would have more and more babies. But now the fisherman is facing a(n)  _  problem. The white shark is so  _  to him that for nearly 2 years she hasn't left him  _  . She even follows him everywhere.  Because of  this, Arnold Pointer can't do fishing -- all the fishes are scared at her, and he doesn't know  _  to do anymore. It is hard to drive away such an almost 17-feet-long shark for Arnold Pointer. We all know the white sharks are protected  _  the wildlife conservation. At the same time, some special feeling has been  _  between Arnold and \"Cindy\", the name the fisherman has given the white shark. Arnold says, \"Every time I stop the boat, she always comes to me, turns on her back and lets me pet her body and neck. She sings, turns her eyes, and moves her fins up and down, hits the water  _  .\" Cindy is  _  an interesting animal that Arnold has to try to go fishing in different places. Doesn't Cindy know what her action means? Maybe she really doesn't understand.", 
    "options": [
        [
            "built", 
            "caught", 
            "killed", 
            "invented"
        ], 
        [
            "strange", 
            "exciting", 
            "happy", 
            "serious"
        ], 
        [
            "thankful", 
            "useful", 
            "careful", 
            "wonderful"
        ], 
        [
            "alive", 
            "aloud", 
            "alone", 
            "asleep"
        ], 
        [
            "how", 
            "when", 
            "what", 
            "why"
        ], 
        [
            "up", 
            "on", 
            "by", 
            "down"
        ], 
        [
            "established", 
            "achieved", 
            "expected", 
            "increased"
        ], 
        [
            "sadly", 
            "normally", 
            "luckily", 
            "happily"
        ], 
        [
            "so", 
            "such", 
            "too", 
            "much"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "A", 
        "C", 
        "C", 
        "C", 
        "A", 
        "D", 
        "B"
    ], 
    "source": "middle1544"
}