{
    "article": "Once there lived a farmer called Henry. He had a brother, Mike, in town who was an excellent gardener. His skill and his beautiful trees were  _  everywhere. One day, Henry went to town to visit Mike. \"Look, my brother,\" said Mike, \"Here is the best  _  tree from my garden. Take it home and  _  it so that you, and your children, and your children's children can enjoy it.\" Henry was  _  with the apple tree and went back home. The next morning, he began to  _  where he should plant it. \"If I plant it on the hill,\" he said to himself, \"the wind might catch it and  _  down the fruit; If I plant it close to the road, people who pass by will pick some of them; but if I plant it...\"  _  he planted the tree in the corner behind his house, where no one else could notice it. But the tree bore no fruit the first year, nor the second. Then Henry sent for his brother and said to him  _  , \"You have cheated me. This is the third year and it brings me  _  but leaves.\" When Mike saw where the tree was planted, he laughed and said, \"You have planted the tree in such a cold corner without  _  or warmth. How, then, could you expect flowers and fruit?\"", 
    "options": [
        [
            "simple", 
            "famous", 
            "similar", 
            "common"
        ], 
        [
            "pear", 
            "grape", 
            "apple", 
            "banana"
        ], 
        [
            "sell", 
            "wash", 
            "hide", 
            "plant"
        ], 
        [
            "tired", 
            "patient", 
            "pleased", 
            "popular"
        ], 
        [
            "learn", 
            "wonder", 
            "realize", 
            "understand"
        ], 
        [
            "put", 
            "cut", 
            "push", 
            "shake"
        ], 
        [
            "Finally", 
            "Firstly", 
            "Luckily", 
            "Certainly"
        ], 
        [
            "happily", 
            "angrily", 
            "kindly", 
            "carelessly"
        ], 
        [
            "nothing", 
            "something", 
            "everything", 
            "anything"
        ], 
        [
            "air", 
            "earth", 
            "water", 
            "sunlight"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "D", 
        "C", 
        "B", 
        "D", 
        "A", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "middle2135"
}