{
    "article": "Tennis world on Li's retirement For close to fifteen years, we've been a part of each other's lives.  _  a tennis player, I've trekked around the world playing hundreds of matches on the WTA tour, for China's Fed Cup team, at the National Games and at several Olympic Games. You've always been there for me,  _  me, cheering me on, and encouraging me..... I must thank  everyone  who has travelled on my journey with me. And those that stay with me through the  _  and the lows and have helped me become the person that I am today. -Li Na China's first and only Grand Slam winner Li Na's  _  to retire has drawn more than 10 million views on Internet in just a few hours. The breaking news left her fans surprised and sad. She is a pioneer who opened  _  to tennis for millions of people all over China and Asia. -WTA Chairman & CEO Stacey Allaster I will  _  remember great memories of us. Wish you the best for a new chapter in your life. - Victoria Azarenka: four time Grand Slam winner and former world No.1 A truly respected person, I  _  Li Na much happiness and health in her next chapters of life. - Maria Sharapova, five time Grand Slam winner and former world No. 1 If she retires, it will be a  _  for both Chinese tennis and tennis sport in Asia. No one can top her achievements in Asia. - Zheng Jie, China's Grand Slam doubles winner We should thank Li Na.  _  her, no one would have cared about tennis and the Chinese players. - Zheng Saisai, Chinese tennis player who is in Incheon.", 
    "options": [
        [
            "To", 
            "As", 
            "At", 
            "For"
        ], 
        [
            "liking", 
            "telling", 
            "supporting", 
            "staying"
        ], 
        [
            "highs", 
            "weights", 
            "length", 
            "shorts"
        ], 
        [
            "result", 
            "decision", 
            "chance", 
            "dream"
        ], 
        [
            "windows", 
            "ways", 
            "doors", 
            "world"
        ], 
        [
            "seldom", 
            "sometimes", 
            "always", 
            "never"
        ], 
        [
            "hope", 
            "wish", 
            "decide", 
            "get"
        ], 
        [
            "loss", 
            "change", 
            "sadness", 
            "surprise"
        ], 
        [
            "With", 
            "For", 
            "Without", 
            "In"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "B", 
        "C", 
        "C", 
        "B", 
        "A", 
        "C"
    ], 
    "source": "middle379"
}