{
    "article": "Boys and girls, this summer vacation is the time for you to take your mind off homework and prepare yourself for future life. The following is some advice on  _  to make your vacation meaningful and colorful. Take exercise. Regular exercise, much health. You  have worked  hard most of the time so far. Therefore, you need to join in outdoor activities, which can bring your whole body into action. You can benefit from different forms of exercise  such as  swimming, jogging and mountain climbing. Learn some basic life skills. One day, you will live alone. As a result, you can't  depend on  your family any longer. In order to deal with your  _  matters in your own life, you should learn cooking, washing and other practical skills. Go for a journey. Travel to places of interest. In this way, you can find the culture there different from  _  of your hometown. Beautiful scenery can  _  make you relaxed. Imagine that you are lying on the warm beach in bright sunshine, with light sea wind gently blowing. Isn't it enjoyable and comfortable? Enjoy family time. Home is the place in which you can rest, receive love and care from relations. Don't always sit in front of a computer alone. Instead, the whole family should spend  some time  watching a movie on the sofa together. Besides, it's great fun for family members to gather around the table,  discussing  sports, clothes or other common topics . If you follow the advice above, you will achieve health, independence , peace of mind and feelings between family members. Today is the beginning of a new life. Your summer vacation must be full of  _  and success. Wish you a wonderful time!", 
    "options": [
        [
            "whether", 
            "how", 
            "when", 
            "what"
        ], 
        [
            "public", 
            "negative", 
            "personal", 
            "Happy"
        ], 
        [
            "it", 
            "that", 
            "one", 
            "what"
        ], 
        [
            "also", 
            "either", 
            "too", 
            "as"
        ], 
        [
            "sadness", 
            "joy", 
            "worry", 
            "Happy"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "B", 
        "A", 
        "B"
    ], 
    "source": "middle2098"
}