{
    "article": "During his college years, Sherman Rogers spent a summer in logging camp. When the boss had to leave for  a few  days, he put Rogers in charge . \"What shall I do if the men  _  to follow my orders?\" Rogers asked. He thought of Tony, a worker who complained all day, gave the other men a  _  time. \"Fire them,\" the boss said. Then, as if reading Rogers' mind, he added, \"I suppose you are going to fire Tony if you get the  _  . I'd feel badly about that. I have been logging for 40 years. Tony is one of the best workers I've ever had. I know he hates everybody and  _  . But he comes in first and leaves last. There has not been an  _  for eight years on the hill where he works.\" The next day, Rogers went to Tony, \"Tony, do you know I'm in charge here today?\" Tony said yes. \"I was going to fire you the first time we quarreled,  _  I want you to know I'm not,\" he told Tony, adding  _  the boss had said. When he finished, Tony dropped the things in his hand and tears went down his  _  . \"Why didn't he tell me that eight years  _  ?\" That day Tony worked  _  than ever before - and he smiled! Rogers went back to  _  after that summer. Twelve years later he met Tony again who was now boss for one of the largest logging companies in the West. Rogers asked him how he came to California and happened to be so  _  . Tony replied, \"Were it not for the one minute you talk to me back that day, I would kill somebody some day. One minute  _  my whole life.\" Have you got one minute to thank someone? One minute to appreciate her or him? One minute. It can make a  _  for a lifetime.", 
    "options": [
        [
            "decide", 
            "refuse", 
            "want", 
            "ask"
        ], 
        [
            "good", 
            "relaxing", 
            "pleasant", 
            "hard"
        ], 
        [
            "way", 
            "suggestion", 
            "chance", 
            "problem"
        ], 
        [
            "something", 
            "nothing", 
            "everything", 
            "nobody"
        ], 
        [
            "advertisement", 
            "action", 
            "idea", 
            "accident"
        ], 
        [
            "and", 
            "but", 
            "so", 
            "because"
        ], 
        [
            "what", 
            "why", 
            "how", 
            "when"
        ], 
        [
            "head", 
            "hair", 
            "face", 
            "hands"
        ], 
        [
            "before", 
            "later", 
            "old", 
            "ago"
        ], 
        [
            "harder", 
            "less", 
            "lazier", 
            "slower"
        ], 
        [
            "school", 
            "bank", 
            "hospital", 
            "hotel"
        ], 
        [
            "healthy", 
            "friendly", 
            "successful", 
            "careful"
        ], 
        [
            "waited", 
            "changed", 
            "left", 
            "sent"
        ], 
        [
            "speech", 
            "mistake", 
            "decision", 
            "difference"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "C", 
        "C", 
        "D", 
        "B", 
        "A", 
        "C", 
        "D", 
        "A", 
        "A", 
        "C", 
        "B", 
        "D"
    ], 
    "source": "middle113"
}