{
    "article": "A little boy invited his mother to attend his school's first teacher-parent meeting. To the little boy's disappointment , she said she would go. This would be the  _  time that his classmates and teacher met his mother and he  _  lose his face because of her appearance. Although she was a  _  woman, there was a scar that covered nearly the whole right side of her face. The boy never wanted to  talk about  why or how she got the scar. At the meeting, the people were  _  by the kindness and natural beauty of his mother even though she had the scar on her face, but the little boy was still embarrassed and hid himself from everyone.  _  , he happened to hear of a talk between his mother and his teacher. The teacher asked  _  , \"How did you get the scar on your face?\" The mother replied, \"When my son was a baby, he was in a room that caught fire.  Everyone  was too afraid to go in because the fire was  out of control  , so I went in.  _  I was running toward his bed, I saw a long piece of wood  falling down  and I placed myself over him trying to protect him. I was knocked senseless but luckily, a fireman came in and saved both of us.\" She  _  the burned side of her face. \"This scar will be there forever, but to this day, I have never  _  what I did.\" At this point, the little boy came out running toward his mother with  _  in his eyes. He held her in his arms and felt a great sense of the sacrifice that his mother had made for him. He held her hand  _  for the rest of the day.", 
    "options": [
        [
            "first", 
            "second", 
            "last", 
            "next"
        ], 
        [
            "can", 
            "should", 
            "would", 
            "need"
        ], 
        [
            "slim", 
            "short", 
            "ugly", 
            "beautiful"
        ], 
        [
            "frightened", 
            "attracted", 
            "worried", 
            "excited"
        ], 
        [
            "Therefore", 
            "Otherwise", 
            "However", 
            "Then"
        ], 
        [
            "excitedly", 
            "seriously", 
            "nervously", 
            "anxiously"
        ], 
        [
            "If", 
            "Though", 
            "Because", 
            "As"
        ], 
        [
            "pointed", 
            "showed", 
            "hit", 
            "touched"
        ], 
        [
            "forgot", 
            "realized", 
            "considered", 
            "regretted"
        ], 
        [
            "tears", 
            "smile", 
            "sunshine", 
            "sadness"
        ], 
        [
            "hardly", 
            "slightly", 
            "tightly", 
            "suddenly"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "D", 
        "B", 
        "C", 
        "B", 
        "D", 
        "D", 
        "D", 
        "A", 
        "C"
    ], 
    "source": "middle424"
}