{
    "article": "The end of the school year was coming quickly. I was so excited because it was time for the school play tryouts. This year's play was called Mystery at the Lighthouse. I was  _  to get the lead part of Joe who tries to solve the mystery of the lights that go on and off by themselves. After school, all those who wanted to  try .  out for the play met in the gym at 3:30. My friend Kevin and I sat and waited for our turn to read for the play. The next day,  _  were posted on the wall outside the gym. Kevin got a part in the play. However, l didn't see my name. I felt  _  inside. I was sure I would get the part. \"I can't understand why I'm not in the play,\" I said to my Mom. \"Rick, it just  _  that someone was a little better than you. You shouldn't give up just because of this one time. Look at all the other things you're good at,\" said Mom. \"You are great with art and drawing and you're a super soccer player.\" \" I guess so, \" I said  _  I went to my room. The next day at school Mr. Carter, the art teacher, asked me if I would be interested in doing some drawing and painting for the play. \" You want me to help draw for the play?\"\" I sure do, \" said Mr. Carter. I was so happy about being part of the play  after all  . I stayed after school each day for the next week and drew a big lighthouse and painted it. I  _  drew some boats in the water and painted them. I was so excited the night of the play. I  _  from the side of the stage as Kevin said his part of the play very well. At the end of the show, Mr. Carter called all the students onto the stage who helped with the artwork, lights and moving things around on stage. I felt  _  of being part of the play. I think I like doing the artwork better. It was so much fun!", 
    "options": [
        [
            "hoping", 
            "smiling", 
            "helping", 
            "learning"
        ], 
        [
            "jobs", 
            "parts", 
            "events", 
            "choices"
        ], 
        [
            "special", 
            "worried", 
            "funny", 
            "ready"
        ], 
        [
            "supposes", 
            "explains", 
            "matters", 
            "means"
        ], 
        [
            "if", 
            "as", 
            "once", 
            "until"
        ], 
        [
            "instead", 
            "still", 
            "just", 
            "also"
        ], 
        [
            "rushed", 
            "stepped", 
            "watched", 
            "reported"
        ], 
        [
            "afraid", 
            "proud", 
            "tired", 
            "sure"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "C", 
        "D", 
        "B", 
        "D", 
        "C", 
        "B"
    ], 
    "source": "middle1246"
}