{
    "article": "It was the golden season. I could see the _ leaves falling with the cool wind. For others, it is a harvest season, while for me, it is an annoying season. I was _ for the Postgraduate Entrance Examination. But so many unhappy things made me so tired, so I decided to have a walk along the Yanjiang Road in my university.\n\"Autumn is a lonely season and life is uninteresting. The days in this season always get me _ \"I thought when the sound of a guitar flowed into my ears, like a stream flowingfrom the mountains. A young girl, sitting on the lawn, was lost in playing her guitar. She was a beautiful girl, _ when the wind blew her long hair, l had never seen her before. The musicwas so attractive that I listened quietly.\nLost in the music, I did not _ that I had been standing for so long. But my existence  did not seem to disturb her. Leaves were still falling. Every day when I passed by the lawn, I saw her playing her guitar.\nAutumn was _ over. One day, when I was listening carefully, the sound suddenly stopped. To my surprise, the girl came over to me.\n\"You must like the music,\" she said.\n\"Yes, you play very well. Why did you stop?\" I asked.\nSuddenly, a _ expression appeared on her face.\n\"I came here just to have a rest because I failed in the college entrance examination. I felt very disappointed. And it was your listening every day that _ me,\" she said, \"and I have to go tomorrow.\"\n\"In fact, it was your playing that gave me a _ autumn and helped me believe that I have the ability to pass the Postgraduate Entrance Examination.\" I answered, \"I think it was God who gave us the _ to know each other and we should be good friends.\"\nShe smiled and I smiled in that beautiful autumn.", 
    "options": [
        [
            "yellow", 
            "green", 
            "new", 
            "empty"
        ], 
        [
            "going", 
            "waiting", 
            "preparing", 
            "caring"
        ], 
        [
            "across", 
            "down", 
            "away", 
            "out"
        ], 
        [
            "mainly", 
            "specially", 
            "mostly", 
            "especially"
        ], 
        [
            "realize", 
            "consider", 
            "remember", 
            "understand"
        ], 
        [
            "nearly", 
            "hardly", 
            "already", 
            "just"
        ], 
        [
            "excited", 
            "angry", 
            "sad", 
            "worried"
        ], 
        [
            "moved", 
            "encouraged", 
            "wondered", 
            "saved"
        ], 
        [
            "short", 
            "successful", 
            "relaxing", 
            "meaningful"
        ], 
        [
            "space", 
            "gift", 
            "chance", 
            "luck"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "B", 
        "D", 
        "A", 
        "A", 
        "C", 
        "B", 
        "D", 
        "C"
    ], 
    "source": "middle66"
}