{
    "article": "A boy was sent by his parents to a boarding school . Before being sent away, this boy was the  _  student in his class. He was at the top in every competition. But the boy changed after  _  home and attending the boarding school. His grades started dropping. He  _  being in a group. He was lonely all the time because he felt no one loved him. His  _  started worrying about the boy. But they did not know  _  was wrong with him. So his dad  _  to travel to the boarding school and  _  with him. They sat on the bank of the lake near the school. The father started  _  him casual questions about his classes, teachers and sports.  _  some time his dad said, \"Do you know, son, why I am here today?\" The boy answered back, \"To check my  _  ?\" \"No, no,\" his dad replied, \"I am here to tell you that you are the most important person for  _  . I want to see you  _  . I don't care about grades. I care about you. I care about your happiness. YOU ARE MY LIFE.\" These words caused the boy's eyes to fill with tears. He hugged his dad. They didn't say  _  to each other for a long time. Now the boy had everything he wanted. He knew there was someone on this earth who cared for him  _  . And today this young man is in college at the  _  of his class and no one has ever seen him sad!", 
    "options": [
        [
            "healthiest", 
            "nicest", 
            "loneliest", 
            "brightest"
        ], 
        [
            "reaching", 
            "going", 
            "leaving", 
            "coming"
        ], 
        [
            "hated", 
            "enjoyed", 
            "wanted", 
            "liked"
        ], 
        [
            "friends", 
            "parents", 
            "teachers", 
            "cousins"
        ], 
        [
            "what", 
            "why", 
            "how", 
            "where"
        ], 
        [
            "liked", 
            "continued", 
            "decided", 
            "thought"
        ], 
        [
            "quarrel", 
            "talk", 
            "sing", 
            "dance"
        ], 
        [
            "saying", 
            "telling", 
            "speaking", 
            "asking"
        ], 
        [
            "When", 
            "Before", 
            "After", 
            "Until"
        ], 
        [
            "groups", 
            "grades", 
            "happiness", 
            "brightness"
        ], 
        [
            "me", 
            "him", 
            "her", 
            "them"
        ], 
        [
            "sad", 
            "lonely", 
            "happy", 
            "moved"
        ], 
        [
            "nothing", 
            "anything", 
            "something", 
            "everything"
        ], 
        [
            "widely", 
            "strongly", 
            "heavily", 
            "deeply"
        ], 
        [
            "top", 
            "bottom", 
            "middle", 
            "height"
        ]
    ], 
    "answers": [
        "D", 
        "C", 
        "A", 
        "B", 
        "A", 
        "C", 
        "B", 
        "D", 
        "C", 
        "B", 
        "A", 
        "C", 
        "B", 
        "D", 
        "A"
    ], 
    "source": "middle2052"
}