{
    "article": "Around two weeks ago, I was invited to be a judge at a college. All of the students had been given a piece of paper with a topic written on it. The first one to speak looked a little  _  . \"My dear friends and judges,\" he said loudly, \"this is an unfair  _  ! I have been given the paper,\" he continued, \"to speak on the topic with just a few minutes' preparation,  _  those who come after me have more time to  work on  their speeches!\" He then left the stage and went out of the hall. I met him later by chance. \"Who said life is  _  ?\" I asked him with a smile, and I asked him to walk with me to my car. \"Have you seen the figures they show when a new car is  _  into the market, saying how good it is?\" \"Yes,\" he nodded. \"But they put a  _  after all these figures. They say all the figures are in ideal road conditions!\" \"Yes,\" he said again. \"Can you show me some ideal road conditions?\" I asked him, and he smiled. \"The car that sells well is the one  _  will provide power and speed on the  _  roads. That car is the winner.\" We had got to the car. \"Don't look for ideal competition conditions,\" I said. \"  _  the unfair and come out a winner!\" I looked back as I drove away and saw him smile and wave, and I knew he would do as I said.", 
    "options": [
        [
            "unhappy", 
            "afraid", 
            "ungrateful", 
            "tired"
        ], 
        [
            "idea", 
            "competition", 
            "topic", 
            "judge"
        ], 
        [
            "when", 
            "so", 
            "since", 
            "while"
        ], 
        [
            "easy", 
            "fair", 
            "interesting", 
            "boring"
        ], 
        [
            "produced", 
            "imported", 
            "advertised", 
            "introduced"
        ], 
        [
            "word", 
            "guide", 
            "line", 
            "letter"
        ], 
        [
            "that", 
            "what", 
            "who", 
            "whose"
        ], 
        [
            "best", 
            "worst", 
            "busiest", 
            "longest"
        ], 
        [
            "fight", 
            "balance", 
            "blame", 
            "change"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "D", 
        "B", 
        "D", 
        "C", 
        "A", 
        "B", 
        "A"
    ], 
    "source": "middle277"
}