{
    "article": "I'm your dog, and I have something I'd like to whisper in your  _  I know that you humans  _  busy lives. Some have to work, and some have children to raise. It always seems like you are running here and there, often much too fast,  _  noticing the truly important things in life. Look down at me now, while you sit there at your computer. See the way my dark brown eyes look at yours? They are slightly cloudy now. That comes with ages. You  _  at me. I see love in your eyes. What do you see in  _  ? Do you see a spirit7 A soul inside, who loves you as no other could in the world. That is all I ask, to slow down, even if for a few minutes to be  _  me. Sometimes we die young suddenly. Sometimes we age so slowly before your eyes that you may not even seem to know  _  the very end. Still the love is always there, even when we must take that long sleep. I  _  not be here tomorrow or next week. Some day you will cry and be  _  at yourself that you did not have just \"one more day\" with me. We have NOW, together. So come, sit down here next to me on the floor, and look deep into my eyes. Enter my world , and let time slow down if only for 15  _  . Speak with your heart , and you will know your true self.", 
    "options": [
        [
            "eyes", 
            "hands", 
            "ears", 
            "heart"
        ], 
        [
            "lead", 
            "lose", 
            "like", 
            "make"
        ], 
        [
            "ever", 
            "never", 
            "always", 
            "often"
        ], 
        [
            "laugh", 
            "shout", 
            "point", 
            "smile"
        ], 
        [
            "yours", 
            "ours", 
            "mine", 
            "his"
        ], 
        [
            "wiyh", 
            "for", 
            "on", 
            "without"
        ], 
        [
            "in", 
            "after", 
            "until", 
            "by"
        ], 
        [
            "should", 
            "can", 
            "must", 
            "may"
        ], 
        [
            "surprised", 
            "angry", 
            "good", 
            "weak"
        ], 
        [
            "years", 
            "minutes", 
            "hours", 
            "days"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "B", 
        "D", 
        "C", 
        "A", 
        "C", 
        "D", 
        "B", 
        "B"
    ], 
    "source": "middle501"
}