{
    "article": "Packing too many things is one of the fastest ways to make your trip less enjoyable. When you leave, it always seems like you're going to need every item in your suitcase. _ when you finish your journey, you may haven't been worn once. Unless you can _ a porter everywhere you go, all of those extra items are going to weigh you down. Here are _ on how to pack for vacation and make your trip a pleasure.\nChoose a wheeled suitcase and a small backpack. The wheeled _ saves you from carrying heavy baggage. The small backpack lets you keep _ items close.\nPut your necessary travel items in the backpack. They _ things like money, medicine and a mobile phone. If you have space, add some _ items as well as a book, a snack and sunglasses.\nBring less. You'll have to carry your bags _ airports, train stations and city streets, so you don't want to pack more items than necessary. Leave home any items _ you may not need during your trip.\nDon't _ your suitcase. You are sure to buy at least a few souvenirs during your trip, and leaving space for them in your suitcase will reduce your travel stress.", 
    "options": [
        [
            "So", 
            "And", 
            "But", 
            "Since"
        ], 
        [
            "support", 
            "afford", 
            "provide", 
            "serve"
        ], 
        [
            "skills", 
            "researches", 
            "messages", 
            "suggestions"
        ], 
        [
            "car", 
            "bike", 
            "robot", 
            "case"
        ], 
        [
            "interesting", 
            "important", 
            "wonderful", 
            "educational"
        ], 
        [
            "include", 
            "prepare", 
            "experience", 
            "discover"
        ], 
        [
            "expensive", 
            "necessary", 
            "extra", 
            "correct"
        ], 
        [
            "around", 
            "through", 
            "between", 
            "inside"
        ], 
        [
            "when", 
            "where", 
            "why", 
            "that"
        ], 
        [
            "fill", 
            "lose", 
            "forget", 
            "lock"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "D", 
        "D", 
        "B", 
        "A", 
        "C", 
        "B", 
        "D", 
        "A"
    ], 
    "source": "middle979"
}