{
    "article": "Eleven-year-old Angela had something wrong with her nervous system .She was unable to  _  . In fact, she could hardly make any  _  . Although she believed that she had a good chance of recovering, the doctors said that  _  , if any, could come back to normal after getting this disease. Having heard this, the little girl was not discouraged. There, lying in her hospital bed, she insisted that no matter what the doctors said, her going back to school was  _  . She was moved to a specialized health center, and whatever method could be tried was used. Still she would not  give up  . It seemed that she was undefeatable . The doctors were all fond of her and taught her about  _  that she could make it . Every day Angela would lie there, faithfully doing her mental exercise. One day,  _  she was imagining her legs moving again, it seemed as though a miracle happened: The bed began to move! \"Look what I'm doing! Look! I can do it! I moved! I moved! \"she shouted  _  ! Of course, at this very moment everyone else in the hospital was  _  . More importantly, they were running  _  safety. People were crying, and equipment was falling .You see, it was an  _  . But don't tell that to Angela. She has believed that she did it, just as she had never doubted that she would recover. And now only a few years later, She's back in school. You see, to such a person who can  _  the earth, such a disease is a small problem, isn't it?", 
    "options": [
        [
            "see", 
            "hear", 
            "talk", 
            "walk"
        ], 
        [
            "progress", 
            "difference", 
            "movement", 
            "achievement"
        ], 
        [
            "few", 
            "all", 
            "some", 
            "most"
        ], 
        [
            "true", 
            "doubtful", 
            "certain", 
            "impossible"
        ], 
        [
            "thinking", 
            "expecting", 
            "pretending", 
            "imagining"
        ], 
        [
            "as", 
            "since", 
            "after", 
            "before"
        ], 
        [
            "quietly", 
            "happily", 
            "quickly", 
            "carefully"
        ], 
        [
            "frightened", 
            "pleased", 
            "touched", 
            "encouraged"
        ], 
        [
            "in", 
            "by", 
            "for", 
            "with"
        ], 
        [
            "appointment", 
            "earthquake", 
            "achievement", 
            "instruction"
        ], 
        [
            "push", 
            "shock", 
            "save", 
            "shake"
        ]
    ], 
    "answers": [
        "D", 
        "C", 
        "A", 
        "C", 
        "D", 
        "A", 
        "B", 
        "A", 
        "C", 
        "B", 
        "D"
    ], 
    "source": "middle738"
}