{
    "article": "BEIJING--The sky is gray and air smells strange. It's another day of smog. On Saturday, heavy haze still covered north and east China. Highways were closed and  _  couldn't take off on time. The smoggy weather  _  the country's land from north to south, including Beijing, Hebei, Shandong, and 6 other provinces. People could only see clearly  _  than 50 meters in some areas. Cities  _  Shanghai and Nanjing have been covered by the gray sky for the past several days. Many walkers in the street had to wear  _  . In the Lukou airport in Nanjing, more than 60 flights were canceled on Saturday  because of  the haze, which also made primary and middle schools and kindergartens stop  _  on Thursday and Friday in Nanjing. The office worker of Environmental Protection said earlier this week that there were several  _  reasons behind the widespread haze: unpleasant weather conditions making  _  difficult for smog to disappear, motor vehicle exhaust , and coal use for winter heating. To fight pollution, the Chinese government now plans to clean up the air by cutting coal use,  _  some factories, and removing 6 million old cars from the roads. \"We must face up to the facts,\" said Yan Naiqiang, a professor of environmental science at Shanghai Jiao Tong University. \"The treatment of smog will be a long fight. From now on, if we use buses or cars less and do more riding, we believe a clear sky is not a faraway dream.\"", 
    "options": [
        [
            "coaches", 
            "trains", 
            "flights", 
            "double-deckers"
        ], 
        [
            "afforded", 
            "affected", 
            "admired", 
            "announced"
        ], 
        [
            "less", 
            "more", 
            "farther", 
            "nearer"
        ], 
        [
            "in", 
            "like", 
            "around", 
            "outside"
        ], 
        [
            "hats", 
            "gloves", 
            "sunglasses", 
            "masks"
        ], 
        [
            "classes", 
            "rest", 
            "work", 
            "shopping"
        ], 
        [
            "mainly", 
            "mostly", 
            "main", 
            "most"
        ], 
        [
            "that", 
            "this", 
            "one", 
            "it"
        ], 
        [
            "close", 
            "closing", 
            "open", 
            "opening"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "A", 
        "B", 
        "D", 
        "A", 
        "C", 
        "D", 
        "B"
    ], 
    "source": "middle486"
}