{
    "article": "My now 7-year-old grandson, who lives 100 miles away, has kept my phone number in his mind since he was 4. Since then, he has been  _  me every night before he goes to bed to tell me about his day or just to say \"Good night, Grandma.\" He also often calls me at other times during the day just to  _  a happy or sad moment. Many times he's playing a basketball with one hand, or laughing with a friend about something that I  _  quite understand, or crying about something he may or may not want to talk about while I'm on the other end of the phone. I just listen and empathize or laugh with him--just share his current  _  . I always let him control the  _  , and the time he's on the phone with me. Many times I just listen to him play, or play games we've made up together that we can play over the  _  . The only time I take control of the  _  is when he's ready to say goodbye at night. Often there are four special  _  I say to him every night. One night I thought maybe he was tired to hear those, so I didn't say them. He  _  called me back and told me that I forgot to say those sentences! I haven't missed saying them since then! My friends all know that he is the most important for me.  _  I'm in church , or some place where I really can't take his call, I always politely excuse myself and talk to him, even if it's just for a minute to tell him I'll call him back in a few minutes. He knows that he takes first place in my heart.", 
    "options": [
        [
            "troubling", 
            "seeing", 
            "promising", 
            "calling"
        ], 
        [
            "spend", 
            "enjoy", 
            "share", 
            "experience"
        ], 
        [
            "never", 
            "ever", 
            "nearly", 
            "fully"
        ], 
        [
            "secret", 
            "problem", 
            "plan", 
            "feeling"
        ], 
        [
            "action", 
            "result", 
            "topic", 
            "team"
        ], 
        [
            "experience", 
            "letter", 
            "Internet", 
            "phone"
        ], 
        [
            "work", 
            "talk", 
            "game", 
            "voice"
        ], 
        [
            "words", 
            "messages", 
            "sentences", 
            "rules"
        ], 
        [
            "immediately", 
            "usually", 
            "probably", 
            "especially"
        ], 
        [
            "Since", 
            "Unless", 
            "Before", 
            "As"
        ]
    ], 
    "answers": [
        "D", 
        "C", 
        "A", 
        "D", 
        "C", 
        "D", 
        "B", 
        "C", 
        "A", 
        "B"
    ], 
    "source": "middle903"
}