{
    "article": "When I was twelve years old, I went with my dad to his work -- a car showroom. I was walking _ carelessly and saw a poor woman with a child beside her standing outside the showroom. I saw that she was crying and went inside to tell my father. He went out and asked  the woman to come into the _ . He offered her some water and then asked her what was wrong.\nThe woman said that her _ had died and she didn't have anyone else in her family who could help her. She did some manual   labor to earn some money to take care of her daughter but the child was _ for the last three days and she was unable to go to work.  Now she didn't have a grain of food to eat. While she was telling this story to my father, she was unable to control  her emotions   and started _ again. My father and I were deeply moved by her story.\nWe got some food for her and her child. My father then took them to the nearest _ for her child to be treated as she did not seem to be very well. On the way, we _ her a 5kg-bag of wheat from the market. My father gave her some money before we left. The lady was so grateful.\nIt is eight years later, but that event is still very _ in my mind. My father's kindness to this woman moved me greatly and since then, I have _ to try and walk a similar path and serve others. I'm happy to see so many other people in this world are also ready to help others when they meet people in _ . They have chosen to walk a service path also.", 
    "options": [
        [
            "away", 
            "around", 
            "over", 
            "up"
        ], 
        [
            "car", 
            "office", 
            "showroom", 
            "kitchen"
        ], 
        [
            "Baby", 
            "mother", 
            "husband", 
            "brother"
        ], 
        [
            "sick", 
            "happy", 
            "busy", 
            "sad"
        ], 
        [
            "Working", 
            "talking", 
            "eating", 
            "crying"
        ], 
        [
            "hospital", 
            "restaurant", 
            "bank", 
            "station"
        ], 
        [
            "gave", 
            "made", 
            "bought", 
            "cooked"
        ], 
        [
            "weak", 
            "similar", 
            "Clean", 
            "fresh"
        ], 
        [
            "Learned", 
            "decided", 
            "remembered", 
            "helped"
        ], 
        [
            "Happiness", 
            "difficulty", 
            "business", 
            "space"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "C", 
        "A", 
        "D", 
        "A", 
        "C", 
        "D", 
        "B", 
        "B"
    ], 
    "source": "middle542"
}