{
    "article": "Kierman was born in Sydney, Australia, and grew up near the sea. For more than 40 years, he raced in international sailing competitions.\nIn 1987, Kierman was competing in an around-the-world race when he began to _ the huge amount of rubbish in the world's oceans. When he returned to Australia, he _ to do something about it.\nHe organized a community _ called \"Clean Up Sydney Harbour.\" On Sunday, January 8, 1989, more than 40,000 volunteers came out to _ away rubbish. The next year, Kierman made the clean-up a national event. It was a huge _ Across Australia, about 300,000 people spent the day improving their local _ .\nSince then, \"Clean Up Australia\" has got _ every year. In 2002, for example,800,000 people cleaned up almost 15,000 tons of rubbish from Australia's beaches, parks and streets.\nKierman was _ with the success of his project. In 2003, he started an even bigger program. With the _ of the United Nations Environment Program, he introduced \"Clean Up the World\", an international program that supports communities around the world in cleaning up and protecting the environment. \"Clean Up the World\" has grown _ and his wonderful idea has now spread from one city to the whole world.", 
    "options": [
        [
            "save", 
            "collect", 
            "notice", 
            "produce"
        ], 
        [
            "refused", 
            "decided", 
            "pretended", 
            "stopped"
        ], 
        [
            "law", 
            "party", 
            "company", 
            "event"
        ], 
        [
            "clear", 
            "send", 
            "turn", 
            "give"
        ], 
        [
            "problem", 
            "success", 
            "surprise", 
            "failure"
        ], 
        [
            "culture", 
            "project", 
            "government", 
            "environment"
        ], 
        [
            "older", 
            "smaller", 
            "bigger", 
            "faster"
        ], 
        [
            "happy", 
            "angry", 
            "disappointed", 
            "concerned"
        ], 
        [
            "need", 
            "help", 
            "hope", 
            "action"
        ], 
        [
            "loudly", 
            "gently", 
            "rapidly", 
            "busily"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "D", 
        "A", 
        "B", 
        "D", 
        "C", 
        "A", 
        "B", 
        "C"
    ], 
    "source": "middle2122"
}