{
    "article": "It was Christmas Eve. I was fifteen years old and feeling like the world was over for me. I didn't have enough money to buy myself the _ that I had wanted that year.\nDad came back in and there was ice in his beard . \"You've been by widow Smith's house recently?\" he asked. Widow Smith _ two miles down the road. Her husband died a year ago and left her with _ children.\n\"I rode by just today,\" Dad _ , \"Little Jack was out looking for wood. They must have used up wood, Tom.\"\nWe filled our sledge high with _ . Then we went to the store and Dad bought some food and a small pair of shoes. I tried to think about _ Dad was doing. I knew we didn't have enough money, so why was Dad buying them so many things?\nWe _ widow Smith's house and went in. \"We brought you a few things, madam.\" Dad said, and put down the bag of food on the table. Then Dad handed widow Smith the pair of shoes. At that moment, tears filled her eyes and started running down her face.\nMy throat seemed to be filled with _ , and there were tears in my eyes, too. Just then, my dream gift seemed very unimportant. Dad had given me the look on widow Smith's face and the smiles of _ three children. He had given me the best Christmas of my life.", 
    "options": [
        [
            "gift", 
            "ice", 
            "house", 
            "store"
        ], 
        [
            "taught", 
            "lived", 
            "studied", 
            "worked"
        ], 
        [
            "one", 
            "two", 
            "three", 
            "four"
        ], 
        [
            "continued", 
            "wrote", 
            "spoke", 
            "wondered"
        ], 
        [
            "clothes", 
            "shoes", 
            "food", 
            "wood"
        ], 
        [
            "why", 
            "what", 
            "which", 
            "how"
        ], 
        [
            "worried", 
            "returned", 
            "left", 
            "reached"
        ], 
        [
            "everything", 
            "something", 
            "anything", 
            "nothing"
        ], 
        [
            "my", 
            "his", 
            "her", 
            "their"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "C", 
        "A", 
        "D", 
        "B", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "middle1431"
}