{
    "article": "When I entered the classroom, our teacher announced we were going to have a math test. I looked at the paper full of what looked like hieroglyphs to me and began to  _  I did my best that I could, and then left my  _  to put my paper in a pile on the front desk with a sigh . I returned and then an idea came to my mind. I checked where the teacher was  _  I made my move. She was walking in the  _  of the room with hands behind her back. I went back to the pile of test papers that already handed in and when I picked up my paper I also got the paper below it. When I looked at the  _  paper I had taken, I discovered it was the work of the  _  girl in our class, I copied her answers to my paper. The next day when I got back my paper, I was  _  to see an \"F\" on it. After class I went to the girl and said to her, \"That math test was difficult and I  _  it. I guess we need to study more.\" Her reply was, \"Not me, I got every question right and got an 'A' \". The teacher knew about it. She didn't blame me in front of the class and  _  me to keep my dignity . I made a  _  to myself never to cheat again. I would remember to always be honest in the things I do.", 
    "options": [
        [
            "think", 
            "cry", 
            "worry", 
            "sleep"
        ], 
        [
            "partner", 
            "seat", 
            "classroom", 
            "teacher"
        ], 
        [
            "after", 
            "since", 
            "until", 
            "before"
        ], 
        [
            "front", 
            "middle", 
            "back", 
            "bottom"
        ], 
        [
            "extra", 
            "new", 
            "clean", 
            "difficult"
        ], 
        [
            "tallest", 
            "oldest", 
            "prettiest", 
            "smartest"
        ], 
        [
            "shocked", 
            "angry", 
            "happy", 
            "excited"
        ], 
        [
            "knew", 
            "made", 
            "failed", 
            "lost"
        ], 
        [
            "told", 
            "reminded", 
            "allowed", 
            "advised"
        ], 
        [
            "speech", 
            "promise", 
            "wish", 
            "joke"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "D", 
        "C", 
        "A", 
        "D", 
        "A", 
        "C", 
        "C", 
        "B"
    ], 
    "source": "middle2112"
}