{
    "article": "Robby was 11 years old when his mother (a single mom) sent him to have his first piano lesson. I prefer that students begin at an earlier age, but Robby said that it had always been his mother's  _  to hear him play the piano. So I  _  him as a student. Although Robby worked very hard, he didn't have a basic  _  of music. However, he never  _  up and continued. And at the end of each weekly lesson he'd always say: \"My mom is going to hear me  _  some day.\" But it seemed  _  . He didn't have a natural talent or ability for music. One day Robby  _  to our lessons very late. He told me that his mom had been  _  and unable to take him to piano lessons, but he was still  _  in class. He asked if he could take part in my concert and I  _  . The night of the concert came. The high school gym was  _  with parents, friends and relatives. The concert was going well. Then, Robby came up on stage. He announced that he had chosen Mozart's Concerto No 21 in C Major. I was not prepared for what I heard next. His  _  danced on the keys... He played so  _  that everyone was on his feet, clapping excitedly. In tears, I ran up on stage, \"Oh, Robby! How could you do it?\" \"Well, Miss Hondorf... remember I told you my mom was sick? Well, actually she had cancer and  _  away this morning. And well... she was born deaf, so tonight was the first time she ever heard me play at the  _  . I wanted to make it special and show her I could do it! My mother's dream came true at last.\"", 
    "options": [
        [
            "decision", 
            "conclusion", 
            "advice", 
            "dream"
        ], 
        [
            "considered", 
            "accepted", 
            "knew", 
            "protected"
        ], 
        [
            "sense", 
            "education", 
            "information", 
            "thought"
        ], 
        [
            "got", 
            "gave", 
            "stood", 
            "put"
        ], 
        [
            "sing", 
            "speak", 
            "play", 
            "call"
        ], 
        [
            "cheerless", 
            "helpless", 
            "hopeless", 
            "meaningless"
        ], 
        [
            "listened", 
            "flew", 
            "came", 
            "went"
        ], 
        [
            "asleep", 
            "deaf", 
            "well", 
            "ill"
        ], 
        [
            "writing", 
            "practicing", 
            "singing", 
            "talking"
        ], 
        [
            "agreed", 
            "disliked", 
            "expected", 
            "decided"
        ], 
        [
            "satisfied", 
            "bored", 
            "crowded", 
            "familiar"
        ], 
        [
            "fingers", 
            "feet", 
            "arms", 
            "legs"
        ], 
        [
            "carefully", 
            "cheerfully", 
            "meaningfully", 
            "wonderfully"
        ], 
        [
            "took", 
            "passed", 
            "moved", 
            "ran"
        ], 
        [
            "party", 
            "concert", 
            "meeting", 
            "show"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "A", 
        "B", 
        "C", 
        "C", 
        "C", 
        "D", 
        "B", 
        "A", 
        "C", 
        "A", 
        "D", 
        "B", 
        "B"
    ], 
    "source": "middle927"
}