{
    "article": "Though the great progress has been made in medical science, human beings are often attacked by cancer, which means death. A woman named Bonnie suffered a  _  of discomforts caused by the treatment of cancer. She didn't regard cancer as a deadly illness, but a laughing matter. She treated it In a humorous way. To put it in  another  way, she is teaching people that even though cancer isn't  _  ,we can treat it in a humorous way. Her second child was going to be born three months away  _  he was diagnosed with cancer. Suddenly, a happy mother turned into a helpless woman afraid for her own  _  .It was after she had had her baby that she had an operation. Then came chemo and her life seemed to be made up of fears and tears. But the  _  moment in her life came after she lost all her hair and a free wig arrived. She tried i c on as her older son Kyler watched. \"That was when I decided how to deal with it: crying over this bad wig or laughing about it. Either way would make  my son  remember it,\" Bonnie said. She spent a lot of time looking for anything funny from cancer patients. She got a lot out of collecting  _  stories. She started laughing a lot, finding it the perfect medicine. Using herself  _  a bald model, Bonnie set out to design her own greeting cards and calendars, making fun of the sufterings of chemo. \"  To have  joy, we badly need to laugh.\" she said. Clearly, you can increase your confidence to get over any disease and trouble by means of laughing.", 
    "options": [
        [
            "set", 
            "series", 
            "way", 
            "pack"
        ], 
        [
            "serious", 
            "terrible", 
            "fun", 
            "bad"
        ], 
        [
            "before", 
            "until", 
            "while", 
            "when"
        ], 
        [
            "son", 
            "illness", 
            "operation", 
            "life"
        ], 
        [
            "lowest", 
            "highest", 
            "great", 
            "ugly"
        ], 
        [
            "detective", 
            "romantic", 
            "different", 
            "humorous"
        ], 
        [
            "as", 
            "be", 
            "is", 
            "to"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "D", 
        "D", 
        "A", 
        "D", 
        "A"
    ], 
    "source": "middle527"
}