{
    "article": "Once when Kevin was selling hats under a big tree, the monkeys on the tree picked some hats and put them on. So Kevin took off his own hat and threw _ on the ground. The stupid monkeys threw their hats, too! Kevin soon _ all the hats and left happily.\nFifty years later, young Tony, _ of Kevin, also sold hats for a living. _ a long walk, Tony was tired, so he put his bag of hats beside him and laid down under a big tree. He was soon fast _ .\nWhen he woke up, Tony found that there weren't any hats in his bag! Tony started looking for his hats. To his _ , he found some monkeys on the tree wearing his hats.\nTony didn't know what to do. Then he remembered the story his grandfather _ used to tell him. \"Yes! I can fool these monkeys!\" said Tony. \"I'll _ them imitate   me and very soon I will get all my hats back!\"\nTony then waved at the monkeys, the monkeys waved at him. Tony started dancing, the monkeys were also dancing. Tony threw his hat on the ground...\nJust then, one of the monkeys jumped down _ the tree, picked up the hat Tony threw on the ground and _ up to Tony. He said, \"Do you think only you had a grandfather?\"", 
    "options": [
        [
            "it", 
            "its", 
            "him", 
            "his"
        ], 
        [
            "pointed", 
            "put", 
            "collected", 
            "matched"
        ], 
        [
            "father", 
            "son", 
            "grandson", 
            "friend"
        ], 
        [
            "When", 
            "After", 
            "Before", 
            "As"
        ], 
        [
            "alive", 
            "afraid", 
            "awake", 
            "asleep"
        ], 
        [
            "pleasure", 
            "interest", 
            "value", 
            "surprise"
        ], 
        [
            "recently", 
            "luckily", 
            "proudly", 
            "angrily"
        ], 
        [
            "tell", 
            "make", 
            "promise", 
            "realize"
        ], 
        [
            "from", 
            "beside", 
            "toward", 
            "through"
        ], 
        [
            "put", 
            "brought", 
            "walked", 
            "took"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "C", 
        "B", 
        "D", 
        "D", 
        "C", 
        "B", 
        "A", 
        "C"
    ], 
    "source": "middle2158"
}