{
    "article": "I came to study in the US last fall. My life was quite simple when I arrived at Andover. Although I had quite a few after-class activities, I didn't take any official leadership position.\nThis _ changed when I received an email from Ms Griffith, my cluster dean  , _ that a new female DC Rep was needed. DC Rep stands for Discipline Committee Representative. _ students living in school break serious rules, like taking drugs, getting drunk or cheating in their studies. Such students must be punished . The punishments are _ by a DC Rep, two student representatives  and the cluster dean. I was really interested in becoming DC Rep for my cluster, Pine Knoll, _ so were five other students. We had to hold an election and Ms Griffith asked us to write _ to be sent to everyone in Pine Knoll.\nI thought hard about what to _ . I didn't want to make any promises, because they are difficult to keep. I didn't want to say I was experienced, because I was not. So I started my speech by explaining _ I wanted to become DC Rep. \"I want to serve Pine Knoll.\" I wrote _ .\nI made three posters that said \"Vote For Teresa\" and put them on every exit of my cluster so that people would _ my name when they went to vote.\nAlthough I tried hard, I didn't win the election . I was disappointed, but my positive nature did not allow me to feel down for very long. I actually _ when my friends tried to comfort me. \"Teresa, I am sorry that you didn't win the election,\" they would say.\n\"No, don't be sorry for me. I am very happy to have taken part in the election,\" I said.\nIt is true that the process is much more important than the _ . I am surprised and happy to discover my hidden _ .", 
    "options": [
        [
            "school", 
            "situation", 
            "time", 
            "life"
        ], 
        [
            "explaining", 
            "writing", 
            "saying", 
            "talking"
        ], 
        [
            "Usually", 
            "Seldom", 
            "Often", 
            "Sometimes"
        ], 
        [
            "carried", 
            "given", 
            "made", 
            "decided"
        ], 
        [
            "or", 
            "though", 
            "but", 
            "and"
        ], 
        [
            "speeches", 
            "articles", 
            "compositions", 
            "introductions"
        ], 
        [
            "write", 
            "prepare", 
            "answer", 
            "give"
        ], 
        [
            "how", 
            "whether", 
            "when", 
            "why"
        ], 
        [
            "carefully", 
            "easily", 
            "rudely", 
            "honestly"
        ], 
        [
            "recognize", 
            "remember", 
            "forget", 
            "mind"
        ], 
        [
            "smiled", 
            "cried", 
            "laughed", 
            "shouted"
        ], 
        [
            "result", 
            "aim", 
            "reason", 
            "study"
        ], 
        [
            "strength", 
            "courage", 
            "way", 
            "skill"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "D", 
        "D", 
        "C", 
        "A", 
        "A", 
        "D", 
        "D", 
        "B", 
        "A", 
        "A", 
        "B"
    ], 
    "source": "middle2319"
}