{
    "article": "When I was a naughty boy, maybe because of the influence of the film \"Xiao Bing Zhang Ga\", my dream was to be a  _  just like Zhang Ga. I thought if I was a soldier, I should be able to swim, dive and climb trees  as  he did. It seemed to be very  _  . So I began to learn swimming, diving and climbing trees. I practiced every day and finally I  could  do them well. But when I entered junior high school and had the military training , I suddenly found that  being  a soldier was very difficult and I wasn't strong enough to stand it. I had to  give up  my dream. But I wasn't  _  , and I had a new aim, which was to be a postman, or rather to be a newspaper boy. As a newspaper boy, I could  _  along streets on a bike and throw newspapers onto every porch. That's also very cool. So I started learning to ride a bicycle. After the everyday  _  , I could go very fast by bicycle. But  _  my disappointment, the job which I wanted only existed in western countries not in China, because there was no porch in China. And Chinese postmen had to put very thick newspapers into very small mailboxes from very narrow entrances. The job was far from  _  I had expected. So once again my dream fell through. Perhaps you have had the same experience as I and most of your dreams haven't come true  _  . But I think it doesn't matter, because if you have a dream, you'll make many efforts to realize it. This course is really important.  _  I hadn't dreamt of being a soldier or a newspaper boy, I wouldn't have learned to swim, to dive, to climb trees or to ride a bicycle. Even if we can't  achieve  our dream, we'll learn much from the efforts we have made. So what I want to tell us is that dream helps us grow up and teaches us how  to control  our lives. It is dream that gives us power and makes our lives colorful.", 
    "options": [
        [
            "teacher", 
            "soldier", 
            "postman", 
            "writer"
        ], 
        [
            "wonderful", 
            "bad", 
            "wonderfully", 
            "badly"
        ], 
        [
            "discouraged", 
            "pleased", 
            "angry", 
            "nervous"
        ], 
        [
            "speed", 
            "ride", 
            "take", 
            "run"
        ], 
        [
            "ride", 
            "train", 
            "practice", 
            "coach"
        ], 
        [
            "in", 
            "on", 
            "to", 
            "at"
        ], 
        [
            "how", 
            "what", 
            "that", 
            "where"
        ], 
        [
            "too", 
            "yet", 
            "either", 
            "also"
        ], 
        [
            "If", 
            "Because", 
            "Unless", 
            "Though"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "A", 
        "A", 
        "C", 
        "C", 
        "B", 
        "C", 
        "A"
    ], 
    "source": "middle281"
}