{
    "article": "\"You don't understand me!\" I shouted. Then I ran out of the door and got on a bus. I didn't know  _  it was going. I just want to get away from home as  _  as I could.\nI couldn't  _  what had just happened to me. My mother, the person I believe in, had just read all of my  _  from my close friends! It shouldn't have happened to me. She read my letters and told me not to write to  _ any more! I couldn't  _  the tears from falling when I thought about this.\nLater that day, I went to my close  _  house.  _  my friend gave me a cup of water, the phone rang.\n\"It's your mother,\" she spoke to me in a low  _ .\n\"Tell her that I'm not here!\" I replied. However my mother heard it. \"Tell her not to leave! I'll be right there!\" Then she rang up the phone  _  a goodbye. In fact, I should say that I was a little  _ I couldn't imagine what would happen.\nBut to my  _ , when my mother arrived, \"sorry\" was the first word she  _  to me. Her  _  told me that she had been crying and her voice told me that she was really tired. \"will you forgive me?\" at last she asked. I didn't know what to say. I just  ran to  her, and gave her a hug .\nShe held me so tightly. You know, at that time, I felt so warm. I really love you, Mum!", 
    "options": [
        [
            "where", 
            "what", 
            "why", 
            "when"
        ], 
        [
            "happily", 
            "slowly", 
            "carefully", 
            "quietly"
        ], 
        [
            "remember", 
            "talk", 
            "believe", 
            "ask"
        ], 
        [
            "letters", 
            "books", 
            "magazines", 
            "novels"
        ], 
        [
            "him", 
            "them", 
            "you", 
            "her"
        ], 
        [
            "make", 
            "think", 
            "stop", 
            "find"
        ], 
        [
            "classmate's", 
            "relatives", 
            "teacher's", 
            "friend's"
        ], 
        [
            "Unless", 
            "If", 
            "After", 
            "Since"
        ], 
        [
            "voice", 
            "sound", 
            "noise", 
            "silence"
        ], 
        [
            "during", 
            "without", 
            "towards", 
            "from"
        ], 
        [
            "satisfied", 
            "bored", 
            "worried", 
            "interested"
        ], 
        [
            "surprise", 
            "mind", 
            "body", 
            "heart"
        ], 
        [
            "told", 
            "said", 
            "asked", 
            "heard"
        ], 
        [
            "ears", 
            "arms", 
            "hands", 
            "eyes"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "C", 
        "A", 
        "B", 
        "C", 
        "D", 
        "C", 
        "A", 
        "B", 
        "C", 
        "A", 
        "B", 
        "D"
    ], 
    "source": "middle1549"
}