{
    "article": "In one's life, one usually has little understanding of oneself. When you succeed, you may be very proud. When you  _  you may lose heart. If you don't get a thorough understanding of yourself, you may miss lots of  _  in life. To get a thorough understanding of yourself is to know  _  about yourself. You may realize your strong points and weak  _  .You may hope for a wonderful future, but be sure not to expect too much because not all dreams can be  _  . You may be confident enough to meet challenges, but first you should know  what to do  . To get a thorough understanding of yourself needs self-appreciation. Maybe you think you are not a tall tree  _  just small grass, but as long as you get full confidence, you are sure to face any trouble. To get a thorough understanding of yourself also means to  look after  yourself. When you are angry, find a quiet place so that you won't be hurt. When you are sad, tell your friends about it to  _  the mood into a good one. When you are tired, get a good sleep. If you don't take good care of yourself, you  _  be able to stay away from illness. So if you get a thorough understanding of yourself, and you will get a full control of yourself and find your life full of color.", 
    "options": [
        [
            "fail", 
            "win", 
            "beat", 
            "have"
        ], 
        [
            "lessons", 
            "problems", 
            "chances", 
            "choose"
        ], 
        [
            "little", 
            "well", 
            "badly", 
            "worse"
        ], 
        [
            "one", 
            "ones", 
            "it", 
            "those"
        ], 
        [
            "realized", 
            "remembered", 
            "replied", 
            "receive"
        ], 
        [
            "or", 
            "but", 
            "and", 
            "if"
        ], 
        [
            "change", 
            "cut", 
            "throw", 
            "show"
        ], 
        [
            "will", 
            "won't", 
            "need", 
            "may"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "B", 
        "B", 
        "A", 
        "B", 
        "A", 
        "B"
    ], 
    "source": "middle2033"
}