{
    "article": "Keeping traditions alive is never an easy thing. Chen Zunkai, the owner of Baoyuan Dumpling House, has  _  the past 16 years improving one of the most traditional Chinese foods: jiaozi. Her  _  are not the white crescent-shaped ones simply filled  _  pork or lamb, but colorful ones using more than 150 kinds of fillings. \"  _  I try to do is to make dumplings have a taste of home,\" Chen says. \"I hope every customer, Northerners or Southerners, vegetarians or non-vegetarians, Chinese people or foreigners can  _  something familiar.\" Chinese dumplings are believed  to be  more than 2,000 years old.  _  , they are made and eaten by people in North China at some festivals such as the winter solstice . To  _  the year-end cold, people usually fill dumplings with strongly flavored meat such as pork or lamb. For Chen, her  _  came after she noticed that there were not many choices for those  _  prefer lighter fillings. Most vegetarian dumplings have a filling of only two kinds of ingredients, and not one restaurant in Beijing has more than 10 kinds of vegetarian fillings. \"I think I can make it,\" Chen says.", 
    "options": [
        [
            "wasted", 
            "paid", 
            "spent", 
            "cost"
        ], 
        [
            "dumplings", 
            "noodles", 
            "cakes", 
            "cookies"
        ], 
        [
            "by", 
            "from", 
            "of", 
            "with"
        ], 
        [
            "Which", 
            "Where", 
            "What", 
            "When"
        ], 
        [
            "smell", 
            "taste", 
            "feel", 
            "touch"
        ], 
        [
            "Suddenly", 
            "Luckily", 
            "Traditionally", 
            "Finally"
        ], 
        [
            "get", 
            "refuse", 
            "enjoy", 
            "fight"
        ], 
        [
            "plan", 
            "idea", 
            "information", 
            "advice"
        ], 
        [
            "which", 
            "whom", 
            "who", 
            "/"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "C", 
        "B", 
        "C", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "middle1847"
}