{
    "article": "A successful man said, \"Find a dream and do whatever it takes to make it come true.\" A young man didn't know how to face his work. One day he was sitting in a park watching squirrels run in the trees. Suddenly, a squirrel jumped from one high tree to another. It seemed to  _  for a branch so far out of reach that the jump looked impossible. And sure enough, the squirrel  _  . But it still landed safely on a branch several feet lower. Then it just climbed up a little higher and reached the branch it really  _  . An old man sitting near the young man said, \"It's  _  . I have seen a lot of squirrels jump like that. A lot of them miss, but I have never seen one of them get hurt. I guess they have got to risk it if they don' t want to spend their whole life  _  one tree. \" Then the young man thought, \"If a little squirrel is  _  to take a chance, do I have less  _  than a squirrel?\" At that moment he decided to take a risk he had been thinking about. And sure enough, he landed safely in a position he  _  thought possible. Shoot for the moon.  Even if  you miss, you will land among the stars, and you will still end up higher and better than  _  you are now. Since life is short and time goes by so fast, why not make it the best one possible?", 
    "options": [
        [
            "search", 
            "care", 
            "aim", 
            "stand"
        ], 
        [
            "succeeded", 
            "fell", 
            "missed", 
            "appeared"
        ], 
        [
            "rested", 
            "liked", 
            "discovered", 
            "wanted"
        ], 
        [
            "dangerous", 
            "funny", 
            "exciting", 
            "boring"
        ], 
        [
            "in", 
            "on", 
            "at", 
            "by"
        ], 
        [
            "afraid", 
            "ready", 
            "nervous", 
            "lucky"
        ], 
        [
            "chance", 
            "time", 
            "sense", 
            "courage"
        ], 
        [
            "never", 
            "always", 
            "still", 
            "sometimes"
        ], 
        [
            "how", 
            "who", 
            "where", 
            "what"
        ]
    ], 
    "answers": [
        "C", 
        "C", 
        "D", 
        "B", 
        "A", 
        "B", 
        "D", 
        "A", 
        "C"
    ], 
    "source": "middle947"
}