{
    "article": "I have a friend named Monty Roberts who owns a horse ranch .He has let me use his  _  to raise money for youth at risk programs. The last time I was there he told me his story.when he was young, his family is too  _  to have a house to live in.As a  _  , when he was in high school, he was asked to write a paper about  _  he wanted to be and do when he grew up.That night he wrote a seven-page paper describing his goal of  _  a horse ranch.He also drew a picture to show a 4,000-square-foot house that would sit on a beautiful farm.The next day he handed it in to his  _  .Two days later he received his paper back.On the front page was a large red F.Roberts asked, \"Why did I receive an F?\" He teacher said, \"This is a(an)  _  dream for a young boy like you.Owning a horse ranch requires a lot of money.\" Then the teacher added, \"If you will rewrite this paper with a more realistic goal, I will reconsider your  _  .\" The boy went home and thought about it for a  _  and hard time.He asked his father what he should do.His father said, \"Look, son, you have to  have  your own mind on this.Finally, after sitting with it for a week, the boy turned in the same paper, making no  _  at all.He told his teacher \"you could keep the F and I  _  keep my dream. Monty tell me this  _  because I am sitting in his 4,000-square-foot house in the middle of my 200-acre horse ranch.He said a lot of kids's  _  can be stole.Don't let anyone steal your dreams.Follow your heart, no matter what.  _  he had enough gumption not to give up my dream.", 
    "options": [
        [
            "name", 
            "company", 
            "ranch", 
            "school"
        ], 
        [
            "small", 
            "busy", 
            "poor", 
            "lazy"
        ], 
        [
            "present", 
            "return", 
            "punishment", 
            "result"
        ], 
        [
            "what", 
            "which", 
            "whom", 
            "who"
        ], 
        [
            "renting", 
            "donating", 
            "owning", 
            "kitchen"
        ], 
        [
            "teacher", 
            "father", 
            "friend", 
            "wife"
        ], 
        [
            "surprised", 
            "great", 
            "terrible", 
            "unrealistic"
        ], 
        [
            "work", 
            "grade", 
            "family", 
            "ability"
        ], 
        [
            "easy", 
            "long", 
            "short", 
            "hurry"
        ], 
        [
            "decision", 
            "reason", 
            "excuse", 
            "changes"
        ], 
        [
            "never", 
            "still", 
            "sometimes", 
            "even"
        ], 
        [
            "square", 
            "story", 
            "house", 
            "teacher"
        ], 
        [
            "money", 
            "house", 
            "dream", 
            "hobbies"
        ], 
        [
            "Quickly", 
            "Suddenly", 
            "Unluckily", 
            "Fortunately"
        ]
    ], 
    "answers": [
        "C", 
        "C", 
        "D", 
        "A", 
        "C", 
        "A", 
        "D", 
        "B", 
        "B", 
        "D", 
        "B", 
        "B", 
        "C", 
        "D"
    ], 
    "source": "middle221"
}