{
    "article": "A 10-year-old boy decided to study judo* although he had lost his left arm in a car accident. The boy began  _  with a Japanese judo coach. The boy was doing well, so he couldn't know  _  the coach taught him only one move. After three months of  _  , the boy finally asked, \"Sir, should I start to learn more moves?\" \"This is the only move you know,  _  this is the only move you'll need to know,\" the coach replied. Not quite understanding, but the boy  believed in  his teacher. So he kept training. Several months  _  , the coach took the boy to his first match. To his surprise, the boy  _  won his first match. The second match was more difficult. But after some time, his opponent* became impatient. The boy used his one move to win the match again.  _  of the people in the stadium were amazed by his success. The boy was now in the finals. This time, his opponent was bigger,  _  , and more experienced. For a while, the boy seemed to  _  . Worried that the boy  _  get hurt, someone shouted, \"Stop! Stop! Stop!\" However, the coach said, \"No,  _  .\" As the match was keeping on, his opponent made a big mistake: he dropped his guard. Quickly, the boy used his move to  _  him. The boy won the final match. He was the winner.  _  the way home, the boy asked his coach: \"Sir, how did I win the match with only one move?\" \"You won for  _  reasons,\" the coach answered, \"First, you've almost known one of the most difficult moves in all of judo. And second, the only defense* for that move is for your opponent to catch your left arm.\" The boy's greatest weakness had become his greatest strength.", 
    "options": [
        [
            "class", 
            "learn", 
            "lessons", 
            "work"
        ], 
        [
            "why", 
            "what", 
            "when", 
            "how"
        ], 
        [
            "doing", 
            "running", 
            "writing", 
            "training"
        ], 
        [
            "so", 
            "but", 
            "or", 
            "until"
        ], 
        [
            "later", 
            "ago", 
            "before", 
            "after"
        ], 
        [
            "slowly", 
            "easily", 
            "carefully", 
            "hardly"
        ], 
        [
            "None", 
            "Both", 
            "All", 
            "Either"
        ], 
        [
            "weaker", 
            "worse", 
            "cuter", 
            "stronger"
        ], 
        [
            "win", 
            "lose", 
            "take", 
            "throw"
        ], 
        [
            "might", 
            "can", 
            "must", 
            "should"
        ], 
        [
            "stop", 
            "play", 
            "stay", 
            "continue"
        ], 
        [
            "fail", 
            "win", 
            "get", 
            "beat"
        ], 
        [
            "In", 
            "At", 
            "On", 
            "For"
        ], 
        [
            "one", 
            "two", 
            "three", 
            "four"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "B", 
        "A", 
        "B", 
        "C", 
        "D", 
        "B", 
        "A", 
        "D", 
        "D", 
        "C", 
        "B"
    ], 
    "source": "middle673"
}