{
    "article": "Once there was a poor little girl living near a forest. She had no family and no one to love her. So she often  _  sad and lonely. One day, when she was walking in the forest, she found that a small  _  was trapped unluckily in a bush. The butterfly tried to fly away  _  failed. The kind little girl saved the butterfly with great care. Instead of flying away, the butterfly turned  _  a beautiful fairy . The little girl was very  _  . \"Thank you for  _  me. You are so kind. I will make any of your dreams come true.\" said the fairy. The little girl thought for a moment and then said, \"I want to be  _  !\" The fairy said, \"Very well. I will help you.\" And she said something in the little girl's ear. Then the fairy disappeared. As the kind little girl grew up, she was  _  ready to help people in need and was popular among the villagers. No one in the village was as happy as she was. Everyone asked her the  _  of her happiness. She always smiled and  _  , \"The secret of my happiness is that I listened to a kind  _  when I was a little girl.\" When the kind girl became a very old woman and was dying, the neighbours in the  _  all gathered around her bed because they were  _  that her secret of happiness would die with her. They asked, \"Please tell us what the kind fairy said.\" The lovely old woman still  _  and said, \"She told me that everyone needed me, no matter how safe they seemed, no matter how rich or poor, no matter how old or  _  . She said that helping others would make me happy all my life.\"", 
    "options": [
        [
            "thought", 
            "found", 
            "sounded", 
            "felt"
        ], 
        [
            "butterfly", 
            "bird", 
            "snake", 
            "squirrel"
        ], 
        [
            "so", 
            "or", 
            "but", 
            "as"
        ], 
        [
            "on", 
            "up", 
            "into", 
            "down"
        ], 
        [
            "surprised", 
            "tired", 
            "mad", 
            "angry"
        ], 
        [
            "catching", 
            "beating", 
            "killing", 
            "saving"
        ], 
        [
            "active", 
            "happy", 
            "energetic", 
            "humorous"
        ], 
        [
            "always", 
            "never", 
            "seldom", 
            "hardly"
        ], 
        [
            "success", 
            "secret", 
            "power", 
            "lesson"
        ], 
        [
            "asked", 
            "hoped", 
            "answered", 
            "refused"
        ], 
        [
            "witch", 
            "fairy", 
            "ghost", 
            "princess"
        ], 
        [
            "village", 
            "town", 
            "city", 
            "world"
        ], 
        [
            "excited", 
            "pleased", 
            "glad", 
            "afraid"
        ], 
        [
            "shouted", 
            "cried", 
            "smiled", 
            "jumped"
        ], 
        [
            "young", 
            "great", 
            "nice", 
            "quiet"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "C", 
        "C", 
        "A", 
        "D", 
        "B", 
        "A", 
        "B", 
        "C", 
        "B", 
        "A", 
        "D", 
        "C", 
        "A"
    ], 
    "source": "middle974"
}