{
    "article": "George lived with his sick mother in a poor village. One bright sunny _ in July, he went early to the forest two miles away. He was asked to pick up some wood. After working hard for half a day, he looked around for a _ place to rest and eat his lunch. Suddenly some fine red wild _ caught his eye. \"How good these will be with my bread and butter!\" George thought. He at once began to _ all the strawberries he could find, then sat down by the river, ready to enjoy them. Just then as he was putting the _ strawberry into his mouth, he thought of his mother. \"Shall I _ them for her?\" He imagined how much they would make _ happy, yet still looking at them with longing   eyes.\n\"I will eat half, and take the other half to her,\" he said. Then he divided the strawberries into two. _ he found each half looked too small, so he put them together again. \"I will only taste one.\" Then he took the biggest one, butt soon put it back. Finally, he carefully _ them with leaves, deciding to keep them all _ his mother.\nWhen the sun was beginning to go down, George went home. _ happy he felt that he had all his strawberries for his sick mother! The _ he came to his home, the less he wished to taste them. As soon as he _ , he ran to his mother and happily and offered his wild strawberries. Tears in eyes, she put her hand on his head and said _ : \"And you kept them for me, did you? God will bless you for all this, my child.\"\nCould the eating of the strawberries have given half the happiness he felt at the moment?", 
    "options": [
        [
            "morning", 
            "noon", 
            "afternoon", 
            "night"
        ], 
        [
            "hot", 
            "dark", 
            "cool", 
            "noisy"
        ], 
        [
            "apples", 
            "strawberries", 
            "pears", 
            "peaches"
        ], 
        [
            "buy", 
            "grow", 
            "make", 
            "collect"
        ], 
        [
            "first", 
            "last", 
            "other", 
            "next"
        ], 
        [
            "cut", 
            "make", 
            "sell", 
            "save"
        ], 
        [
            "him", 
            "them", 
            "her", 
            "it"
        ], 
        [
            "But", 
            "So", 
            "If", 
            "Or"
        ], 
        [
            "showed", 
            "locked", 
            "covered", 
            "washed"
        ], 
        [
            "to", 
            "from", 
            "for", 
            "on"
        ], 
        [
            "What", 
            "How", 
            "Why", 
            "Whether"
        ], 
        [
            "nearer", 
            "farther", 
            "longer", 
            "later"
        ], 
        [
            "got", 
            "reached", 
            "went", 
            "arrived"
        ], 
        [
            "angrily", 
            "lovingly", 
            "worriedly", 
            "politely"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "B", 
        "D", 
        "A", 
        "D", 
        "C", 
        "A", 
        "C", 
        "C", 
        "B", 
        "A", 
        "D", 
        "B"
    ], 
    "source": "middle1636"
}