{
    "article": "Alan is a schoolboy. He is good at all his subjects .He thinks computers can help him with his homework. So Alan wanted a computer last week. He asked his parents _ the money and they said he must get it himself. But how did he get it? He _ about this when he walked home. Not many people wanted to ask children to work for them. Maybe he could take away snow for the neighbors. But this was not _ . He had to wait a long time for that. He couldn't cut grass for their gardens _ he had no tools to do the work with.\nThen he saw one of his classmates, Dick, delivering    newspaper. I could do that, he thought. Maybe I could even get the computer _  away. I could pay for it a little each week. He ran to _  up with Dick. Alan asked him a lot of questions. He learned that it was _  to get twenty-five dollars each week. He learned that the job took about three hours each night. Dick _ him the phone number of the newspaper manager Alan almost flew home. After he had told his mother _ he thought, she smiled \"I think it is a  great idea,\" she said, \"I'll call the newspaper....\"\n\"Wait, Mum,\" Alan said, \"I'll call. After that, I'm going to be a businessman now.\"\nAlan's mother smiled _  . We should learn from him.", 
    "options": [
        [
            "in", 
            "at", 
            "with", 
            "for"
        ], 
        [
            "said", 
            "told", 
            "thought", 
            "spoke"
        ], 
        [
            "spring", 
            "summer", 
            "autumn", 
            "winter"
        ], 
        [
            "when", 
            "because", 
            "while", 
            "after"
        ], 
        [
            "now", 
            "right", 
            "just", 
            "only"
        ], 
        [
            "take", 
            "catch", 
            "carry", 
            "put"
        ], 
        [
            "friendly", 
            "kind", 
            "wrong", 
            "possible"
        ], 
        [
            "taught", 
            "gave", 
            "made", 
            "asked"
        ], 
        [
            "that", 
            "when", 
            "what", 
            "where"
        ], 
        [
            "sadly", 
            "happily", 
            "politely", 
            "happy"
        ]
    ], 
    "answers": [
        "D", 
        "C", 
        "D", 
        "B", 
        "B", 
        "B", 
        "D", 
        "B", 
        "C", 
        "B"
    ], 
    "source": "middle1453"
}