{
    "article": "One's education starts from family, especially from his or her mother. Here is a story  _  happened in my childhood. One Saturday morning, I was watching TV in the living room with my two brothers. My mum  _  several apples of different colors and sizes. She put all the apples on the table, then  _  me and my younger brothers, \"Which do you like ?\"  _  my younger brothers and I wanted the biggest one.  _  I could say \" The biggest one\", one of my brothers stood up and said what I wanted to say. My mum  picked up  the biggest apple and said to us, \"It is  _  to get the biggest apple. Many people want the best thing, but few really get it. Now let's start a  _  . Look at the lawn in front of our  _  . I'll divide it into three parts. Each of you must finish pruning  _  own share. The best and quickest one will be  _  the biggest apple.\" I won the apple finally. Since then, I have learned to try my best to succeed whenever I get a chance. I work  _  to get what I want. That was what my mother advised me to do. I feel very thankful to my mum because she taught me a very basic but the most  _  lesson. It is quite fair that we can get what we want  _  competing . My mother kept teaching us in this way and we followed her  _  all the time. I do believe that mother is the first teacher of children, who can teach them to be a No.1 pursuing person.", 
    "options": [
        [
            "how", 
            "what", 
            "that", 
            "when"
        ], 
        [
            "wanted", 
            "drew", 
            "hid", 
            "brought"
        ], 
        [
            "told", 
            "answered", 
            "replied", 
            "asked"
        ], 
        [
            "All", 
            "Both", 
            "Neither", 
            "Either"
        ], 
        [
            "Before", 
            "When", 
            "Until", 
            "After"
        ], 
        [
            "good", 
            "strange", 
            "bad", 
            "polite"
        ], 
        [
            "lesson", 
            "party", 
            "conversation", 
            "competition"
        ], 
        [
            "school", 
            "church", 
            "house", 
            "library"
        ], 
        [
            "my", 
            "our", 
            "your", 
            "their"
        ], 
        [
            "sent", 
            "given", 
            "shown", 
            "shared"
        ], 
        [
            "hard", 
            "carelessly", 
            "easily", 
            "comfortably"
        ], 
        [
            "expensive", 
            "important", 
            "difficult", 
            "traditional"
        ], 
        [
            "on", 
            "without", 
            "about", 
            "by"
        ], 
        [
            "advice", 
            "example", 
            "decision", 
            "plan"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "D", 
        "B", 
        "A", 
        "A", 
        "D", 
        "C", 
        "C", 
        "B", 
        "A", 
        "B", 
        "D", 
        "A"
    ], 
    "source": "middle866"
}