{
    "article": "Now and then you are not satisfied with yourself, thinking you're short of beauty, short of money or short of friendship. _ , all these are not necessary. Why not learn to love yourself?\nLoving yourself means loving everything in you, your height, your voice, your eyes, your hair, even including your mistakes. Don't feel ashamed that you will be laughed at when you are wrong. As we know, no one is perfect. Is there anybody in the world who makes _ mistake at all? Of course not. Always ask yourself, \"Am I getting _ just because of the mistakes I made?\" Or \"Do I have the courage to correct my mistake?\" _ the answer is yes or no, holding a positive attitude is of great importance. Face bravely the mistakes you made yesterday and try your best to encourage yourself to learn _ them. They might be your best teachers. You don't need someone else to tell you how to correct your mistakes. When correcting the mistakes and making decisions on your own, you will find you are stronger and stronger with each passing day. Remember, the one who loves _ can gain the love from others. You enjoy being liked and loved, but don't _ everybody to like you. If somebody doesn't like you, it is still OK. Being what you are is the best way to show you love for yourself. All above will teach you how to grow up and bring you great _ in your life.\nMy dear friends, every morning when you open your eyes, it's a gift from life. Get started from now on . Never allow yourself to become discouraged. Since you're the only one in the world, love yourself and smile every day!", 
    "options": [
        [
            "Immediately", 
            "Closely", 
            "Actually", 
            "Suddenly"
        ], 
        [
            "some", 
            "any", 
            "no", 
            "few"
        ], 
        [
            "sad", 
            "excited", 
            "pleased", 
            "sadly"
        ], 
        [
            "Weather", 
            "If", 
            "Whether", 
            "Although"
        ], 
        [
            "on", 
            "from", 
            "at", 
            "about"
        ], 
        [
            "himself", 
            "itself", 
            "ourselves", 
            "yourself"
        ], 
        [
            "hope", 
            "let", 
            "expect", 
            "make"
        ], 
        [
            "behavior", 
            "blindness", 
            "kindness", 
            "success"
        ]
    ], 
    "answers": [
        "C", 
        "C", 
        "A", 
        "C", 
        "B", 
        "A", 
        "C", 
        "D"
    ], 
    "source": "middle867"
}