{
    "article": "John Brown was a shopkeeper. He sold and repaired watches in his small shop. One day his cousin, Mike, came to the shop and said to him, \"I've lost my job. Do you _ if I work in your shop?\" \"Certainly not. I'll teach you everything I know about watches,\" John told Mike. For the first few weeks, Mike worked very hard. He was polite and helpful to the customers  . He cleaned the shelves and _ where everything was in the shop. John was very pleased with him. While Mike looked _ the front of the shop, John was able to work and build up the repair business in the back room.\nAfter a month and a half, Mike asked, \"Is there anything else you want to  _ me?\"\n\"Yes, Mike, there is,\" John said. \"It's time I taught you the secret of our  _ .\"\n\"I think I know that,\" Mike said. \"You buy watches at one price and sell them at a higher price. The _ in price is our profit  .\"\n\"That's true, but it's not where we make most of our profit,\" John said. He  picked up a watch from the counter  . \"Do you think this watch is a good one?\" he asked Mike. \"No, I don't think so. It's a cheap one,\" the young man answered. \"We can't make much profit from selling those. Perhaps only a few dollars each.\"\n\"That's where you are _ , my boy,\" John said. \"Those watches make more profit than any other watch in the shop.\"\n\"Could you tell me  _ those cheap watches make more profit?\" Mike asked.\n\"They are really cheap, but they are always _ ,\" John told him. \"We make our profit from repairing them.\"", 
    "options": [
        [
            "worry", 
            "mind", 
            "know", 
            "agree"
        ], 
        [
            "showed", 
            "answered", 
            "learned", 
            "explained"
        ], 
        [
            "after", 
            "for", 
            "at", 
            "towards"
        ], 
        [
            "give", 
            "present", 
            "test", 
            "teach"
        ], 
        [
            "plan", 
            "experience", 
            "success", 
            "message"
        ], 
        [
            "discount", 
            "choice", 
            "difference", 
            "level"
        ], 
        [
            "careless", 
            "impatient", 
            "unlucky", 
            "wrong"
        ], 
        [
            "why", 
            "when", 
            "where", 
            "whether"
        ], 
        [
            "improving", 
            "working", 
            "changing", 
            "Breaking"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "D", 
        "C", 
        "C", 
        "D", 
        "A", 
        "D"
    ], 
    "source": "middle340"
}