{
    "article": "One day, the students of Class 6 were reading in the classroom. Mrs. Brown came in and told the whole class that they would have to change _ in March. The naughtiest   class in the grade could not _ it. The pupils all disagreed with the decision, so they shouted when Mrs. Brown said it was because a new pupil would be _ the class. The class was in disorder  . \"Why must we move to another classroom just because someone new is coming?\" one of them asked _ . Mrs. Brown waited patiently before the class without saying anything. The students saw it and they became quiet. Mrs. Brown told them to be _ to their new classmate and then she left.\nThe following week, the class understood  _ . The principal   himself brought the new student to their class. In fact , Mr. White pushed   the new student to the class because the student was in a wheelchair  . Mr. White _  the new student as Jeff and asked them to be friendly to him. He said that Jeff now was a _ of the class and they should work together. He added, \"A house divided   against itself cannot stand.\"  _  could fully understand what Mr. White meant at first.\nOver time, they began to understand what their principal meant. Jeff was a  _ student and often lent a helping hand to students who did not understand _ work. They felt very thankful to him. They took turns to wheel him about   _ they knew well that when someone did something for you, you _ do something back in return  . Not only did their results   _ , but their behavior   became better. It was a special year Class 6 would never forget.`", 
    "options": [
        [
            "partner", 
            "lesson", 
            "teacher", 
            "classroom"
        ], 
        [
            "try", 
            "catch", 
            "believe", 
            "manage"
        ], 
        [
            "leading", 
            "helping", 
            "visiting", 
            "joining"
        ], 
        [
            "sadly", 
            "angrily", 
            "seriously", 
            "coldly"
        ], 
        [
            "nice", 
            "useful", 
            "honest", 
            "careful"
        ], 
        [
            "why", 
            "where", 
            "when", 
            "how"
        ], 
        [
            "mistook", 
            "described", 
            "introduced", 
            "remembered"
        ], 
        [
            "hope", 
            "member", 
            "monitor", 
            "symbol"
        ], 
        [
            "Nobody", 
            "Somebody", 
            "Anybody", 
            "Everybody"
        ], 
        [
            "lucky", 
            "strict", 
            "funny", 
            "clever"
        ], 
        [
            "his", 
            "her", 
            "their", 
            "our"
        ], 
        [
            "if", 
            "because", 
            "until", 
            "though"
        ], 
        [
            "should", 
            "could", 
            "might", 
            "would"
        ], 
        [
            "appear", 
            "develop", 
            "improve", 
            "continue"
        ]
    ], 
    "answers": [
        "D", 
        "C", 
        "D", 
        "B", 
        "A", 
        "A", 
        "C", 
        "B", 
        "A", 
        "D", 
        "C", 
        "B", 
        "A", 
        "C"
    ], 
    "source": "middle2197"
}