{
    "article": "Jack was a big, fine figure of a policeman, and always had a lot of work to do. One day, he was too busy to have enough lunch and had to keep on working. He walked up and down Market Street, keeping a  _  eye on things and getting hungrier and hungrier. He passed Tony's  _  store. \"Would you like to have a banana, Jack?\" greeted Tony. But Jack  _  his head and said, \"No, thank you.\" He never ate when he was at  _  . Then he went past another shop that was full of cheeses, cold meats, potato chips, and so on. And when the shopkeeper offered him a pack of sausage, he  _  again. So it went, all day long. The  _  man went past the sweet store, the bakery, the peanut man and the toffee-apple man, saying, \"No, thank you, not on duty.\" He got much  _  . At last, his day ended, and he immediately ran back home. He went  _  the stairs and into the kitchen. \"You must be hungry, man!\" cried his wife, who had prepared well for the dinner, \" Sit at the  _  and eat!\" Jack sat down immediately and began to enjoy the meal. It seemed that it was the most delicious and biggest meal he had ever had. He said, \"Thank you, my dear.\" \"It's always a pleasure to  _  for you,\" his wife replied.", 
    "options": [
        [
            "lazy", 
            "lovely", 
            "patient", 
            "sharp"
        ], 
        [
            "shoe", 
            "fruit", 
            "toy", 
            "clothes"
        ], 
        [
            "shook", 
            "nodded", 
            "relaxed", 
            "hit"
        ], 
        [
            "break", 
            "street", 
            "school", 
            "work"
        ], 
        [
            "accepted", 
            "received", 
            "refused", 
            "admitted"
        ], 
        [
            "poor", 
            "lucky", 
            "smart", 
            "worried"
        ], 
        [
            "hungrier", 
            "happier", 
            "ruder", 
            "sadder"
        ], 
        [
            "past", 
            "in", 
            "on", 
            "up"
        ], 
        [
            "window", 
            "chair", 
            "table", 
            "floor"
        ], 
        [
            "wait", 
            "cook", 
            "wash", 
            "smile"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "A", 
        "D", 
        "C", 
        "A", 
        "A", 
        "D", 
        "C", 
        "B"
    ], 
    "source": "middle1512"
}