{
    "article": "Johnny, a lizard*,lived between some rocks in the country, where he liked lying in the sun every morning. One day, he was so _ that he didn't notice some boys coming up behind him. The boys caught Johnny. Luckily, he escaped from their hands in the end. But he lost his _ .\nThe children watched the tail moving about, but they _ threw the tail away and left. After a while, Johnny came back to look for his tail, but he couldn't find it. Feeling so sad, he decided to stop doing everything else in his life and spend  _ his time finding his tail. Days and months passed, Johnny kept looking, asking everyone he met if they had seen his tail. However, there was _ no news about it.\nOne day, he asked a boy and the boy answered in surprise, \"Why do you need _ tails?\"\nAfter hearing this, Johnny turned back and saw that he had grown a new, stronger tail. He suddenly realized that he didn't need the old tail any more, and he found it silly to _ so much time in looking for it. So Johnny stopped and went back home.\n _ the way, he suddenly found his old tail on the road. Although it looked terrible, Johnny was still _ to have it back. He picked it up. Just at that moment, an idea hit him that he shouldn't look at the past and worry about it since it was not useful for _ any more. Finally, he decided to drop his _ tail there, leaving all his past worries with it. As he went on his journey, all he took with him were the thoughts of the present and the _ of the future\nAs we know, it's not good to look at the past,  _  it helps in the future. The past is past, move on and live for the present and the future! Let the past go with wind.", 
    "options": [
        [
            "relaxed", 
            "interested", 
            "lonely", 
            "nervous"
        ], 
        [
            "body", 
            "eyes", 
            "tail", 
            "head"
        ], 
        [
            "again", 
            "soon", 
            "already", 
            "nearly"
        ], 
        [
            "Other", 
            "both", 
            "no", 
            "all"
        ], 
        [
            "only", 
            "Also", 
            "still", 
            "always"
        ], 
        [
            "one", 
            "two", 
            "Three", 
            "four"
        ], 
        [
            "waste", 
            "Use", 
            "Pay", 
            "take"
        ], 
        [
            "In", 
            "On", 
            "By", 
            "At"
        ], 
        [
            "excited", 
            "sad", 
            "bored", 
            "afraid"
        ], 
        [
            "he", 
            "his", 
            "he's", 
            "him"
        ], 
        [
            "small", 
            "Big", 
            "old", 
            "strong"
        ], 
        [
            "dreams", 
            "suggestions", 
            "messages", 
            "news"
        ], 
        [
            "so", 
            "And", 
            "Unless", 
            "because"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "B", 
        "D", 
        "C", 
        "B", 
        "A", 
        "B", 
        "A", 
        "D", 
        "C", 
        "A", 
        "C"
    ], 
    "source": "middle1833"
}