{
    "article": "Once I went shopping on my first visit to Macao. Coming from cold and cloudy England, I enjoyed the sun and dressed in a T-shirt and a  _  skirt. Not having much  _  to enjoy the sun in England, my legs were very white. In England this is not a fashionable look at all . Most women spend every sunny day out trying to get darker skin. The darker the skin, the better the look. I have tried to get darker but  _  works for me! As I  walked around  one shop, the two shop assistants kept looking at my legs the whole time , talking quietly to each other in Chinese. I began to feel uncomfortable and asked my friend  _  we could leave. After we left the shop, she asked me what was wrong. I complained about the shop assistants being very impolite . They  _  be talking about my white skin. My friend laughed. \"They weren't laughing at you. They were saying how nice your legs are. Many Chinese women want to have white skin like yours.  Infact  , there are many beauty products in the shops to make skin whiter and a lot of money is spent on them.\" It just shows that we are never happy with what we have. The grass is  _  greener on the other side. If the women of the West and East  _  the same way, Western women wouldn't spend so much money on cream that makes skin darker and women from the  _  wouldn't need to use cream that makes skin whiter.", 
    "options": [
        [
            "long", 
            "short", 
            "beautiful", 
            "expensive"
        ], 
        [
            "money", 
            "exercise", 
            "space", 
            "chance"
        ], 
        [
            "anything", 
            "everything", 
            "nothing", 
            "something"
        ], 
        [
            "though", 
            "and", 
            "but", 
            "if"
        ], 
        [
            "must", 
            "mustn't", 
            "can", 
            "needn't"
        ], 
        [
            "never", 
            "always", 
            "ever", 
            "seldom"
        ], 
        [
            "thought", 
            "saw", 
            "worked", 
            "decided"
        ], 
        [
            "East", 
            "West", 
            "South", 
            "North"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "C", 
        "D", 
        "A", 
        "B", 
        "A", 
        "A"
    ], 
    "source": "middle153"
}