{
    "article": "One day, I heard an American boy say to a Chinese girl student, \"You speak very good English.\" But the girl answered, \"No, no. My English is very poor.\" The foreigner was quite  _  at the answer. Thinking he had not made  _  understood or the girl had not heard him clearly, he said, \"Yes, indeed, you speak very well.\" But the girl still kept saying, \"No.\" In the end the American boy could not understand and didn't know  _  to say. What's wrong with the girl's answer? She didn't  _  )in the same way as the American people do. She should answer, \"Thank you\" instead of \"No\". She  _  understood what the American boy had said, but she thought she should be modest. In the west, people will feel proud and  _  when they are praised . So if someone says the dishes you have cooked are very delicious, you should say, \"Thank you.\" In our country we think being modest is a virtue and being proud is a bad thing, but in my opinion, being confident does not  _  being proud, so sometimes you should be confident  instead of  being modest.  _  you are modest and say, \"No, I'm afraid I can't do it well\", while working in a western country, the others may think that you really cannot do it. If you often say \"No\", you will certainly be looked down on by others. When asking for a job, if one says something like \"Yes, I can certainly do it\" instead of \"Let me have a try \", he or she will  expect to  get it. So in the west, you should be brave to show your self-confidence.", 
    "options": [
        [
            "excited", 
            "surprised", 
            "relaxed", 
            "frightened"
        ], 
        [
            "her", 
            "herself", 
            "himself", 
            "him"
        ], 
        [
            "when", 
            "which", 
            "what", 
            "how"
        ], 
        [
            "accept", 
            "receive", 
            "refuse", 
            "disagree"
        ], 
        [
            "hardly", 
            "really", 
            "rarely", 
            "badly"
        ], 
        [
            "kind", 
            "modest", 
            "shy", 
            "confident"
        ], 
        [
            "think", 
            "say", 
            "ask", 
            "mean"
        ], 
        [
            "Unless", 
            "Until", 
            "Whether", 
            "If"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "C", 
        "A", 
        "B", 
        "D", 
        "D", 
        "D"
    ], 
    "source": "middle1063"
}