{
    "article": "Mr Guppy was a very large man. Life was not easy for him. He could not find clothes big enough. His _ were too large for most shoes. In buses, trains and planes, he could not stand up straight. The roofs were too _ . In fact, wherever he went and whatever he did, Mr Guppy had _ because of his size.\nThese problems were so bad that Mr Guppy _ at home most of time. Life was easier at home.Then one day, a friend said, \"You spend too much time at home. You _ go out more. There's a good movie at the theatre.\"\n\"I can't sit in any seat there,\" Mr Guppy said. \"I'm _ big.\"\n\"That is no problem,\" his friend said. \"I'll buy you two tickets. You can _ them at the theatre when you get there.\"\nThe friend sent money to the theatre for two tickets. When the day came, Mr Guppy put on his best clothes and went to the theatre.\n\"You have two tickets for me,\" he said to the _ in the ticket office. \"My name is Guppy.\"\n\"Oh, yes, Mr. Guppy,\" the woman said. \"Here you are. Seats G4 and P12. I'm sorry, you and your friend can't sit together _ too many people have come to see the film this evening.\"\nPoor Mr Guppy! He smiled sadly, walked out of the theatre and went home.", 
    "options": [
        [
            "hands", 
            "feet", 
            "ears", 
            "eyes"
        ], 
        [
            "low", 
            "high", 
            "large", 
            "small"
        ], 
        [
            "experience", 
            "problems", 
            "relations", 
            "practice"
        ], 
        [
            "left", 
            "kept", 
            "stayed", 
            "lived"
        ], 
        [
            "must", 
            "would", 
            "should", 
            "need"
        ], 
        [
            "few", 
            "little", 
            "some", 
            "too"
        ], 
        [
            "buy", 
            "sell", 
            "give", 
            "get"
        ], 
        [
            "woman", 
            "man", 
            "girl", 
            "boy"
        ], 
        [
            "until", 
            "because", 
            "before", 
            "whether"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "B", 
        "C", 
        "C", 
        "D", 
        "D", 
        "A", 
        "B"
    ], 
    "source": "middle695"
}