{
    "article": "Scientists study the world and learn about things using a process called the scientific method. By asking important questions and searching for the answers, it is possible to make amazing discoveries! Sometimes a scientist is _ to answer his own questions, but if he has taken good notes ,another scientist may come along later who is able to use new knowledge to answer it.\nWhen you use the scientific method to _ an experiment, you start by making observations  about something that _ you. Based on your observations, you make a hypothesis . This is using _ you know to make a smart guess about what you think could happen. Then you are ready to begin your experiment. All _ your experiment you take down notes, which are _ experiment date . You are constantly  making observations during this time. You may make discoveries that cause you to improve your experiment as you go. _ , you conclude your experiment and begin to look over your notes to decide what it all means. Based on what you have learned, you make a final statement about _ your hypothesis was correct or not. You have to have reasons and evidence to support what you are saying.\nUsing the scientific method can be difficult, but worthy. Because all the steps are organized in a process, the _ are more valid . When you provide observations as evidence to support what you are saying, your ideas are more likely to be accepted.", 
    "options": [
        [
            "unable", 
            "sure", 
            "ready", 
            "surprised"
        ], 
        [
            "read", 
            "refuse", 
            "prevent", 
            "conduct"
        ], 
        [
            "hurts", 
            "represents", 
            "interests", 
            "attacks"
        ], 
        [
            "what", 
            "when", 
            "why", 
            "which"
        ], 
        [
            "without", 
            "including", 
            "except", 
            "during"
        ], 
        [
            "controlled", 
            "decided", 
            "called", 
            "carried"
        ], 
        [
            "Firstly", 
            "Suddenly", 
            "Finally", 
            "Mostly"
        ], 
        [
            "whether", 
            "what", 
            "how", 
            "when"
        ], 
        [
            "problem", 
            "results", 
            "services", 
            "aims"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "C", 
        "A", 
        "D", 
        "C", 
        "C", 
        "A", 
        "B"
    ], 
    "source": "middle2088"
}