{
    "article": "Jenny was a nurse in a children's hospital. One evening there was a big dance at the hospital. Most of the doctors and nurses would be there, but of course them had to be  _  to look after the children. Jenny was not among the  _  ones who were free to go to the dance. She enjoyed dancing very much ,so when she had to start  _  that evening while her friends were getting ready to go to the dance,she felt very  _  for herself. She went to each sick child one after another and said good night.  _  she came to a little boy called Tommy. Tommy was only 11 years old ,but he already talked like an  _  Poor Tommy had a very serious illness,and now he was hardly able to  _  any part of his body except his hands. But he was always happy and always thinking about others instead of himself. When Jenny came up to his bed, he said, \"I'm very sorry that you have to  _  the dance because of us. But we're going to have a party for you. If you look in my  _  , you'll find a piece of cake. I saved it from my supper today, so it's quite  _  \" \"And I'd get up and dance with you myself if I was able to,\"he added. Suddenly the hospital dance seemed very far away and not at all important to Jenny.", 
    "options": [
        [
            "allowed", 
            "invited", 
            "left", 
            "made"
        ], 
        [
            "lucky", 
            "active", 
            "jealous", 
            "wise"
        ], 
        [
            "dancing", 
            "working", 
            "drinking", 
            "relaxing"
        ], 
        [
            "grateful", 
            "happy", 
            "sorry", 
            "proud"
        ], 
        [
            "Lucky", 
            "Hopefully", 
            "Firstly", 
            "Finally"
        ], 
        [
            "actor", 
            "alien", 
            "angel", 
            "adult"
        ], 
        [
            "touch", 
            "wave", 
            "move", 
            "clean"
        ], 
        [
            "miss", 
            "attend", 
            "forget", 
            "host"
        ], 
        [
            "dustbin", 
            "drawer", 
            "wallet", 
            "bed"
        ], 
        [
            "rare", 
            "sweet", 
            "tasty", 
            "fresh"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "B", 
        "C", 
        "D", 
        "D", 
        "C", 
        "A", 
        "B", 
        "D"
    ], 
    "source": "middle1796"
}