{
    "article": "Everyone strongly hopes for success. What is important for success? It is generally accepted that confidence, hardworking and _  are main factors  leading to success. Ronaldo said he believed he was a better player than Messi in a(an) _ published in Spanish sports paper on Sunday.\nTalking about his achievements of his career, Ronaldo showed _ . Ronaldo was also asked about Messi, who is seen _ his biggest enemy to be considered the best player in the world. \"Whether you are number one or not is a question of small difference, for example, whether you win titles  in a match or not is not so important. _ some people may think Messi to be the best, I think that I am.\" Ronaldo said that boos  didn't make him sad, but had the _ effect. \"I need an enemy, it's part of the game and I have been booed since I was 18 or 19, it's not a problem, it _ me to practice harder,\" he said.\nRonaldo insisted that hard work was important to be a _ player, though at times he feels a great pain for his training, saying a body \"was not used\" to training hard and playing twice a week. But no pain, no _ . He said he had changed his life to make sure he was in top condition, saying that when in the past he would go out, now he \"goes home to rest to be better prepared for the following date.\"\n\"Football is my life. It's what I love most,\" he explained.", 
    "options": [
        [
            "lovers", 
            "friends", 
            "relatives", 
            "enemies"
        ], 
        [
            "interview", 
            "talk", 
            "story", 
            "speech"
        ], 
        [
            "luck", 
            "pride", 
            "surprise", 
            "happiness"
        ], 
        [
            "to", 
            "as", 
            "in", 
            "for"
        ], 
        [
            "Although", 
            "Unless", 
            "Even", 
            "Since"
        ], 
        [
            "funny", 
            "side", 
            "opposite", 
            "bad"
        ], 
        [
            "wants", 
            "causes", 
            "encourages", 
            "draws"
        ], 
        [
            "clever", 
            "fast", 
            "top", 
            "famous"
        ], 
        [
            "score", 
            "result", 
            "progress", 
            "gain"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "B", 
        "B", 
        "A", 
        "C", 
        "C", 
        "C", 
        "D"
    ], 
    "source": "middle381"
}