{
    "article": "My mother only had one eye. And because of this, I never wished her to show up in my school, being afraid that my classmates would  find out  I had an ugly mother. One day during elementary school, I was terribly ill. My mother came. \"Your mom only has one eye?!\" asked some of my classmates. I was so  _  . I wished my mother would just  _  from this world. \"If you make me teased ,why don't you just die?\" I shouted at her, taking no notice of the sad look on her face. My mother just handed me some medicine and left without saying  _  . At that time, I felt  _  to say what I always wanted to say, and I didn't think I had hurt her feelings very much. That night I saw my mom  _  in her room, so quietly, as if she was afraid that she might  _  me. Even so, I hated her tears from one eye. I made a  _  : I must study hard and leave my mother. Years later my dream came true. I was quite successful and lived  _  . I never thought of going back to see my \"ugly\" mother  _  one day I got a letter, which said, \"My son... I'm sorry I only have one eye. When you were little, you got into a(n)  _  and lost your eye. As a mom, I couldn't  _  watching you live with only one eye.  _  I gave you mine. I was never  _  with you and I never regretted what I did because I  _  you...\" I cried out aloud. Only then did I realize how beautiful my mother was!", 
    "options": [
        [
            "happy", 
            "embarrassed", 
            "cool", 
            "pleased"
        ], 
        [
            "disappear", 
            "change", 
            "come", 
            "go"
        ], 
        [
            "everything", 
            "something", 
            "anything", 
            "nothing"
        ], 
        [
            "worried", 
            "bad", 
            "good", 
            "annoyed"
        ], 
        [
            "cooking", 
            "working", 
            "reading", 
            "crying"
        ], 
        [
            "break", 
            "wake", 
            "lose", 
            "see"
        ], 
        [
            "decision", 
            "difference", 
            "suggestion", 
            "mistake"
        ], 
        [
            "luckily", 
            "healthily", 
            "busily", 
            "happily"
        ], 
        [
            "if", 
            "unless", 
            "until", 
            "though"
        ], 
        [
            "accident", 
            "appointment", 
            "university", 
            "habit"
        ], 
        [
            "enjoy", 
            "stand", 
            "help", 
            "stop"
        ], 
        [
            "So", 
            "Because", 
            "Or", 
            "But"
        ], 
        [
            "excited", 
            "surprised", 
            "angry", 
            "proud"
        ], 
        [
            "dislike", 
            "love", 
            "hate", 
            "miss"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "C", 
        "D", 
        "B", 
        "A", 
        "D", 
        "C", 
        "A", 
        "B", 
        "A", 
        "C", 
        "B"
    ], 
    "source": "middle2104"
}