{
    "article": "What does \"self-control\" mean? Suppose you have a ticket for an exciting film which you want to see very much, but unluckily you have to study  _  an exam tomorrow. What will you do? See the film  _  study for the exam? If you can give up seeing the film and work hard at your  _  , it means that you have self-control. Self-control is not something that you have at birth. It needs to be cultivated in your life. Often, young children are easily  _  when their needs or wishes are not met at once. Almost daily, children see a lot of food, toys and activities that are attractive to them. Many time children do not know how to  deal with  their frustration when they are told \"no\" or \"later\". Also, sometimes young children do not understand  _  they are not allowed to do anything. In order to have positive experiences at home and at school, children need to learn  _  to properly deal with their feelings when they cannot have something. These skills will increase children's self- control. Don't go to bed late because of a nice TV program, or you may go to school  late  and it is a waste of time. Every one of us has some hobbies, a few of which may  _  us from making progress in life. We must use our  _  to become free of them.", 
    "options": [
        [
            "for", 
            "at", 
            "on", 
            "about"
        ], 
        [
            "and", 
            "while", 
            "but", 
            "or"
        ], 
        [
            "school", 
            "lessons", 
            "films", 
            "listening"
        ], 
        [
            "happy", 
            "upset", 
            "tired", 
            "excited"
        ], 
        [
            "what", 
            "which", 
            "why", 
            "who"
        ], 
        [
            "skills", 
            "lessons", 
            "ways", 
            "strategies"
        ], 
        [
            "leave", 
            "make", 
            "keep", 
            "push"
        ], 
        [
            "decision", 
            "energy", 
            "knowledge", 
            "self-control"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "B", 
        "B", 
        "C", 
        "A", 
        "C", 
        "D"
    ], 
    "source": "middle2089"
}