{
    "article": "Benjamin is the unluckiest boy in the world. He hardly ever falls ill , but if he falls ill, it is on the weekend. He is a good student, but when he takes a test, his pen _ . His bird sings very well, but when he asks his friends to listen to it, the bird becomes silent .\nBut Benjamin thinks he is the luckiest boy in the world. He has wonderful parents and a lovely sister. He has a singing bird. His classmates are friendly to him . Benjamin is always happy and he is kind.\nOne day his mother _ him some money to buy an ice-cream. When he arrived at the ice-cream shop, he saw an old man outside it. He had old clothes, terrible glasses, and he looked _ . Benjamin thought he was poor. He decided not to buy the ice-cream and gave the money to the man.\n\"Thank you. You are a kind boy. But I' m not poor. Keep your money, I'm the richest man in town and I sometimes wear old clothes to see _ people do,\" the man said and gave the money _ to him.\nThe man took Benjamin to the biggest _ in town and said, \"Choose _ you like. I can buy you the most expensive one.\" Benjamin asked, \"Can I choose _ ? \"Of course,\" answered the man.\nBenjamin chose the newest radio because when his bird keeps silent, he can at least listen to it with his friends. He then bought a new pair of glasses _ the man.", 
    "options": [
        [
            "works", 
            "broke", 
            "worked", 
            "breaks"
        ], 
        [
            "took", 
            "gave", 
            "got", 
            "showed"
        ], 
        [
            "angry", 
            "crazy", 
            "hungry", 
            "relaxed"
        ], 
        [
            "what", 
            "how", 
            "where", 
            "when"
        ], 
        [
            "/", 
            "back", 
            "behind", 
            "in"
        ], 
        [
            "restaurant", 
            "bank", 
            "shop", 
            "hotel"
        ], 
        [
            "something", 
            "anything", 
            "everything", 
            "everyone"
        ], 
        [
            "one", 
            "two", 
            "three", 
            "more"
        ], 
        [
            "to", 
            "for", 
            "after", 
            "with"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "C", 
        "B", 
        "B", 
        "C", 
        "B", 
        "B", 
        "B"
    ], 
    "source": "middle140"
}