{
    "article": "It's not polite to arrive at a dinner party more than 15 to 20 minutes late. The host or hostess usually waits for all the guests to arrive _ having the meal. If someone is late, all the others will be kept waiting. If you will have to be late, call and tell them to start without you.\nIt's even worse to be _ ! The host or hostess _ not be ready. If you are early, drive or walk _ the block   for a few minutes, or just sit in your car until the right time.\nThough it's often important to arrive at a party on time, yet on the other hand, for open houses, the host or hostess invites guests to arrive and leave between certain times, so you can arrive at any time within the times he or she gives you.\nIt's nice to bring an empty stomach, but it's even nicer to bring a _ present. The present should not cost a lot, or you might embarrass  the host or hostess. Flowers, wine, or a box of candy will do fine. _ bring money as a present.\nIn an introduction , the order of a name is the given name, and then the family name. In other words, the given name comes _ . After the introduction, we usually call friends by their given names. Older people may want you to call them by their titles and family names, such as \"Mr. Jones\", \"Mr. Smith\", \"Ms. Johson\" or \"Dr. Brown\".", 
    "options": [
        [
            "while", 
            "when", 
            "before", 
            "after"
        ], 
        [
            "late", 
            "early", 
            "quick", 
            "fast"
        ], 
        [
            "must", 
            "can", 
            "may", 
            "should"
        ], 
        [
            "around", 
            "across", 
            "over", 
            "through"
        ], 
        [
            "expensive", 
            "beautiful", 
            "big", 
            "small"
        ], 
        [
            "Always", 
            "Sometimes", 
            "Never", 
            "Usually"
        ], 
        [
            "first", 
            "second", 
            "last", 
            "third"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "C", 
        "A", 
        "D", 
        "C", 
        "A"
    ], 
    "source": "middle1073"
}