{
    "article": "I'm a cook in a restaurant. One day, I went for a walk when suddenly I saw smoke. I went closer to _ what was happening. It came from a house. At that time I saw the firemen rushing into the _  and I ran to  _ to one of them. I asked him if there was someone inside.He replied that there was a whole family. My heart missed a beat  because I realized  that the family was in danger  . And it was _ for them to run away from the inside.\nI asked if there was an extra   uniform for firemen. He said Yes ,and I quickly wore it and went in with three more  _ . As I went inside, it was so hot that I felt as if I was melting  .I passed by the living room and saw the curtains   _ . When the firemen tried to  put out the fire, I found the people. They  _ themselves behind the curtains. One of them was unlucky  _ he was seriously burnt. I helped them out of the burning house  _ . Finally we were safe from the danger and the firemen put out the fire  _ . The officer of the firemen  _ e for my courage  to help those people.\nThat night I  _ not sleep because of all the excitement. Even now I am still proud that I saved the people who were in danger. I'll never regret  what I did.", 
    "options": [
        [
            "draw", 
            "see", 
            "look", 
            "notice"
        ], 
        [
            "station", 
            "restaurant", 
            "supermarket", 
            "house"
        ], 
        [
            "say", 
            "tell", 
            "talk", 
            "speak"
        ], 
        [
            "simple", 
            "important", 
            "normal", 
            "difficult"
        ], 
        [
            "firemen", 
            "cooks", 
            "customers", 
            "doctors"
        ], 
        [
            "lost", 
            "watered", 
            "burning", 
            "flying"
        ], 
        [
            "enjoyed", 
            "hid", 
            "hit", 
            "saw"
        ], 
        [
            "because", 
            "before", 
            "if", 
            "though"
        ], 
        [
            "suddenly", 
            "quietly", 
            "politely", 
            "quickly"
        ], 
        [
            "brave", 
            "bravely", 
            "excited", 
            "excitedly"
        ], 
        [
            "called", 
            "thanked", 
            "asked", 
            "found"
        ], 
        [
            "would", 
            "should", 
            "might", 
            "could"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "C", 
        "D", 
        "A", 
        "C", 
        "B", 
        "B", 
        "D", 
        "B", 
        "B", 
        "D"
    ], 
    "source": "middle1132"
}