{
    "article": "Edith Cavell was born in a little English village. She was a clever, _ girl and did well at school, especially in music and _ . After she left school, her first job was to take care of the children of a _ family in Belgium. The language they spoke was French, _ she found that her school studies were useful. She could understand them  _ , at the same time she taught the children to speak English and play the piano.\nAfter _ that her father was seriously ill, Edith returned home to look after him. She then decided to become a nurse. _ she worked for five years in an English hospital where she was good at her job. A Belgian doctor was so impressed that he invited her to his country to _ a training school for nurses. The _ World War broke out in 1914 and Edith Cavell's school of nursing became a hospital. She _ there to look after the sick and wounded soldiers. Edith treated them _ kindness. Between November 1914 and August 1915 she helped about 200 wounded soldiers and prisoners   escape from the Germans. Later the German army found out _ Edith had done and they arrested her. Finally, the Germans _ her, but they could not kill her memory. A _ statue has been built in Trafalgar Square, London, in honor of the _ English nurse.", 
    "options": [
        [
            "funny", 
            "strange", 
            "lazy", 
            "hard-working"
        ], 
        [
            "German", 
            "French", 
            "Spanish", 
            "English"
        ], 
        [
            "rich", 
            "poor", 
            "good", 
            "bad"
        ], 
        [
            "but", 
            "so", 
            "and", 
            "or"
        ], 
        [
            "clearly", 
            "happily", 
            "easily", 
            "quickly"
        ], 
        [
            "watching", 
            "feeling", 
            "seeing", 
            "hearing"
        ], 
        [
            "Before", 
            "Later", 
            "Since", 
            "When"
        ], 
        [
            "find", 
            "hold", 
            "have", 
            "organize"
        ], 
        [
            "First", 
            "Second", 
            "Third", 
            "Fourth"
        ], 
        [
            "came", 
            "got", 
            "stayed", 
            "arrived"
        ], 
        [
            "as", 
            "with", 
            "about", 
            "over"
        ], 
        [
            "that", 
            "what", 
            "which", 
            "where"
        ], 
        [
            "killed", 
            "met", 
            "caught", 
            "hit"
        ], 
        [
            "strong", 
            "small", 
            "short", 
            "tall"
        ], 
        [
            "brave", 
            "strong", 
            "weak", 
            "good"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "A", 
        "B", 
        "C", 
        "D", 
        "B", 
        "D", 
        "A", 
        "C", 
        "B", 
        "B", 
        "A", 
        "D", 
        "A"
    ], 
    "source": "middle742"
}