{
    "article": "One day a father and his 5-year-old son were decorating the Christmas tree. A little boy about six years old came to the front door begging. In Mexico, people taking begging as a normal  _  of life. People just accept it and they give  _  they have. When they saw the little boy, the father and the son went to the front door. The little boy was  _  dressed and seemed very cold. The father went back with his son and said to him, \"give him one of your  _  .\" The little boy opened his box and  pulled out  an old one, but his father said to him, \"No, no---give him your  _  \"And the little boy, like a little tiger, shouted, \"no way!\" He cried and refused to give what he liked best to the little boy.  _  the father insisted softly, \"No, you must give him one of your favorite toys. He may not have a mom or dad. It's  _  outside, yet he can't stay at home to sit by a fire to enjoy the  _  of Christmas.\" Hearing that, the boy, with his  _  down, picked out a toy he had just got. He walked to the front door with the toy in his hand, and the father  _  in the living room. After about ten  _  , his son came running back into the living room. \"Daddy, can I give him  another  one\" shouted the little boy happily. The father did not know what had happened to his son and the little boy, yet he felt very  _  that his son finally understood the joy of  _  .", 
    "options": [
        [
            "hobby", 
            "part", 
            "example", 
            "story"
        ], 
        [
            "what", 
            "that", 
            "if", 
            "how"
        ], 
        [
            "well", 
            "strangely", 
            "poorly", 
            "beautifully"
        ], 
        [
            "toys", 
            "books", 
            "clothes", 
            "shoes"
        ], 
        [
            "favorite", 
            "dislikes", 
            "news", 
            "colors"
        ], 
        [
            "Because", 
            "And", 
            "But", 
            "Since"
        ], 
        [
            "warm", 
            "hot", 
            "noisy", 
            "cold"
        ], 
        [
            "happy", 
            "sad", 
            "joy", 
            "noise"
        ], 
        [
            "leg", 
            "hand", 
            "head", 
            "ears"
        ], 
        [
            "slept", 
            "ran", 
            "jumped", 
            "waited"
        ], 
        [
            "weeks", 
            "hours", 
            "minutes", 
            "days"
        ], 
        [
            "anxious", 
            "nervous", 
            "sad", 
            "happy"
        ], 
        [
            "receiving", 
            "giving", 
            "taking", 
            "sending"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "A", 
        "A", 
        "C", 
        "D", 
        "C", 
        "C", 
        "D", 
        "C", 
        "D", 
        "B"
    ], 
    "source": "middle420"
}