{
    "article": "The telephone rang in the police station at Richmond, California, US. \"  _  station? A train for Santa Fe collided a  _  at the McDonald Street Crossing. Please come here at once. With an ambulance ,too. A man is badly wounded,\" said a(n)  _  voice of a young woman. \"OK. We'll come soon. Please stay there and wait.\" Replied the policeman. Within a minute, a police car and an ambulance  _  off. Soon they got to the crossing, but only to find everything was  _  . No collision, no wounded man. \"What a dirty  _  !\" said the policeman angrily. \" We must find out that mischievous  _  and...\"They had not been able to say anything about a  _  when they heard the whistle of a train was nearing them quickly. All of a sudden, a truck appeared. It came  _  towards them, too. When it was passing the crossing, it suddenly  _  to move on. Right then and there, before the eyes of all the people present, the train collided with the truck heavily and struck it dozens of metres away. When Randolph Bruce, the driver , was helped out of the damaged truck, he was badly wounded just as the young woman had foretold on the phone. As he was taken to hospital in time, he was  _  at last. Later the police did whatever they could to  _  the woman who had  _  them, but failed. It is really  _  that a prophecy should agree with the fact so  _  .", 
    "options": [
        [
            "Weather", 
            "Railway", 
            "Fire", 
            "Police"
        ], 
        [
            "bus", 
            "truck", 
            "taxi", 
            "train"
        ], 
        [
            "sweet", 
            "anxious", 
            "beautiful", 
            "low"
        ], 
        [
            "turned", 
            "took", 
            "started", 
            "walked"
        ], 
        [
            "bad", 
            "satisfied", 
            "pleasant", 
            "fine"
        ], 
        [
            "call", 
            "lie", 
            "trick", 
            "plan"
        ], 
        [
            "policeman", 
            "boy", 
            "woman", 
            "driver"
        ], 
        [
            "reward", 
            "praise", 
            "thanks", 
            "punishment"
        ], 
        [
            "turning", 
            "running", 
            "starting", 
            "passing"
        ], 
        [
            "continued", 
            "refused", 
            "began", 
            "stopped"
        ], 
        [
            "saved", 
            "dead", 
            "awake", 
            "alive"
        ], 
        [
            "find", 
            "meet", 
            "punish", 
            "thank"
        ], 
        [
            "laughed", 
            "telephoned", 
            "repeated", 
            "visited"
        ], 
        [
            "exciting", 
            "surprising", 
            "pleasing", 
            "interesting"
        ], 
        [
            "equally", 
            "truly", 
            "exactly", 
            "carefully"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "B", 
        "C", 
        "D", 
        "C", 
        "C", 
        "D", 
        "B", 
        "B", 
        "A", 
        "A", 
        "B", 
        "B", 
        "C"
    ], 
    "source": "middle684"
}