{
    "article": "You may think that English dictionaries have been used for many, many centuries. In fact, an English dictionary you _ today wasn't made until the Qing Dynasty .Three men did most of the important _ work on dictionaries. They spent nearly all their lives trying to _ words for their dictionaries. For them, it was a wonderful journey. The largest dictionary in the world is the Oxford English Dictionary. The _ for this dictionary came from an important meeting in Britain in1857.Twenty -two years later, Oxford University asked James Murray to be the editor of its new dictionary.\nMurray had never been to _ . At the age of fourteen, he left his village school in Scotland and taught himself while working in a bank . Later he become a great teacher. After Oxford gave him the job, Murray had a small house _ in his garden to do the work. Every morning, Murray got out of bed at five o'clock and _ in the small house several hours before breakfast. Often he would work into the night. Murray hoped to finish the new dictionary in ten years. But after five years, he was _ adding words for the letter\"A\"! He worked on the dictionary _ he was very old. Forty-four years later, in1928, other editors finished the dictionary.", 
    "options": [
        [
            "use", 
            "write", 
            "copy", 
            "miss"
        ], 
        [
            "easy", 
            "boring", 
            "early", 
            "dangerous"
        ], 
        [
            "spell", 
            "invent", 
            "collect", 
            "make"
        ], 
        [
            "way", 
            "idea", 
            "use", 
            "prize"
        ], 
        [
            "school", 
            "cinema", 
            "village", 
            "college"
        ], 
        [
            "sold", 
            "built", 
            "broken", 
            "drawn"
        ], 
        [
            "read", 
            "wrote", 
            "worked", 
            "thought"
        ], 
        [
            "already", 
            "still", 
            "usually", 
            "always"
        ], 
        [
            "if", 
            "because", 
            "until", 
            "since"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "C", 
        "B", 
        "D", 
        "B", 
        "C", 
        "B", 
        "C"
    ], 
    "source": "middle327"
}