{
    "article": "Why is setting goals important? Because goals can help you do, be, and experience everything you want in life. Instead of just letting life happen to you, goals allow you to make your life happen. Successful people  _  how their life should be and set lots of goals. By setting goals you are taking control of your life. It's like having a  _  to show you where you want to go. Think of it this way. There are  _  drivers. One has a destination in mind (her goal) which can be found on a map. She can drive straight there without any wasted time or wrong turns. The other driver has no goals or destination or map. She starts off at the same time from the same place as the first driver,  _  she drives aimlessly around, never getting anywhere, just using up gas . Which driver do you want to be? Winners in life set goals and follow through on them. They decide what they want in life and then get there by making  _  and setting goals.  _  people just let life happen by accident. Goals aren't difficult to set--and they aren't difficult to reach. It's up to you to find out what your goals really are. You are the one who must  _  what to achieve and in what direction to aim your life. Research tells us that when we write a goal down, we are more likely to achieve it. Written goals can be reviewed regularly, and have  _  power. Like a contract with  _  , they are harder to forget. Also  _  you write your goals in a sepecial way, you are able to make yourself continuously aware of situations that will bring you nearer to your goal.", 
    "options": [
        [
            "imagine", 
            "discuss", 
            "experience", 
            "show"
        ], 
        [
            "guide", 
            "friend", 
            "map", 
            "sign"
        ], 
        [
            "two", 
            "many", 
            "some", 
            "few"
        ], 
        [
            "or", 
            "and", 
            "but", 
            "so"
        ], 
        [
            "plans", 
            "money", 
            "friends", 
            "maps"
        ], 
        [
            "Lucky", 
            "Young", 
            "Common", 
            "Unsuccessful"
        ], 
        [
            "practice", 
            "change", 
            "accept", 
            "decide"
        ], 
        [
            "less", 
            "fewer", 
            "more", 
            "better"
        ], 
        [
            "myself", 
            "yourself", 
            "themselves", 
            "itself"
        ], 
        [
            "although", 
            "until", 
            "when", 
            "before"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "A", 
        "C", 
        "A", 
        "D", 
        "D", 
        "C", 
        "B", 
        "C"
    ], 
    "source": "middle1091"
}