{
    "article": "About 10 years ago, I started a job as a trainer . In one of my firstclasses, the head trainer told a very _ story that I would like to share with you.\nHe began by drawing a _ standing in the middle of a circle. To make it more interesting,he drew things like a house, a car, and a few friends inside the circle.\nHe asked the question, \"Can anyone tell me what this is?\" In a long silence, one guy decided to _ his idea, \"the world?\" The trainer said, \"That's close and this is your Comfort Zone. Inside yourcircle you have all the things that are _ to you. Your home, your family, your friends and your job. People feel that inside this circle they are safe from any _ or conflict. \"\n\"Can anyone tell me what happens when you step out of this circle?\" A strong silence came over the room. The same eager guy announced, \"You are afraid. \" Another guy said, \"You make mistakes. \" The silence continued and the trainer smiled and said,\"When you make mistakes, _ can the result be?\" The first guy shouted, \"You _ something. \"\n\"Exactly, you are learning. \" The trainer turned to the board and drew an arrow _ from the man directly to the outside of the circle. He continued to say,  \"When you leave your Comfort Zone you put _ out there, in front of the world to be in situations that you are not _ with. The end result is that you have learned _ that you did not know and you expand your knowledge to become a better person. \"  He turned again to the board and drew a _ circlearound the original circle, and added a few new things like more friends, a bigger house, etc.\n\"The moral of the story is that if you stay inside your Comfort Zone, you will _ be able to expand your horizons and learn. When you step out of your Comfort Zone you will finally make your circle bigger and your mind grow stronger, and all in all a better person. \"", 
    "options": [
        [
            "moving", 
            "educational", 
            "interesting", 
            "surprising"
        ], 
        [
            "man", 
            "lamp", 
            "horse", 
            "tree"
        ], 
        [
            "take", 
            "argue", 
            "write", 
            "show"
        ], 
        [
            "important", 
            "strange", 
            "friendly", 
            "useless"
        ], 
        [
            "noise", 
            "disagreement", 
            "danger", 
            "argument"
        ], 
        [
            "how", 
            "which", 
            "where", 
            "what"
        ], 
        [
            "lose", 
            "learn", 
            "want", 
            "miss"
        ], 
        [
            "leaving", 
            "flying", 
            "pointing", 
            "connecting"
        ], 
        [
            "yourself", 
            "himself", 
            "themselves", 
            "ourselves"
        ], 
        [
            "busy", 
            "strict", 
            "popular", 
            "comfortable"
        ], 
        [
            "nothing", 
            "everything", 
            "anything", 
            "something"
        ], 
        [
            "small", 
            "smaller", 
            "big", 
            "bigger"
        ], 
        [
            "often", 
            "never", 
            "sometimes", 
            "always"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "D", 
        "A", 
        "C", 
        "D", 
        "B", 
        "C", 
        "A", 
        "D", 
        "D", 
        "D", 
        "B"
    ], 
    "source": "middle1392"
}