{
    "article": "A professor stood in front of his class  _  some things on the table. When the class began, he picked up a very large and empty( ) bottle and tried to fill it with  _  stones. He then asked the students if the bottle was full. They  _  that it was. Then the professor picked up a box of small stones and put  _  into the bottle. He shook the bottle. The small stones rolled into the open areas between the big stones. He then asked the students  _  if the bottle was full. They agreed it  _  . The professor picked up a box of sand and poured it into the bottle. Of course the sand filled up the remaining ( ) open areas of the bottle. \" Now\", said the professor, \" I want you to know that this bottle  is like  your life. The big stones are the  _  things like your family, partners, health and children. The small stones are the other things that matter like your job, house and car. The sand is everything  _  , the small things.  _  you put the sand into the bottle  _  , there is no room for the stones. The same goes for your  _  . If you  _  all your time and energy on the small things, you will  _  have room for the things that are important to you. Please put the big stones first. They are the things that are  _  important.", 
    "options": [
        [
            "and", 
            "with", 
            "take", 
            "bring"
        ], 
        [
            "important", 
            "small", 
            "big", 
            "easy"
        ], 
        [
            "spoke", 
            "talked", 
            "told", 
            "said"
        ], 
        [
            "it", 
            "them", 
            "it's", 
            "they"
        ], 
        [
            "too", 
            "again", 
            "also", 
            "still"
        ], 
        [
            "is", 
            "was", 
            "isn't", 
            "wasn't"
        ], 
        [
            "sad", 
            "small", 
            "important", 
            "little"
        ], 
        [
            "else", 
            "other", 
            "others", 
            "another"
        ], 
        [
            "Because", 
            "So", 
            "And", 
            "If"
        ], 
        [
            "quickly", 
            "fast", 
            "first", 
            "second"
        ], 
        [
            "life", 
            "house", 
            "job", 
            "car"
        ], 
        [
            "cost", 
            "spend", 
            "pay", 
            "take"
        ], 
        [
            "also", 
            "still", 
            "never", 
            "always"
        ], 
        [
            "real", 
            "really", 
            "much", 
            "even"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "D", 
        "B", 
        "B", 
        "B", 
        "C", 
        "A", 
        "D", 
        "C", 
        "A", 
        "B", 
        "C", 
        "B"
    ], 
    "source": "middle1102"
}