{
    "article": "Feeling lonely can make you sick. Doctors have long known that loneliness can cause many health problems and even death. What they didn't know is  _  this feeling causes illness. A study in the online magazine  _  that loneliness actually influences the important part of our bodies--our genes. In a small population of patients, researchers  _  more than 20,000 genes to compare how the genes of lonely and non-lonely individuals express themselves in molecular processes and in personal health. They found that gene expression is  _  ) lonely people. \"We now have a new way for understanding the relationship  _  social experience and physical health,\" explains the study's lead author, Steve Cole of University of California, Los Angeles. \"This study--the first to link  _  with gene changes--is special and exciting,\" says Emma Adam, a professor of human development at Northwestern University. \"It  _  According to John Cacioppo, an author of the study from the University of Chicago, the work suggests that loneliness is a warning  _  , much like physical pain. \"This feeling is so bad because  _  of us wants to be forgotten; that' s also what human means,\" he says. \"It makes us  _  for other people and want to be with friends when we're lonely.\"", 
    "options": [
        [
            "when", 
            "where", 
            "how", 
            "if"
        ], 
        [
            "explains", 
            "talks", 
            "replies", 
            "answers"
        ], 
        [
            "collected", 
            "grew", 
            "found", 
            "surveyed"
        ], 
        [
            "important", 
            "different", 
            "interesting", 
            "difficult"
        ], 
        [
            "in", 
            "between", 
            "about", 
            "both"
        ], 
        [
            "work", 
            "health", 
            "life", 
            "feelings"
        ], 
        [
            "fills", 
            "makes", 
            "builds", 
            "repairs"
        ], 
        [
            "note", 
            "sign", 
            "sound", 
            "picture"
        ], 
        [
            "each", 
            "nothing", 
            "any", 
            "none"
        ], 
        [
            "look", 
            "live", 
            "care", 
            "think"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "B", 
        "B", 
        "D", 
        "A", 
        "B", 
        "D", 
        "C"
    ], 
    "source": "middle393"
}