{
    "article": "Did you know that 11,000 people die every day from smoking? Did you know that people die every day from breathing smoke  _  other people's cigarettes? Tobacco smoke has 43 ingredients that may  _  cancer. If smokers had learned these  _  when they were young, they probably would never have started smoking. Most smokers try  _  first cigarette when they are teenagers. Often, they start smoking because they think that it makes them look more  _  . Sometimes they start smoking because their friends tell them that it's cool. If teenagers are told that half of them will die before the age of 65 from smoking cigarettes, how can they still think it's cool to smoke? One of the biggest problems is cigarette advertisements. Tobacco companies  _  tell the truth to teenagers about cigarettes. After watching the advertisements on TV or looking at the posters in which people ride horses or play in a rock band, young people often think that smoking  _  be cool. Sadly, cigarettes are very difficult to  give up  once a person has started smoking. Most teenagers start smoking  _  they are influenced by friends or cigarettes advertisements. And often, the teenagers regret the decision to start smoking later in life. Teenagers need to know  _  bad cigarettes are for their health. If they are told that cigarettes kill more people than guns do, they probably will never start smoking.", 
    "options": [
        [
            "from", 
            "with", 
            "by", 
            "to"
        ], 
        [
            "produce", 
            "devote", 
            "cause", 
            "lead"
        ], 
        [
            "facts", 
            "information", 
            "message", 
            "news"
        ], 
        [
            "theirs", 
            "their", 
            "them", 
            "themselves"
        ], 
        [
            "out-going", 
            "hard-working", 
            "easy-going", 
            "grown-up"
        ], 
        [
            "never", 
            "often", 
            "sometimes", 
            "always"
        ], 
        [
            "need", 
            "might", 
            "must", 
            "may"
        ], 
        [
            "so", 
            "although", 
            "because", 
            "but"
        ], 
        [
            "what", 
            "how", 
            "why", 
            "if"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "A", 
        "B", 
        "D", 
        "A", 
        "C", 
        "C", 
        "B"
    ], 
    "source": "middle892"
}