{
    "article": "It was unusually quiet in the emergency room on December 25. I didn't think there would be any patients, sighing about having to work on Christmas. Just then five bodies  showed up  at my desk, a pale woman and four children. \"Are you all  _  ?\" I asked. \"Yes,\" she said weakly and lowered her head. But when they were asked to talk about their problems, things got a little  _  . Two of the children had headaches, but there was no  _  body language of holding the head.; two children had earaches, but only one could tell me which ear was affected. The  _  complained of a cough but seemed to work to produce it. Something was wrong. I didn't say anything but  _  that it might be a little while  _  a doctor could see her. She  _  , \"Take your time; it's warm in here.\" Then, I checked their chart. No address--they were homeless. The waiting room was warm. I went back to the nurses' station and mentioned we had a  _  family in the waiting room. The nurses went into action immediately, much as we do when there's a  _  emergency. But this was a Christmas emergency. We were all  _  a free meal on Christmas Day, so we claimed that meal and prepared a big dinner for our guests .We needed presents. We  _  from different departments candies, fruits and other things  _  that could be presents. Our team worked to meet the needs of a family who just wanted to be  _  on Christmas. Later, as the family walked to the door to  _  , the four-year-old boy came running back, gave me a hug and whispered.\"Thanks for being our angels today.\"", 
    "options": [
        [
            "thirsty", 
            "hungry", 
            "sick", 
            "warm"
        ], 
        [
            "uncertain", 
            "smooth", 
            "natural", 
            "funny"
        ], 
        [
            "common", 
            "usual", 
            "fair", 
            "normal"
        ], 
        [
            "mother", 
            "children", 
            "nurses", 
            "doctor"
        ], 
        [
            "answered", 
            "imagined", 
            "explained", 
            "commented"
        ], 
        [
            "after", 
            "since", 
            "when", 
            "before"
        ], 
        [
            "advised", 
            "added", 
            "explained", 
            "replied"
        ], 
        [
            "funny", 
            "lonely", 
            "jobless", 
            "homeless"
        ], 
        [
            "war", 
            "fire", 
            "medical", 
            "electrical"
        ], 
        [
            "rewarded", 
            "offered", 
            "allowed", 
            "ordered"
        ], 
        [
            "borrowed", 
            "received", 
            "collected", 
            "bought"
        ], 
        [
            "expensive", 
            "available", 
            "generous", 
            "present"
        ], 
        [
            "fun", 
            "warm", 
            "busy", 
            "lucky"
        ], 
        [
            "leave", 
            "travel", 
            "rest", 
            "relax"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "A", 
        "C", 
        "D", 
        "D", 
        "D", 
        "C", 
        "B", 
        "C", 
        "B", 
        "B", 
        "A"
    ], 
    "source": "middle1145"
}