{
    "article": "Mom is not only my best friend but also my compass  . When she was alive, her actions and advice  _  me a lot. She taught me one important  _  \"Believe in yourself.\"\nIf there was one phrase   my mom  _  liked to hear, it was \"I can't\". She didn't finish high school and took two jobs to  _  the large family, but she never complained.  _  education and years of hard work, my mom became an excellent reporter.\nWhile I was in high school, I had a  _  time with math. My mom tried to help me, but I still often failed the exams. So my math teacher  _  me to meet with him at 7:00 every morning before school for extra   help. I told Mom, \"That's crazy! I am  _  ! I can't do that!\" She replied, \"You are doing it. I'll send you to school.\" Every morning at 6:45, we'd leave the  _  . Although Mom worked 12 hours every day, she never  _  driving me to school.\nAfter months of learning, I was facing the final exam. I was so nervous. On the day of the final, my mom hugged me and said, \"Clara, believe in yourself. You can do it. You have  put in  so much effort.\" Her words made me realize that I needed to trust in my  _  . Two days later, I got the report card. I was happy that my math exam scores doubled. When I told my mom the good news excitedly, she said, \"Yes, you deserve   it. I'm  _  of you, dear.\"\nEven now, whenever I worry that a task is too much for me, I think back to that  _  .\nNo matter how  _  something is, if you are willing   to work, you can succeed. I'm forever thankful to Mom for that lesson.", 
    "options": [
        [
            "influenced", 
            "disappointed", 
            "provided", 
            "fooled"
        ], 
        [
            "sentence", 
            "lesson", 
            "word", 
            "saying"
        ], 
        [
            "always", 
            "often", 
            "seldom", 
            "never"
        ], 
        [
            "encourage", 
            "feed", 
            "support", 
            "guide"
        ], 
        [
            "With", 
            "Through", 
            "For", 
            "To"
        ], 
        [
            "good", 
            "long", 
            "hard", 
            "free"
        ], 
        [
            "warned", 
            "advised", 
            "ordered", 
            "allowed"
        ], 
        [
            "worried", 
            "mad", 
            "comfortable", 
            "tired"
        ], 
        [
            "house", 
            "school", 
            "office", 
            "classroom"
        ], 
        [
            "refused", 
            "agreed", 
            "missed", 
            "enjoyed"
        ], 
        [
            "ability", 
            "skill", 
            "spirit", 
            "creativity"
        ], 
        [
            "caring", 
            "patient", 
            "proud", 
            "responsible"
        ], 
        [
            "teacher", 
            "exam", 
            "text", 
            "day"
        ], 
        [
            "interesting", 
            "difficult", 
            "boring", 
            "valuable"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "D", 
        "C", 
        "B", 
        "C", 
        "B", 
        "B", 
        "A", 
        "C", 
        "A", 
        "C", 
        "B", 
        "B"
    ], 
    "source": "middle1087"
}