{
    "article": "Around the world, people have different ideas about what good manners are. When you go to restaurants in different parts of the world, it's  _  to know the right and wrong things to do. For example, in China it's OK to  _  a lot of noise in a restaurant. In fact, if a restaurant isn't noisy and  _  , you may think there is something wrong with it. However, in many western countries, restaurants are  _  places. If a table is too loud, other people who are eating there might even  _  to the owner of the restaurant. Paying the bill is also different from country to country. In China,one person usually pays for  _  . In western countries, one person pays if he or she is entertaining clients , but when friends eat together, they usually share the cost. This is called doing Dutch . Also, when westerners pay the  _  , they usually leave some money for the  _  . This is called \"Leaving a tip\". Leaving a tip is thought to be polite. In the U.S., it's  _  to leave tips of 10%, 15%, or 20% of the bill, which is decided by how good the service is. Good waiters can make a lot of money! The food people eat is different in the world, but you can find the same kind of food in many countries. Chinese and Italian food, for example, are  _  all over the world.", 
    "options": [
        [
            "popular", 
            "difficult", 
            "important", 
            "enjoyable"
        ], 
        [
            "cause", 
            "keep", 
            "stop", 
            "make"
        ], 
        [
            "lively", 
            "dangerous", 
            "lucky", 
            "polite"
        ], 
        [
            "noisy", 
            "quiet", 
            "busy", 
            "clean"
        ], 
        [
            "shout", 
            "explain", 
            "complain", 
            "ask"
        ], 
        [
            "everybody", 
            "nobody", 
            "somebody", 
            "none"
        ], 
        [
            "bill", 
            "waiter", 
            "visitors", 
            "food"
        ], 
        [
            "gatekeeper", 
            "seller", 
            "waiter", 
            "visitor"
        ], 
        [
            "terrible", 
            "common", 
            "serious", 
            "unusual"
        ], 
        [
            "different", 
            "popular", 
            "expensive", 
            "cheap"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "A", 
        "B", 
        "C", 
        "A", 
        "A", 
        "C", 
        "B", 
        "B"
    ], 
    "source": "middle1448"
}