{
    "article": "There was once a young man who liked puppets   so much that he was apprenticed   to a master puppet-maker. Sadly, the young man was not very clever, and his _ and other apprentices were always telling him that he had no ability when it came to making puppets, and that he would not _ .\nEven so, he enjoyed it so much that he worked day after day to improve. Though he put all his effort into it, they would always find something _ with the puppets he had made, and they ended up driving him out of the workshop.\nHe wasn't going to give up, so the young man decided that from then on he would spend all his time making just one kind of puppet. And whenever he found a fault   in his puppet he would throw it away and _ again right from the starting-point. Years passed, and with each _ attempt   his puppet became a little bit better. By now, his puppet was much better than anything his old apprentices could make, but he _ making improvements. Living like that, the man wasn't making any money, and many people laughed at how _ he was.\nBy the time he was an old man, his puppet was truly wonderful. Finally one day, after so many years of effort, he finished his puppet, and said, \"I can't find anything wrong with it. This time it\nis _ .\" And for the first time in all those years, instead of _ his puppet, he put it on the shelf, feeling truly satisfied and happy. The puppet gave that old man more _ than any other famous puppet-makers ever got from their creations.", 
    "options": [
        [
            "father", 
            "teacher", 
            "classmate", 
            "friend"
        ], 
        [
            "miss", 
            "forget", 
            "succeed", 
            "listen"
        ], 
        [
            "wrong", 
            "interesting", 
            "special", 
            "unusual"
        ], 
        [
            "stop", 
            "start", 
            "change", 
            "appear"
        ], 
        [
            "usual", 
            "old", 
            "easy", 
            "new"
        ], 
        [
            "finished", 
            "avoided", 
            "kept", 
            "stopped"
        ], 
        [
            "serious", 
            "strict", 
            "honest", 
            "silly"
        ], 
        [
            "modern", 
            "perfect", 
            "priceless", 
            "expensive"
        ], 
        [
            "hiding", 
            "fixing", 
            "covering", 
            "throwing"
        ], 
        [
            "confidence", 
            "joy", 
            "courage", 
            "warmth"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "B", 
        "D", 
        "C", 
        "D", 
        "B", 
        "D", 
        "B"
    ], 
    "source": "middle547"
}