{
    "article": "I stood there listening to my father shout at top of his voice. The look on his face said that one of us did something  _  . \"Which one of you did this?\" We all looked down at the step. There was child's handwriting in chalk there. I had a lot of  _  . I hoped no one could see it. Would he guess it was me? I was so worried. When he asked me, I lied, \"Not me, Dad.\" The others denied it as well. Of course, we all knew that one of  _  must have done it. But as the youngest and smallest of the three, I just couldn't find the courage to tell the truth. To  find out  who had written on the step, Father gave us each a piece of paper and a pencil. \"I want each of you to  _  exactly what you see on the step.\" I tried my best to write the words  _  . I didn't want Dad to be able to tell it was me. He  _  our pieces of paper and looked at them. \"Since none of you will admit to have done it, then I will punish you  _  and said nothing. The last thing I wanted was for Dad to  _  me. \"I did it.\" My sister said she did something that she didn't. Father grounded her for a month. We didn't talk about that day for many years. Not until we were all older and I knew it was  _  to finally tell my dad it was really me. I always felt sorry for it. That was the last time I let anyone take the blame for me.", 
    "options": [
        [
            "hard", 
            "wrong", 
            "special", 
            "true"
        ], 
        [
            "surprise", 
            "happiness", 
            "fear", 
            "joy"
        ], 
        [
            "them", 
            "me", 
            "you", 
            "us"
        ], 
        [
            "write", 
            "read", 
            "recite", 
            "draw"
        ], 
        [
            "clearly", 
            "slowly", 
            "differently", 
            "carefully"
        ], 
        [
            "opened", 
            "colored", 
            "showed", 
            "collected"
        ], 
        [
            "only", 
            "all", 
            "both", 
            "one"
        ], 
        [
            "beat", 
            "teach", 
            "punish", 
            "understand"
        ], 
        [
            "lucky", 
            "silly", 
            "easy", 
            "safe"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "D", 
        "A", 
        "C", 
        "D", 
        "B", 
        "C", 
        "D"
    ], 
    "source": "middle571"
}