{
    "article": "Wang Ling, a middle school girl, felt angry with her parents after getting a boy's phone call.\"A classmate called me to discuss homework.We talked _ just a few minutes before my parents got mad,\" said the girl.\"They asked whether I liked the boy.I said I  Didn' t,   they wouldn't _ me.\"Wang's trouble is not strange at all because puppy love  becomes a big headache for  both  parents and schools.They worry that puppy love will be bad for _ .Her school makes it a rule not to allow any talk or any physical contact  _ one boy and one girl alone.\nMany students say they understand _ parents and teachers are so nervous about puppy love.But some think they are going too far.\"We have our _ thoughts and we know what to  do with it,\" said Wang Ling.\nAnother girl, Jiang Ting, liked _ friends with boys.\" Boys and girls can learn from each other,\" she said.\" My mother asks me to study hard.However, she  never  stops me from making friends with boys. Once Jiang told her mother she might fall in love with a boy.Her mother let Jiang make her  own _ .Soon Jiang found that she didn't like him any more because the boy was not as _ as what she had thought before.And she did wrose and worse in her subjects because she spent much on it.At last she _ the worry form schools and most parents about puppy love.", 
    "options": [
        [
            "for", 
            "in", 
            "with", 
            "to"
        ], 
        [
            "because", 
            "if", 
            "but", 
            "and"
        ], 
        [
            "both", 
            "none", 
            "either", 
            "neither"
        ], 
        [
            "game", 
            "study", 
            "match", 
            "housework"
        ], 
        [
            "during", 
            "between", 
            "around", 
            "about"
        ], 
        [
            "how", 
            "what", 
            "who", 
            "why"
        ], 
        [
            "play", 
            "live", 
            "do", 
            "fill"
        ], 
        [
            "never", 
            "already", 
            "ever", 
            "just"
        ], 
        [
            "its", 
            "my", 
            "his", 
            "her"
        ], 
        [
            "good", 
            "bad", 
            "heavy", 
            "thin"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "A", 
        "B", 
        "B", 
        "D", 
        "C", 
        "A", 
        "D", 
        "A"
    ], 
    "source": "middle1876"
}