{
    "article": "A school was near my home and I often watched the kids from my window when they played basketball. One day, I saw a little girl playing with boys. _ played very well and no one could stop her. Sometimes, I saw her play _ She often practiced by herself until dark.\nOne day I asked her _ she practiced so much. She said, \"I want to go to university. The only way I can go is to get a scholarship . I like to play basketball. If I play well, I can get a scholarship. My Daddy told me that if the _ is big enough and work hard for it, I can be successful.\" Then she smiled and ran to go practice.\nI watched her through junior high and into high school. Every week, she and her school team won in the basketball matches.\nOne day, I saw her _ in the grass. I went over there and sat down beside her. I asked her what was wrong. \"Oh, nothing,\" she answered, \"I am just too short.\"  The coach told her that she would probably never play for a university team,so she should _ her dream about university.\nShe was sad, but she told me that her father said those coaches were not _ . They did not understand the power of a dream. He told her that if she really wanted to play for a good university, and wanted a scholarship, _ could stop her.\nThe next year, when she and her _ went to the Northern California match, a university recruiter noticed her and _ her a full scholarship. Her dream finally came true.", 
    "options": [
        [
            "They", 
            "She", 
            "He", 
            "It"
        ], 
        [
            "slowly", 
            "happily", 
            "safely", 
            "alone"
        ], 
        [
            "why", 
            "how", 
            "where", 
            "when"
        ], 
        [
            "dream", 
            "cause", 
            "advice", 
            "matter"
        ], 
        [
            "playing", 
            "crying", 
            "standing", 
            "sitting"
        ], 
        [
            "forget", 
            "enjoy", 
            "think", 
            "throw"
        ], 
        [
            "happy", 
            "strange", 
            "right", 
            "wrong"
        ], 
        [
            "anything", 
            "something", 
            "nothing", 
            "everything"
        ], 
        [
            "teacher", 
            "mother", 
            "team", 
            "father"
        ], 
        [
            "bought", 
            "offered", 
            "found", 
            "brought"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "A", 
        "A", 
        "D", 
        "A", 
        "C", 
        "C", 
        "C", 
        "B"
    ], 
    "source": "middle2184"
}