{
    "article": "Do you like sports? All over the world people enjoy sports. Sports can help people to keep healthy, happy and to live  _  What sports do you like? People often play different games in  _  winter and summer. Summer is good  _  swimming. And in winter people often go skating. Some sports are very popular around the world  such as  basketball, football and running. Do you often run? Are you good at it? Here is a funny story about running! Peter and Mike are in the same class. Peter was born  _  a poor family. But Mike's father is a shopkeeper and is  _  . When Peter gets into trouble, Mike always  _  him. Peter likes to have sports. And he is good at running.  _  can catch up with him in his school and he often wins the 400-meter race. It was Sunday. Mike and Peter went to a forest to have a picnic. Mike took a lot of  _  there. They ate and drank and then began to go fishing in the river. The two boys enjoyed themselves there. Suddenly they  heard  a great noise. They looked around and found it was  a tiger  behind a big tree. They were both very  _  . Peter put on his shoes  _  and was going to run away. Mike  _  him and said, \"It's no use for us. The tiger runs  much faster  than us. Let's find a way.' \"It doesn't matter,' said Peter. \" I'm sure I'll run faster than you!\" Don't you think you should learn to run fast?", 
    "options": [
        [
            "shorter", 
            "longer", 
            "slower", 
            "faster"
        ], 
        [
            "all", 
            "every", 
            "both", 
            "each"
        ], 
        [
            "at", 
            "in", 
            "for", 
            "on"
        ], 
        [
            "in", 
            "for", 
            "on", 
            "with"
        ], 
        [
            "hard", 
            "poor", 
            "rich", 
            "unhappy"
        ], 
        [
            "helps", 
            "asks", 
            "wants", 
            "teaches"
        ], 
        [
            "Nobody", 
            "Everyone", 
            "Anybody", 
            "Someone"
        ], 
        [
            "books", 
            "clothes", 
            "food", 
            "movies"
        ], 
        [
            "excited", 
            "bored", 
            "tired", 
            "afraid"
        ], 
        [
            "slowly", 
            "happily", 
            "beautifully", 
            "quickly"
        ], 
        [
            "stopped", 
            "asked", 
            "wondered", 
            "told"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "C", 
        "A", 
        "C", 
        "A", 
        "A", 
        "C", 
        "D", 
        "D", 
        "A"
    ], 
    "source": "middle328"
}