{
    "article": "Three young men got bored with their jobs in the factory. They felt  _  , so they get together to visit their old master worker for  _  . When they saw their master worker, they began to  _  about their factory and their jobs. The old master worker listened to them without  _  a word. About twenty minutes later, he gave the three guests green tea, black and milk tea in  different  cups. Some cups are old, some are new, some are expensive and some are cheap. The old man told them to  _  what they like. When all the three young men had a cup of  _  in hand, the old man said: \"Look at the cups in your hands! You  all  chose the good - looking, expensive cups. What would you like to choose, tea or  _  ? You should choose what you need. Stop complaining about anybody or anything. And use your head and choose what you really need for yourself. Fall in love  _  your job and this is what you really need now.\" Life is serious. Jobs and life are just like cups and tea. Jobs are just ways of making a living. If we understand this, we won't complain about our jobs. Try to choose what you need, and you'll enjoy yourself and your life.", 
    "options": [
        [
            "relaxed", 
            "quiet", 
            "unpleasant", 
            "comfortable"
        ], 
        [
            "advice", 
            "jobs", 
            "work", 
            "tea"
        ], 
        [
            "hate", 
            "discuss", 
            "worry", 
            "complain"
        ], 
        [
            "telling", 
            "saying", 
            "talking", 
            "speaking"
        ], 
        [
            "choose", 
            "understand", 
            "make", 
            "stop"
        ], 
        [
            "water", 
            "milk", 
            "drink", 
            "juice"
        ], 
        [
            "jobs", 
            "ways", 
            "life", 
            "cups"
        ], 
        [
            "with", 
            "of", 
            "at", 
            "for"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "B", 
        "A", 
        "C", 
        "D", 
        "A"
    ], 
    "source": "middle1529"
}