{
    "article": "Now we have the Internet and TV programmes.There is so _ to talk about.They are around us all the time and _ us all kinds of things.\nTo help kids stay away from bad _ , a two-day meeting was held in Shanghai last week.People at the meeting talked about how to make kids' programmes and books _ . They want kids to grow up in an information world _ fights or terror .\nThe Internet and TV help people learn _ is going on around us. _ sometimes what they tell you may be wrong.You need to use your _ and think for a while when you are watching TV or suffering on the Internet.\n\"Let's take air-cushioned   sports shoes for _ !\" Advertisements say people can run faster if they wear these shoes. But you need to make _ how useful the shoes really are. The shoes may _ you look cool, but will they really make you run faster? Before you spend all your _ on something advertisements want you to buy, think twice. Each company says they have the best sports shoes in the world _ they want you to buy their shoes.\nTo _ kids from being cheated   or badly effected, grow-ups are trying to make the media   more fun and safer for them.\nThe people at the Shanghai meeting said _ should be no bad things in Web pages and TV programmes for kids to see. The Internet workers also said they would try and care more about the views of kids.", 
    "options": [
        [
            "many", 
            "much", 
            "little", 
            "few"
        ], 
        [
            "speak", 
            "say", 
            "talk", 
            "tell"
        ], 
        [
            "books", 
            "teaching", 
            "information", 
            "games"
        ], 
        [
            "better", 
            "easier", 
            "cleaner", 
            "worse"
        ], 
        [
            "with", 
            "without", 
            "under", 
            "above"
        ], 
        [
            "who", 
            "which", 
            "what", 
            "that"
        ], 
        [
            "Because", 
            "But", 
            "So", 
            "Since"
        ], 
        [
            "hand", 
            "mouth", 
            "head", 
            "foot"
        ], 
        [
            "fun", 
            "short", 
            "example", 
            "sport"
        ], 
        [
            "sure", 
            "decision", 
            "mind", 
            "way"
        ], 
        [
            "train", 
            "make", 
            "serve", 
            "realize"
        ], 
        [
            "knowledge", 
            "time", 
            "spirit", 
            "money"
        ], 
        [
            "though", 
            "so", 
            "because", 
            "unless"
        ], 
        [
            "stop", 
            "frighten", 
            "attract", 
            "treat"
        ], 
        [
            "we", 
            "they", 
            "it", 
            "there"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "C", 
        "A", 
        "B", 
        "C", 
        "B", 
        "C", 
        "D", 
        "A", 
        "B", 
        "D", 
        "C", 
        "A", 
        "D"
    ], 
    "source": "middle877"
}