{
    "article": "Ever since I was very young, I have looked to my parents and grandparents, friends and teachers for guidance. I ask them for answers to everything. Afraid to make a _ , I've asked countless times, \"What should I do?\"\nMaybe I was _ to take my first baby step on my own. I decided I only wanted to do things the \"right\" way, even if it meant not doing something.\nSometime during my high school years, I _ . Maybe it was when I decided to try for the lead in \"Beauty and the Beast\". Never mind that I would have to memorize lines and movements, I would take the chance that I might fail. The day of tryouts my heart was beating wildly.My hands were _ badly when I got up to sing.\nBut something happened. When I opened my mouth to sing, the sound was loud, powerful and sweet. I reached for the high notes that sometimes were beyond my reach. With no break in my voice, I was trying to do my best even though I might _ . But I didn't. I realized that if I wanted to live life to the fullest, I had to take chances.\nNow, I do take these chances with baby steps every day, _ my opinions in class discussions or debates, performing in other school plays.\nI have finally learned to _ myself. I'm taking a tough science course right now. Some of my friends are talking about auditing the class so a low grade won't affect their opportunities for college. I'm taking the chance that if I try _ enough, I'll get a good grade so that it won't lower my strong grades in other subjects.\nI have come to realize that even though my parents and grandparents, friends and teachers don't always have the _ to \"What should I do?\", they will be there to support me when I try.\n\"Life is learning to deal with Plan B,\" my mother told me. But I now know that the Plan A I make for my life will become easier with every _ I take.", 
    "options": [
        [
            "wish", 
            "mistake", 
            "noise", 
            "promise"
        ], 
        [
            "afraid", 
            "ready", 
            "happy", 
            "lazy"
        ], 
        [
            "travelled", 
            "regretted", 
            "changed", 
            "waited"
        ], 
        [
            "knocking", 
            "moving", 
            "aching", 
            "shaking"
        ], 
        [
            "miss", 
            "doubt", 
            "turn", 
            "fail"
        ], 
        [
            "hiding", 
            "voicing", 
            "choosing", 
            "guessing"
        ], 
        [
            "comfort", 
            "excuse", 
            "push", 
            "enjoy"
        ], 
        [
            "fast", 
            "hard", 
            "early", 
            "well"
        ], 
        [
            "answer", 
            "plan", 
            "letter", 
            "hope"
        ], 
        [
            "break", 
            "minute", 
            "chance", 
            "class"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "D", 
        "D", 
        "B", 
        "C", 
        "B", 
        "A", 
        "C"
    ], 
    "source": "middle879"
}