{
    "article": "Born in 1979 in Harbin, Heilongjiang Province, Yang Guang lost his sight when he was still a baby. As the saying goes, when God closes a door, he opens a window. Although he lived in  _  , Yang Guang found something that made his life colorful. That is  _  . Yang Guang started his life with music at the age of 7. Then,  joined  a local art group and he stayed in the group  _  8years. When he was 19, he decided to go to Beijing. Yang is  _  clear about what he wants and pursues his goal with a strong will, which helped him go  _  the difficult times in Beijing. \"If you want to do something, you have to go straight for it and don't  think about  other things or the result,\" he said. To attend the television show \"Xing Guang Da Dao\" was a turning point in this young man's life. By his excellent singing, Yang  _  won the contest of the week, the month and the year of 2007. In the final round of year's contest, he caught a cold, but he did not stop  _  from striving for his dream. This is only his first step of realizing his dreams. Yang Guang is still striving for his dreams and looking forward to  another  success.", 
    "options": [
        [
            "sadness", 
            "darkness", 
            "happiness", 
            "silence"
        ], 
        [
            "art", 
            "sing", 
            "music", 
            "play"
        ], 
        [
            "after", 
            "of", 
            "in", 
            "for"
        ], 
        [
            "always", 
            "never", 
            "almost", 
            "usually"
        ], 
        [
            "across", 
            "in", 
            "through", 
            "into"
        ], 
        [
            "carefully", 
            "quickly", 
            "successfully", 
            "luckily"
        ], 
        [
            "her", 
            "him", 
            "his", 
            "he"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "D", 
        "A", 
        "C", 
        "C", 
        "B"
    ], 
    "source": "middle686"
}