{
    "article": "My name is Ben Mansury. I'm fifteen years old and study in a middle school. In school, I never join in any group discussion or stage program. So, I never knew what stage nervousness was. Our community has a weekly \"Students Ideas\" program. About two years ago, I received a(n)  _  from the chairman of our community. He invited me to the \"Students Ideas\" talk the next morning to speak to the group. The time between his call to the next morning was like several weeks for me. The whole night, I could not sleep. Many  _  were coming. One of them was to call the chairman, with regret, and tell him that I could not come. But finally, I thought, if I missed this  _  , the community would never invite me again to any of their programs. So, I decided to go. I reached the hall in time. When my turn came and I started, my heartbeat increased and my mouth went dry. I wasn't even able to  _  the words on the paper properly. I had no idea where I was standing and what I was talking. That was the day when I  _  my biggest weakness: public speaking. After I finished, I met with the chairman and  _  what happened to me. He said that this happens to everyone. It is very  _  . He suggested that I should come again the next week. I  _  a talk carefully. This time when I gave the talk, I was somewhat comfortable but not confident . Afterwards, I met with the chairman again and told him about the improvement I  _  I had made. He was kind enough to invite me again. For around one month, I practiced a lot for my talk. This time I was feeling comfortable and both the chairman and my neighbors thought I did a good job. I learned that everything is  _  if we take the first step, as the saying goes: A journey of thousand miles begins with first step.", 
    "options": [
        [
            "letter", 
            "call", 
            "card", 
            "email"
        ], 
        [
            "topics", 
            "regrets", 
            "thoughts", 
            "words"
        ], 
        [
            "man", 
            "group", 
            "stage", 
            "chance"
        ], 
        [
            "read", 
            "spell", 
            "see", 
            "recite"
        ], 
        [
            "had", 
            "forgot", 
            "realized", 
            "improved"
        ], 
        [
            "asked", 
            "checked", 
            "explained", 
            "wondered"
        ], 
        [
            "useful", 
            "successful", 
            "difficult", 
            "common"
        ], 
        [
            "wrote", 
            "prepared", 
            "gave", 
            "finished"
        ], 
        [
            "knew", 
            "felt", 
            "believed", 
            "hoped"
        ], 
        [
            "easy", 
            "great", 
            "helpful", 
            "possible"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "D", 
        "A", 
        "C", 
        "C", 
        "D", 
        "B", 
        "B", 
        "D"
    ], 
    "source": "middle71"
}