{
    "article": "Once two beautiful sisters called Reitu and Reipae lived in a village. The sisters loved each other very much and did everything together.\nOne day a chief  called Ueoneone was travelling through the area. He saw Reitu and fell in love with _ . But he went home without telling her. When he got to his village, Ueoneone _ stop thinking about Reitu. He knew he wanted to marry her, so he sent his magic bird to look for her. The bird flew to the sisters' village. He told Reitu about Ueoneone and asked if she wanted to marry him. Reitu _ , but said her sister must go with her. The bird asked the sisters to sit on its back.\nThen the bird _ to fly. After a few hours, they stopped to rest. But when Reipae got off, the bird flew back into the sky with Reitu, leaving Reipae behind. Reitu was very _ . As soon as she saw Ueoneone, she told him to send the bird back to fetch  Reipae.\n\"I can't.\" said Ueoneone. \"Look, the bird is dying. He has no more _ .\"\nReitu was sad.\n\"Now I have _ the person I love the most in the world,\" she said.\nUeoneone took Reitu's hand.\n\"I'll send my fastest men to find your _ ,\" he told her.\nThe men found Reipae and brought her Reitu. The sisters were very happy to see each other again. Reitu and Ueoneone got married. Reipae also married another chief from the area, _ the sisters were able to stay close for the rest of their lives.", 
    "options": [
        [
            "him", 
            "her", 
            "it", 
            "them"
        ], 
        [
            "shouldn't", 
            "needn't", 
            "mustn't", 
            "couldn't"
        ], 
        [
            "cried", 
            "left", 
            "agreed", 
            "understood"
        ], 
        [
            "began", 
            "refused", 
            "continued", 
            "learned"
        ], 
        [
            "angry", 
            "happy", 
            "bored", 
            "excited"
        ], 
        [
            "home", 
            "food", 
            "courage", 
            "magic"
        ], 
        [
            "met", 
            "lost", 
            "killed", 
            "became"
        ], 
        [
            "mother", 
            "sister", 
            "father", 
            "brother"
        ], 
        [
            "so", 
            "but", 
            "though", 
            "because"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "C", 
        "A", 
        "A", 
        "C", 
        "B", 
        "B", 
        "A"
    ], 
    "source": "middle2036"
}