{
    "article": "A recent survey shows some problems about children's using computers. When a group of Children were asked  _  they used their computers for, most of them said they usually used computers  to play  games. Why? Computer games are becoming more and more popular. A number of small shops along busy streets have changed into small game houses  to get  more money. These places are always crowded with people especially young boys. In the computer games houses, people  _  a lot of money competing with the machines. It is  _  for one to win a computer, but one can make progress after  _  again and again. People always want to win whatever games they play. The more they  _  ,the more they want to win. At school, they have no mind for their lessons. When school is over, they run to the nearby computer game houses. Some of them can get enough money from their parents. But some of them are not lucky enough to get the money. They begin to  take away  other people's money and become thieves. For school boys, it's easier to fall into bad habits than into good  _  .Bad habits don't come  _  .They come little by little. So we should use computers in a right way, or they will bring many serious problems.", 
    "options": [
        [
            "why", 
            "what", 
            "how", 
            "if"
        ], 
        [
            "spend", 
            "use", 
            "win", 
            "take"
        ], 
        [
            "wonderful", 
            "easy", 
            "important", 
            "difficult"
        ], 
        [
            "trying", 
            "driving", 
            "making", 
            "running"
        ], 
        [
            "lose", 
            "hope", 
            "wish", 
            "work"
        ], 
        [
            "one", 
            "ones", 
            "those", 
            "habit"
        ], 
        [
            "slowly", 
            "suddenly", 
            "exactly", 
            "usually"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "D", 
        "A", 
        "A", 
        "B", 
        "B"
    ], 
    "source": "middle847"
}