{
    "article": "The 88th Academy Awards, once again thrilled   people around the world,  _ the Chinese, who were excited about Leonardo DiCaprio getting the Best Actor Award.\nBut the yearly presentation   also made Chinese filmmakers uncomfortable _ , as no Chinese films have ever won a golden prize. The hard truth leaves people wondering _ the nation will get a place in the famous Academy Award, as China is already the second largest film market.\nThe condition for our national artists is similar to that of Chinese writers and scientists _ Mo Yan and Tu Youyou won Nobel Prizes in 2012 and 2015. Just as Chinese people are used to seeing their fellow citizens   taking home Nobel Prizes from Stockholm, it is time for them to see that _ an Oscar is also achievable  .\nThere are good reasons for the Chinese people to _ such a bright future.\nFirst, China is one of the fastest growing film _ in the world. Lots of businesses from home and abroad are willing to invest here. It will  _ more talented people to get into the industry because of more and more relaxed environment for development.\nThe latest survey _ Chinese cinemas took a record 6.87 billion yuan (about $1.05 billion) in ticket sales in February, with the monthly box office   going past that of North America for the first time.\nThe achievement may be _  in the future. It is supposed that China's yearly box office could continue to go beyond North America in 2017.", 
    "options": [
        [
            "but", 
            "with", 
            "except", 
            "including"
        ], 
        [
            "happy", 
            "relaxed", 
            "impossible", 
            "uncomfortable"
        ], 
        [
            "where", 
            "when", 
            "what", 
            "why"
        ], 
        [
            "while", 
            "after", 
            "before", 
            "since"
        ], 
        [
            "winning", 
            "developing", 
            "choosing", 
            "deciding"
        ], 
        [
            "cancel", 
            "excuse", 
            "doubt", 
            "expect"
        ], 
        [
            "artists", 
            "markets", 
            "awards", 
            "companies"
        ], 
        [
            "encourage", 
            "remain", 
            "insist", 
            "realize"
        ], 
        [
            "showed", 
            "studied", 
            "started", 
            "sent"
        ], 
        [
            "replied", 
            "repaired", 
            "required", 
            "repeated"
        ]
    ], 
    "answers": [
        "D", 
        "D", 
        "B", 
        "C", 
        "A", 
        "D", 
        "B", 
        "A", 
        "A", 
        "D"
    ], 
    "source": "middle2324"
}