{
    "article": "One cold, rainy evening last October, I was in the hospital collecting medical records. A 43-year-old  _  , whom I will call Ms A, was lying in bed. There were no relatives or friends with her.  _  the bed beside her was empty. After I finished my work, I was about to leave when Ms A spoke in her  _  voice . \"I haven't seen you here before, doctor. Are you  _  ?\" Not really. It's just that I don't come here every day,\" I replied. I was  _  someone in her condition would want to talk. Ms A started talking about  _  . She told me that she had three children in primary school, who were  staying with  a neighbor. \" My husband  _  a year ago and I'm the only breadwinner of my family. We are not rich and my  _  as a cleaner is exactly enough for me and my kids.\" I just sat quietly while she talked. She  _  her difficulties and sufferings, and her struggles to earn money. She also expressed her fear about what would  become of  her children if something bad happened to her. Finally, Ms A stopped talking with \"I'm very sorry for keeping you here listening to my problems, but I feel  _  now. I had no one to pour out my  _  to.\" A single tear fell down the corner of her eye. A few days later, when I returned to the ward , I discovered that Ms A had left as her  _  had improved. Ms A taught me one of the most important lessons a doctor can learn. Sometimes patients don't need expensive medicine or state-of-the-art technology. They just need someone with the  _  and willingness to lent an ear and spare a little of their time. For me, that is one of the best things a doctor can do for a patient.", 
    "options": [
        [
            "doctor", 
            "nurse", 
            "patient", 
            "manager"
        ], 
        [
            "Even", 
            "But", 
            "So", 
            "Then"
        ], 
        [
            "calm", 
            "serious", 
            "eager", 
            "weak"
        ], 
        [
            "hungry", 
            "certain", 
            "free", 
            "new"
        ], 
        [
            "delighted", 
            "bored", 
            "surprised", 
            "content"
        ], 
        [
            "everything", 
            "others", 
            "anything", 
            "herself"
        ], 
        [
            "died", 
            "graduated", 
            "joined", 
            "appeared"
        ], 
        [
            "energy", 
            "skill", 
            "pay", 
            "experience"
        ], 
        [
            "divided", 
            "shared", 
            "absorbed", 
            "refused"
        ], 
        [
            "hopeless", 
            "good", 
            "worse", 
            "bored"
        ], 
        [
            "problems", 
            "beliefs", 
            "excuses", 
            "adventures"
        ], 
        [
            "future", 
            "income", 
            "condition", 
            "performance"
        ], 
        [
            "patience", 
            "courage", 
            "freedom", 
            "talent"
        ]
    ], 
    "answers": [
        "C", 
        "C", 
        "D", 
        "D", 
        "C", 
        "D", 
        "A", 
        "C", 
        "B", 
        "B", 
        "A", 
        "C", 
        "A"
    ], 
    "source": "middle2131"
}