{
    "article": "Dear Dad, I am writing this letter to you because it's too difficult to talk about it. I can't stop  thinking  about my uncle and how he died. In fact, I seriously want to ask you to stop smoking. I've looked up  lots of  information about smoking and I've found out some disturbing things. You already know that smoking is bad for your breathing and can cause cancer. I've found out  _  it causes many other illnesses as well. Did you know that over 100,000 people die from smoking every year in Britain? It's the second  biggest  cause of death in the world. I don't want you to be one of these people. When Mum  asks  you to smoke outside, you think she's just being difficult. Well, it's true that she doesn't like the smell of smoke in the house and on our clothes. It's not very pleasant. However, when you smoke, it's also bad for me and Mum. In other words, when we breathe in your smoke, it's like we are smoke  _  . As a result, we can get diseases as well. Doctors are finding that more and more non-smokers are falling ill because of the effects of other people's smoking. I know that it is very difficult to stop smoking  _  you mustn't give in to it. Please see the doctor and ask him for help. We will do anything we can  to help  you. You must try to save your own  _  . You are important to us and we don't want to lose you. Who else can I ask to help me  _  my maths homework or fix my bike? Please don't smoke! Your loving daughter, Kate", 
    "options": [
        [
            "that", 
            "which", 
            "why", 
            "what"
        ], 
        [
            "we", 
            "us", 
            "our", 
            "ourselves"
        ], 
        [
            "but", 
            "or", 
            "and", 
            "so"
        ], 
        [
            "life", 
            "lives", 
            "live", 
            "living"
        ], 
        [
            "for", 
            "with", 
            "on", 
            "to"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "A", 
        "A", 
        "B"
    ], 
    "source": "middle498"
}