{
    "article": "When spring comes, flowers are beginning to come out. For teenagers in the US that means a vacation is on _  way.\nIn the US, students may begin their spring vacation at different times, depending on  _  they live. So while students from one town are on vacation, their neighbors in the next town might  have classes as usual. Spring vacation is also known _  \"spring break\". During this time, students have one or two weeks off from school. The break usually happens in late March or _ .\nSpring break is a _  time. Teachers usually don't give homework over the break, so students can spend their days and nights free from school-time stress. There are lots of ways to spend the time. Some families go on vacation, visit a new state or even a new _ . Others may ravel to visit family members who live far away. Some students _ relax at home or visit friends' houses. Sometimes teachers lead overseas trips for groups of students. On a ten-day trip, for example, students might have a  _  through Spain, France, and Italy. These trips are often expensive,  _  they give students an unusual chance to see other parts of the world.", 
    "options": [
        [
            "their", 
            "its", 
            "your", 
            "ours"
        ], 
        [
            "where", 
            "how", 
            "why", 
            "when"
        ], 
        [
            "by", 
            "in", 
            "for", 
            "as"
        ], 
        [
            "February", 
            "April", 
            "October", 
            "December"
        ], 
        [
            "relaxing", 
            "busy", 
            "private", 
            "tiring"
        ], 
        [
            "family", 
            "city", 
            "town", 
            "country"
        ], 
        [
            "both", 
            "all", 
            "either", 
            "neither"
        ], 
        [
            "tour", 
            "rest", 
            "walk", 
            "picnic"
        ], 
        [
            "or", 
            "but", 
            "and", 
            "so"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "D", 
        "B", 
        "A", 
        "D", 
        "C", 
        "A", 
        "B"
    ], 
    "source": "middle1792"
}