{
    "article": "People have been raising pigeons  for about 10,000 years. And pigeon  keepers use  different kinds of pigeons for different  _ . Some people use pigeons for  _ . For example, in parts of China people cook a special meal with pigeon to celebrate the New Year.\nSome people also keep pigeons because they look especially _ . There are many interesting kinds of these \"pretty\" pigeons. Different kinds of pigeons have interesting features  such as  long, soft tail feathers or designs on their heads. The owners of these kinds of pigeons enter them in  _  and the best looking pigeons are chosen to win prizes.\nBut pigeons have many other  _  too. Pigeons can fly long distances without growing  _ . They also have another  _  sense. No matter how far from home they are, pigeons can usually fly back to where they  _ . This is often called a \"homing sense\". This sense makes them good for carrying  _ .\nIn many cities around the world, pigeons live in special houses, and pigeon keepers spend a lot of money and time  caring for  their birds. When someone has a very good pigeon, he is very  _ . He may also have a way to make money.  But this is not usually the main  _  people keep pigeons. For some people, they keep pigeons as a hobby.\nPeople love pigeons so much that they even take them  _  when they move to a new country. They  _   these birds as their children.  \"When you are looking at a pigeon in the sky you feel free. It is the best feeling you have in a strange country\", a pigeon lover says.", 
    "options": [
        [
            "ways", 
            "types", 
            "purposes", 
            "decision"
        ], 
        [
            "food", 
            "sport", 
            "money", 
            "family"
        ], 
        [
            "beautiful", 
            "clever", 
            "funny", 
            "happy"
        ], 
        [
            "shows", 
            "competitions", 
            "classes", 
            "discussions"
        ], 
        [
            "skills", 
            "ideas", 
            "signs", 
            "problem"
        ], 
        [
            "worried", 
            "tired", 
            "hungry", 
            "cold"
        ], 
        [
            "special", 
            "quick", 
            "weak", 
            "sixth"
        ], 
        [
            "live", 
            "eat", 
            "play", 
            "fall"
        ], 
        [
            "luck", 
            "peace", 
            "messages", 
            "supplies"
        ], 
        [
            "brave", 
            "proud", 
            "nervous", 
            "patient"
        ], 
        [
            "duty", 
            "prize", 
            "reason", 
            "power"
        ], 
        [
            "along", 
            "back", 
            "up", 
            "out"
        ], 
        [
            "wish", 
            "consider", 
            "prove", 
            "choose"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "A", 
        "B", 
        "A", 
        "B", 
        "A", 
        "A", 
        "C", 
        "B", 
        "C", 
        "A", 
        "B"
    ], 
    "source": "middle2264"
}