{
    "article": "\"But I feel good doing this!\" the little boy's voice rang in my ears when I entered the mall. He stood raising _ for cancer research. In the cold wind, he pulled his hat down over his ears. He warmed one hand in his pocket and held a list with the other hand. I noticed him greeting the people passing by _ gloves on his hands.\nI checked my purse but I didn't find any change. I was _ ready to give money because I wished cancer could be cured   one day.\n\"I'll bring you some money when I returned\" I _ the little boy.\n\"Thank you!\" he smiled and he seemed almost _ in the cold air. I suggested he come inside the mall, but he said, \"The guard there said no one is allowed to raise money for charities   in the mall. But I feel good doing this here. It's OK.\"\nI did my shopping and _ about buying something for him. Finally, I bought a pair of gloves, brown ones. The cashier   felt curious when I _ the boy's words \"But I feel good doing this!\"\nThe boy still stood where he had been. I offered some money to him and _ in the list that he handed to me. Then he told me that his best friend George had leukemia  . He did this in order to help him out of _ .\nWith tears full of my eyes, I put the gloves that I bought for him into his hands.\n\"Will the cancer research give you something to thank you for doing this?\"\n\"Oh yes!\" the boy said and his eyes _ up with joy, \"They sure do! Now I can stand here much _ than I expected!\"\n\"What do you receive then?\" I asked. He answered with a smile, \"I get another new, empty list.\"", 
    "options": [
        [
            "cards", 
            "money", 
            "bottles", 
            "information"
        ], 
        [
            "without", 
            "except", 
            "into", 
            "from"
        ], 
        [
            "never", 
            "seldom", 
            "sometimes", 
            "always"
        ], 
        [
            "cheated", 
            "refused", 
            "promised", 
            "praised"
        ], 
        [
            "relaxed", 
            "bored", 
            "frozen", 
            "pleased"
        ], 
        [
            "thought", 
            "worried", 
            "talked", 
            "cared"
        ], 
        [
            "introduced", 
            "repeated", 
            "heard", 
            "kept"
        ], 
        [
            "called", 
            "filled", 
            "gave", 
            "got"
        ], 
        [
            "sight", 
            "work", 
            "trouble", 
            "breath"
        ], 
        [
            "lit", 
            "came", 
            "caught", 
            "took"
        ], 
        [
            "lower", 
            "less", 
            "earlier", 
            "longer"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "D", 
        "C", 
        "C", 
        "A", 
        "B", 
        "B", 
        "C", 
        "A", 
        "D"
    ], 
    "source": "middle2096"
}