{
    "article": "There's always hope\nI was sitting around the other morning thinking about some of my former   students. When I do that, my thoughts always turn to Vincent.\nEighteen years ago, on the first day of third grade, when I had my class write something about themselves, he just sat there. So I took him outside to see what was wrong. \"You can  _  about something else; anything you want,\" I offered. He turned to me and shouted, \"I can't write!\" and threw his pencil.\nVincent was difficult and  _ . He acted out. He threw things. He refused to work, to be quiet, to sit down.\nSo these many years later, I wondered what he was up to. With time on my hands, I googled him and looked him up on Facebook and before long I found him. And after a few texts we agreed to meet. And he told me his  _ .\nVincent knew he was smart, but he also knew he couldn't do what other kids did. He had to move around and talk. For him, sitting still, listening and reading, didn't  _ . The more he tried to do the things on his terms, the more we forced him to do the things on our terms and the angrier he got. The angrier he got, the more trouble he got into.\nIn other words, we  _  him.\nBut he wouldn't let me tell him that. He took full responsibility for his behavior. He remembered feeling  _  for acting out.\nThat  _ me. Kids like Vincent are always angry about something; they hold the world responsible for the consequence .\nThis story also had one of us turning Vincent around. But none of us did that for him. There were no excellent teachers like Annie Sullivan or Jaime Escalante. That didn't mean we didn't _ . I remember countless conversations, trying to understand him, going to his Little League games.\nIt was Vincent who turned Vincent around, along with a junkie   house painter he worked with after failing through high school. This guy clearly scared   him straight; talked him into going to  _ .\nBut it was Vincent who attended classes and got straight A's for two years. And it was Vincent who got accepted into ten different universities, including Stanford and UW. And it was Vincent who landed a great job at a big tech company.\nVincent is completely different form 18 years ago. I couldn't be happier for him.\nAnd for me, the  _  is simple but powerful -- there's always hope.", 
    "options": [
        [
            "talk", 
            "read", 
            "write", 
            "hear"
        ], 
        [
            "angry", 
            "lazy", 
            "careless", 
            "disappointed"
        ], 
        [
            "job", 
            "story", 
            "school", 
            "family"
        ], 
        [
            "arrive", 
            "change", 
            "work", 
            "end"
        ], 
        [
            "forgot", 
            "helped", 
            "freed", 
            "failed"
        ], 
        [
            "proud", 
            "special", 
            "natural", 
            "terrilble"
        ], 
        [
            "attracted", 
            "encouraged", 
            "surprised", 
            "influenced"
        ], 
        [
            "try", 
            "wait", 
            "learn", 
            "succeed"
        ], 
        [
            "movies", 
            "business", 
            "college", 
            "sports"
        ], 
        [
            "rule", 
            "memory", 
            "answer", 
            "message"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "B", 
        "C", 
        "D", 
        "D", 
        "C", 
        "A", 
        "C", 
        "D"
    ], 
    "source": "middle1873"
}