{
    "article": "When I was in my ninth grade, I was on a stage-design team for a play and Mrs. Reagan was my director. Almost immediately I loved her. She had an unpleasant voice and a direct way of speaking,  _  she was encouraging and inspiring. For some reason, she was impressed with my work and me. Mrs. Reagan would ask me for my  _  . She wanted to know how I thought we should deal with things. At first I had no idea how to answer because I knew  _  about stage design! But I slowly tried to answer her  _  . It was cause and effect: She believed I had opinions, so I began to make them and I completed them perfectly. She believed in me, so I began to believe in myself. Mrs. Reagan 's motto that year was, \"Try it. We can achieve it  _  !\" I began to take the chances. I had been so afraid of failing but suddenly there was no failing. I learned to create something  _  . The shy, quiet freshman achieved success that year. I was  _  in the program as \"Student Art Assistant\" because of the time and effort I'd put in. It was that year that I  _  I wanted to spend the rest of my life doing stage design. Being on that stage-design team with Mrs. Reagan changed me completely. Not only was I stronger and more experienced than I had thought, but I also  _  a strong interest and a world I hadn't known. She taught me not to  _  what people think I should do. She taught me to take chances and not be  _  . Mrs. Reagan was the person who gave me confidence when I was upset. Her trust in me has encouraged me to do things that I never imagined  _  .", 
    "options": [
        [
            "and", 
            "so", 
            "yet", 
            "for"
        ], 
        [
            "impression", 
            "opinion", 
            "information", 
            "advice"
        ], 
        [
            "anything", 
            "something", 
            "everything", 
            "nothing"
        ], 
        [
            "questions", 
            "words", 
            "explanations", 
            "ideas"
        ], 
        [
            "again", 
            "more", 
            "instead", 
            "later"
        ], 
        [
            "easily", 
            "carefully", 
            "confidently", 
            "proudly"
        ], 
        [
            "introduced", 
            "recognized", 
            "placed", 
            "considered"
        ], 
        [
            "proved", 
            "decided", 
            "accepted", 
            "realized"
        ], 
        [
            "discovered", 
            "developed", 
            "took", 
            "encouraged"
        ], 
        [
            "accept", 
            "decide", 
            "care", 
            "wonder"
        ], 
        [
            "afraid", 
            "lazy", 
            "sad", 
            "bored"
        ], 
        [
            "successful", 
            "possible", 
            "enjoyable", 
            "agreeable"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "D", 
        "A", 
        "D", 
        "C", 
        "B", 
        "D", 
        "A", 
        "C", 
        "A", 
        "B"
    ], 
    "source": "middle1555"
}