{
    "article": "Once there was a king who offered a prize to the artist who would paint the best picture of peace. Many artists  _  .The king looked at all the pictures. But there were only two he really liked, and he had to choose  _  them. One picture was of a  _  lake. The lake was a perfect mirror for peaceful high mountains all around it. Overhead was a blue sky with white soft clouds. All that saw this picture  _  it was a perfect picture of peace. The other picture had  _  ,too. But these were rugged and bare .Above was an angry sky, from which rain fell and in which lightning played. Down the side of the mountain was a waterfall. This did not look peaceful  at all  .But when the king looked closely, he saw behind the waterfall a bush  _  in the crack in the rock. In the bush a mother bird had built her nest .She sat on her nest, watching the running water. After the king compared the two pictures  _  ,he chose the second picture  _  explained, \"Peace does not mean to be in a place where there is no noise, trouble, or hard work. Peace means when facing unhappy situations, you can still be calm in your  _  .That is the real meaning of peace.\"", 
    "options": [
        [
            "argued", 
            "invited", 
            "tried", 
            "invented"
        ], 
        [
            "between", 
            "except", 
            "within", 
            "through"
        ], 
        [
            "calm", 
            "round", 
            "small", 
            "deep"
        ], 
        [
            "announced", 
            "thought", 
            "doubted", 
            "promised"
        ], 
        [
            "lakes", 
            "clouds", 
            "mirrors", 
            "mountains"
        ], 
        [
            "lying", 
            "growing", 
            "dying", 
            "moving"
        ], 
        [
            "actively", 
            "carefully", 
            "angrily", 
            "widely"
        ], 
        [
            "so", 
            "but", 
            "or", 
            "and"
        ], 
        [
            "voice", 
            "world", 
            "heart", 
            "view"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "A", 
        "B", 
        "D", 
        "B", 
        "B", 
        "D", 
        "C"
    ], 
    "source": "middle1532"
}