{
    "article": "Recently, a reader asked me about the dangers that pets can face around the house. So, I visited my local animal  _  last weekend and got some advice to share about how we can make our homes  _  for our pets. When I arrived, several pets and their  _  were in the waiting room. Mr. Smith, with a cat, chatted with me. \"My cat will be  _  for an uncomfortable stomach in a minute,\" he said. \"My children gave  _  a bowl of milk. However, if she is given milk, she will get a stomachache.\" Just then, the vet walked over to us. \"Yes, Mr. Smith is  _  . Only a few people know this. In fact, milk mustn't be fed to cats  _  some cats can't take it in easily,\" the vet said. \"Other human foods are bad for pets  as well  . For example, if a dog eats chocolate, it will become  _  .\" I asked the vet what other  _  there are for pets around the house. \"Well,\" she replied, \"we should not  _  small things, such as batteries , lying around as they can be eaten by pets. Last month, a small cat was brought  _  because it had eaten a button which was on the floor without being noticed!\" Before I left, the vet  _  me some more important advice to share with you: You should keep all medicine and cleaning products away from pets. Also, pets, such as cats and dogs, sometimes will  _  their hair if they are unwell. If your pet looks unwell or is acting unusual, you should  ring up  your vet at once. Follow the advice and you can keep your pets safe.", 
    "options": [
        [
            "school", 
            "hospital", 
            "market", 
            "museum"
        ], 
        [
            "warm", 
            "safe", 
            "clean", 
            "beautiful"
        ], 
        [
            "owners", 
            "visitors", 
            "teachers", 
            "actors"
        ], 
        [
            "paid", 
            "chosen", 
            "treated", 
            "returned"
        ], 
        [
            "it", 
            "me", 
            "him", 
            "her"
        ], 
        [
            "friendly", 
            "healthy", 
            "good", 
            "right"
        ], 
        [
            "until", 
            "though", 
            "while", 
            "because"
        ], 
        [
            "brown", 
            "sick", 
            "smart", 
            "comfortable"
        ], 
        [
            "secrets", 
            "changes", 
            "dangers", 
            "mistakes"
        ], 
        [
            "buy", 
            "use", 
            "leave", 
            "collect"
        ], 
        [
            "in", 
            "off", 
            "on", 
            "down"
        ], 
        [
            "offered", 
            "posted", 
            "wasted", 
            "accepted"
        ], 
        [
            "colour", 
            "keep", 
            "lose", 
            "sell"
        ]
    ], 
    "answers": [
        "B", 
        "B", 
        "A", 
        "C", 
        "D", 
        "D", 
        "D", 
        "B", 
        "C", 
        "C", 
        "A", 
        "A", 
        "C"
    ], 
    "source": "middle1432"
}