{
    "article": "People can't be perfect in every way. What we can do is to change ourselves to become a better person.\nMy mother always  _  to me, \"To make progress is important\".\nRecently I felt very unhappy and worried because I didn't do well in my  _  exam. I prepared for it  _  for a long time. I spent a lot of time reviewing books and test papers in order to get good grades. But my careful preparation didn't  _  any rewards. My good friend found out that I was terribly sad. I told her all my feelings. I thought I was  _  and helpless. When I looked at the wide sky, I couldn't help  crying . She sat next to me,  holding  my hands, but said nothing until I stopped crying. She cheered me up and encouraged me, \" Trust me, you're great.\"\nThe sentence encouraged me and brought sunshine into my life. I never felt so happy as I did that day. I learned that life isn't always _ , but the changes make us wiser. Records do not mean  _ .\nWhat we have done is more important than the result. One thing I'd like to change is that I don't want to  be controlled  by weak points. I want to be an optimistic  girl.", 
    "options": [
        [
            "says", 
            "tells", 
            "speaks", 
            "talks"
        ], 
        [
            "month", 
            "month's", 
            "monthly", 
            "months'"
        ], 
        [
            "careful", 
            "carelessly", 
            "careless", 
            "carefully"
        ], 
        [
            "bring", 
            "take", 
            "carry", 
            "catch"
        ], 
        [
            "hope", 
            "hopeful", 
            "hopeless", 
            "hopes"
        ], 
        [
            "safe", 
            "ugly", 
            "beautiful", 
            "dangerous"
        ], 
        [
            "something", 
            "anything", 
            "nothing", 
            "everything"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "D", 
        "A", 
        "C", 
        "C", 
        "D"
    ], 
    "source": "middle831"
}