{
    "article": "My name is Lily. My father is a teacher. His students love him a lot because he is funny. I love him, too, but I think he can be \"foolish\"  _  . Once we moved into a new house and had to go shopping to buy new chairs and lights. In the supermarket, I'm interested  _  some of the beautiful lights with good qualities and made my father buy them. When we got home, my father began to work out how much money we had  _  that day. Suddenly, he stopped. \"Something's wrong.\" he said. \"I've got 30 yuan  _  than I should!\"\"That's great,\" I said. \"You can buy me that  _  book I want.\" Father said nothing. Instead, he counted how much money he had again and again. \"The salesgirl must have made a mistake. We  _  go back to the shop,\" he said. \"Do you have to go back?\" I asked. \"Nobody will know we  were given  too much change . It would be foolish to go back.\" \"It wouldn't be 'foolish'.\" my father said angrily. \"It's called being  _  .\" At that moment, I looked into his eyes and knew he was right. The salesgirl was surprised to see us in the shop again. But  _  we gave her the money, she thanked us a lot. On my way home, my father stopped me  _  smiled. \"Do you still want that cartoon book?\" he asked. I looked at my \"foolish\" father and answered loudly, \"Father, you are the greatest!\"", 
    "options": [
        [
            "sometimes", 
            "often", 
            "always", 
            "never"
        ], 
        [
            "with", 
            "on", 
            "in", 
            "to"
        ], 
        [
            "took", 
            "lost", 
            "cost", 
            "spent"
        ], 
        [
            "much", 
            "more", 
            "less", 
            "some"
        ], 
        [
            "story", 
            "cartoon", 
            "music", 
            "magic"
        ], 
        [
            "may", 
            "can", 
            "should", 
            "need"
        ], 
        [
            "clever", 
            "honest", 
            "selfish", 
            "cool"
        ], 
        [
            "how", 
            "why", 
            "when", 
            "where"
        ], 
        [
            "and", 
            "but", 
            "or", 
            "so"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "D", 
        "B", 
        "B", 
        "C", 
        "B", 
        "C", 
        "A"
    ], 
    "source": "middle1150"
}