{
    "article": "Students' life in America\nStudents in America always have a busy but wonderful school day.\nThey have classes for five days each week. From _ to Friday students usually get up at seven. Then they wash their faces and have _ . They usually have eggs, bacon , bread, fruit and a glass of milk. After that they go to school on foot or by yellow school _ .Some students ride bikes. They get to school at about half past eight. Then they put their school bags in their lockers and _ only one book, a notebook and a pencil to each class. In a middle school, students have classes for six hours. Their classes are English, Writing, Maths, Music, _ and so on .\nAt noon students don't go home for lunch. They _ have lunch at school. They often have meat, fruit, _ , bread and a drink. _ most students like pizza, hot dogs and hamburgers better. Students don't have a short _ .They go back to have classes _ lunch until three o'clock. Then they go home.\nStudents don't do their homework after they get home. They usually play or watch TV before _ . They have _ at six in the evening. The supper usually has soup, meat, vegetables, rice or pasta . After supper they do their _ . Sometimes they play or talk with their parents at home.", 
    "options": [
        [
            "Monday", 
            "Tuesday", 
            "Wednesday", 
            "Thursday"
        ], 
        [
            "dinner", 
            "breakfast", 
            "lunch", 
            "supper"
        ], 
        [
            "car", 
            "bike", 
            "bus", 
            "plane"
        ], 
        [
            "lend", 
            "carry", 
            "borrow", 
            "take"
        ], 
        [
            "Chatting", 
            "Sleeping", 
            "Drawing", 
            "Eating"
        ], 
        [
            "really", 
            "seldom", 
            "usually", 
            "never"
        ], 
        [
            "vegetables", 
            "games", 
            "books", 
            "competitions"
        ], 
        [
            "So", 
            "And", 
            "Because", 
            "But"
        ], 
        [
            "sleep", 
            "talk", 
            "drink", 
            "holiday"
        ], 
        [
            "at", 
            "before", 
            "after", 
            "in"
        ], 
        [
            "midnight", 
            "supper", 
            "rest", 
            "Work"
        ], 
        [
            "supper", 
            "lunch", 
            "reakfast", 
            "nothing"
        ], 
        [
            "homework", 
            "housework", 
            "cleaning", 
            "Washing"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "C", 
        "D", 
        "C", 
        "C", 
        "A", 
        "D", 
        "A", 
        "C", 
        "B", 
        "A", 
        "A"
    ], 
    "source": "middle1159"
}