{
    "article": "A girl complained to her father about her hard life. She didn't know what she had to do and wanted to  give up  . She felt tired for fighting and fighting. One problem had been finished but another came. Her father, a cook, took her  into  the kitchen. He poured water into three pans and boiled it. When the water was boiling, in the first pan he put some carrots, in the  _  he put some eggs and in the last he put some coffee. He  waited for  them for a few minutes without any words. The girl closed her mouth and waited impatiently, not knowing  _  her father was doing that. After about 20 minutes, her father turned  _  the stove, took out the carrots and put them in a bowl. He took out the eggs and put  _  in another bowl. After that the  _  was poured into a cup. Turning back to his daughter, he asked, \"What do you  _  ?\" \"Carrots, eggs, and coffee, \" she answered. Her father told her to  _  her eyes and let her touch the carrots. She did and felt that the carrots were soft. After that he asked her to take the eggs and  _  them. Then, she got the eggs, cooked and hard. At last, the father asked her to smell the coffee. \"What's the meaning, Father?\" He  _  that each had suffered the same unlucky experience-- the boiling water, but  _  had a different reaction( . The strong and hard carrots had become soft and weak after being in the boiling water. The eggs became hard  _  being cooked. The coffee was very special and it changed the water. \"Who are you?\" asked her father, \"When calamity  knocks at  your door, what's your reaction? Are you carrots, eggs, or coffee?\"", 
    "options": [
        [
            "first", 
            "second", 
            "third", 
            "fourth"
        ], 
        [
            "that", 
            "what", 
            "where", 
            "why"
        ], 
        [
            "on", 
            "over", 
            "off", 
            "in"
        ], 
        [
            "it", 
            "its", 
            "them", 
            "themselves"
        ], 
        [
            "eggs", 
            "carrots", 
            "coffee", 
            "water"
        ], 
        [
            "hear", 
            "taste", 
            "smell", 
            "see"
        ], 
        [
            "close", 
            "open", 
            "wash", 
            "drop"
        ], 
        [
            "keep", 
            "protect", 
            "break", 
            "drink"
        ], 
        [
            "complained", 
            "explained", 
            "told", 
            "expected"
        ], 
        [
            "every", 
            "all", 
            "each", 
            "either"
        ], 
        [
            "before", 
            "after", 
            "behind", 
            "under"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "C", 
        "C", 
        "C", 
        "D", 
        "A", 
        "C", 
        "B", 
        "C", 
        "B"
    ], 
    "source": "middle754"
}