{
    "article": "Imagine a life without arms or legs! You can't hold anyone in your  _  .You can't walk anywhere with your feet. How would you last a day like that? Would you smile at yourself in the mirror like Nick Vujicic, the  29-year-old  Australian? Nick was born without limbs , so life was not  _  for him. At school many students played jokes on him  _  he looked different from everyone else. He was refused to be  _  friends, so he always felt  _  . However, he faced that bravely . He  _  to type and write with two toes at the age of six, and he could  _  surf and play golf. In college, he was very successful and was among the  _  students in the studies. And he decided on  _  to do later in his life- to encourage others to work hard for their dreams. Now Nick is one of the most popular  _  in the world. He travels to many countries and gives speeches about his story  _  difficulties. \"Living life fully is about looking at what you  _  ,not what you don't have.\" He said. His  _  encourages millions of people. \"I tell people to keep on getting up when they  _  and to always love themselves,\" he said. \"If I can encourage just one person, then my job in this life is done.\"", 
    "options": [
        [
            "arms", 
            "ears", 
            "eyes", 
            "teeth"
        ], 
        [
            "old", 
            "easy", 
            "important", 
            "difficult"
        ], 
        [
            "because", 
            "if", 
            "until", 
            "although"
        ], 
        [
            "his", 
            "my", 
            "their", 
            "our"
        ], 
        [
            "alone", 
            "relaxed", 
            "lonely", 
            "surprised"
        ], 
        [
            "imagined", 
            "forgot", 
            "helped", 
            "learned"
        ], 
        [
            "even", 
            "ever", 
            "never", 
            "hardly"
        ], 
        [
            "tall", 
            "lazy", 
            "sleepy", 
            "excellent"
        ], 
        [
            "how", 
            "who", 
            "what", 
            "where"
        ], 
        [
            "doctors", 
            "speakers", 
            "scientists", 
            "engineers"
        ], 
        [
            "at", 
            "for", 
            "into", 
            "against"
        ], 
        [
            "make", 
            "have", 
            "lose", 
            "want"
        ], 
        [
            "story", 
            "sadness", 
            "friend", 
            "family"
        ], 
        [
            "fall", 
            "play", 
            "listen", 
            "exercise"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "A", 
        "C", 
        "C", 
        "D", 
        "A", 
        "D", 
        "C", 
        "B", 
        "D", 
        "B", 
        "A", 
        "A"
    ], 
    "source": "middle2223"
}