{
    "article": "I was looking for a Christmas present for my daughter in a toy store. A nicely dressed little girl, with some money in her little hand, was looking at some beautiful  _  . When she saw a doll she liked, she would ask her father  _  she had enough money. He usually said yes. At the same time, a boy, with  _  and small clothes, was looking at some video games. He, too, had money in his hand, but it looked no more than five dollars. Each time he  _  up one of the video games and looked at his father, he shook his head. The little girl had  _  her doll, a very beautiful one.  _  , she noticed the boy and his father. She saw the boy give up a video game with disappointment and walk to another corner of the store. The little girl put her doll back to the  _  and ran over to the video game. After she talked to her father, she paid for the video game and whispered to the  shop assistant  . So the boy got the video game that he wanted  for free  --he was told it was a  _  from the store. He smiled happily, although he felt it was so incredible . The girl saw all this happen. She  smiled  , too. When I walked out of the store to my car, I heard the father ask his daughter why she had done that. I would never  _  their short talk. \"Daddy, didn't Grandma want me to buy something that would  _  me happy?\" He said, \"Of course, she did.\" \"Well, I just  _  !\" With that, the little girl started skipping towards their car  _  .", 
    "options": [
        [
            "shops", 
            "dolls", 
            "flowers", 
            "girls"
        ], 
        [
            "when", 
            "that", 
            "if", 
            "why"
        ], 
        [
            "poor", 
            "expensive", 
            "fashionable", 
            "old"
        ], 
        [
            "looked", 
            "picked", 
            "carried", 
            "caught"
        ], 
        [
            "chosen", 
            "completed", 
            "brought", 
            "decided"
        ], 
        [
            "However", 
            "Finally", 
            "So", 
            "Again"
        ], 
        [
            "floor", 
            "seat", 
            "store", 
            "shelf"
        ], 
        [
            "prize", 
            "surprise", 
            "memory", 
            "return"
        ], 
        [
            "repeat", 
            "remember", 
            "forget", 
            "forgive"
        ], 
        [
            "make", 
            "bring", 
            "find", 
            "lead"
        ], 
        [
            "see", 
            "did", 
            "will", 
            "had"
        ], 
        [
            "carefully", 
            "happily", 
            "luckily", 
            "angrily"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "D", 
        "B", 
        "A", 
        "A", 
        "D", 
        "A", 
        "C", 
        "A", 
        "B", 
        "B"
    ], 
    "source": "middle1832"
}