{
    "article": "No man can change the weather. Nobody can control the weather. But if we read correctly the signs around us we can  _  what the more important changes in the weather will be. This way of telling what the weather will be  _  on the following day or two is called weather forecasting.. For many countries and in all countries people  have studied  the weather and tried to make weather forecasting. Some distant objects such as hills and tall trees seem to be very clear and near. This is a sign of much vapor in the  _  , and so rain will probably come. Rings around the sun are a sign of coming rain. Many people feel in their bones the coming of wet weather. Their joints hurt. Some birds fly high if fine weather is coming  _  they fly near the ground if rainy or stormy weather is  on the way  . It is probably because of the insects  _  they are hunting that they fly low. If you see a rainbow during rainy weather, this is a sign that the weather will become clear and fine. Such rainbows come in the evening. If the stars twinkle  _  at night, then fine weather will continue. If a fog appears in the morning, just about a river, then the day will be  _  . If the sunset is mostly red in color, then the following day will be fine. If a rainbow  _  in the morning, rainy weather will probably come. Most of the above sayings have been made by the people who have used their eyes and brains to make weather forecasting.", 
    "options": [
        [
            "tell", 
            "read", 
            "write", 
            "make"
        ], 
        [
            "going", 
            "doing", 
            "like", 
            "about"
        ], 
        [
            "air", 
            "earth", 
            "space", 
            "world"
        ], 
        [
            "until", 
            "while", 
            "however", 
            "although"
        ], 
        [
            "when", 
            "where", 
            "which", 
            "while"
        ], 
        [
            "late", 
            "clearly", 
            "strongly", 
            "quickly"
        ], 
        [
            "warm", 
            "cold", 
            "windy", 
            "snowy"
        ], 
        [
            "shines", 
            "performs", 
            "disappears", 
            "appears"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "A", 
        "B", 
        "C", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "middle2137"
}