{
    "article": "It was a sunny winter day. I had gone down the tower when a blind man came toward me. He kept close to the wall, touching it lightly with his arm. I stood still and looked at him walking toward the tower.\n\"What does a blind man want to climb up the tower for?\" I wondered  , Thinking of some terrible reasons, I thought I should _ him.\nHe went up slowly and _ from time to time. I followed him a few steps behind. When he got to the first corner of the bell tower, I came close to him. \"Excuse me,\" I said as politely as I could, \"but I wonder _ you came up.\"\nHe smiled, \"Perhaps climbing up the tower. You have noticed--and yet, not being blind, perhaps you won't--how the sun shines into the tower _ the windows here and there, so that one can _ the cool steps suddenly become quite warm, even in winter. But behind the wall there is shade . There is no place so good as this for feeling the difference between light and darkness. Though I'm blind, I also want to feel the _ brought by the sunlight. In fact, it isn't my first time to be here.\" He said and seemed as _ as a child.\nI had never thought that even a blind man could have his way to _ the beautiful life. But we often paid no attention to its value because we never _ it.\nWe went down the _ together and I left him. From then on, I began to treasure what life has given me.", 
    "options": [
        [
            "stop", 
            "follow", 
            "watch", 
            "protect"
        ], 
        [
            "talked", 
            "smiled", 
            "stopped", 
            "called"
        ], 
        [
            "why", 
            "how", 
            "where", 
            "when"
        ], 
        [
            "by", 
            "in", 
            "through", 
            "into"
        ], 
        [
            "see", 
            "feel", 
            "know", 
            "imagine"
        ], 
        [
            "warmth", 
            "peace", 
            "happiness", 
            "difference"
        ], 
        [
            "pleased", 
            "simple", 
            "excited", 
            "lovely"
        ], 
        [
            "understand", 
            "live", 
            "enjoy", 
            "have"
        ], 
        [
            "noticed", 
            "practiced", 
            "had", 
            "lost"
        ], 
        [
            "street", 
            "tower", 
            "steps", 
            "corner"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "C", 
        "B", 
        "C", 
        "A", 
        "C", 
        "D", 
        "B"
    ], 
    "source": "middle1427"
}