{
    "article": "Several years ago a young priest   moved to London. He often took the bus from his home to the downtown area. One day, he went home by bus as usual. When he sat down, he discovered that the driver had given him twenty extra pence. As he _ what to do, he thought to himself, \"You'd better give the twenty pence back. It would be _ to keep it.\" Then he thought, \"Oh forget it, it's only twenty pence. Who would worry about so little _ ? Also, the bus company already gets too much money; they will never miss it. _ it as a gift from God, and keep quiet.\"\nWhen his stop came, the priest stopped at the door for a moment, then he handed the twenty pence back to the driver and said, \"Here, you gave me too much change.\"\nThe driver with a smile replied, \"Aren't you the new priest in this area? I'm thinking about going to your church  . I just wanted to see what you would do if I gave you too much _ .\"\nWhen the young priest got _ the bus, his knees became weak and soft. He had to hold the nearest tree for _ , and looked up to the sky and said loudly, \"Oh, God. I almost _ myself for twenty pence!\"\nWe may never see what influence our _ have on people. What we need to provide is an example for others to see. Be careful of how you behave, and be _ always because you never know who is watching your actions.", 
    "options": [
        [
            "considered", 
            "knew", 
            "realized", 
            "understood"
        ], 
        [
            "right", 
            "useful", 
            "useless", 
            "wrong"
        ], 
        [
            "time", 
            "money", 
            "value", 
            "treasure"
        ], 
        [
            "Buy", 
            "Get", 
            "Accept", 
            "Find"
        ], 
        [
            "care", 
            "support", 
            "help", 
            "change"
        ], 
        [
            "on", 
            "up", 
            "off", 
            "through"
        ], 
        [
            "shelter", 
            "support", 
            "strength", 
            "struggle"
        ], 
        [
            "paid", 
            "blamed", 
            "devoted", 
            "sold"
        ], 
        [
            "thoughts", 
            "suggestions", 
            "actions", 
            "words"
        ], 
        [
            "brave", 
            "polite", 
            "generous", 
            "honest"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "B", 
        "C", 
        "D", 
        "C", 
        "B", 
        "D", 
        "C", 
        "D"
    ], 
    "source": "middle1379"
}