{
    "article": "A Fun Way to Start the Day\nMrs.Bames turned off the bright camera light on the news desk.Charlie,a fifth-grade news\nannouneer ,sat at the desk.\"Our show seems to be missing something,\"he said.\"It seems like we should end our _ on a cheerful note.We should give the students _ to enjoy.Since the show is schoolwide,we could help everyone begin the day in a positive way.\"\n\"What do you mean,Charlie?Don't you think the students like watching our news show and _ about the important events of the day?\"Mrs.Barnes said jokingly.\"Sure,\"Charlie answered.\"I'm just looking for a little something more to add to our program,\"he said.\nCharlie was what his mother called an\"experimenter\".He was, _ trying to find a new way of doing something,and today Charlie wanted to think of how to really _ up the school with the morning news.\nAs Charlie walked, he hummed the school song. His friend Jenny met him in the hallway and,without a word,she too began humming. By the time they reached the classroom door,another girl,Lily,had _ them and started singing their happy song.\nAt first,Mrs.Barnes watched the class with a confused expression,and then with a shine in her eyes,she smiled. Her class loved to sing,and she liked sharing this _ with them.\nJust at that moment,Charlie realized that music was the _ he had been looking for. That's it!Charlie thought. We can end the morning news by singing our school song.\n\"So what do you think?\"Charlie asked heartedly.Mrs.Barnes was happy to see Charlie _ about his volunteer work as the school news announcer.\"Let's give it a try!\"Mrs.Barnes replied.\"I have a feeling that it will be a _ way to end our morning news show and a fun way to start the day!\"", 
    "options": [
        [
            "class", 
            "show", 
            "day", 
            "week"
        ], 
        [
            "something", 
            "anything", 
            "nothing", 
            "everything"
        ], 
        [
            "reading", 
            "warning", 
            "talking", 
            "asking"
        ], 
        [
            "almost", 
            "already", 
            "ever", 
            "always"
        ], 
        [
            "call", 
            "wake", 
            "look", 
            "give"
        ], 
        [
            "told", 
            "helped", 
            "found", 
            "joined"
        ], 
        [
            "moment", 
            "memory", 
            "plan", 
            "information"
        ], 
        [
            "reason", 
            "request", 
            "answer", 
            "ability"
        ], 
        [
            "disappointed", 
            "worried", 
            "excited", 
            "surprised"
        ], 
        [
            "pleasant", 
            "polite", 
            "normal", 
            "traditional"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "D", 
        "B", 
        "D", 
        "A", 
        "C", 
        "C", 
        "A"
    ], 
    "source": "middle273"
}