{
    "article": "\"When it comes to Earth, there's no time to waste,\" says the Earth Day Network. And that is right. Protecting our environment is very important, and World Earth Day was _ in 1970 to raise people's environmental awareness. On April 22, People around the world celebrate Earth day.\nEvery year there is a special _ , and this year it is \"Trees for Earth\", so Earth Day will be all about planting trees. Their goal is to plant 7.8 billion trees _ the next five years.\nThat's a big goal, and you might wonder _ trees are so important. Well for one, they can help stop climate change. Carbon dioxide   is a chemical in our atmosphere, but _ make too much of it. Each person makes about 2.3 tons a year, which is bad for the environment.\nWell guess what! Trees take in carbon dioxide and protect the air quality. Planting new trees is important because people cut down _ trees. Last year, there were 3 trillion  trees in the _ , about 139 billion in China. But according to Time, the world's total number has been _ cut in half since human civilization   began. That's because 15 billion trees are cut down every year.\nSo we need to plant more to replenish   the ones we've lost. One tree can take in 48 pounds (21.8kg) of carbon dioxide per year. And it's still one of the cheapest and _ ways to get rid of carbon dioxide.\nBut don't forget that you can also help the environment by cutting down on how much energy or water you use every day. Every little thing helps!", 
    "options": [
        [
            "set", 
            "produced", 
            "created", 
            "found"
        ], 
        [
            "name", 
            "theme", 
            "saying", 
            "sign"
        ], 
        [
            "for", 
            "after", 
            "by", 
            "in"
        ], 
        [
            "what", 
            "why", 
            "whether", 
            "how"
        ], 
        [
            "humans", 
            "animals", 
            "ghosts", 
            "plants"
        ], 
        [
            "countless", 
            "hopeless", 
            "useless", 
            "endless"
        ], 
        [
            "wild", 
            "world", 
            "forest", 
            "space"
        ], 
        [
            "hardly[:", 
            "never", 
            "really", 
            "almost"
        ], 
        [
            "most", 
            "best", 
            "fewest", 
            "worst"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "D", 
        "B", 
        "A", 
        "A", 
        "B", 
        "D", 
        "B"
    ], 
    "source": "middle1381"
}