{
    "article": "Rachel lived in a small town in America. She always wanted to help others when she was young. At the age of 5, she learned about an organization named Locks of Love. It uses hair donations to make wigs for children who have  _  their hair because of cancer or other illnesses. Rachel then asked her mother to cut her long hair and send  _  to the organization. At the age of eight, she learned that other children had no clean  _  in Africa, and she was shocked, When her school began  _  money to build wells there, she asked her parents to  _  holding her birthday party. Also, she asked her friends each to donate $ 9 to the project in Africa  instead of  giving her birthday presents. One year later, it was her  _  birthday on June 12. She made a  _  page on the Internet with a goal of $300. However. Rachel was able to raise only $200. This made her a little  _  . Unluckily, Rachel was badly hurt in an accident  _  eight days. That was a terrible shock to her friends. They wanted to find some ways of showing support to her.  _  they began donating on Rachel's birthday page. Donations  _  her $ 300 goal quickly and kept rising . When it was clear that she would  _  come back to herself , her parents donated her organs to other children. They also donated her hair a  _  time to Locks of Love. More  _  was(were) being raised. The total donations soon reached $ 100,000, then $ 300, 000. So far more than $ 850,000 has been raised from all over the world, including donations from the Africans who are moved by the little American girl.", 
    "options": [
        [
            "sold", 
            "lost", 
            "borrowed", 
            "used"
        ], 
        [
            "them", 
            "her", 
            "one", 
            "it"
        ], 
        [
            "room", 
            "air", 
            "toy", 
            "water"
        ], 
        [
            "spending", 
            "making", 
            "raising", 
            "saving"
        ], 
        [
            "stop", 
            "start", 
            "keep", 
            "finish"
        ], 
        [
            "eighth", 
            "ninth", 
            "tenth", 
            "eleventh"
        ], 
        [
            "birthday", 
            "family", 
            "child", 
            "game"
        ], 
        [
            "angry", 
            "happy", 
            "excited", 
            "sad"
        ], 
        [
            "before", 
            "after", 
            "in", 
            "during"
        ], 
        [
            "But", 
            "And", 
            "Though", 
            "Unless"
        ], 
        [
            "passed", 
            "offered", 
            "showed", 
            "brought"
        ], 
        [
            "exactly", 
            "hardly", 
            "clearly", 
            "never"
        ], 
        [
            "final", 
            "first", 
            "following", 
            "next"
        ], 
        [
            "clothes", 
            "money", 
            "books", 
            "food"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "D", 
        "C", 
        "A", 
        "B", 
        "A", 
        "D", 
        "B", 
        "B", 
        "A", 
        "D", 
        "A", 
        "B"
    ], 
    "source": "middle2213"
}