{
    "article": "My \" perfect holiday\"\nAs a boy, like all other boys, I wanted to be a man. But my parents did everything for me. _ hey managed every minute of my life. Although they loved me. I felt a bit unhappy with them \"Zheng Chengyu, do your homework!\" \"Practice the piano!\" \" Turn off the TV!\" I became so bored with their orders that I wished they would leave me alone.\nWell, my wish came true! Although my parents were very worried about leaving me, they had to go away on business for a few days. Now was my chance! I could have some fun at last! As soon as I got home from school the first day, I happily threw my schoolbag on the sofa and ate lots of snacks. Then I enjoyed an exciting film _ TV , and after that I played computer games. I liked the games so much that I played until midnight.\nThe next morning I woke up late. I had to hurry to school without breakfast, but I was still late. The teacher asked me for my homework, but I could not hand it in. With an empty stomach, I was unable to play basketball with my classmate! I felt tired and _ at school all day long.\nWhen I got home, I tried to cook some rice, but I _ it. I even dropped my father's cup when I was cooking! I found myself so bad at simple cooking tasks. I started to feel _ . I wanted Mum and Dad to come home soon. Mum cooked such delicious food, and made sure I never forgot my homework. Dad always helped me with my difficult questions, and _ funny jokes when I was unhappy. Then I _ being home alone was not always perfect.\nWhen y parents came home, they were happy to find _ I could cook and tidy up now. I told them my home alone story, and we all laughed.", 
    "options": [
        [
            "Actually", 
            "Naturally", 
            "Nearly", 
            "Simply"
        ], 
        [
            "in", 
            "at", 
            "on", 
            "with"
        ], 
        [
            "sleep", 
            "asleep", 
            "sleepy", 
            "sleeping"
        ], 
        [
            "burn", 
            "burning", 
            "burnd", 
            "burnt"
        ], 
        [
            "alone", 
            "lonely", 
            "along", 
            "longly"
        ], 
        [
            "spoke", 
            "said", 
            "talked", 
            "told"
        ], 
        [
            "realized", 
            "considered", 
            "apologized", 
            "discussed"
        ], 
        [
            "if", 
            "what", 
            "which", 
            "that"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "C", 
        "D", 
        "B", 
        "D", 
        "A", 
        "D"
    ], 
    "source": "middle1974"
}