{
    "article": "Mr Bean, who is silly, awkward  _  always funny and enjoyable, is a world-famous comedy character on TV and in movies. He makes people  _  through a series of simple and funny acts  using  body languages. Rowan Atkinson is the  _  who plays Mr Bean. Mr Atkinson is quite  famous  for playing Mr Bean. Rowan was born on January 6, 1955, and  _  his early years on the family farm with his mother, three older brothers and his strict father, who did not believe  _  the value of television. For a time, he attended the same school as Tony Blair, who was two years older than him. At the age of 13, he  _  at Newcastle University where he had the highest marks in his year. At Oxford he got his Master's degree in electrical engineering. He was particularly  interested in  fast cars, of which he has a large collection. Rowan's career change from an electrical engineer to a famous comedian was partly  because of  some speaking problems he had in his childhood. While he was still at primary school, Rowan had already shown great talent in  _  . Although his teachers predicted a career in acting, Rowan was not confident  _  he met a group of talented people at university, and he realized this could be a career for him. Another important event  _  . One day in 1976, he was playing around and making faces  in the mirror  . He realized something. \"I discovered my face,\" he said later. John Lloyd, who worked for the BBC, says, \"When I watched Mr Atkinson act for the first time, I was  _  that he would be more famous than Chaplin.\"", 
    "options": [
        [
            "and", 
            "or", 
            "but", 
            "while"
        ], 
        [
            "laugh", 
            "sing", 
            "cry", 
            "dance"
        ], 
        [
            "doctor", 
            "writer", 
            "actor", 
            "farmer"
        ], 
        [
            "cost", 
            "took", 
            "paid", 
            "spent"
        ], 
        [
            "in", 
            "on", 
            "at", 
            "/"
        ], 
        [
            "worked", 
            "studied", 
            "played", 
            "helped"
        ], 
        [
            "swimming", 
            "driving", 
            "acting", 
            "singing"
        ], 
        [
            "until", 
            "but", 
            "after", 
            "before"
        ], 
        [
            "caused", 
            "missed", 
            "caught", 
            "occurred"
        ], 
        [
            "afraid", 
            "sure", 
            "worried", 
            "surprised"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "C", 
        "D", 
        "A", 
        "B", 
        "C", 
        "A", 
        "D", 
        "B"
    ], 
    "source": "middle1163"
}