{
    "article": "I still remember my kindergarten teacher, Mrs. White. She looked just like Snow White, _ she had the same bright eyes and short dark hair.\nWe used to _ a lot . And I would show what I wrote to Mrs. White for correction . She would look at my writing and see many mistakes in it. But she _ made any red correction and she always gave a star. I was feeling _ of my writing each time I got a star. But it _ my mother. So one day, when she met Mrs. White at a parent-teacher meeting, Mum asked her why she never corrected my _ and why she never said no to her child.\nMrs. White said, \"The children are just beginning to get _ about using words. Spelling and grammar can wait. We can't _ that interest with a red pen.\" As it was a long time ago, my mother could only remember the main idea of _ Mrs. White said about my writing. However, I grew up learning to use _ with loving care and confidence  like that.\nIf Mrs. White had used her red pen more often, I probably wouldn't be _ you about this now. Whenever I look back on those encouraging  _ from Mrs. White, I feel they just look _ real ones in the night sky-bright, shiny, and guiding me on my way somewhere. I do believe she was such a _ teacher, who tried to use a red pen less to keep the joy, wonder and excitement in a child's _ .\nThanks to Mrs. White, I have no fear about writing. Also, I'm not afraid of any mistake in my life!", 
    "options": [
        [
            "because", 
            "so", 
            "or", 
            "but"
        ], 
        [
            "run", 
            "cry", 
            "write", 
            "speak"
        ], 
        [
            "always", 
            "never", 
            "often", 
            "sometimes"
        ], 
        [
            "afraid", 
            "tired", 
            "surprised", 
            "proud"
        ], 
        [
            "protected", 
            "worried", 
            "helped", 
            "hurt"
        ], 
        [
            "exercises", 
            "designs", 
            "mistakes", 
            "messages"
        ], 
        [
            "nervous", 
            "excited", 
            "afraid", 
            "bored"
        ], 
        [
            "stop", 
            "keep", 
            "save", 
            "show"
        ], 
        [
            "that", 
            "when", 
            "which", 
            "what"
        ], 
        [
            "letters", 
            "grammar", 
            "words", 
            "spelling"
        ], 
        [
            "telling", 
            "talking", 
            "saying", 
            "speaking"
        ], 
        [
            "dreams", 
            "stars", 
            "gifts", 
            "pens"
        ], 
        [
            "at", 
            "through", 
            "for", 
            "like"
        ], 
        [
            "careless", 
            "helpless", 
            "wonderful", 
            "bad"
        ], 
        [
            "mind", 
            "hands", 
            "arms", 
            "ears"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "B", 
        "D", 
        "B", 
        "C", 
        "B", 
        "A", 
        "D", 
        "C", 
        "A", 
        "B", 
        "D", 
        "C", 
        "A"
    ], 
    "source": "middle803"
}