{
    "article": "When you sit down with your family to eat a meal, do you ever wonder when and where the tradition of using chopsticks   began?\nPeople say that the first chopsticks were used in China 5,000 years ago. The practice became widespread in Korea, Vietnam and Japan. Today they are a symbol of _ culture.\nOf Asian co untries, Japan highlights the importance of chopsticks _ a day to celebrate them. August 4 is _ as Chopsticks Day in Japan.\nThe different _ traditions of Asia lead to different kinds of chopsticks. For example the Japanese use sharp chopsticks _ they eat a lot of fish. Sharp chopsticks are good for picking the fish from the bones.\nChopsticks are made from different kinds of material. Bamboo chopsticks are _ because the material is easy to break apart and doesn't burn easily. People also use wood and bone for chopsticks. Some rich people had theirs made from valuable metals. Many emperors used silver chopsticks, for it was believed that they would turn _ if there was poison in the food.\nThere are also many table manners _ with chopsticks. For instance, never stick your chopsticks upright in your rice bowl or tap on your bowl with your chopsticks. People believe this is impolite to the host.", 
    "options": [
        [
            "European", 
            "American", 
            "Asian", 
            "Chinese"
        ], 
        [
            "with", 
            "through", 
            "on", 
            "over"
        ], 
        [
            "picked", 
            "made", 
            "used", 
            "set"
        ], 
        [
            "homing", 
            "producing", 
            "cooking", 
            "gardening"
        ], 
        [
            "because", 
            "so", 
            "once", 
            "unless"
        ], 
        [
            "usual", 
            "common", 
            "general", 
            "strong"
        ], 
        [
            "black", 
            "gray", 
            "dark", 
            "red"
        ], 
        [
            "popular", 
            "filled", 
            "compared", 
            "connected"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "C", 
        "A", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "middle247"
}