{
    "article": "Everyone should do something to protect the environment. How did we help to save our earth this week? Let me tell you. First, my family try to save  _  . We never left the lights on when leaving the rooms. We turn off the TV when  _  is watching it. Mom only uses cold water in the washing machine. Second, we also start recycling this week. We  _  to write on both sides of the paper, not just on one side. We also  _  our rubbish into different bags for bottles, cans, paper and food. Mom keeps the plastic shopping bags from the supermarket to use them again as rubbish bags. These are great  _  to help our environment. Third, my family also save water. We never take long baths and have short showers  _  . We wash the toilet with used water. My sister and I don't  _  the tap running when we brushed our teeth. At last, mom and dad begin to save gas. Mom  _  to drive us to school, but now my sister and I start riding our bikes to school. It's hard work  _  good exercise! This week dad and his workmates also start to go to work together in one  _  and share the cost. This also help reduce greenhouse gases. These are great ways to help protect our environment.", 
    "options": [
        [
            "water", 
            "oil", 
            "electricity", 
            "food"
        ], 
        [
            "somebody", 
            "everybody", 
            "nobody", 
            "anybody"
        ], 
        [
            "want", 
            "keep", 
            "refuse", 
            "try"
        ], 
        [
            "divide", 
            "check", 
            "buy", 
            "change"
        ], 
        [
            "ways", 
            "advice", 
            "information", 
            "news"
        ], 
        [
            "again", 
            "instead", 
            "already", 
            "too"
        ], 
        [
            "leave", 
            "stop", 
            "finish", 
            "watch"
        ], 
        [
            "hoped", 
            "began", 
            "used", 
            "needed"
        ], 
        [
            "or", 
            "but", 
            "for", 
            "and"
        ], 
        [
            "car", 
            "bus", 
            "subway", 
            "train"
        ]
    ], 
    "answers": [
        "C", 
        "C", 
        "D", 
        "A", 
        "A", 
        "B", 
        "A", 
        "C", 
        "B", 
        "A"
    ], 
    "source": "middle1046"
}