{
    "article": "Homesickness can be a terrible feeling for anyone who travels away from their home town, country or simply away from the house they live in for a period of time. It is a strong feeling of wanting to go back to your own places very much. Some people get homesick easily while others never experience it at all.\nDifferent people deal with homesickness in different ways. Some ring home and have a chat with the people who they think _ 'home' - often their mum or dad. This may be a good idea for you to feel that you are not _ . It reminds you that home and the people you love are in fact still there and that you will see them soon. However, it can make the homesickness even _ . By talking to people from home, it can make you miss them more! It can make you want to be home even more and make you realise how much you miss your loved ones. For this very reason, some people find _ better not to contact home but to let the feeling pass by doing fun activities. This can not only work as a good way to _ lonely feelings that homesickness can cause, but can also work well towards helping you get used to the place which you are living or staying in. Reminding yourself that where you are can make you see the bigger picture; that home is great, but where I am right now is also great _ different reasons!\nIn German there is a(n) _ which is quite opposite to homesickness and that is 'Fernweh'. This means the feeling of wanting to get away and see new places.", 
    "options": [
        [
            "respect", 
            "remain", 
            "represent", 
            "realise"
        ], 
        [
            "lonely", 
            "satisfied", 
            "alone", 
            "single"
        ], 
        [
            "better", 
            "good", 
            "bad", 
            "worse"
        ], 
        [
            "it", 
            "that", 
            "these", 
            "those"
        ], 
        [
            "increase", 
            "reduce", 
            "cancel", 
            "improve"
        ], 
        [
            "to", 
            "by", 
            "for", 
            "with"
        ], 
        [
            "idea", 
            "word", 
            "reason", 
            "sickness"
        ]
    ], 
    "answers": [
        "C", 
        "C", 
        "D", 
        "A", 
        "B", 
        "C", 
        "B"
    ], 
    "source": "middle984"
}