{
    "article": "Foods quickly spoil and break down if they are not stored correctly. Heat and damp encourage increase in micro-organisms , and sunlight can  _  vitamins in such food as milk. Therefore, most foods should be stored in a cool, dark and dry place. Some foods  _  bad quickly, such as meat, eggs and milk. They should be stored in a temperature of 5degC~10degC. In this temperature range, the activity of micro-organisms is  _  In warm climates, this temperature can be kept  _  in a fridge or in the underground basement of a house. Dry goods, such as flour and rice, should be kept at a slightly higher temperature. A temperature of 15degC is ideal. In Britain and northern European countries this means that the room in which dry foods are stored should  _  the general heating of the house. The room should also be well  _  nd, above all, dry. Damp very quickly causes the  _  of the green molds. These molds often grow on cheese if it is not stored properly. Fruits and vegetables need cool and damp  _  , so an underground basement usually  _  an excellent storage place. If the central heating unit is in the basement,  _  , it will not be ideal unless the unit and the pipes do not give out any heat.", 
    "options": [
        [
            "destroy", 
            "cause", 
            "harm", 
            "hurt"
        ], 
        [
            "become", 
            "get", 
            "go", 
            "turn"
        ], 
        [
            "reduced", 
            "raised", 
            "increased", 
            "shortened"
        ], 
        [
            "usually", 
            "seldom", 
            "forever", 
            "only"
        ], 
        [
            "choose", 
            "enjoy", 
            "share", 
            "refuse"
        ], 
        [
            "aired", 
            "cleaned", 
            "decorated", 
            "emptied"
        ], 
        [
            "appearance", 
            "growth", 
            "development", 
            "increase"
        ], 
        [
            "conditions", 
            "situations", 
            "matters", 
            "scenes"
        ], 
        [
            "gets", 
            "becomes", 
            "creates", 
            "makes"
        ], 
        [
            "therefore", 
            "besides", 
            "however", 
            "then"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "A", 
        "D", 
        "C", 
        "A", 
        "B", 
        "A", 
        "D", 
        "C"
    ], 
    "source": "middle2265"
}