{
    "article": "Amy is a 26-year-old single mother with a daughter. She was moving into her house in Atlanta early on the morning of March 12, when a man _ her to her door, and put a gun  to her side.\n\"I started walking to my door, and I felt really, really _ ,\"she said in a TV interview last week.\nThe man was Brian Nichols, 33 years old. He killed three people at an Atlanta courthouse on March 11.The police were  searching for him.\nNichols tied Smith up with tape, but set her free after she begged  him not to take her  _ again and again. \"I told him if he hurt me, my little girl wouldn't have a mummy,\" she said with tears.\n\"I just talked to him and tried to make him believe me,\" Smith said.\nShe asked Nichols  _  he chose her. \"He said he thought I was an angel _  from God, and God asked him to do so.\"\nSmith even  cooked breakfast for the man before he allowed her to leave. Nichols was   _ when she made him breakfast and that the two of them watched TV, seeing the police looking for him. \"I cannot believe that's me on the TV!\" Nichols told the woman.\nThen, Nichols asked Smith what she thought he should  do. She said, \"I think you should turn yourself in. If you don't, more people are going to get _ .\"\nFinally, he let her go. Then she called the police.", 
    "options": [
        [
            "took", 
            "followed", 
            "found", 
            "noticed"
        ], 
        [
            "sad", 
            "angry", 
            "frightened", 
            "amazed"
        ], 
        [
            "money", 
            "life", 
            "daughter", 
            "clothes"
        ], 
        [
            "how", 
            "why", 
            "when", 
            "where"
        ], 
        [
            "sent", 
            "taken", 
            "given", 
            "come"
        ], 
        [
            "surprised", 
            "excited", 
            "afraid", 
            "unhappy"
        ], 
        [
            "tired", 
            "hurt", 
            "caught", 
            "worried"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "B", 
        "B", 
        "A", 
        "A", 
        "B"
    ], 
    "source": "middle764"
}