{
    "article": "The Doll and the White Rose\nI was walking around in a mall, when I saw a cashier   hand a little boy some money back.The cashier said, \"I'm sorry, but you don't have enough money to buy this _ .\"The little boy seemed very disappointed.\nI walked toward him and asked him who he wished to give the doll to. \"It's the doll that my sister wanted so _ for Christmas.She was sure that Santa Claus would bring it to her. But Santa Claus can't bring it to her where she is now.I have to give the doll to my mommy so that she can give it to my sister when she goes there.\"His eyes were so _ .\"My sister has gone to be with God.Daddy says that Mommy is going to see God very soon too, so I thought that she could _ the doll with her to give it to my sister.\"\nMy heart nearly stopped.The little boy looked up at me and continued, \"I told Daddy to tell Mommy not to go yet.I need her to wait until I come back from the mall.\"\nI quickly _ for my wallet and said,\" Suppose we check again,  just in case you do have enough money for the doll.\"\n\"OK,  I hope I do have enough,\" he said. I put some of my money with his without him _ and we started to count it.There was enough for the doll and even some spare money.\nSurprisingly, the little boy cried, \"Thank you God for giving me _ money!\" Then he looked at me and added, \"I asked last night before I went to sleep for God to make sure I had enough money to buy this doll, so that Mommy could give it to my sister.He heard me! I also wanted to have enough money to buy a white _ for my mommy, but I didn't dare to ask God for too much.But he gave me enough to buy the doll and a white rose ! \"\nThen I _ two days before a local newspaper reported an accident in which a woman and a little girl were badly injured. The little girl died right away, and the mother was left in a critical state.Was this the family of the little boy?\nTwo days after I met the little boy, I read in the _ that the woman had passed away.I couldn't stop myself from going to the funeral.Teary-eyed, I felt that my life had been changed forever.", 
    "options": [
        [
            "shirt", 
            "doll", 
            "car", 
            "dress"
        ], 
        [
            "Quickly", 
            "happily", 
            "much", 
            "strongly"
        ], 
        [
            "sad", 
            "bright", 
            "blind", 
            "big"
        ], 
        [
            "take", 
            "bring", 
            "carry", 
            "buy"
        ], 
        [
            "Caught", 
            "looked", 
            "received", 
            "reached"
        ], 
        [
            "Giving", 
            "seeing", 
            "looking", 
            "thinking"
        ], 
        [
            "Basic", 
            "useful", 
            "enough", 
            "warm"
        ], 
        [
            "rose", 
            "rabbit", 
            "basket", 
            "glove"
        ], 
        [
            "Thought", 
            "spent", 
            "recognized", 
            "remembered"
        ], 
        [
            "Novel", 
            "Magazine", 
            "newspaper", 
            "book"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "A", 
        "D", 
        "B", 
        "C", 
        "A", 
        "D", 
        "C"
    ], 
    "source": "middle2075"
}