{
    "article": "An old man lived in a nice house with a large garden. He took care of his  _  all the time, watering and fertilizingthem. One day a young man went by the  _  He looked at the beautiful flowers, imagining how happy he could be if he lived in such a beautiful place. Then, suddenly he found the old gardener was  _  He was very surprised about this and asked, \"You can't see these flowers. Why are you busy taking care of them every day?\" The old man smiled and said,\" I can tell you four  _  First, I was a gardener when I was young, and I really like this job.  _  , although I can't see these flowers, I can touch them. Third, I can smell the sweetness of them. As to the last one, that's  you  \" \" Me? But you don't know me,\" said the young man. \"Yeah, it's  _  that I don't know you. But I know that flowers are angels that everybody knows. We enjoy the happiness these flowers have brought us.\" The blind man's work opened our eyes and  _  our hearts, which also made his life happier. It was just like Beethoven, who became deaf in his later life and wrote many great musical works. Beethoven himself couldn't  _  his wonderful music, but his music has  _  millions of people to face their difficulties bravely. Isn't it one kind of happiness?", 
    "options": [
        [
            "flowers", 
            "trees", 
            "vegetables", 
            "grass"
        ], 
        [
            "study", 
            "garden", 
            "kitchen", 
            "balcony"
        ], 
        [
            "blind", 
            "famous", 
            "smart", 
            "friendly"
        ], 
        [
            "stories", 
            "reasons", 
            "excuses", 
            "conclusions"
        ], 
        [
            "And", 
            "But", 
            "Second", 
            "Third"
        ], 
        [
            "true", 
            "hard", 
            "cool", 
            "fair"
        ], 
        [
            "broke", 
            "hurt", 
            "pleased", 
            "treated"
        ], 
        [
            "write", 
            "hear", 
            "play", 
            "believe"
        ], 
        [
            "changed", 
            "discovered", 
            "encouraged", 
            "made"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "A", 
        "B", 
        "C", 
        "A", 
        "C", 
        "B", 
        "C"
    ], 
    "source": "middle307"
}