{
    "article": "One's attitude is always important. If you are lazy and weak, you will never taste success. But if you are  _ , success and happiness will be more likely to come to you.\nI love eating persimmons   . But you can't get them until autumn. If you try them before the right time, they probably _  bad. In Grade Six, because of my poor grades, my parents were _ that I wouldn't be able to get into an excellent middle school. They _ me to study harder, but I didn't really understand why they were so anxious .\nSummer came and I studied hard. The hot weather made me sleepy and I couldn't concentrate   on my textbook. But every time when I wanted to stop  _ , my dad would say, \"Think about your   _ . If you don't work hard, you will regret.\" I had to sit back down again and return to my textbooks. But all I thought about was playing with my friends.\nMy dad would say to me, with a serious look on _ face, \"If a persimmon tree doesn't grow in summer, it can't bear   fruit in autumn! Only by working hard can you get good results.\" A few months later, I succeeded in _ the key middle school. I was so happy. My dad was right, if a persimmon tree doesn't grow _ summer, there will be no fruit in autumn. I worked hard and I enjoyed the fruit of my hard work!", 
    "options": [
        [
            "busy", 
            "clever", 
            "hard-working", 
            "free"
        ], 
        [
            "look", 
            "taste", 
            "turn", 
            "smell"
        ], 
        [
            "embarrassed", 
            "worried", 
            "excited", 
            "annoyed"
        ], 
        [
            "made", 
            "allowed", 
            "pushed", 
            "pulled"
        ], 
        [
            "thinking", 
            "working", 
            "playing", 
            "looking"
        ], 
        [
            "future", 
            "hobby", 
            "health", 
            "wealth"
        ], 
        [
            "his", 
            "your", 
            "my", 
            "their"
        ], 
        [
            "failing", 
            "reaching", 
            "getting", 
            "entering"
        ], 
        [
            "before", 
            "during", 
            "after", 
            "until"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "B", 
        "C", 
        "B", 
        "A", 
        "A", 
        "D", 
        "B"
    ], 
    "source": "middle2318"
}