{
    "article": "Malala Yousafzai Brave, a 19-year-old girl, has been thought to be clever and determined since October 9, 2012 when Taliban gunmen entered her school bus and shot   her head.\nBefore this _ day, Malala had been speaking out for girls' education in her country of Pakistan. The doctors, who treated Malala after she was shot, didn't _ that she would live but she did so much more than just live-she _ .\nMalala has recently _ a book named \"I am Malala\". She has joined talk shows and has had the chance to meet with the US President Barack Obama.\nOn July 12th, her sixteenth birthday, Malala made her first public appearance after she was shot. She spoke in the United Nations in front of students, teachers, and some important guests.\nIn her speech, Malala made it _ that the Taliban did not reach their goal of stopping her strong _ . Nothing changed in her life, Malala said-except that: weakness, _ and hopelessness died; strength, power and courage were born. Malala told her listeners that she would continue to fight for _ education in her country and all over the world.\nThrough her speech, Malala is trying to help us _ that a gun may hit her body but not her heart. She won Nobel Peace Prize in 2014.", 
    "options": [
        [
            "sad", 
            "happy", 
            "rainy", 
            "snowy"
        ], 
        [
            "know", 
            "expect", 
            "find", 
            "wish"
        ], 
        [
            "died", 
            "lived", 
            "improved", 
            "lost"
        ], 
        [
            "read", 
            "borrowed", 
            "found", 
            "written"
        ], 
        [
            "happy", 
            "lucky", 
            "clear", 
            "right"
        ], 
        [
            "voice", 
            "health", 
            "sound", 
            "words"
        ], 
        [
            "happiness", 
            "care", 
            "interest", 
            "fear"
        ], 
        [
            "better", 
            "worse", 
            "harder", 
            "easier"
        ], 
        [
            "wonder", 
            "guess", 
            "know", 
            "understand"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "C", 
        "D", 
        "C", 
        "A", 
        "D", 
        "A", 
        "D"
    ], 
    "source": "middle1266"
}