{
    "article": "(15;l,l5) There once was a boy who loved eating sweets. He  _  asked for sweets from his father. His father was a  _  man and they lived in a very old house. He could not always  _  sweets for his son. But the little boy did not  _  this, and demanded sweets all the time. The boy's father thought hard about  _  to stop the child asking for so many sweets. There was a very holy man living nearby at that time. The boy's father had a(n)  _  .He decided to take the boy to the great man who might  be able to  persuade the child to stop asking for sweets all the time. The boy and his father went along to the  _  man. The father said to him, \"Oh, great saint, could you ask my son to stop asking for sweets which I cannot afford?\" The great man was in  _  , because he liked sweets himself. How could he ask the boy to give up asking for sweets? The holy man told the father to  _  his son back after one month. During that month, the holy man gave up eating sweets, and when the boy and his father  _  after a month, the holy man said to the boy \"My dear child, will you stop asking for sweets which your father cannot afford to give you?\"  From then on  , the boy stopped asking for sweets. The boy's  _  asked the saint, \"Why didn't you ask my son to give up asking for sweets  _  we came to you a month ago?\" The holy man replied, \"How could I ask a boy to give up sweets when I loved sweets myself. In the last month I gave up eating sweets.\" A person's  _  is much more powerful than just his words.", 
    "options": [
        [
            "always", 
            "never", 
            "hardly", 
            "seldom"
        ], 
        [
            "rich", 
            "honest", 
            "kind", 
            "poor"
        ], 
        [
            "make", 
            "accept", 
            "afford", 
            "find"
        ], 
        [
            "ignore", 
            "understand", 
            "remember", 
            "change"
        ], 
        [
            "what", 
            "where", 
            "why", 
            "how"
        ], 
        [
            "excuse", 
            "surprise", 
            "idea", 
            "proverb"
        ], 
        [
            "young", 
            "strong", 
            "great", 
            "ugly"
        ], 
        [
            "difficulty", 
            "peace", 
            "danger", 
            "tears"
        ], 
        [
            "call", 
            "turn", 
            "get", 
            "bring"
        ], 
        [
            "returned", 
            "asked", 
            "left", 
            "disappeared"
        ], 
        [
            "sister", 
            "brother", 
            "father", 
            "mother"
        ], 
        [
            "when", 
            "because", 
            "until", 
            "though"
        ], 
        [
            "success", 
            "history", 
            "future", 
            "action"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "C", 
        "B", 
        "D", 
        "C", 
        "C", 
        "A", 
        "D", 
        "A", 
        "C", 
        "A", 
        "D"
    ], 
    "source": "middle2258"
}