{
    "article": "One of my father's favourite sayings as I was growing up was \"Try it!\" I couldn't  _  I didn't like everything. Whatever it might be, until after I  _  it. Over the years I've come to  _  I ought to thank him. My  _  job was just one I decided to try for a few years until I made up my mind to do as a career .  _  I believed I would work for several years, get married, stay at home, and raise a family, so I  _  think the job I took mattered that much. I didn't like the work that would take much of my time. I tried not to make any mistakes. I began to control some basic skills and I was given the chance to move up through the company into different  _  . I  _  each new chance with the thought. \" Well, I'll try it. If I don't like it , I can always go back to my  _  position . \" But I was with the same company for the past 28 years. And I've  _  every career change I've made. I have discovered I  _  a large number of different talents and skills that I am never  afraid of  trying new chances. I have also discovered that if I  believe in  what I am doing and work hard at achieving my  _  , I will succeed. That's  _  I am so excited to be a part of Career Fables ,com. I think time has come and I am determined to make it a success.", 
    "options": [
        [
            "tell", 
            "speak", 
            "say", 
            "talk"
        ], 
        [
            "tried", 
            "said", 
            "finished", 
            "copied"
        ], 
        [
            "consider", 
            "argue", 
            "include", 
            "realize"
        ], 
        [
            "first", 
            "best", 
            "extra", 
            "best"
        ], 
        [
            "Actually", 
            "usually", 
            "finally", 
            "Gradually"
        ], 
        [
            "don't", 
            "do", 
            "didn't", 
            "can't"
        ], 
        [
            "situations", 
            "choices", 
            "directions", 
            "positions"
        ], 
        [
            "received", 
            "accepted", 
            "hated", 
            "refused"
        ], 
        [
            "easier", 
            "earlier", 
            "higher", 
            "newer"
        ], 
        [
            "allowed", 
            "enjoyed", 
            "counted", 
            "organized"
        ], 
        [
            "own", 
            "show", 
            "gather", 
            "need"
        ], 
        [
            "business", 
            "goal", 
            "growth", 
            "way"
        ], 
        [
            "why", 
            "because", 
            "so", 
            "for"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "A", 
        "A", 
        "C", 
        "D", 
        "B", 
        "B", 
        "B", 
        "A", 
        "B", 
        "A"
    ], 
    "source": "middle1641"
}