{
    "article": "On a cold December morning, my mother and I were walking home from pizza store. We were served warmly and equipped with the video we had been trying  to watch  . I was feeling a little tired  _  I was carrying our shopping bags of snacks and the video. They were so  _  that I decided to throw away some of them. So I started to walk towards the dustbin when I noticed a poor man stepping out of the restaurant in front of us. He held a paper bag with his dirty hand. He headed for another nearby dustbin and started looking  _  something. I suddenly felt very upset. I know this man would take all he could get, so I walked up to him and handed the drink and some snacks to him. The man, with lines on his face and wrinkles on his forehead, looked up in  _  and took what I gave him. A huge smile spread across his face and this made  _  feel indescribable satisfaction . I felt like I couldn't be happier with myself, but then he said, \"Wow, first someone gives me this sandwich, then this drink, and now some tasty food, this is my daughter's  _  day!\" He thanked me  _  and started off on his bike. I even heard him whistling a song as he  _  away. I now understand what is meant by the saying \"Giving is getting\". Everyone in the world needs help, everyone can  _  help and everyone will be helped by something kind. The image of that man's happiness caused by my small gift appears in my mind every time I have the chance to do something nice.", 
    "options": [
        [
            "because", 
            "when", 
            "although", 
            "after"
        ], 
        [
            "dry", 
            "dirty", 
            "heavy", 
            "salty"
        ], 
        [
            "through", 
            "around", 
            "for", 
            "over"
        ], 
        [
            "sight", 
            "danger", 
            "surprise", 
            "trouble"
        ], 
        [
            "him", 
            "me", 
            "us", 
            "them"
        ], 
        [
            "busy", 
            "boring", 
            "terrible", 
            "lucky"
        ], 
        [
            "happily", 
            "unhappily", 
            "quietly", 
            "quickly"
        ], 
        [
            "walked", 
            "rode", 
            "ran", 
            "flew"
        ], 
        [
            "offer", 
            "receive", 
            "refuse", 
            "share"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "C", 
        "C", 
        "A", 
        "D", 
        "A", 
        "B", 
        "A"
    ], 
    "source": "middle196"
}