{
    "article": "I worked for a short time as a waiter at a  _  a few months ago. I also helped to clean up the tables when it was very  _  . One night, just before Christmas, I found a large black wallet  _  the floor near one of the tables. I guessed I should check it to find out  _  was the owner, but I was very busy at the time. And I imagined that  _  there was something valuable in the wallet, the owner would be back. Sure enough, an hour  _  a man came up to the counter and asked if anyone had found a wallet. I  _  him to describe the lost wallet, and after he described it exactly, I gave him the wallet. He expressed his  _  . He asked me if I had opened  _  , and when I told him \"no\". At once he opened it  _  showed that it had nearly $ 800 in cash. He took out a twenty-dollar bill and  _  it to me and I was amazed at this. Thinking about it later, I began wondering whether I would have been  _  if I had known what was in the wallet! I thought that if I had no way to  _  the owner and no one returned to get it, I might keep it. But it also came into my  _  that I actually saved someone's Christmas plans by finding and returning the wallet. The good feeling it gave me was worth more than  _  we could buy with money.", 
    "options": [
        [
            "bookshop", 
            "hotel", 
            "hospital", 
            "restaurant"
        ], 
        [
            "interesting", 
            "busy", 
            "boring", 
            "tiring"
        ], 
        [
            "on", 
            "in", 
            "behind", 
            "under"
        ], 
        [
            "what", 
            "when", 
            "how", 
            "who"
        ], 
        [
            "because", 
            "if", 
            "as", 
            "though"
        ], 
        [
            "ago", 
            "after", 
            "later", 
            "before"
        ], 
        [
            "asked", 
            "made", 
            "let", 
            "ordered"
        ], 
        [
            "excuses", 
            "greetings", 
            "thanks", 
            "wishes"
        ], 
        [
            "it", 
            "one", 
            "itself", 
            "them"
        ], 
        [
            "but", 
            "and", 
            "so", 
            "or"
        ], 
        [
            "lent", 
            "sold", 
            "handed", 
            "brought"
        ], 
        [
            "wise", 
            "careful", 
            "kind", 
            "honest"
        ], 
        [
            "catch", 
            "miss", 
            "get", 
            "find"
        ], 
        [
            "head", 
            "mind", 
            "heart", 
            "idea"
        ], 
        [
            "anybody", 
            "nobody", 
            "anything", 
            "nothing"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "A", 
        "D", 
        "B", 
        "C", 
        "A", 
        "C", 
        "A", 
        "B", 
        "C", 
        "D", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "middle1070"
}