{
    "article": "Lisa and Mike were celebrating their anniversary .The couple used to be sweet. But now  _  had changed since they got married. The once lovely couple had turned bitter( ).They fought over every little thing.  _  of them hated the way things had changed. Lisa was  _  for Mike to come home. She hoped that Mike would remember their anniversary. She  _  4 imagined that her husband would bring her flowers. In this  _  , they could remember the old happiness again and forget all the  _  . But her imagination was cut short when the phone in the bedroom  _  . Lisa answered to the sound of a man. \"Hello madam, I'm calling from the police station. Is this Mr. Mike Green's  _  ?\"\"Yes, it is!\" \"I'm sorry madam but there was a traffic accident and a man has  _  . We got this number from his wallet( ). We need you to come and identify ( ) his body.\" Lisa was shocked !  _  could this happen! She'd have died for another chance to mend every little fight! She lay and cried  _  the floor in pain. She lost her chance. Forever!  _  , there was a noise at the doorway. The door opened and Mike came in. \"My dear, it's a  _  day today. My wallet was stolen.\" \"That's the best  _  I've ever heard,\" Lisa said with a smile as her eyes were  _  .", 
    "options": [
        [
            "interests", 
            "things", 
            "habits", 
            "friendship"
        ], 
        [
            "All", 
            "One", 
            "None", 
            "Both"
        ], 
        [
            "searching", 
            "Singing", 
            "waiting", 
            "starting"
        ], 
        [
            "even", 
            "always", 
            "hardly", 
            "sometimes"
        ], 
        [
            "time", 
            "day", 
            "way", 
            "fact"
        ], 
        [
            "fighting", 
            "feeling", 
            "decision", 
            "love"
        ], 
        [
            "sounded", 
            "rang", 
            "knocked", 
            "made"
        ], 
        [
            "office", 
            "address", 
            "speaking", 
            "number"
        ], 
        [
            "lost", 
            "left", 
            "died", 
            "hurt"
        ], 
        [
            "How", 
            "When", 
            "Where", 
            "What"
        ], 
        [
            "above", 
            "on", 
            "beside", 
            "to"
        ], 
        [
            "Luckily", 
            "Slowly", 
            "Quietly", 
            "Suddenly"
        ], 
        [
            "nice", 
            "bad", 
            "cool", 
            "warm"
        ], 
        [
            "News", 
            "advice", 
            "lie", 
            "information"
        ], 
        [
            "looking", 
            "Putting", 
            "watering", 
            "turning"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "C", 
        "A", 
        "C", 
        "A", 
        "B", 
        "D", 
        "C", 
        "A", 
        "B", 
        "D", 
        "B", 
        "A", 
        "C"
    ], 
    "source": "middle2092"
}