{
    "article": "How can we keep a feeling of balance in our lives? How can we live with a positive attitude ? To answer the two questions, let's focus on the following points.\nLife Isn't Fair    Our life isn't always _ of pleasure, is it? Life doesn't always give us a hand and doing our best doesn't always bring good results.\nFailure  Failure is necessary to life, almost as necessary as the _ we breathe. Failure is part of trying. The only thing that we need to think about is _ to deal with it. In fact, failure can be a great teacher that leads( )us to success.\nLoneliness It's _ for us to be with our family and friends for ever. Sometimes we have to be alone. Don't be afraid when we feel lonely. Treasure the friendship, kindness and love we own now.\nSuffering  Growing up is not easy and pain is part of our lives. Almost everyone gets hurt. Take a deep breath and give life a big smile when we suffer pain.\nPersonal Responsibility   We each have a choice to be either a _ or a loser. We should have responsibility for the choices we make. What we will have in the future depends on what we do _ .\nSelf-confidence  We should believe we can do something well. Nothing in the world is difficult for the man who is confident of himself.\nLife is like a long journey. _ with a positive attitude and look at the bright side of things. There will always be sunshine and flowers in our eyes.\n.", 
    "options": [
        [
            "full", 
            "filling", 
            "filled", 
            "made"
        ], 
        [
            "water", 
            "air", 
            "food", 
            "force"
        ], 
        [
            "what", 
            "which", 
            "how", 
            "when"
        ], 
        [
            "possible", 
            "impossible", 
            "impolite", 
            "polite"
        ], 
        [
            "driver", 
            "winner", 
            "farmer", 
            "president"
        ], 
        [
            "today", 
            "yesterday", 
            "past", 
            "tomorrow"
        ], 
        [
            "Provide", 
            "Direct", 
            "Travel", 
            "Separate"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "C", 
        "B", 
        "B", 
        "A", 
        "C"
    ], 
    "source": "middle699"
}