{
    "article": "Each of us makes mistakes from time to time. In fact, we can  _  a lot from our mistakes. Donnie was a  _  student and never answered questions in class. He was  _  to make mistakes. He never finished his homework  _  he didn't want to make any mistakes. Nothing changed  _  Marry Anne, a teacher, came to our  _  . One morning, Marry Anne asked Donnie to  _  some questions. After a while Donnie was in tears because he made a mistake.  _  Marry Anne got a box full of erasers from the desk. \"Look, Donnie,\" she said standing  _  him. \"I've got something to show you.\" She  took out  the erasers, one at a time, and put them on the desk. \"See these erasers, Donnie?\" she continued. \"Do you know  _  the erasers become smaller and smaller? That's because we make mistakes. But we erase the mistakes and try  _  . That's what you must learn.\" \"Here,\" she said, \"I'll  _  one eraser on your desk, so you will remember that  everybody  may make mistakes.\" Donnie looked at Marry Anne and smiled. Donnie  _  a lot from then on. He knew that everyone had the permission to make mistakes as long as you learned them and tried again.", 
    "options": [
        [
            "take", 
            "make", 
            "get", 
            "bring"
        ], 
        [
            "good", 
            "shy", 
            "clever", 
            "small"
        ], 
        [
            "glad", 
            "excited", 
            "surprised", 
            "afraid"
        ], 
        [
            "because", 
            "so", 
            "if", 
            "but"
        ], 
        [
            "after", 
            "while", 
            "until", 
            "when"
        ], 
        [
            "row", 
            "class", 
            "team", 
            "classroom"
        ], 
        [
            "answer", 
            "ask", 
            "give", 
            "have"
        ], 
        [
            "Suddenly", 
            "Unluckily", 
            "Luckily", 
            "Carefully"
        ], 
        [
            "on", 
            "with", 
            "beside", 
            "to"
        ], 
        [
            "when", 
            "how", 
            "what", 
            "why"
        ], 
        [
            "more", 
            "again", 
            "another", 
            "one"
        ], 
        [
            "forget", 
            "carry", 
            "leave", 
            "take"
        ], 
        [
            "change", 
            "got", 
            "learned", 
            "thought"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "D", 
        "A", 
        "C", 
        "B", 
        "A", 
        "A", 
        "C", 
        "D", 
        "B", 
        "C", 
        "A"
    ], 
    "source": "middle2055"
}