{
    "article": "When my mom came back home from the hospital with the twins, I was excited at the very beginning. I couldn't  _  to play with them and be the best sister ever. Everyone was coming over to our house to hold babies an  _  presents to the babaies and talk nonstop about how lovely the babies were. Then they'd pull out their  _  and just as I was about to say \"cheese\", they'd run over to my perfect little brothers and take photos of them. At that time I was thinking ,\" Why can't I be  _  again so I can be the one getting all the  _  \" When my aunt Camille got married,my mom  _  a long time finding the perfect clothes for them. On the day of the wedding,my twin brothers had the cutest and prettiest clothes and then there was me,just sitting and watching in my  _  dress. At the ceremony ,all I  _  was the praise------how sweet and lovely the twins were. I  _  agreed that they were wonderful,but I couldn't help feeling that I was  _  and unnoticed. There was a big party after the wedding. Aunt Canille and her nice new  _  had the first dance,and then everyone started dancing happily.I  took off  my uncomfortable dress shoes,and I danced and danced and danced! It became one of the most fun time I've ever had in my whole life. The best part was when my aunt and I took my twin brothers by the hands and  _  them some dance moves, helping them was such a cool thing,I  _  then what a huge waste of time feeling jealous !  _  comes when you kick over your shoes and enjoy life!", 
    "options": [
        [
            "enjoy", 
            "wait", 
            "stand", 
            "help"
        ], 
        [
            "make", 
            "create", 
            "give", 
            "show"
        ], 
        [
            "cameras", 
            "gifts", 
            "photos", 
            "money"
        ], 
        [
            "smart", 
            "short", 
            "sick", 
            "little"
        ], 
        [
            "support", 
            "attention", 
            "prizes", 
            "changes"
        ], 
        [
            "spent", 
            "paid", 
            "kept", 
            "wasted"
        ], 
        [
            "popular", 
            "wonderful", 
            "daily", 
            "special"
        ], 
        [
            "felt", 
            "heard", 
            "looked", 
            "smelt"
        ], 
        [
            "never", 
            "hardly", 
            "certainly", 
            "luckily"
        ], 
        [
            "careless", 
            "careful", 
            "unimportant", 
            "useful"
        ], 
        [
            "baby", 
            "friend", 
            "partner", 
            "husband"
        ], 
        [
            "taught", 
            "passed", 
            "lent", 
            "warned"
        ], 
        [
            "imagined", 
            "collected", 
            "meant", 
            "realized"
        ], 
        [
            "present", 
            "chance", 
            "success", 
            "happiness"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "D", 
        "B", 
        "A", 
        "C", 
        "B", 
        "C", 
        "C", 
        "D", 
        "A", 
        "D", 
        "D"
    ], 
    "source": "middle97"
}