{
    "article": "John was very shy. He hated being with others and always kept quiet,   _   what might happen if he opened his mouth.\nOne day, when some people were visiting, John felt so ashamed that he   _   in a bedroom. Suddenly, a little elf   came to him. The elf shouted   _  , \"Please! Stop screaming   like that.\" \nThe boy was   _  . He forgot his shyness and asked, \"Who screamed?\"\n\"Is there anyone else here?\" \nThe boy looked around. They were   _  .\n\"  _   I never say anything,\" he replied, trying to   _   himself. \"How can I shout without opening my mouth?\"\nThen the elf's   _   changed from anger to surprise. \"Don't you know? Nobody told you that your eyes, your hands and your whole body   _   all the time?\"\nThe elf began to   _   that each part of the body speaks its own   _   and does so without stopping and how each   _   we make says something. The elf gave John a little bottle and dropped some magic water into his   _   and told him, \"Now, you'll hear with your ears what people are saying without opening their mouth.\"\nIt was   _  . He could hear how everyone   kept up   two or three conversations, even when completely silent. But what surprised him most was on his birthday when he met a shy girl. His magic ears could hear her loud   _  , \"I don't want to be here! I don't want to play with anyone!\"\nJohn wet the girl's ears with some magic drops from his bottle. Together, they set out to   explore   which gestures to make to ensure their bodies were quieter and more pleasant. And they   _   that smiling, looking into people's eyes and   _   saying \"Hello\" meant their bodies stopped yelling, and so they became   _   children.", 
    "options": [
        [
            "imagining", 
            "fearing", 
            "expecting", 
            "reporting"
        ], 
        [
            "hid", 
            "played", 
            "dreamed", 
            "prepared"
        ], 
        [
            "proudly", 
            "nervously", 
            "angrily", 
            "hopelessly"
        ], 
        [
            "worried", 
            "shocked", 
            "determined", 
            "disappointed"
        ], 
        [
            "alone", 
            "lonely", 
            "strange", 
            "special"
        ], 
        [
            "If", 
            "So", 
            "Although", 
            "But"
        ], 
        [
            "teach", 
            "protect", 
            "excuse", 
            "enjoy"
        ], 
        [
            "theory", 
            "argument", 
            "method", 
            "attitude"
        ], 
        [
            "talk", 
            "act", 
            "lie", 
            "move"
        ], 
        [
            "admit", 
            "explain", 
            "suggest", 
            "comment"
        ], 
        [
            "function", 
            "character", 
            "concern", 
            "language"
        ], 
        [
            "expression", 
            "sentence", 
            "gesture", 
            "performance"
        ], 
        [
            "ears", 
            "eyes", 
            "hands", 
            "mouth"
        ], 
        [
            "boring", 
            "challenging", 
            "surprising", 
            "frightening"
        ], 
        [
            "cries", 
            "tears", 
            "laughs", 
            "jokes"
        ], 
        [
            "proved", 
            "discovered", 
            "promised", 
            "remembered"
        ], 
        [
            "suddenly", 
            "clearly", 
            "finally", 
            "politely"
        ], 
        [
            "helpful", 
            "useful", 
            "cheerful", 
            "regretful"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "B", 
        "A", 
        "D", 
        "C", 
        "D", 
        "A", 
        "B", 
        "D", 
        "C", 
        "A", 
        "C", 
        "A", 
        "B", 
        "D", 
        "C"
    ], 
    "source": "high2344"
}