{
    "article": "Laziness is a state of inaction. It is something that you do, not something that you are. Being lazy means you have no  _  to do anything. This is obvious but the mistake that many people make is  _  themselves as someone who is lazy. Lazy people are often seen as useless.  _  , are they really being lazy or are they acting lazy? There is a huge difference between saying you are lazy sometimes and you are a lazy person. One is suggesting that your laziness is  _  while the other suggests that it's permanent. This is the myth of laziness. People who are lazy aren't lazy; they  _  are people who are temporarily acting that way. So what causes a person to be inactive? The answer is a lack of goals. If you give someone a good enough  _  to do something, he will do it. People who don't seem to do anything just haven't found a good enough reason to do something. Lazy students don't study because they don't see the  _  in studying. For example, if you are too lazy to clean out the garage, would someone  _  a gun to your head help you take action? The reason can be positive or negative  as long as  it's strong enough to induce action. To motivate someone who is lazy, what you need to do is to help him find enough  _  to work towards a certain goal.", 
    "options": [
        [
            "motivation", 
            "question", 
            "promotion", 
            "courage"
        ], 
        [
            "agreeing", 
            "denying", 
            "identifying", 
            "refusing"
        ], 
        [
            "Otherwise", 
            "Besides", 
            "However", 
            "Therefore"
        ], 
        [
            "correct", 
            "false", 
            "temporary", 
            "inspirational"
        ], 
        [
            "simply", 
            "occasionally", 
            "often", 
            "hardly"
        ], 
        [
            "excuse", 
            "gift", 
            "chance", 
            "purpose"
        ], 
        [
            "point", 
            "success", 
            "situation", 
            "difficulty"
        ], 
        [
            "dropping", 
            "pointing", 
            "shooting", 
            "hiding"
        ], 
        [
            "reasons", 
            "money", 
            "energy", 
            "Confidence"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "C", 
        "C", 
        "A", 
        "D", 
        "A", 
        "B", 
        "A"
    ], 
    "source": "high471"
}