{
    "article": "My first lesson is at a meeting. As we settle around the table I hear Meg, who is 41 recovering from  a recent operation, talking to Judith, the manager of our project. \"Thank you so much for   _   my daughters to their dance lessons last week.\" \"Don't mention it,\" Judith says, \"It was nothing.\"\nKnowing how   _   Judith's schedule is, with her work, kids and aging parents, I find her driving Meg's children to lessons unbelievably   _  . I am about to say more about this when Donna, another colleague, enters the room   _  . She apologizes for being late, saying she just hosted a lunch for her friends who are over seventy. \"That is so nice of you,\" I say,   _   how busy she is, how she doesn't like to cook and clean. \"Oh,\" she says, waving her hand, \"It was nothing.\"   _  , I can still tell the 48 _  in her voice. She did gain a sense of satisfaction from the entertainment offered to her friends.\nSeeing their   _   to help others selflessly, I start thinking about the concept of \"nothing\", this peaceful and generous way of living--- had it really been nothing or are they simply saying that? It   _  to me that once I spent a whole afternoon after work helping a friend 51 prepare for  a speech she was going to deliver. I   _   her to rearrange the sequence of the stories in the lecture to make it sound more   _  . After the fifth try, she finally   _   it. She hugged me with   _  , saying thanks to me. I smiled and said it was nothing. \nSuddenly, I realized that helping someone was really something to me. I learned that giving from the heart doesn't   _   mean sacrifice and hard work. The   _   is finding something we love to do and finding someone who   _   that something. Our generosity can benefit others   as well as   ourselves. Once you have a good   _   of it, it's nothing. And it's really something.", 
    "options": [
        [
            "guiding", 
            "fetching", 
            "driving", 
            "dragging"
        ], 
        [
            "common", 
            "tight", 
            "strange", 
            "practical"
        ], 
        [
            "ridiculous", 
            "eccentric", 
            "tiresome", 
            "generous"
        ], 
        [
            "hastily", 
            "angrily", 
            "disappointedly", 
            "unexpectedly"
        ], 
        [
            "ignoring", 
            "knowing", 
            "forgetting", 
            "predicting"
        ], 
        [
            "Moreover", 
            "Therefore", 
            "Otherwise", 
            "Somehow"
        ], 
        [
            "pleasure", 
            "sadness", 
            "surprise", 
            "regret"
        ], 
        [
            "progress", 
            "ambition", 
            "promise", 
            "willingness"
        ], 
        [
            "refers", 
            "appears", 
            "occurs", 
            "seems"
        ], 
        [
            "begged", 
            "invited", 
            "recommended", 
            "sponsored"
        ], 
        [
            "confusing", 
            "sensible", 
            "sensitive", 
            "typical"
        ], 
        [
            "got", 
            "meant", 
            "caught", 
            "made"
        ], 
        [
            "concern", 
            "worry", 
            "gratitude", 
            "apology"
        ], 
        [
            "normally", 
            "accidentally", 
            "necessarily", 
            "possibly"
        ], 
        [
            "treat", 
            "trick", 
            "plot", 
            "plan"
        ], 
        [
            "needs", 
            "admires", 
            "loves", 
            "defends"
        ], 
        [
            "order", 
            "glimpse", 
            "impression", 
            "command"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "D", 
        "A", 
        "B", 
        "D", 
        "A", 
        "D", 
        "C", 
        "C", 
        "B", 
        "D", 
        "C", 
        "C", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "high94"
}