{
    "article": "\"Hey, Dad, are you going to come to my award ceremony tonight?\" I  _  asked my father. \"I have to work late tonight. I doubt if I'll be able to  _  it on time. I am just too busy right now,\" he replied. My mind could not  _  the idea that he would be too busy working late. He was also too busy to  _  my horse show, football games and the 15 birthday party. He always used the same  _  . Why had I even taken trouble to ask?  _  , there was always a slight hope that tonight would be  _  . As my mother and I arrived at school, two friends  _  me. \"Jill, meet my dad. Dad, this is my friend Jill.\" I shook the hand of a tall man. Camera flashes lit up the room, and claps filled the  _  as students accepted their awards. My name was finally called,  along with  three others. I followed my classmates to the  _  . When I reached out my hand to shake the  _  , a big smile lit up her face. The blinding flash from my mother's camera  _  my eyes and I knew my dad wasn't there. I walked back to my seat  _  . Back at home, seeing my dad's car in the garage. I told myself he would not be  _  . But the strong smell of alcohol hit me as soon as I  _  inside, and I could feel my tears  building up  . I followed the sound of his drunken words and saw him  _  on the couch.  _  did Father lie to me? I threw my award on the floor, walked to my bedroom, and shut the door. Tears rolled down my face. I wondered if I would ever be more  _  than his whiskey bottle.", 
    "options": [
        [
            "confidently", 
            "eagerly", 
            "proudly", 
            "fearfully"
        ], 
        [
            "reach", 
            "keep", 
            "take", 
            "make"
        ], 
        [
            "create", 
            "support", 
            "appreciate", 
            "accept"
        ], 
        [
            "watch", 
            "avoid", 
            "attend", 
            "speed"
        ], 
        [
            "excuse", 
            "reply", 
            "promise", 
            "trick"
        ], 
        [
            "Besides", 
            "Thus", 
            "Otherwise", 
            "However"
        ], 
        [
            "active", 
            "formal", 
            "different", 
            "serious"
        ], 
        [
            "recognized", 
            "greeted", 
            "encouraged", 
            "showed"
        ], 
        [
            "air", 
            "audience", 
            "school", 
            "playground"
        ], 
        [
            "stage", 
            "position", 
            "office", 
            "exit"
        ], 
        [
            "Jill's", 
            "teacher's", 
            "mother's", 
            "father's"
        ], 
        [
            "fixed", 
            "touched", 
            "hurt", 
            "inserted"
        ], 
        [
            "successfully", 
            "disappointedly", 
            "delightedly", 
            "hopefully"
        ], 
        [
            "drunk", 
            "woken", 
            "forgiven", 
            "hidden"
        ], 
        [
            "stepped", 
            "noticed", 
            "examined", 
            "glanced"
        ], 
        [
            "learning", 
            "lying", 
            "putting", 
            "carrying"
        ], 
        [
            "How", 
            "Where", 
            "Why", 
            "Whether"
        ], 
        [
            "perfect", 
            "comfortable", 
            "fortunate", 
            "important"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "D", 
        "C", 
        "A", 
        "D", 
        "C", 
        "B", 
        "A", 
        "A", 
        "B", 
        "C", 
        "B", 
        "A", 
        "A", 
        "B", 
        "C", 
        "D"
    ], 
    "source": "high1342"
}