{
    "article": "As the plane circled over the airport, everyone guessed that something was wrong. The plane was moving unsteadily through the  _  , and the passengers were suddenly threw forward. At that moment, the air hostess appeared. She looked very pale , but was quite  _  . Speaking quickly but almost in a whisper, she told everyone that the pilot was badly ill and asked if any of the passengers knew  something  about machines or at least knew how to drive a car. After a moment  _  a man got up and followed the hostess into the pilot's room. Moving the pilot aside, the man  _  his seat and listen carefully to the orders  _  were being sent by radio from the airport below. The plane was now dangerously  _  to the ground, but it soon began to climb. The man had to circle the airport several times in order to become familiar  _  the controls. But the danger had not yet passed. The terrible moment came when he had to  _  . Following orders, the man controlled the plane to the airfield. It shook greatly as it touched the ground and then moved rapidly  _  the field, but after a long run it stopped safely. Outside a lot of people, who had been watching anxiously, ran forward to congratulate the \"pilot\" on an excellent landing.", 
    "options": [
        [
            "airport", 
            "heaven", 
            "air", 
            "cloud"
        ], 
        [
            "natural", 
            "calm", 
            "worried", 
            "excited"
        ], 
        [
            "thought", 
            "quiet", 
            "darkness", 
            "silence"
        ], 
        [
            "took", 
            "sat", 
            "placed", 
            "stood"
        ], 
        [
            "they", 
            "that", 
            "these", 
            "this"
        ], 
        [
            "up", 
            "over", 
            "close", 
            "downstairs"
        ], 
        [
            "to", 
            "with", 
            "for", 
            "about"
        ], 
        [
            "land", 
            "drive", 
            "rise", 
            "set"
        ], 
        [
            "above", 
            "onto", 
            "around", 
            "across"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "D", 
        "A", 
        "B", 
        "C", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "high1743"
}