{
    "article": "It was a cold winter. The day my husband fell to his death, it started to snow, just  _  any November day. His  _  , when I found it, was lightly covered with snow. It snowed almost every day for the next four months, while I sat on the couch and watched it  pile up  . One morning, I walked slowly  _  and was surprised to see a snow remover clearing my driveway and the bent back of a woman clearing my walk. I dropped to my knees and crawled back upstairs,  _  those good people would not see me. I was  _  . My first thought was, how would I ever  _  them? I didn't have the  _  to brush my hair,  let alone  clear someone's walk. Before Jon's death, I felt proud that I  _  asked for favors. I identified myself by my competence and  _  . So who was I if I was no longer capable? How could I  _  myself if I just sat on the couch every day and watched the snow fall? Learning to receive the love and  _  from others wasn't easy. Friends cooked for me and I cried. Finally, my friend Kathy said, \"Mary, cooking for you isn't a  _  for me; it makes me feel good to be able to do something for you.\" Over and over, I heard  _  words from the people who supported me during those  _  days. One wise man told me, \"You aren't doing nothing because being fully open to your  _  may be the hardest work you will ever do.\" I am not the person I  _  was, but in many ways I have changed for the  _  . I've been surprised to learn that there is incredible freedom coming from  _  one's worst fear and walking away whole. I believe there is strength, for sure, in accepting a dark period of our life.", 
    "options": [
        [
            "on", 
            "in", 
            "like", 
            "for"
        ], 
        [
            "body", 
            "soul", 
            "shoe", 
            "footprint"
        ], 
        [
            "upstairs", 
            "downstairs", 
            "indoors", 
            "outdoors"
        ], 
        [
            "so", 
            "yet", 
            "and", 
            "for"
        ], 
        [
            "delighted", 
            "disappointed", 
            "annoyed", 
            "ashamed"
        ], 
        [
            "pay", 
            "award", 
            "reward", 
            "treat"
        ], 
        [
            "courage", 
            "strength", 
            "spirit", 
            "power"
        ], 
        [
            "frequently", 
            "gradually", 
            "hardly", 
            "uncertainly"
        ], 
        [
            "intelligence", 
            "independence", 
            "excellence", 
            "qualification"
        ], 
        [
            "achieve", 
            "praise", 
            "respect", 
            "promote"
        ], 
        [
            "supply", 
            "support", 
            "contribution", 
            "similar"
        ], 
        [
            "burden", 
            "job", 
            "business", 
            "sorrow"
        ], 
        [
            "sensitive", 
            "same", 
            "considerate", 
            "similar"
        ], 
        [
            "blue", 
            "rainy", 
            "bright", 
            "snowy"
        ], 
        [
            "despair", 
            "difficulty", 
            "pain", 
            "regret"
        ], 
        [
            "still", 
            "once", 
            "even", 
            "never"
        ], 
        [
            "worse", 
            "less", 
            "more", 
            "better"
        ], 
        [
            "facing", 
            "noticing", 
            "managing", 
            "expressing"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "B", 
        "A", 
        "D", 
        "C", 
        "B", 
        "C", 
        "B", 
        "C", 
        "B", 
        "A", 
        "D", 
        "A", 
        "C", 
        "B", 
        "D", 
        "A"
    ], 
    "source": "high2395"
}