{
    "article": "Many years ago, I owned a service station and roadhouse on the main road between Melbourne and Adelaide.\nOne very cold, wet night at about 3:30 a.m., there was a 41 _  on the front door of our house. A young man, wet from 42 _  to toe, explained that he had 43 run  out of petrol about 30 km up the road. He had left his pregnant  wife and his two children 44 _  at the car and said that he would hitchhike   back. Once I had 45 _  a can with petrol, I took him back to his car where his two-year-old and four-year-old children were both 46 _ , saying that they were cold. Once the car had started, I suggested that he 47 _  me back. \nBefore leaving, I had turned the heater 48 _  in the roadhouse, so that when we went in, it was nice and49 _ . While the little ones played and ran 50 _ , I prepared bread and butter for the children, and hot chocolate for the 51 _ . \n It was about 5 a. m. before they 52 _ . The young fellow asked me how much he 53 _  me and I told him that the petrol pump   had 54 _  $ 15. He offered to pay \"call-out fee\", but I wouldn't accept it. \nAbout a month later, I received a 55 _  from interstate, a large bus company that we bad been trying to 56 _  to stop off at our roadhouse for a long time, It 57 _  out that the young fellow I had helped was its general manager, the most 58 _  person in the company. \nIn his letter, he thanked me again and 59 _  me that, from then on, all their buses would stop at my service station, In this 60 _ , a little bit of kindness was rewarded with a huge amount of benefits.", 
    "options": [
        [
            "kick", 
            "hit", 
            "beat", 
            "knock"
        ], 
        [
            "finger", 
            "shoulder", 
            "head", 
            "hand"
        ], 
        [
            "away", 
            "behind", 
            "over", 
            "out"
        ], 
        [
            "supplied", 
            "poured", 
            "equipped", 
            "filled"
        ], 
        [
            "sleeping", 
            "crying", 
            "quarrelling", 
            "fighting"
        ], 
        [
            "allow", 
            "ring", 
            "lead", 
            "follow"
        ], 
        [
            "on", 
            "off", 
            "in", 
            "over"
        ], 
        [
            "neat", 
            "hot", 
            "warm", 
            "attractive"
        ], 
        [
            "around", 
            "inside", 
            "nearby", 
            "along"
        ], 
        [
            "drivers", 
            "guests", 
            "customers", 
            "adults"
        ], 
        [
            "left", 
            "arrived", 
            "ate", 
            "disappeared"
        ], 
        [
            "gave", 
            "paid", 
            "owed", 
            "offered"
        ], 
        [
            "appeared", 
            "exhibited", 
            "calculated", 
            "shown"
        ], 
        [
            "call", 
            "letter", 
            "check", 
            "notice"
        ], 
        [
            "get", 
            "force", 
            "requite", 
            "hope"
        ], 
        [
            "pointed", 
            "turned", 
            "worked", 
            "found"
        ], 
        [
            "generous", 
            "successful", 
            "serious", 
            "powerful"
        ], 
        [
            "praise", 
            "persuaded", 
            "informed", 
            "convinced"
        ], 
        [
            "lesson", 
            "business", 
            "aspect", 
            "case"
        ]
    ], 
    "answers": [
        "D", 
        "C", 
        "B", 
        "D", 
        "B", 
        "D", 
        "A", 
        "C", 
        "A", 
        "D", 
        "A", 
        "C", 
        "D", 
        "B", 
        "A", 
        "B", 
        "D", 
        "C", 
        "D"
    ], 
    "source": "high393"
}