{
    "article": "Katy and I have been friends since college, for more than thirty years. Our friendship has   _  constant . We have seen each other through all the times when we really need a friend. In  _  of our friendship, Katy and I took our first  _  trip together.\nThe first day of our trip ended in Santa Fe, New Mexico.  _  with the long drive, we decided to go to the restaurant for dinner. We sat down and  _  our meal. As we talked, I noticed a(n)  _  couple sitting a short distance away from us. The look of  _  on the woman's face attracted me.. She stared into the face of the man as he talked,  _  me of a teenager in love!\nI called Katy's  _  to the couple. As we watched, the man reached  _  to place a gentle kiss on the woman's cheek. She  _  . \"Now that's what I call real love! I imagine they've been married for a long time.\" I said. \"  _  maybe,\" remarked Katy, \"They haven't been together long.\" \"Well, whatever the case, it's  _  they care much for each other,\" I said.\nKaty and I watched and listened  _  to their conversation. She smiled and  agreed with  whatever he said. We were touched by the warm scene we were witnessing  . Then the  _  changed. The woman's wrinkled but beautiful face was suddenly covered with a  _  look. She asked the man in a sweet voice, \"Do I know you? What is this place?\" \"You know me. I'm Ralph, your husband. We're in Santa Fe,\" the man said. \"Oh, I  _  to have forgotten. I'm not sure,\" she said. \"That's okay, sweetheart. You'll be all right,\" he  _  her, kissing her cheek again. Tears coursed down our cheeks as Katy and I looked at each other. \"We were right,\" she said  _  . \"It is the real thing. That is love.\"", 
    "options": [
        [
            "become", 
            "grown", 
            "remained", 
            "developed"
        ], 
        [
            "congratulation", 
            "terms", 
            "favor", 
            "celebration"
        ], 
        [
            "air", 
            "car", 
            "boat", 
            "train"
        ], 
        [
            "Bored", 
            "Suffered", 
            "Tired", 
            "Excited"
        ], 
        [
            "cooked", 
            "ordered", 
            "prepared", 
            "finished"
        ], 
        [
            "young", 
            "elderly", 
            "friendly", 
            "rich"
        ], 
        [
            "hope", 
            "doubt", 
            "adoration", 
            "envy"
        ], 
        [
            "showing", 
            "reminding", 
            "telling", 
            "introducing"
        ], 
        [
            "attention", 
            "intention", 
            "time", 
            "idea"
        ], 
        [
            "away", 
            "off", 
            "around", 
            "over"
        ], 
        [
            "smiled", 
            "disagreed", 
            "angered", 
            "moved"
        ], 
        [
            "Or", 
            "Though", 
            "Therefore", 
            "Otherwise"
        ], 
        [
            "natural", 
            "obvious", 
            "important", 
            "moving"
        ], 
        [
            "madly", 
            "silently", 
            "unashamedly", 
            "carefully"
        ], 
        [
            "place", 
            "scene", 
            "topic", 
            "sense"
        ], 
        [
            "frightened", 
            "surprised", 
            "disappointed", 
            "confused"
        ], 
        [
            "need", 
            "feel", 
            "seem", 
            "use"
        ], 
        [
            "told", 
            "answered", 
            "comforted", 
            "encouraged"
        ], 
        [
            "quickly", 
            "eagerly", 
            "cheerfully", 
            "thoughtfully"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "B", 
        "C", 
        "B", 
        "B", 
        "C", 
        "B", 
        "B", 
        "D", 
        "A", 
        "A", 
        "B", 
        "C", 
        "B", 
        "D", 
        "C", 
        "C", 
        "D"
    ], 
    "source": "high2512"
}