{
    "article": "Once, there lived a young short monk in a temple on top of a hill, caring for his vegetable garden. He had one daily task of carryingtwo  _  of water up the hill from a cold stream. Rain or shine, he never  _  monk passed the temple and the young monk invited him to  _  . Since they would share the water, they went down the mountain together to fetch water. But the carrying pole is only  _  enough for one bucket. The two monks were unable to  _  the shared load on their carrying pole without shaking the contents of the two buckets all over the short monk. They  _  to retain  only a small  care for  of water that the young monk would have carried on his own, not mentioning to  _  the garden. When the young monk began to see his guest as  _  , the other monk began to see his host as unreasonable. Then a  _  monk came. The  _  of the third monk urged everyone to expect that someone else would take on the chore. As a result, no one fetched water though everybody was  _  . One night, a rat jumped and knocked the candleholder , leading to a devastating   _  life. The temple never lacks water again.", 
    "options": [
        [
            "buckets", 
            "bowls", 
            "bottles", 
            "cups"
        ], 
        [
            "lost", 
            "spared", 
            "missed", 
            "spent"
        ], 
        [
            "traveling", 
            "roaming", 
            "begging", 
            "hiking"
        ], 
        [
            "balance", 
            "fasten", 
            "lift", 
            "hold"
        ], 
        [
            "failed", 
            "managed", 
            "tried", 
            "wished"
        ], 
        [
            "sum", 
            "number", 
            "drop", 
            "amount"
        ], 
        [
            "unhappy", 
            "unforgettable", 
            "ungrateful", 
            "unrelated"
        ], 
        [
            "first", 
            "second", 
            "third", 
            "fourth"
        ], 
        [
            "mistake", 
            "arrival", 
            "death", 
            "leaving"
        ], 
        [
            "tired", 
            "hungry", 
            "thirsty", 
            "angry"
        ], 
        [
            "fire", 
            "flood", 
            "storm", 
            "earthquake"
        ], 
        [
            "hard", 
            "poor", 
            "rich", 
            "harmonious"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "A", 
        "A", 
        "B", 
        "D", 
        "C", 
        "C", 
        "B", 
        "C", 
        "A", 
        "D"
    ], 
    "source": "high2542"
}