{
    "article": "University students are different. However, a closer look at their    _   of learning at university will enable us to classify them roughly into three groups: those who learn out of instinct, those who learn for a    _   future, and those who learn with no definite objects. Firstly, there are a handful of students who learn day and night simply because they like to learn. They read a great deal of British and American novels because they are    _   interested in literature. Others sit in front of the computer screen,   working on  one new program after another all day and all night because they have discovered beauty in complicated signal patterns, and   dreaming of   becoming \"Bill Gates\" one day. Secondly there are students who work hard for a better career. It is arguable that the majority of university students fall into this group. After enrolling in the hottest specialty of the moment, they   _    themselves into books, whether they like them or not. Thirdly, there is a small fraction of students who learn without an aim. They take courses, finish assignments, enjoy life on campus, but lead a   _  life. They are a group of \"sleepers\". After four years, they part to continue their various lives.   _   , it is almost certain that those who learn out of instinct will be happy, those who learn with   _   will be professional successful at least, and those who learn without an aim will end up with  _  .", 
    "options": [
        [
            "scores", 
            "programs", 
            "purposes", 
            "methods"
        ], 
        [
            "promising", 
            "dreaming", 
            "directing", 
            "leading"
        ], 
        [
            "partly", 
            "keenly", 
            "mostly", 
            "sharply"
        ], 
        [
            "take", 
            "drag", 
            "throw", 
            "keep"
        ], 
        [
            "countless", 
            "directionless", 
            "harmless", 
            "careless"
        ], 
        [
            "Besides", 
            "Therefore", 
            "However", 
            "Thus"
        ], 
        [
            "determination", 
            "exploration", 
            "direction", 
            "attention"
        ], 
        [
            "something", 
            "anything", 
            "everything", 
            "nothing"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "B", 
        "C", 
        "B", 
        "C", 
        "A", 
        "D"
    ], 
    "source": "high2564"
}