{
    "article": "I remember quite well a day 17 years ago. That day, our twin sons, Chad and Brad,   _   their car and left home to attend college. I realized that our   _   would soon become a \"table for two\".   _  , the boys would come home on the weekends, but   even so  , I knew our family life would never be exactly the same again.\nThe boys walked around each room to   make sure   they hadn't forgotten anything they needed. I packed a cooler with   _   and their favorite cold snacks. I found a box and filled it with essential   _   items. I thought they might go to bed hungry that night. I   _   my wallet and placed the little bit of   _   I had in their hands.\nWe all walked   _  . Chad and Brad gave me big   _   and quickly got into their car. I   _   as they drove away. When their car was   out of sight  , I sat down on the driveway and cried   harder   than I had cried in a long time. My husband Roy tried to   _   me, but I could see grief in his eyes, as well.\nThere are many parents who would   experience   this period. Bittersweet feelings will be   _   while I cannot explain them adequately. I can still remember   _   I felt when we began that new chapter in our lives.\n  _   time going by, however, Roy and I are now accustomed to our table for two and we enjoy our lives together. I have to admit I still miss our children and the old   _   we had together.", 
    "options": [
        [
            "repaired", 
            "washed", 
            "loaded", 
            "decorated"
        ], 
        [
            "room", 
            "garden", 
            "chair", 
            "table"
        ], 
        [
            "So", 
            "Yet", 
            "Sure", 
            "Therefore"
        ], 
        [
            "water", 
            "drinks", 
            "wine", 
            "medicine"
        ], 
        [
            "food", 
            "clothes", 
            "book", 
            "supply"
        ], 
        [
            "tidied", 
            "cleaned", 
            "closed", 
            "emptied"
        ], 
        [
            "paper", 
            "goods", 
            "cash", 
            "check"
        ], 
        [
            "outside", 
            "indoors", 
            "forward", 
            "backward"
        ], 
        [
            "smiles", 
            "stares", 
            "kisses", 
            "hugs"
        ], 
        [
            "talked", 
            "waved", 
            "ran", 
            "cried"
        ], 
        [
            "delight", 
            "persuade", 
            "comfort", 
            "help"
        ], 
        [
            "absent", 
            "present", 
            "returning", 
            "concealing"
        ], 
        [
            "what", 
            "when", 
            "why", 
            "how"
        ], 
        [
            "With", 
            "As", 
            "For", 
            "About"
        ], 
        [
            "tables", 
            "houses", 
            "times", 
            "lives"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "C", 
        "B", 
        "A", 
        "D", 
        "C", 
        "A", 
        "D", 
        "B", 
        "C", 
        "B", 
        "D", 
        "A", 
        "C"
    ], 
    "source": "high311"
}