{
    "article": "Shopping habits in the United States have changed greatly in the last quarter of the 20th century. Early in the 1900s most American towns and cities had a Main Street.   Main Street was always in the heart of a town. This street was  _  on both sides with many  various  businesses. Here, shoppers walked into stores to look at all sorts of\nmerchandise: clothing, furniture, hardware, groceries.  In addition  ,some shops offered  services  .These\nshops included drugstores, restaurants, shoe-repair stores, and barber or\nhairdressing shops.  _  in the 1950s, a change began to  take place  .Too many automobiles had crowded into Main Street while too few parking\nplaces were  available to  shoppers. Because the\nstreets were crowded, merchants began to look with interest at the open spaces  _  the city limits. Open space is what their car-driving customers\nneeded.\nAnd open space is what they got when the first shopping centre was built. Shopping centres, or rather malls,  started  as a collection of small new stores  away from  crowded city centres.  _  by hundreds of free\nparking space, customers were drawn away from  _  areas to outlying\nmalls. And the growing  _  of shopping centres led  in turn  to the building of bigger and better stocked stores. By the late\n1970s, many shopping malls had almost developed into small cities themselves.\nIn addition to providing the  _  of one stop\nshopping, malls were transformed into landscaped parks, with benches,\nfountains, and outdoor entertainment.", 
    "options": [
        [
            "built", 
            "designed", 
            "intended", 
            "lined"
        ], 
        [
            "suddenly", 
            "Abruptly", 
            "Contrarily", 
            "But"
        ], 
        [
            "over", 
            "from", 
            "within", 
            "outside"
        ], 
        [
            "Attracted", 
            "Surprised", 
            "Delighted", 
            "Enjoyed"
        ], 
        [
            "inner", 
            ".central", 
            "shopping", 
            "downtown"
        ], 
        [
            "distinction", 
            "fame", 
            "popularity", 
            "liking"
        ], 
        [
            "cheapness", 
            "readiness", 
            "convenience", 
            "handiness"
        ]
    ], 
    "answers": [
        "D", 
        "D", 
        "D", 
        "A", 
        "D", 
        "C", 
        "C"
    ], 
    "source": "high2811"
}