{
    "article": "Hey, Tahlia! How's the model?\" I had just taken a bite of my hot dog  _  I heard a familiar voice yelling at me from across the crowded school yard. I saw a group of popular girls who were all  _  . \"What kind of  _  are you going to do? An ad for a Frankenstein movie?\" More laughter. My stomach twisted into a tight knot. How could they humiliate me like this,  in front of  the entire school? As I walked into the cafeteria, I  glanced at  the dark scars on my right hand. At 9 months old, I knocked over a tea pot and dumped boiling water all over my hands and stomach. My parents  _  me to the hospital, but I had to have skin graft operation. I was in so much pain! But what  _  me most were the cruel things people said about how I looked,  _  that day at lunch. The girls were being supermean to me because they'd heard I was considering doing some modeling. A close friend had suggested that I shouldn't let my scars limit me and that I might  _  a good model. But after that  _  at school, I was sure I'd made a huge mistake. Upon arriving home, I covered the mirror with a blanket, fell on my bed and sobbed. The next day, I  _  myself to go to school. At lunch my best friend Jesse tried to encourage me: \"You can't  _  forever, Tahlia. So what if you have a few scars? Just go outside and show them that you're just as good as they are.\" Although I knew he was right, I couldn't  _  standing up for myself like that. However, that night as I sat on the bed, my friend's words replayed in my mind. I'm  _  hiding from myself, I thought. How stupid! Slowly, I stood up, walked over to the  _  , and tossed the blanket aside. There, in the mirror I saw a slim, dark-haired, blue-eyed girl, looking just fine,  _  with a few scars. The next day I wore a comfortable T-shirt to school. What's more, I had lunch outside the cafeteria,  _  beside those mean girls. They were shocked that I should dare to walk into their territory. I felt  _  too--free and happy. Sometimes people still look at me strangely. They  _  and stare, but I don't let it get to me. I have applied to several modeling companies, and at least one company is considering me for jobs. Maybe I'll never  end up  posing on the runway, but I do know one thing: I'm done.", 
    "options": [
        [
            "as", 
            "when", 
            "while", 
            "before"
        ], 
        [
            "applauding", 
            "cheering", 
            "laughing", 
            "quarreling"
        ], 
        [
            "modeling", 
            "writing", 
            "drilling", 
            "acting"
        ], 
        [
            "presented", 
            "sent", 
            "rushed", 
            "handed"
        ], 
        [
            "hurt", 
            "beat", 
            "disappointed", 
            "puzzled"
        ], 
        [
            "for", 
            "like", 
            "on", 
            "after"
        ], 
        [
            "impress", 
            "make", 
            "consult", 
            "defeat"
        ], 
        [
            "effect", 
            "phenomenon", 
            "challenge", 
            "scene"
        ], 
        [
            "forced", 
            "expected", 
            "reminded", 
            "preferred"
        ], 
        [
            "apologize", 
            "beg", 
            "hide", 
            "complain"
        ], 
        [
            "consider", 
            "imagine", 
            "appreciate", 
            "resist"
        ], 
        [
            "hardly", 
            "ever", 
            "even", 
            "gradually"
        ], 
        [
            "blanket", 
            "bed", 
            "chair", 
            "mirror"
        ], 
        [
            "while", 
            "though", 
            "but", 
            "because"
        ], 
        [
            "right", 
            "still", 
            "therefore", 
            "anyhow"
        ], 
        [
            "sensitive", 
            "uncomfortable", 
            "different", 
            "tense"
        ], 
        [
            "compare", 
            "associate", 
            "wave", 
            "whisper"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "C", 
        "A", 
        "B", 
        "B", 
        "D", 
        "A", 
        "C", 
        "B", 
        "C", 
        "D", 
        "B", 
        "A", 
        "C", 
        "D"
    ], 
    "source": "high2326"
}