{
    "article": "Dad is a liar certainly. He never tells the truth about anything bad, or anything that he thinks is bad to me, even though I've told him I don't  _  hearing these things. He's the  _  man I have ever met, who never hurts others, as well as the cruelest man, for he's always hard on himself. Every time I phoned home from college and asked dad how his  _  was getting on, he would always reply, \"Oh, couldn't be better!\" When I asked mum the same question on the phone,  _  , she honestly told me every  _  with dad's business. I didn't blame  dad for his  _  . Instead I showed concern  for him.\nDad is a miser , undoubtedly. I hardly see dad wear  _  clothes. In fact, his closet is half empty. Even in this half, two-thirds is used by mum's clothes and the other one-third  belongs to  him. I begged him to buy some new clothes, but he simply shook his head, \" The old clothes are still good enough. \" Were they? I saw holes in them!\nIt tore my heart up when I saw dad cough terribly with his hand covering his mouth. When the pains  became very serious, he  _  took some medicine.\nSo it surprised  _  when the day came that dad got sick. He was lying in bed, and all the family gathered  around him. I knelt  by his bedside, tears filling my eyes.\nDear dad, you've been pushing yourself too hard, which you should not have. I know I might as well expect a river to flow backwards as hope to take you out of working so hard.", 
    "options": [
        [
            "mind", 
            "suggest", 
            "enjoy", 
            "allow"
        ], 
        [
            "cleverest", 
            "strongest", 
            "biggest", 
            "kindest"
        ], 
        [
            "health", 
            "experiment", 
            "business", 
            "treatment"
        ], 
        [
            "also", 
            "anyway", 
            "therefore", 
            "however"
        ], 
        [
            "change", 
            "difference", 
            "decision", 
            "problem"
        ], 
        [
            "lies", 
            "opinions", 
            "purposes", 
            "excuses"
        ], 
        [
            "cheap", 
            "new", 
            "clean", 
            "old"
        ], 
        [
            "still", 
            "even", 
            "only", 
            "ever"
        ], 
        [
            "somebody", 
            "nobody", 
            "anybody", 
            "everybody"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "C", 
        "D", 
        "D", 
        "A", 
        "B", 
        "C", 
        "B"
    ], 
    "source": "high1061"
}