{
    "article": "I was sitting in the surgical waiting area at the hospital waiting for word of my wife's operation. The small room was filled with other families and friends who were  _  waiting to hear how their loved ones were doing. There was a young boy sitting quietly in the  _  .He held a small box of  _  in one hand and a tablet( )in the other. Every so often he'd place the tablet on his lap and draw something. As the hours passed I began to see the room almost  _  .And there was a strange silence. \"Daddy,when is Mommy going home?\"the young boy asked,breaking the  _  . \"Tomorrow,\"his father replied. The boy picked up his crayons and  _  something on the tablet. I  _  him as he moved his feet back and forth,looking up at the ceiling and then toward the sunshine-filled window.\"When's  _  ,Daddy?\"he asked. His father  _  him over to sit by him. \"Come,  _  here next to me,\"he said with a gentle tone in his voice.  _  his things,the little boy walked slowly to his father's side from the corner. The man  _  out and held his son by his shoulders. \"There are three days in life. Yesterday,today and tomorrow. One is over and done,one we live in,the other we  _  .We can't live in yesterday,but if we are happy enough today,we will be even happier tomorrow,\"he said in an attempt to  _  the boy. The little boy looked at him for a moment and said,\"If Mommy is going home tomorrow,I'll be  _  . So,I want it to be tomorrow already, Daddy.\" Now hanging on every word of this  _  ,I leaned forward to hear his response. It was  _  . \"Son,the one great thing about today is once it  _  ,it is already almost tomorrow.\" I thought about how  _  it was. Even in my adult life. I still live waiting for what tomorrow may  _  .Now I know that it is already \"almost tomorrow.\"", 
    "options": [
        [
            "eagerly", 
            "patiently", 
            "happily", 
            "curiously"
        ], 
        [
            "chair", 
            "corner", 
            "distance", 
            "shadow"
        ], 
        [
            "gifts", 
            "toys", 
            "chalks", 
            "crayons"
        ], 
        [
            "dark", 
            "full", 
            "empty", 
            "clean"
        ], 
        [
            "promise", 
            "rule", 
            "record", 
            "silence"
        ], 
        [
            "wrote", 
            "drew", 
            "printed", 
            "carved"
        ], 
        [
            "followed", 
            "found", 
            "watched", 
            "caught"
        ], 
        [
            "today", 
            "yesterday", 
            "future", 
            "tomorrow"
        ], 
        [
            "knocked", 
            "ordered", 
            "called", 
            "pulled"
        ], 
        [
            "stand", 
            "sit", 
            "lie", 
            "sleep"
        ], 
        [
            "Gathering", 
            "Forgetting", 
            "Saving", 
            "Choosing"
        ], 
        [
            "got", 
            "took", 
            "set", 
            "reached"
        ], 
        [
            "spend", 
            "waste", 
            "kill", 
            "expect"
        ], 
        [
            "frighten", 
            "satisfy", 
            "persuade", 
            "warn"
        ], 
        [
            "happier", 
            "calmer", 
            "smarter", 
            "sadder"
        ], 
        [
            "story", 
            "argument", 
            "conversation", 
            "discussion"
        ], 
        [
            "humorous", 
            "silly", 
            "positive", 
            "perfect"
        ], 
        [
            "ends", 
            "starts", 
            "passes", 
            "lasts"
        ], 
        [
            "meaningful", 
            "important", 
            "interesting", 
            "fantastic"
        ], 
        [
            "happen", 
            "come", 
            "bring", 
            "need"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "D", 
        "C", 
        "D", 
        "B", 
        "C", 
        "D", 
        "C", 
        "B", 
        "A", 
        "D", 
        "D", 
        "B", 
        "A", 
        "C", 
        "D", 
        "B", 
        "A", 
        "C"
    ], 
    "source": "high2526"
}