{
    "article": "Burglars are probably the most unpopular visitors to your house. But how do you know if your home is an easy target for burglars ? Around the holidays, many families don't consider taking proper  _  to prevent their homes from suffering holiday thefts. With just a few simple  _  , you can better make sure of the  _  of your home during all of the holiday celebrations. Here are a few tips for making it difficult to  _  you are away from home. Either have a trusted neighbor  pick up  your mail and newspapers, or tell your mailman to hold your mail until you  _  . Make sure  _  says \"Hey, we're not home!\" like when your post-box is filled with all kinds of mail and you have many different newspapers in your driveway.  _  several different lights in your house on random timers. Do not leave your  _  lights on all the time.  _  , put your outside lights on timers to be on only during the  _  . If an outdoor light  _  on for days at a time, it means that nobody is home to turn it off. If you have pets that you are not taking with you on vacation,  _  them with a friend,  rather than  having someone coming into your house every day to take care of them. When burglars see a neighbor or friend  _  your house every day, they will know you are not home. Close all your  _  when you leave town. This is effective to  _  possible burglars, as no one can see what is in your house. If they don't know what there is to take, then the  _  is even greater for them to break in. This article just has suggested a few tips to help you keep your house safe while you are on  _  . Nothing can truly protect your home unless you have it  _  by a professional home security system.", 
    "options": [
        [
            "qualifications", 
            "measures", 
            "issues", 
            "patterns"
        ], 
        [
            "steps", 
            "paces", 
            "words", 
            "manners"
        ], 
        [
            "safety", 
            "tidiness", 
            "attraction", 
            "structure"
        ], 
        [
            "say", 
            "tell", 
            "speak", 
            "predict"
        ], 
        [
            "exist", 
            "escape", 
            "disappear", 
            "return"
        ], 
        [
            "everything", 
            "something", 
            "anything", 
            "nothing"
        ], 
        [
            "Choose", 
            "Give", 
            "Set", 
            "Make"
        ], 
        [
            "outdoor", 
            "indoor", 
            "inside", 
            "kitchen"
        ], 
        [
            "Therefore", 
            "However", 
            "Instead", 
            "Again"
        ], 
        [
            "days", 
            "weekends", 
            "weekdays", 
            "nights"
        ], 
        [
            "repeats", 
            "remains", 
            "lasts", 
            "happens"
        ], 
        [
            "find", 
            "turn", 
            "leave", 
            "hold"
        ], 
        [
            "cleaning", 
            "protecting", 
            "evaluating", 
            "entering"
        ], 
        [
            "windows", 
            "doors", 
            "curtains", 
            "eyes"
        ], 
        [
            "improve", 
            "discourage", 
            "inspire", 
            "frighten"
        ], 
        [
            "chance", 
            "desire", 
            "reward", 
            "risk"
        ], 
        [
            "holiday", 
            "board", 
            "duty", 
            "trip"
        ], 
        [
            "monitored", 
            "guided", 
            "strengthened", 
            "collected"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "A", 
        "B", 
        "D", 
        "D", 
        "C", 
        "A", 
        "C", 
        "D", 
        "B", 
        "C", 
        "D", 
        "C", 
        "B", 
        "D", 
        "A", 
        "A"
    ], 
    "source": "high363"
}