{
    "article": "I drove to a local supermarket the other day. My shopping list was  _  and my wallet was light. Still, I needed to get a week's worth of groceries for my family. I parked my car, looked down at my list, and hoped I could  _  it all. As I  _  the door, I saw a man with kind eyes and a gentle  _  . He said he was collecting for a local food bank that helped to  _  the hungry in my area. He handed me a second shopping list of things they could use and asked me to  _  if I could. I smiled back, took the  _  and walked into the store. I really wanted to help, but wasn't sure if I could this time. I walked through the store, picking up vegetables, soup, spaghetti, bread, milk, cereal, macaroni, bananas, and a dozen other things. I slowly  _  each item off my list until I was done. When I looked down at my full cart I  _  again if I even had enough to pay for it all. Then, as I put my own list back into my pocket, I saw the food  _  list under it. I smiled and decided to trust my heart. With the food bank in mind, I went over and  picked up  two of the biggest boxes of rice the store had and put them in my cart. It took  _  six dollars out of my wallet to pay for them,  _  my heart felt six times larger when I did. And when everything was  _  , I had just enough to pay for it all. It  _  so little to make our world a better place. A few dollars can help to fill a child's  _  belly . A smile and hug can help to  _  a hurting heart. An encouraging word can inspire someone else to live and to love. A random  _  of kindness can change another's day and life. It is up to us,  _  . If we can  _  a few dollars on rice , then we can share a love that will last forever.", 
    "options": [
        [
            "short", 
            "long", 
            "frequent", 
            "heavy"
        ], 
        [
            "offer", 
            "exchange", 
            "afford", 
            "accept"
        ], 
        [
            "approached", 
            "painted", 
            "cleaned", 
            "left"
        ], 
        [
            "attitude", 
            "manner", 
            "smile", 
            "anger"
        ], 
        [
            "share", 
            "train", 
            "protect", 
            "feed"
        ], 
        [
            "help", 
            "write", 
            "advertise", 
            "search"
        ], 
        [
            "name", 
            "project", 
            "list", 
            "budget"
        ], 
        [
            "signed", 
            "marked", 
            "rid", 
            "separated"
        ], 
        [
            "wandered", 
            "wondered", 
            "fancied", 
            "amazed"
        ], 
        [
            "store", 
            "cart", 
            "nutrition", 
            "bank"
        ], 
        [
            "other", 
            "others", 
            "more", 
            "another"
        ], 
        [
            "so", 
            "but", 
            "and", 
            "since"
        ], 
        [
            "ordered", 
            "totaled", 
            "replaced", 
            "packed"
        ], 
        [
            "takes", 
            "spends", 
            "pays", 
            "wastes"
        ], 
        [
            "hungry", 
            "adequate", 
            "anxious", 
            "full"
        ], 
        [
            "cure", 
            "treat", 
            "heal", 
            "recover"
        ], 
        [
            "ability", 
            "allowance", 
            "appreciation", 
            "act"
        ], 
        [
            "although", 
            "though", 
            "yet", 
            "still"
        ], 
        [
            "save", 
            "rescue", 
            "accumulate", 
            "reserve"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "C", 
        "D", 
        "A", 
        "C", 
        "B", 
        "B", 
        "D", 
        "D", 
        "B", 
        "B", 
        "A", 
        "A", 
        "C", 
        "D", 
        "B", 
        "A"
    ], 
    "source": "high520"
}