{
    "article": "When you are five years old, your mother is your everything. She is your   _  , friend, and nurse; the only person you rely on   _   with your hopes, dreams, and wishes. But for me, this was not the case.\nMy mother suffered from   _   problems that would keep her in bed for days, leaving me to care for her and look after myself. This situation   _   me to grow up much faster. While I knew my mother was sick, I felt deep down that we could   get through   it and everything would be okay.   _  , in 1997 everything went terribly wrong, and my life changed forever.\nAdoption is a   _   word to a five-year-old, but when I realized that my own mother had signed me over to   _  , I felt it was the worst betrayal . I suffered from shock, anger, and confusion as I attempted to adjust to my new family. No longer could I   _   anyone since the person I had loved more than all else had abandoned me. Hearing people tell me that she did it in my best interest, I felt even more   _  . I could not forgive her and always   _   how she could reject me like an old sofa. \nHowever, the more I got older, the more I began to understand how   _   our situation had been. We had been   _   on boxes of noodles, and at one point we   _   lived in our car. I was once passed from drug-addicted cousins to mentally unstable neighbors as my mother   _   to try and save me from what our lives were becoming   _   each day passed.\nOnly recently have I begun to understand   _   my mother gave me to strangers.  In the long run   she really did save me. She loved me more than anything, so she wanted me to have a 39 _  in life, one she could no longer offer me. I now know my life has been a special   _   only because she was selfless enough to give me up.", 
    "options": [
        [
            "hostess", 
            "competitor", 
            "provider", 
            "candidate"
        ], 
        [
            "mainly", 
            "completely", 
            "gradually", 
            "occasionally"
        ], 
        [
            "moral", 
            "physical", 
            "social", 
            "legal"
        ], 
        [
            "forced", 
            "inspired", 
            "allowed", 
            "convinced"
        ], 
        [
            "Otherwise", 
            "Meanwhile", 
            "However", 
            "Therefore"
        ], 
        [
            "familiar", 
            "negative", 
            "simple", 
            "foreign"
        ], 
        [
            "strangers", 
            "cousins", 
            "friends", 
            "neighbors"
        ], 
        [
            "understand", 
            "support", 
            "trust", 
            "praise"
        ], 
        [
            "worried", 
            "innocent", 
            "scared", 
            "bitter"
        ], 
        [
            "imagined", 
            "wondered", 
            "remembered", 
            "questioned"
        ], 
        [
            "ridiculous", 
            "urgent", 
            "desperate", 
            "complex"
        ], 
        [
            "focusing", 
            "working", 
            "acting", 
            "surviving"
        ], 
        [
            "also", 
            "even", 
            "still", 
            "yet"
        ], 
        [
            "fought", 
            "learnt", 
            "hesitated", 
            "tended"
        ], 
        [
            "till", 
            "before", 
            "as", 
            "once"
        ], 
        [
            "how", 
            "why", 
            "that", 
            "what"
        ], 
        [
            "challenge", 
            "goal", 
            "reward", 
            "chance"
        ], 
        [
            "gift", 
            "fact", 
            "test", 
            "deal"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "B", 
        "A", 
        "C", 
        "D", 
        "A", 
        "C", 
        "D", 
        "B", 
        "C", 
        "D", 
        "B", 
        "A", 
        "C", 
        "B", 
        "D", 
        "A"
    ], 
    "source": "high57"
}