{
    "article": "Life is a series of choices and we can't always foresee the consequences.\nHarry Saleem, an obese( too fat) man with too much money and power, faced a(n)   _  . Outside his office waited his personal   _  , bringing him the   _   news about the only medicine that could save his life. On the other side of the world, one of his engineers waited for his decision on an important   _   of business.\nHis secretary asked him   _   she could bring the doctor in. The billionaire businessman made his   _  . \"No. let the fool wait,\" answered Saleem, \"business comes first.\"   _   the health problem caused by his huge weight, he was still   _   about making money. He 49 _  a fat finger, and one of his staffs   _   to switch on a large television set.\nOn the screen appeared his engineer. They talked by satellite directly to each other although they were thousands of miles   _  . \"It's all ready to explode, Mr. Saleen,\" he said, \"just one\n  _  .\" His engineer was standing above Pakan Valley in South America. A few months ago, it had been a rainforest. Then Saleem's men came, cutting down all the valuable trees and   _   the villagers to move out.   _   the valley, a dam had been built. This would provide power for the factories that Saleem planned to build in that area. The factories would bring him great   _  .\nHe saw no reason to delay. He ordered the engineer to press the button. There, in the valley, a cloud of dust rose,   followed   by a dull explosion. A large river changed its course and water flooded into the valley.\n\"Good, that's that. Now, get that doctor in here,\" he   _  .\nThe doctor came in with a worried look and started to examine his   _   patient. \"You are doing very well, Mr. Saleen. The only medicine is saving your life. But the difficulty is getting more of it.\"\n\"Can you get more? Money is no problem.\" Saleen said. \"Tell me what you need and we'll get it.\"\nThe medicine was made of a plant, which is   _  . There is only one place in the world where the plant grows.\"\n\"Where?\" asked the businessman,   _  .\nThe doctor smiled. \"Well, luckily, the plant comes from one of the lands you own, sir. It comes from a place in South America, known as Pakan Valley.\"", 
    "options": [
        [
            "choice", 
            "opportunity", 
            "consequence", 
            "problem"
        ], 
        [
            "employee", 
            "secretary", 
            "doctor", 
            "engineer"
        ], 
        [
            "amazing", 
            "interesting", 
            "heart-breaking", 
            "important"
        ], 
        [
            "event", 
            "matter", 
            "incident", 
            "accident"
        ], 
        [
            "that", 
            "whether", 
            "until", 
            "unless"
        ], 
        [
            "decision", 
            "mistake", 
            "promise", 
            "plan"
        ], 
        [
            "Besides", 
            "Except", 
            "Instead", 
            "Despite"
        ], 
        [
            "addicted", 
            "crazy", 
            "interested", 
            "dying"
        ], 
        [
            "arose", 
            "rose", 
            "raised", 
            "aroused"
        ], 
        [
            "began", 
            "stopped", 
            "hesitated", 
            "hurried"
        ], 
        [
            "apart", 
            "away", 
            "far", 
            "aside"
        ], 
        [
            "look", 
            "word", 
            "moment", 
            "while"
        ], 
        [
            "forcing", 
            "asking", 
            "forbidding", 
            "stopping"
        ], 
        [
            "Above", 
            "Along", 
            "Through", 
            "Across"
        ], 
        [
            "profits", 
            "advantages", 
            "preference", 
            "achievements"
        ], 
        [
            "demanded", 
            "recommended", 
            "commanded", 
            "suggested"
        ], 
        [
            "healthy", 
            "wealthy", 
            "worried", 
            "frightened"
        ], 
        [
            "common", 
            "usual", 
            "rare", 
            "normal"
        ], 
        [
            "delightedly", 
            "thoughtfully", 
            "impatiently", 
            "cautiously"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "D", 
        "B", 
        "B", 
        "A", 
        "D", 
        "B", 
        "C", 
        "D", 
        "A", 
        "B", 
        "A", 
        "D", 
        "A", 
        "C", 
        "B", 
        "C", 
        "C"
    ], 
    "source": "high695"
}