{
    "article": "In our modern world, when something wears out, we throw it away and buy a new one. The   _  is that countries around the world have growing mountains of   _   because people are throwing out more rubbish than ever before.\nHow did we   _   a throwaway society? First of all, it is now easier to   _  an object than to spend time and money to repair it.   Thanks to   modern manufacturing   and technology, companies are able to produce products quickly and inexpensively. Products are plentiful and   _  . \nAnother cause is our   _   of disposable   products. As   _   people, we are always looking for   _   to save time and make our lives easier. Companies   _   thousands of different kinds of disposable products: paper plates, plastic cups, and cameras, to name a few.\nOur appetite for new products also   _   to the problem. We are   addicted to   buying new things. Advertisements persuade us that   _   is better and that we will be happier with the latest products. The result is that we   throw away   useful possessions to make room for new ones.\nAll around the world, we can see the   _   of this throwaway lifestyle. Mountains of rubbish just keep getting bigger. To   _   the amount of rubbish and to protect the   _  , more governments are requiring people to recycle materials.   _  , this is not enough to solve   our problem.\nMaybe there is another way out. We need to repair our possessions   instead of   throwing them away. We also need to rethink our attitudes about   _  . Repairing our possessions and changing our spending habits may be the best way to reduce the amount of rubbish and take care of our environment.", 
    "options": [
        [
            "key", 
            "reason", 
            "project", 
            "problem"
        ], 
        [
            "gifts", 
            "rubbish", 
            "debt", 
            "products"
        ], 
        [
            "face", 
            "become", 
            "observe", 
            "change"
        ], 
        [
            "hide", 
            "control", 
            "replace", 
            "withdraw"
        ], 
        [
            "safe", 
            "funny", 
            "cheap", 
            "powerful"
        ], 
        [
            "love", 
            "lack", 
            "prevention", 
            "division"
        ], 
        [
            "sensitive", 
            "kind", 
            "brave", 
            "busy"
        ], 
        [
            "ways", 
            "places", 
            "jobs", 
            "friends"
        ], 
        [
            "donate", 
            "receive", 
            "produce", 
            "preserve"
        ], 
        [
            "adapts", 
            "returns", 
            "responds", 
            "contributes"
        ], 
        [
            "newer", 
            "stronger", 
            "higher", 
            "larger"
        ], 
        [
            "advantages", 
            "purposes", 
            "functions", 
            "consequences"
        ], 
        [
            "show", 
            "record", 
            "decrease", 
            "measure"
        ], 
        [
            "technology", 
            "environment", 
            "consumers", 
            "brands"
        ], 
        [
            "However", 
            "Otherwise", 
            "Therefore", 
            "Meanwhile"
        ], 
        [
            "spending", 
            "collecting", 
            "repairing", 
            "advertising"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "B", 
        "C", 
        "C", 
        "A", 
        "D", 
        "A", 
        "C", 
        "D", 
        "A", 
        "D", 
        "C", 
        "B", 
        "A", 
        "A"
    ], 
    "source": "high293"
}