{
    "article": "Across the street from where we live, there stands a big hospital. To earn some money, we rented the rooms upstairs to patients. One evening, there was a(n)  _  at the door.I opened it and saw a short old man who was hardly  _  than my eight-year-old son. But the worst thing was his face----it was  _  ugly. He told me he'd been  hunting for  a room since that noon but no one seemed to have one. For a moment I hesitated, not  _  to rent him a room, but his next words convinced me. He said,\"I could  _  on this chair. My bus leaves early in the morning.\"I told him we would find him a  bed  .\nIt wasn't a long time before I found that this old man had a  _  heart in that tiny body. He fished for a living to  _  his daughter, his daughter's children, and her disabled husband. He didn't tell it by way of complaint. Instead, he was  _  that no pain was caused by his disease and that he still had strength to keep going. At  _  ,we put a camp cot in my children's room for him.  _  he left the next morning, he asked, \"Could I please come back and  _  when I see the doctor next time? Grown-ups are bothered by my  _  .but children don't seem to  _  . \"I told him he was welcome to come again.\nOn his next trip, he brought a big fish and a bag of the largest oysters I had ever seen.Other times we received  _  in the mail. There were oysters, fish or some fresh vegetables.  _  how little money he had and that he must walk three miles to  _  these made these gifts much more precious. And from him we  _  what it was to accept the bad without complaint and the good  _  gratitude.", 
    "options": [
        [
            "bell", 
            "answer", 
            "knock", 
            "call"
        ], 
        [
            "taller", 
            "healthier", 
            "better", 
            "stronger"
        ], 
        [
            "hardly", 
            "usually", 
            "really", 
            "finally"
        ], 
        [
            "knowing", 
            "refusing", 
            "fearing", 
            "wanting"
        ], 
        [
            "wait", 
            "sit", 
            "hide", 
            "sleep"
        ], 
        [
            "funny", 
            "beautiful", 
            "small", 
            "normal"
        ], 
        [
            "please", 
            "surprise", 
            "support", 
            "exchange"
        ], 
        [
            "interested", 
            "scared", 
            "grateful", 
            "worried"
        ], 
        [
            "midnight", 
            "suppertime", 
            "bedtime", 
            "noon"
        ], 
        [
            "lf", 
            "once", 
            "before", 
            "after"
        ], 
        [
            "visit", 
            "stay", 
            "pay", 
            "chat"
        ], 
        [
            "action", 
            "voice", 
            "face", 
            "manner"
        ], 
        [
            "notice", 
            "require", 
            "mind", 
            "escape"
        ], 
        [
            "card", 
            "letters", 
            "greetings", 
            "packages"
        ], 
        [
            "Believing", 
            "knowing", 
            "doubting", 
            "telling"
        ], 
        [
            "mail", 
            "get", 
            "find", 
            "make"
        ], 
        [
            "remembered", 
            "explained", 
            "learned", 
            "showed"
        ], 
        [
            "for", 
            "with", 
            "in", 
            "under"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "C", 
        "D", 
        "D", 
        "B", 
        "C", 
        "C", 
        "C", 
        "C", 
        "B", 
        "C", 
        "C", 
        "D", 
        "B", 
        "A", 
        "C", 
        "B"
    ], 
    "source": "high1763"
}