{
    "article": "Many cancer patients are finding new hope in an unusual approach to cancer treatment. The common method has been developed by Carl Simonton, a specialist in the science of tumors.  _  can sometimes be \"truly amazing,\" he says, when a cancer  _  lets his mind take part in the treatment.\nSimonton remembers that his first patient might have been thought to be a \"  _  case by some. \"He was a sixty-one-year-old man with very severe throat cancer.  He had lost a great deal of weight. He could  _  swallow his own saliva and could eat no food.\n\"I taught him to  relax  and mentally see his disease,\" Simonton says. \"Then I had him  _  an army of white blood cells coming, attacking and  _  the cancer cells. The results of the treatment were both exciting and frightening. Within two weeks his cancer had noticeably become smaller and he was quickly gaining weight. I say it was '  _  ' because I had never seen such a change. I wasn't sure what was going on. I also didn't know what I would do if things went wrong. But  _  didn't go wrong.\n\"We may believe that we have the power in our own bodies to fight cancer as well as the power to  _  the disease in the first place.  With those patients who are willing to stay with us and try, we always find that the cancer has filled some emotional need.\"", 
    "options": [
        [
            "Results", 
            "Researches", 
            "Records", 
            "Replies"
        ], 
        [
            "specialist", 
            "author", 
            "patient", 
            "agent"
        ], 
        [
            "hopeful", 
            "hopeless", 
            "valuable", 
            "worthless"
        ], 
        [
            "easily", 
            "mostly", 
            "carefully", 
            "barely"
        ], 
        [
            "suppose", 
            "observe", 
            "pretend", 
            "picture"
        ], 
        [
            "overcoming", 
            "managing", 
            "treating", 
            "threatening"
        ], 
        [
            "frightening", 
            "interesting", 
            "amusing", 
            "relaxing"
        ], 
        [
            "I", 
            "we", 
            "they", 
            "it"
        ], 
        [
            "carry", 
            "take", 
            "produce", 
            "find"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "B", 
        "D", 
        "D", 
        "A", 
        "A", 
        "C", 
        "C"
    ], 
    "source": "high619"
}