{
    "article": "Children model themselves largely on their parents. They do so mainly through identification. Children identify  _  a parent when they believe they have the qualities and feelings that are  _  of that parent. The things parents do and say---and the  _  they do and say to them--therefore strongly influence a child's  _  . However, parents must consistently behave like the type of  _  they want their child to become.\nA parent's actions  also  affect the self-image that a child forms  _  identification. Children who see mainly positive qualities in their  _  will likely learn to see themselves in a positive way. Children who observe chiefly  _  qualities in their parents will have difficulty  seeing  positive qualities in themselves. Children may  modify  their self-image, however, as they become increasingly  _  by peers groups standards before they reach 13.\nIsolated  events,  _  dramatic  ones, do not necessarily have a permanent  _  on a child's  behavior. Children interact such events according to their established attitudes and previous training. Children who know they are loved can,  for example  , accept the divorce of their parents' or a parent's early  _  . But if children feel unloved, they may interpret such events  _  a sign of rejection or punishment.\nIn the same way, all children are not influenced  alike  by toys and games, reading matter, and television programs.  _  in the case of a dramatic change in family relations, the  _  of an activity or experience depends on how the child interprets it.", 
    "options": [
        [
            "to", 
            "with", 
            "around", 
            "for"
        ], 
        [
            "informed", 
            "characteristic", 
            "conceived", 
            "indicative"
        ], 
        [
            "gesture", 
            "expression", 
            "way", 
            "Extent"
        ], 
        [
            "behavior", 
            "words", 
            "mood", 
            "reactions"
        ], 
        [
            "person", 
            "humans", 
            "creatures", 
            "adult"
        ], 
        [
            "before", 
            "besides", 
            "with", 
            "through"
        ], 
        [
            "eyes", 
            "parents", 
            "peers", 
            "behaviors"
        ], 
        [
            "negative", 
            "cheerful", 
            "various", 
            "complex"
        ], 
        [
            "mature", 
            "influenced", 
            "unique", 
            "independent"
        ], 
        [
            "not", 
            "besides", 
            "even", 
            "finally"
        ], 
        [
            "idea", 
            "wonder", 
            "stamp", 
            "effect"
        ], 
        [
            "death", 
            "rewards", 
            "advice", 
            "teaching"
        ], 
        [
            "as", 
            "being", 
            "of", 
            "For"
        ], 
        [
            "Even", 
            "Since", 
            "Right", 
            "As"
        ], 
        [
            "result", 
            "effect", 
            "scale", 
            "Cause"
        ]
    ], 
    "answers": [
        "B", 
        "B", 
        "C", 
        "A", 
        "A", 
        "D", 
        "B", 
        "A", 
        "B", 
        "C", 
        "D", 
        "A", 
        "A", 
        "D", 
        "B"
    ], 
    "source": "high965"
}