{
    "article": "My daughter performed on behalf of her class in the annual school concert today. She played so  _  that I could not help cheering her. The very  _  reminded me of her experiences of piano practicing. When she was five, we gave her a piano as a birthday present. With great  _  , she began learning it. However, when she was no longer  _  , she became sick of it.  After all  , it is a tough job to learn the piano, not to mention the daily routine of  _  . When her first teacher left, my friend  _  me to an American teacher whose way of teaching was completely American. After practicing, she would give my daughter some  _  comments , and then point out what should be  _  . Every time she came,  instead of  beginning the lesson right away, she would first play some  _  . She said, \"To learn the piano, you should learn not only the  _  of playing, but more importantly, to  _  the music and love it.\" After some time, my daughter became fond of her lessons. Sometimes she  _  would like to  show off  a little bit when her skill had reached a certain level. Surprisingly, my daughter said to me one day, \"Mom, I was  _  that you didn't give up my piano lessons. Learning it is like climbing a mountain. You'll feel  _  when you are on the way. When you look  _  from where you are, you will realize that you have been making  _  . But if you  _  , you'll never take one more step.\" That was the very thing I wanted to teach her.", 
    "options": [
        [
            "regularly", 
            "smoothly", 
            "carefully", 
            "happily"
        ], 
        [
            "music", 
            "arrangement", 
            "scene", 
            "praise"
        ], 
        [
            "unwillingness", 
            "pressure", 
            "regret", 
            "excitement"
        ], 
        [
            "young", 
            "free", 
            "anxious", 
            "curious"
        ], 
        [
            "practice", 
            "cost", 
            "education", 
            "show"
        ], 
        [
            "led", 
            "sent", 
            "introduced", 
            "directed"
        ], 
        [
            "usual", 
            "good", 
            "interesting", 
            "humorous"
        ], 
        [
            "explained", 
            "changed", 
            "stopped", 
            "improved"
        ], 
        [
            "jokes", 
            "music", 
            "games", 
            "sports"
        ], 
        [
            "skills", 
            "levels", 
            "training", 
            "secrets"
        ], 
        [
            "feel", 
            "follow", 
            "create", 
            "read"
        ], 
        [
            "once", 
            "even", 
            "still", 
            "then"
        ], 
        [
            "nervous", 
            "excited", 
            "afraid", 
            "lucky"
        ], 
        [
            "tired", 
            "easy", 
            "afraid", 
            "excited"
        ], 
        [
            "ahead", 
            "down", 
            "up", 
            "over"
        ], 
        [
            "mistakes", 
            "choices", 
            "progress", 
            "time"
        ], 
        [
            "move", 
            "continue", 
            "do", 
            "stop"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "D", 
        "D", 
        "A", 
        "C", 
        "B", 
        "D", 
        "C", 
        "A", 
        "A", 
        "B", 
        "D", 
        "A", 
        "B", 
        "C", 
        "D"
    ], 
    "source": "high786"
}