{
    "article": "Do you know how many languages there are in the world? There are about 1, 500, but many of them are not considered very    _    .English is considered one of the most important languages because many people   _   it, not only in England and America,   _   in other countries of the world. About 200, 000, 000 speak it   _   their own language, and another 230, 000, 000 use it as   a second   language. It is   _  to say how many people are learning it.   Millions of   boys and girls in schools are trying to do so.\nMany   _   children study French. French is also a very important language.   _   children study German, Russian, Japanese and Chinese.\nWhich is the best   _  to learn a language? We know that we all learnt   our own  language well when we were   _   . If we learn a second language in the   _   way, it may not seem so difficult. What does a small child do? It   _   what people say, and it tries to guess what it hears. When it wants something, it has to    ask for   it. It is using the language,    _   and  talking in it all of the time. If people use a second language   all the time   , they will learn it    _  .\nIn school, you learn to read, to write, to hear and to   _  . It is best to learn all new words through the   _   . You can read them, spell them and speak them later.", 
    "options": [
        [
            "spoken", 
            "happy", 
            "important", 
            "ideal"
        ], 
        [
            "like", 
            "use", 
            "operate", 
            "play"
        ], 
        [
            "but", 
            "and", 
            "too", 
            "so"
        ], 
        [
            "like", 
            "with", 
            "for", 
            "as"
        ], 
        [
            "easy", 
            "again", 
            "difficult", 
            "best"
        ], 
        [
            "Chinese", 
            "Japanese", 
            "English", 
            "Asian"
        ], 
        [
            "Some", 
            "Thousands", 
            "All", 
            "Much"
        ], 
        [
            "time", 
            "way", 
            "thing", 
            "place"
        ], 
        [
            "born", 
            "children", 
            "grown", 
            "boys"
        ], 
        [
            "same", 
            "different", 
            "useful", 
            "good"
        ], 
        [
            "talks", 
            "wants", 
            "cries", 
            "follows"
        ], 
        [
            "speaking", 
            "writing", 
            "thinking", 
            "doing"
        ], 
        [
            "fluent", 
            "confident", 
            "freely", 
            "easily"
        ], 
        [
            "fight", 
            "sing", 
            "speak", 
            "play"
        ], 
        [
            "mouth", 
            "hands", 
            "ears", 
            "eyes"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "A", 
        "D", 
        "C", 
        "C", 
        "A", 
        "B", 
        "B", 
        "A", 
        "D", 
        "C", 
        "D", 
        "C", 
        "C"
    ], 
    "source": "high1335"
}