{
    "article": "We have a small back garden with several trees,so bird nest in abundance. Therefore, it is  _  year after year to find many young birds don't  _  .\nOne morning two years ago, I found a young blackbird sitting still, very cold, in a corner. I  _  it up and moved it to a raised warmer spot,  _  it with tissue and made silly bird noises in the hope that it would  _  . It was breathing, though very weak and wouldn't open its beak  . I knew it had  given up  and was dying but it did start to feel warmer so there was  _  .\nI kept coming to check on it, keeping our three  _  inside the house, as I didn't want them to  _  it, as Toby, my cleverest dog had already spotted it. One time, I went to see the bird, it had  _  down, legs outstretched  , so I placed it  _  back onto the tissue. Its eyes opened  in response  and it seemed to look in my direction,  _  at times its head also moved round, which was not a good sign. I kept making bird noises and  _  it, saying \"Come on, be strong.\" I just felt so  _  , but I wanted it to know that there was someone who  _  . Unfortunately, it died. I did feel so regretful because I tried my best but I  _  .\nTo my  _  , last year I spotted two young blackbirds keeping each other company in one of our trees, and I'm  _  one of them had at least survived as one has been visiting  _  since and helping itself to seed from our feeders.", 
    "options": [
        [
            "obvious", 
            "strange", 
            "usual", 
            "special"
        ], 
        [
            "leave", 
            "survive", 
            "fly", 
            "adjust"
        ], 
        [
            "picked", 
            "put", 
            "hung", 
            "held"
        ], 
        [
            "provided", 
            "connected", 
            "hid", 
            "covered"
        ], 
        [
            "play", 
            "reply", 
            "breathe", 
            "wake"
        ], 
        [
            "hope", 
            "life", 
            "luck", 
            "fun"
        ], 
        [
            "birds", 
            "dogs", 
            "cats", 
            "boys"
        ], 
        [
            "visit", 
            "annoy", 
            "bother", 
            "attack"
        ], 
        [
            "fallen", 
            "pulled", 
            "lain", 
            "showed"
        ], 
        [
            "quickly", 
            "happily", 
            "gently", 
            "carelessly"
        ], 
        [
            "since", 
            "although", 
            "while", 
            "unless"
        ], 
        [
            "encouraging", 
            "saving", 
            "amusing", 
            "calming"
        ], 
        [
            "excited", 
            "curious", 
            "moved", 
            "desperate"
        ], 
        [
            "counted", 
            "preferred", 
            "cared", 
            "differed"
        ], 
        [
            "stopped", 
            "failed", 
            "declined", 
            "missed"
        ], 
        [
            "delight", 
            "disappointment", 
            "sorrow", 
            "amazement"
        ], 
        [
            "proud", 
            "afraid", 
            "sure", 
            "grateful"
        ], 
        [
            "casually", 
            "unexpectedly", 
            "suddenly", 
            "regularly"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "A", 
        "D", 
        "B", 
        "A", 
        "B", 
        "D", 
        "A", 
        "C", 
        "B", 
        "A", 
        "D", 
        "C", 
        "B", 
        "A", 
        "C", 
        "D"
    ], 
    "source": "high40"
}