{
    "article": "Dinah is one of the most good-natured children that ever lived, but she is very, very lazy. There is nothing she likes, or used to like, so much as to curl up in some warm corner in the sun and do nothing. Dinah's mother wished very much that her child should learn to read, but the lady who tried to teach her soon give it up. \"It is no  _  ,\" she said, \"Dinah  _  not learn. She is not stupid, but too lazy.\" It happened soon that a young man from Massachusetts came to the house where Dinah lived. He brought with him something no one else in the neighborhood had ever seen before-a pair of roller-skates. When Dinah saw the young man going rapidly up and down the piazza on his skates she was so  _  . She ran after him like a cat, her black eyes shining. One day the young man allowed her to  try on  the skates. The child was too happy for words. Of course she fell down, but did not  _  at all. \"Look here, Dinah,\" said the young man, \"I understand that my aunt has been trying to teach you to read. Why didn't you learn? Now, if you can read, I will send you a pair of good roller-skates.\" For a moment she said  _  , then exclaimed decidedly, \"I'll have those skates, sure.\" And she did. When she  _  her mind on her work, she could always do it well,  _  it was. The lady who had before this found her  _  difficult a child to teach, now had no trouble. If Dinah showed the least  _  of her former laziness, the word SKATES was enough to draw her attention back to her lesson instantly. On New Year's morning she received a box marked in large printed letters: MISS DINAH MORRIS, Care of Mrs. Lawrence Delaney, NEW ORLEANS, LA. If she can read what is on the outside of this box she can have what is inside. And as Dinah read every word clearly and quickly, of course she had the fine roller-skates the box held. And now sitting curled up in the sun, doing nothing, is not the thing she likes to do best.", 
    "options": [
        [
            "need", 
            "way", 
            "use", 
            "importance"
        ], 
        [
            "shall", 
            "will", 
            "must", 
            "can"
        ], 
        [
            "astonished", 
            "terrified", 
            "frightened", 
            "shocked"
        ], 
        [
            "move", 
            "hurt", 
            "cry", 
            "mind"
        ], 
        [
            "something", 
            "nothing", 
            "anything", 
            "everything"
        ], 
        [
            "paid", 
            "drew", 
            "bent", 
            "made"
        ], 
        [
            "whenever", 
            "however", 
            "whatever", 
            "wherever"
        ], 
        [
            "such", 
            "so", 
            "still", 
            "very"
        ], 
        [
            "sign", 
            "impression", 
            "mark", 
            "expression"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "A", 
        "D", 
        "B", 
        "C", 
        "C", 
        "B", 
        "A"
    ], 
    "source": "high1883"
}