{
    "article": "Many animals use some kinds of \"language\". They use signals  and the signals have meanings. For example,   _  a bee has found some food, it goes  back to  its home.  _  is difficult for a\nbee to tell  the other  bees where the food is speaking\nto them, but it can do a little dancing. This tells the bees where the food is\nand  how far away  it is.\nSome animals show   _  they\nfeel by making sounds. It is not difficult to tell if a dog is angry because it\nbarks. Birds make several different sounds and  _  has\nits meaning. Sometimes we humans make sounds in the same way. We make sounds\nlike \"Oh\" to  _  how we feel about  _  or\nwe  _  something on our feet.\nWe humans have languages. We have words. These words have meaning of things, action, feeling or ideas. We are able to   _  each other information, to tell other people  _  we\nthink or we feel. By writing down words, we can remember what has happened or  _  messages to people far away.\nLanguages, like people, live and die. If a language is not used by people, it is called a dead language. This language cannot live and grow because   no one  speaks it.\nA living language, of course, is often spoken by people today. It grows and changes with time. New words are created, and some old words have   _  meanings.", 
    "options": [
        [
            "because", 
            "since", 
            "when", 
            "as"
        ], 
        [
            "It", 
            "This", 
            "That", 
            "He"
        ], 
        [
            "why", 
            "which", 
            "how", 
            "what"
        ], 
        [
            "each", 
            "every", 
            "all", 
            "some"
        ], 
        [
            "show", 
            "say", 
            "talk", 
            "speak"
        ], 
        [
            "everything", 
            "something", 
            "nothing", 
            "anything"
        ], 
        [
            "put", 
            "drop", 
            "fall", 
            "set"
        ], 
        [
            "give", 
            "put", 
            "show", 
            "take"
        ], 
        [
            "that", 
            "which", 
            "what", 
            "why"
        ], 
        [
            "send", 
            "bring", 
            "push", 
            "get"
        ], 
        [
            "new", 
            "right", 
            "real", 
            "good"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "C", 
        "A", 
        "A", 
        "B", 
        "B", 
        "A", 
        "C", 
        "A", 
        "A"
    ], 
    "source": "high946"
}