{
    "article": "How can you stop smoking? It is not easy to stop smoking,but millions have  _  to quit and so can you Here are a few suggestions. Prepare yourself . Decide on a day to quit Don't choose a day that you know is going to be stressful, such as the day of an exam. Make a list of all the  _  you will get from stopping smoking. Then  throw away  your last packet of cigarettes. Be  _  . Every time you feel like smoking a cigarette,  _  yourself that you are a non-smoker.Reread the list of benefits you wrote earlier. Break the habit Instead of smoking a cigarette,do something else. Go for a walk,clean your teeth drink some water, clean the house;in fact,do anything to keep your mind and  _  your hands busy. Relax. If you start to feel nervous or stressed,do not reach  _  a cigarette .Try some deep breathing instead. Do some relaxation exercise every time you feel stressed. Get help if you need it. Arrange to stop smoking with a fiend so you call talk about your problems,or Join a stop-smoking group .If you feel  _  ,you might like to talk to a doctor or chemist about something to help you,like nicotine chewing gum. Keep trying. Do not be disappointed if you have to try several times before you stop smoking. If you  _  and have a cigarette,do not feel ashamed .Just try again. You will succeed  _  .", 
    "options": [
        [
            "managed", 
            "tried", 
            "wanted", 
            "expected"
        ], 
        [
            "values", 
            "benefits", 
            "results", 
            "profits"
        ], 
        [
            "addicted", 
            "accustomed", 
            "determined", 
            "depressed"
        ], 
        [
            "prepare", 
            "inform", 
            "threaten", 
            "remind"
        ], 
        [
            "especially", 
            "specially", 
            "normally", 
            "certainly"
        ], 
        [
            "out", 
            "for", 
            "at", 
            "in"
        ], 
        [
            "desperate", 
            "satisfied", 
            "arbitrary", 
            "conscious"
        ], 
        [
            "stick", 
            "continue", 
            "weaken", 
            "insist"
        ], 
        [
            "eventually", 
            "constantly", 
            "occasionally", 
            "normally"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "C", 
        "D", 
        "A", 
        "B", 
        "A", 
        "C", 
        "A"
    ], 
    "source": "high1032"
}