{
    "article": "No More Time Out\nShawn and Thomas had always been good friends. They lived near each other, and they both loved   _  . They played baseball, touch football, and kickball. They  _  liked to play soccer, shoot baskets, and skateboard.\nWhen they were in the fourth grade, though, Thomas broke his   _  in\na soccer game. He had to be on crutches for six weeks.\nShawn   _  Thomas, but what was there to do? Shawn didn't like television or\ncomputer games. Thomas didn't like to sit and talk. After trying three times to\nstart a conversation, Shawn  _  up.\nHe said, \"I'm out of here.\"\nFor days, Shawn   _  at home, feeling guilty for not visiting Thomas again. Thomas stayed\nhome, too, feeling  _  because Shawn\nwasn't visiting him. After a week, Shawn's mom spoke up. \"It's time for you and\nThomas to get back into  _  ! That's why I\nspoke to Ms McNulty at the library. She has the perfect volunteer job for you\nboth,\" she said.\nShawn said nothing. \nHis mom continued, \"The library sells used books to raise money. People are always\n  _   off books in bags and boxes. Someone has to carry the books to the storage room. Someone has to   _  them\ninto fiction and nonfiction. You and Thomas can be a team again.\"\n\"No, we   _  !\" said Shawn. \"He and I don't want a job.\" However, Shawn's mom wouldn't  _  no for an answer.\nSure enough,   _  the boys began, things changed. Shawn felt strong as he carried bags\nand boxes through the library. Sorting books in the storage room, Thomas felt  _  again. In fact, one day Thomas said, \"Between you and me, Shawn, this\nisn't so  _  .\" Shawn smiled and agreed.\nThey were a good team.", 
    "options": [
        [
            "books", 
            "sports", 
            "movies", 
            "arts"
        ], 
        [
            "also", 
            "only", 
            "perhaps", 
            "soon"
        ], 
        [
            "arm", 
            "hand", 
            "nose", 
            "leg"
        ], 
        [
            "phoned", 
            "invited", 
            "visited", 
            "checked"
        ], 
        [
            "gave", 
            "cheered", 
            "turned", 
            "hurried"
        ], 
        [
            "talked", 
            "stayed", 
            "called", 
            "waited"
        ], 
        [
            "tired", 
            "afraid", 
            "weak", 
            "angry"
        ], 
        [
            "effort", 
            "duty", 
            "choice", 
            "action"
        ], 
        [
            "dropping", 
            "bringing", 
            "showing", 
            "knocking"
        ], 
        [
            "pack", 
            "lead", 
            "sort", 
            "turn"
        ], 
        [
            "mustn't", 
            "can't", 
            "mightn't", 
            "shouldn't"
        ], 
        [
            "choose", 
            "keep", 
            "take", 
            "allow"
        ], 
        [
            "because", 
            "once", 
            "if", 
            "although"
        ], 
        [
            "relaxed", 
            "lucky", 
            "useful", 
            "special"
        ], 
        [
            "hard", 
            "fair", 
            "simple", 
            "bad"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "D", 
        "C", 
        "A", 
        "B", 
        "D", 
        "D", 
        "A", 
        "C", 
        "B", 
        "C", 
        "B", 
        "C", 
        "D"
    ], 
    "source": "high498"
}