{
    "article": "Remember Your Promise\nMichael, her dearest son, closed his eyes for the last time. He died   _  leukemia .\nAfter Michael  _  he had leukemia, he asked his mother to promise one thing----that she \nbecome a nurse.\nWeeks after Michael's funeral, Kathy was still struggling to  _  it through each day. \nOne night, she had a dream--though she believes it was more like a message.She saw Michael dressed \nand looking as healthy and handsome  as ever  . \"Mike, are you okay?\" she asked\n\"Mom, I'm fine,\" he said. \"But you have to stop  crying  now. You have to remember your\npromise.\" \nThe dream spurred her to   _  . On May 28, a month and a half after Michael's death, Kathy\ntook placement tests at a local community college. \"What am I, nuts?\" she asked herself. \"I haven't\nopened a textbook in 25 years.\" But she  _  well. \n     Nursing school was difficult, especially for someone who'd never used a computer. It took \nher twice as  _  as the younger students  to complete  assignments, and there were several times she\nthought she'd quit. But Matthew and her family continued to  _  her. \"Her head was always in\na book,\" recalls daughter Melissa. \"She  _  study on vacations. I know Michael was on her\nmind the whole time, and that was her driving  _  .\"Doubling up on courses and even taking\nsummer classes  _  working part-time at the deli , she  _  her nursing degree,\ngraduating cum laude  in May 2006 from Thomas Jefferson University, and soon became a\nregistered nurse.\nThe fall before she was   _   to graduate, Kathy attended a nursing career fair. She walked\n  _   up to Beverly Emonds. \"Hi, I'm Kathleen Staub, and I want to work at your hospital,\" she\nsaid. \"But it has to be on Rhoads 7, bone marrow transplant (where Michael stayed).\" \nIn early November, Emonds called Kathy to tell her there would be an opening. But it was\n  far from  a done deal. Kathy had to  _  the floor's nurse manager that Michael's history \nwouldn't interfere   _  her performance on the job. Finally, Emonds called to offer her the  _  . \nShe has kept her promise!", 
    "options": [
        [
            "off", 
            "down", 
            "away", 
            "of"
        ], 
        [
            "studied", 
            "learned", 
            "researched", 
            "questioned"
        ], 
        [
            "make", 
            "take", 
            "do", 
            "manage"
        ], 
        [
            "behaviour", 
            "performance", 
            "action", 
            "reaction"
        ], 
        [
            "gained", 
            "calculated", 
            "marked", 
            "scored"
        ], 
        [
            "long", 
            "high", 
            "wide", 
            "deep"
        ], 
        [
            "encourage", 
            "persuade", 
            "suggest", 
            "advise"
        ], 
        [
            "should", 
            "could", 
            "might", 
            "would"
        ], 
        [
            "strength", 
            "power", 
            "force", 
            "pressure"
        ], 
        [
            "before", 
            "while", 
            "after", 
            "since"
        ], 
        [
            "earned", 
            "caught", 
            "made", 
            "produced"
        ], 
        [
            "due", 
            "prepared", 
            "ready", 
            "anxious"
        ], 
        [
            "directly", 
            "immediate", 
            "straightly", 
            "forwardly"
        ], 
        [
            "convince", 
            "persuade", 
            "swear", 
            "guarantee"
        ], 
        [
            "with", 
            "on", 
            "onto", 
            "away"
        ], 
        [
            "function", 
            "situation", 
            "position", 
            "location"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "A", 
        "C", 
        "D", 
        "A", 
        "A", 
        "D", 
        "C", 
        "B", 
        "A", 
        "A", 
        "A", 
        "A", 
        "A", 
        "C"
    ], 
    "source": "high1309"
}