{
    "article": "The family had had a cat for years. Then, one day, the children finally  _  to persuade their parents to get them a dog as well. So a little Labrador   _  .\nThe dog was so  _  that everyone wanted to hold him and he charmed everyone by just loving them. The cat made it very clear she did not welcome another  _  in the house, but the dog just  _  the cat anyway. The little dog  _  her anywhere, and tried to make friends with the angry cat. No amount of  _  behavior from the cat could persuade the dog not to love the cat.\nThe family thought the cat would  _  like the dog.\nThen one day the family heard horrible  _  from their back yard. They ran to the  _  to see what was happening. They lived in the suburbs and so they saw a real lynx was just planning on  _  their cat for lunch. The poor cat had nowhere to run or hide. It would only be a matter of seconds and their cat would be  _  .\nAnd then suddenly a black lightning ran to the rescue. The little dog  _  the big lynx with all its strength. It did not  _  or stop to think. It saw its  _  in trouble and did what had to be done. The family opened the window and started yelling and the father ran to the yard. The lynx soon disappeared into the  _  .\nAnd ever since that day the cat's behavior toward the dog has  _  totally. Now it is the cat that follows the hero dog everywhere. They  _  in the same basket. The cat even lets the dog eat from her bowl.\nSo if ever anyone is  _  towards you, don't turn your back on them. They may not rescue your  _  ---but their kindness can certainly rescue your day!", 
    "options": [
        [
            "tried", 
            "managed", 
            "failed", 
            "refused"
        ], 
        [
            "agreed", 
            "visited", 
            "survived", 
            "arrived"
        ], 
        [
            "brave", 
            "shy", 
            "cute", 
            "proud"
        ], 
        [
            "pet", 
            "visitor", 
            "baby", 
            "relative"
        ], 
        [
            "avoided", 
            "amused", 
            "loved", 
            "respected"
        ], 
        [
            "watched", 
            "followed", 
            "bit", 
            "searched"
        ], 
        [
            "strange", 
            "curious", 
            "foolish", 
            "bad"
        ], 
        [
            "never", 
            "still", 
            "really", 
            "always"
        ], 
        [
            "quarrels", 
            "fights", 
            "laughter", 
            "cries"
        ], 
        [
            "yard", 
            "road", 
            "window", 
            "door"
        ], 
        [
            "catching", 
            "inviting", 
            "attracting", 
            "pulling"
        ], 
        [
            "painful", 
            "dead", 
            "injured", 
            "frightened"
        ], 
        [
            "pushed", 
            "shook", 
            "attacked", 
            "knocked"
        ], 
        [
            "win", 
            "hide", 
            "argue", 
            "hesitate"
        ], 
        [
            "owner", 
            "friend", 
            "brother", 
            "competitor"
        ], 
        [
            "woods", 
            "houses", 
            "crowds", 
            "shops"
        ], 
        [
            "worsened", 
            "changed", 
            "stopped", 
            "remained"
        ], 
        [
            "sleep", 
            "eat", 
            "play", 
            "wash"
        ], 
        [
            "polite", 
            "equal", 
            "kind", 
            "grateful"
        ], 
        [
            "health", 
            "family", 
            "career", 
            "life"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "C", 
        "A", 
        "C", 
        "B", 
        "D", 
        "A", 
        "D", 
        "C", 
        "A", 
        "B", 
        "C", 
        "D", 
        "B", 
        "A", 
        "B", 
        "A", 
        "C", 
        "D"
    ], 
    "source": "high2360"
}