{
    "article": "It was a sunny day, and as a routine for years, I was shopping at my local supermarket. On that particular day, I had done about 2 weeks worth of shopping and  _  toward the counter to pay for my groceries. After the cashier had scanned my items and I had bagged them up, she stated that the  _  was $150.\nI  _  into my back right pocket to grab the money to pay and noticed that there was no money there. I started to get  _  . I knew my purse was in the car and I was sure I had put the  _  in my back right pocket. I looked at the cashier with wet eyes and a  _  look not knowing what to do. There were people behind me on the line. She told me to speak with the courtesy counter  . I  _  and said, \"Really? It's  _  . No one would hand that in!\" But she  _  me to. \"You never know...\" she said.\nI decided that there was no  _  in checking, so I walked up to a woman behind the counter and said, \" I have to ask, did anyone  turn in  cash by any chance?\" She asked, \"How much?\" My face then  lit up  . \" $200 in the form of one hundred dollar bills.\" I replied. She said, \"  _  , yes, someone did!\" I was so  _  ! \"Who? I want to thank her.\" She pointed to a young girl about 10 years old and said, \"She did.\"\nI walked over to the mom and hugged her. She said, \"It wasn't me, it was my  _  \". I said, \"I know, I wanted to thank you both,  _  she found it. It's because of you that I got this back.\" I was so happy, I was almost in tears.\nThe next day at work, a person in another department  _  me tickets to the circus. He handed me 5 tickets. Almost  _  that young girl's face appeared in my head. After work I went back to the supermarket and stopped at the courtesy counter and asked if she had any idea who that woman was. She smiled and said, \"Yes, she is a friend of mine\". Then I asked her to do me a favor and pass along these 5 tickets to her.\nShe told me that the family of the little girl who found my money were not rich, so they would really  _  this. She also said that they had 3 children, so five was the  _  number of tickets!", 
    "options": [
        [
            "developed", 
            "retired", 
            "headed", 
            "showed"
        ], 
        [
            "total", 
            "percentage", 
            "product", 
            "luggage"
        ], 
        [
            "looked", 
            "searched", 
            "checked", 
            "reached"
        ], 
        [
            "nervous", 
            "curious", 
            "particular", 
            "serious"
        ], 
        [
            "card", 
            "grocery", 
            "purse", 
            "money"
        ], 
        [
            "shocked", 
            "confused", 
            "inspired", 
            "moved"
        ], 
        [
            "laughed", 
            "screamed", 
            "cried", 
            "blamed"
        ], 
        [
            "reality", 
            "evidence", 
            "receipt", 
            "cash"
        ], 
        [
            "stopped", 
            "encouraged", 
            "discouraged", 
            "promised"
        ], 
        [
            "doubt", 
            "need", 
            "harm", 
            "expense"
        ], 
        [
            "Eventually", 
            "Actually", 
            "Finally", 
            "Unfortunately"
        ], 
        [
            "interested", 
            "worried", 
            "absorbed", 
            "surprised"
        ], 
        [
            "daughter", 
            "husband", 
            "mother", 
            "friend"
        ], 
        [
            "because", 
            "however", 
            "although", 
            "besides"
        ], 
        [
            "offered", 
            "borrowed", 
            "produced", 
            "lent"
        ], 
        [
            "simply", 
            "constantly", 
            "previously", 
            "instantly"
        ], 
        [
            "reject", 
            "appreciate", 
            "ignore", 
            "purchase"
        ], 
        [
            "unique", 
            "perfect", 
            "official", 
            "typical"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "A", 
        "D", 
        "B", 
        "A", 
        "D", 
        "B", 
        "C", 
        "B", 
        "D", 
        "A", 
        "C", 
        "A", 
        "D", 
        "B", 
        "B"
    ], 
    "source": "high2131"
}