{
    "article": "People do not analyze every problem they meet.Sometimes they try to remember a solution from the last time they had a  _  problem.They often accept the opinions or ideas of other people.Other times they begin to act without thinking; they try to find a solution by trial and error.  _  , when all of these methods fail, the person with a problem has to start analyzing.There are six  _  in analyzing a problem. First the person must recognize that there is a problem.For example, Sam's bicycle is broken, and he cannot ride it to class as he usually does.Sam must  _  that there is a problem with his bicycle. Next the person must  _  the problem.Before Sam can repair his bicycle, he must know why it does not work.For example, he must  _  the parts that are wrong. Now the person must look for  _  that will make the problem clearer and lead to  _  solutions.For example, suppose Sam decides that his bike does not work because there is something wrong with the brakes.  At this time  , he can look in his bicycle repair book and read about brakes,  talk to  his friends at the bike shop, or look at his brakes carefully. After  studying  the problem, the person should have  _  suggestions for a possible solution.Take Sam as an example  _  , his suggestions might be: tighten or loosen the brakes; buy new brakes and change the old ones. In the end, one  _  seems to be the solution to the problem.Sometimes the  _  idea comes quite  _  because the thinker suddenly sees something new or sees something in a  _  way.Sam, for example, suddenly sees there is a piece of chewing gum stuck to a brake.He  _  hits on the solution to his problem: he must  _  the brake. Finally the solution is  _  .Sam does it and finds his bicycle works perfectly.In short, he has solved the problem.", 
    "options": [
        [
            "usual", 
            "serious", 
            "similar", 
            "common"
        ], 
        [
            "Instead", 
            "Besides", 
            "Otherwise", 
            "However"
        ], 
        [
            "conditions", 
            "ways", 
            "stages", 
            "orders"
        ], 
        [
            "prove", 
            "explain", 
            "show", 
            "see"
        ], 
        [
            "find", 
            "judge", 
            "describe", 
            "face"
        ], 
        [
            "determine", 
            "check", 
            "correct", 
            "recover"
        ], 
        [
            "skills", 
            "answers", 
            "explanation", 
            "information"
        ], 
        [
            "exact", 
            "possible", 
            "real", 
            "special"
        ], 
        [
            "enough", 
            "extra", 
            "several", 
            "countless"
        ], 
        [
            "again", 
            "secondly", 
            "also", 
            "alone"
        ], 
        [
            "conclusion", 
            "suggestion", 
            "decision", 
            "discovery"
        ], 
        [
            "clear", 
            "next", 
            "final", 
            "new"
        ], 
        [
            "late", 
            "unexpectedly", 
            "clearly", 
            "often"
        ], 
        [
            "different", 
            "simple", 
            "quick", 
            "sudden"
        ], 
        [
            "easily", 
            "fortunately", 
            "clearly", 
            "immediately"
        ], 
        [
            "separate", 
            "clean", 
            "loosen", 
            "remove"
        ], 
        [
            "completed", 
            "recorded", 
            "tested", 
            "accepted"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "C", 
        "D", 
        "A", 
        "A", 
        "D", 
        "B", 
        "C", 
        "A", 
        "B", 
        "C", 
        "B", 
        "A", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "high2377"
}