{
    "article": "The greatest source of inspiration for me has always been my father. Though he's been gone for 17 years, his   _  still resonate . He taught me how to run my own race in life. But the most inspiring thing he taught me was to   _  .\nOne incident is   _  in my mind. It happened when I\nwas a teenager. My sister and I weren't very fond of a so-called friend of  _  . Dad was a very generous man, and as he'd done with so many people, he'd\ngiven this fellow great help. But when he asked for a favor  in return  , the guy didn't deliver.\nDad's outlook on most things was \"Live and let live.\" In this case, however, his calmness   _  Terre and me, and we let him know it.\n\"How can you be nice to that man?\" we said to him. \"You've been so kind to him, and he's not being kind back. Why would you want to give him the time of day again?\"\nMy father shrugged and said to us, \"I do not bend my back with   _  . \"\nI didn't get it at first, but over the years I came to understand the   _  . Holding a grudge doesn't   _  the person you're angry with, but it changes you. It makes you\nheavier and gives you more weight to drag around.\nAfter my father died in 1991, a (n)   _  came from a fellow\nI'd had a quarrel with years before to  _  his\nsympathy. He wrote: \"I thought I'd tell you how sorry I am  _  the loss of your father. I know he  _  the\nworld to you. I just wanted to let you know that you are in my thoughts. \"\nMuch moved, I wrote back. I thanked him for his   _  . And\nthen, because he'd  _  \nour disagreement, I recalled Dad's inspiring words. \"I am my father's daughter,\" I wrote. \"And like him, I do not bend my back with yesterday.\"", 
    "options": [
        [
            "lectures", 
            "suggestions", 
            "lessons", 
            "pictures"
        ], 
        [
            "forgive", 
            "persuade", 
            "forget", 
            "excuse"
        ], 
        [
            "vital", 
            "obvious", 
            "visual", 
            "vivid"
        ], 
        [
            "sister's", 
            "mine", 
            "father's", 
            "mother's"
        ], 
        [
            "relaxed", 
            "moved", 
            "interrupted", 
            "bothered"
        ], 
        [
            "anger", 
            "disappointment", 
            "worry", 
            "yesterday"
        ], 
        [
            "reason", 
            "word", 
            "philosophy", 
            "sentence"
        ], 
        [
            "change", 
            "hurt", 
            "upset", 
            "disturb"
        ], 
        [
            "news", 
            "letter", 
            "message", 
            "information"
        ], 
        [
            "explain", 
            "express", 
            "produce", 
            "present"
        ], 
        [
            "in", 
            "with", 
            "about", 
            "at"
        ], 
        [
            "showed", 
            "represented", 
            "equaled", 
            "meant"
        ], 
        [
            "kindness", 
            "sympathy", 
            "understanding", 
            "consideration"
        ], 
        [
            "referred", 
            "mentioned", 
            "reminded", 
            "retold"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "C", 
        "D", 
        "D", 
        "C", 
        "A", 
        "B", 
        "B", 
        "C", 
        "D", 
        "A", 
        "B"
    ], 
    "source": "high2411"
}