{
    "article": "Wings of Angel I used to hate myself because I wasn't \"normal\". Everyone else could pay on the monkey bars and ride on a bicycle, but not  _  . I had a severe spinal cord disorder and I knew I would always be much  _  than others. I hated going to school and I hated people  _  at me. I hated seeing others smiling broadly and standing  _  and tall. And most of all, I hated looking in the  _  and seeing my ugly hunchback. My friends found me  _  because I didn't let others get close to me. I thought I was going to go on like this for the rest of my life  _  Angela appeared. That afternoon, I was sitting by myself in a corner of the school--- a spot where no one would  _  me. That's when I first heard her voice. \"Hi. Can I sit down?\" I raised my head and there she was, with an irresistible smile on her round face. \"What are you looking at?\" she asked. \"Ants.\" \"What are they doing?\" \"No  _  .\" \"I bet they're playing games and making friends. Don't you think so?\" That was how our  _  started and it didn't stop. We talked about everything under the sun---the ants, the clouds, my little niche ---until it was sunset. Then suddenly, she saw my  _  . She just started. My heart  _  . What I feared most had happened and I knew for sure she would  look down upon  me now. She stood up, pointed at my back and said, \"I know  _  your back is hunched.\" I closed my eyes like a criminal waiting to be  _  . I begged in my heart for her to  _  , but she just kept on going. \"I know what you've got in there. Do you?\" \"No,\" I answer  _  . She bent and whispered in my ears. \"Your back is hunched because you've got a pair of wings from the angels.\" I was  _  . I looked into her eyes and her  _  touched my heart. From that day on, I started to learn to  _  myself because I have the wings of an angel and a kind-hearted friend.", 
    "options": [
        [
            "them", 
            "it", 
            "me", 
            "her"
        ], 
        [
            "sadder", 
            "shorter", 
            "weaker", 
            "slower"
        ], 
        [
            "looking", 
            "smiling", 
            "aiming", 
            "glaring"
        ], 
        [
            "still", 
            "alone", 
            "straight", 
            "together"
        ], 
        [
            "street", 
            "sun", 
            "corner", 
            "mirror"
        ], 
        [
            "distant", 
            "stubborn", 
            "hopeless", 
            "unfortunate"
        ], 
        [
            "after", 
            "before", 
            "since", 
            "until"
        ], 
        [
            "disturb", 
            "seek", 
            "interrupt", 
            "ignore"
        ], 
        [
            "wonder", 
            "idea", 
            "sign", 
            "action"
        ], 
        [
            "connection", 
            "competition", 
            "conversation", 
            "comprehension"
        ], 
        [
            "face", 
            "back", 
            "eyes", 
            "shoulders"
        ], 
        [
            "sank", 
            "beat", 
            "broke", 
            "ached"
        ], 
        [
            "that", 
            "how", 
            "whether", 
            "why"
        ], 
        [
            "accused", 
            "arrested", 
            "punished", 
            "sentenced"
        ], 
        [
            "relax", 
            "leave", 
            "stop", 
            "pause"
        ], 
        [
            "shyly", 
            "weakly", 
            "proudly", 
            "firmly"
        ], 
        [
            "astonished", 
            "ashamed", 
            "annoyed", 
            "amused"
        ], 
        [
            "wisdom", 
            "generosity", 
            "honesty", 
            "kindness"
        ], 
        [
            "control", 
            "like", 
            "comfort", 
            "enjoy"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "A", 
        "C", 
        "D", 
        "A", 
        "D", 
        "A", 
        "B", 
        "C", 
        "B", 
        "A", 
        "D", 
        "D", 
        "C", 
        "B", 
        "A", 
        "D", 
        "B"
    ], 
    "source": "high372"
}