{
    "article": "Tom was a businessman and he suffered many failures in his career, which made him a depressed man, he often complained that others had been playing tricks on him. One day he told his wife he was so  _  with the city that he had to leave. So his family moved to  another  city. In the evening of a weekend, Tom and his wife were busy  _  up their new home  _  the light suddenly went out. So they had to  _  work. Tom was regretful to have forgotten to bring along candles and had to wait  _  in a low mood. Just then he heard slight, hesitant knocks on his door that sounded clear in the  _  night. \"Who's it?\" he wondered, since Tom had no  _  in the new city. And this was the moment he especially disliked being disturbed.  However  , he went reluctantly to the door and opened it impatiently. At the door was a little girl, shyly asking, \"Sir, do you have  _  ? I'm your neighbor.\" \"No,\" answered Tom in anger and shut the door violently. \"What a nuisance !\" he complained over it with his wife. \"No sooner had we settled down  _  the neighbor came to  _  things.\" After a while, the door was knocked  _  . He opened it and found the same girl outside. But this time she was holding two candles, saying, \"My grandma told me the new neighbor downstairs might need candles. She  _  me here to give you these .\" Tom was very  _  by what he saw. When he became fully aware, he said, \"Thank you and your  _  . God bless you!\" At that moment he suddenly realized what caused his  _  in life. It was his  _  and harshness with other people. The person who had cheated him in life was  in reality  nobody else but himself, for he had fallen for his unsympathetic  _  .", 
    "options": [
        [
            "inspired", 
            "satisfied", 
            "encouraged", 
            "disappointed"
        ], 
        [
            "looking", 
            "cleaning", 
            "turning", 
            "ending"
        ], 
        [
            "where", 
            "that", 
            "why", 
            "when"
        ], 
        [
            "continue", 
            "quit", 
            "start", 
            "change"
        ], 
        [
            "helplessly", 
            "happily", 
            "patiently", 
            "hopefully"
        ], 
        [
            "noisy", 
            "quiet", 
            "dark", 
            "crowded"
        ], 
        [
            "friend", 
            "consultant", 
            "stranger", 
            "adolescent"
        ], 
        [
            "lights", 
            "tricks", 
            "candles", 
            "failures"
        ], 
        [
            "when", 
            "that", 
            "than", 
            "while"
        ], 
        [
            "borrow", 
            "sell", 
            "purchase", 
            "lend"
        ], 
        [
            "suddenly", 
            "too", 
            "constantly", 
            "again"
        ], 
        [
            "suggested", 
            "sent", 
            "forbade", 
            "forced"
        ], 
        [
            "frightened", 
            "surprised", 
            "puzzled", 
            "pleased"
        ], 
        [
            "brother", 
            "mother", 
            "father", 
            "grandma"
        ], 
        [
            "dissatisfaction", 
            "success", 
            "failure", 
            "determination"
        ], 
        [
            "apology", 
            "responsibility", 
            "coldness", 
            "concept"
        ], 
        [
            "brain", 
            "thought", 
            "idea", 
            "mind"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "D", 
        "B", 
        "A", 
        "B", 
        "A", 
        "C", 
        "C", 
        "A", 
        "D", 
        "B", 
        "B", 
        "D", 
        "C", 
        "C", 
        "D"
    ], 
    "source": "high202"
}