{
    "article": "I found out one time that doing a  _  for someone could get you into a lot of trouble.I was in the eighth grade at the time, and we were having a final test.During the test, the girl sitting next to me  _  something, but I didn't understand.So I  leaned over  her way and found out that she was trying to ask me if I had an extra pen.She showed me that hers was  out of ink  and would not write.I happened to have an extra one, so I took it out of my pocket and  _  it on her desk. Later, after the test papers had been turned in, the teacher asked me to stay in the room when all the other students were  _  .As soon as we were alone she began to talk to me about  _  it meant to grow up; she talked about how important it was to  stand on  your own two feet and be responsible for your own  _  .For a long time, she talked about honesty and emphasized the fact  _  when people do something  _  , they are really cheating themselves.She made me  _  that I would think seriously about all the things she had said, and then she told me I could leave.I walked out of the room  _  why she had chosen to talk to me about all those things.  Later on  , I found out that she thought I had cheated on the test.When she saw me lean over to talk to the girl next to me, it looked as if I was copying answers  _  the girl's test paper.I  _  to explain about the pen, but all she  _  say was that it seemed very strange to her that I hadn't talked of anything about the pen the day she talked to me  _  after the test.  Even if  I tried to explain that I was just doing the girl a favor by letting her use my pen, I was sure she  _  to believe that I had cheated on the test.", 
    "options": [
        [
            "help", 
            "hand", 
            "favor", 
            "fever"
        ], 
        [
            "whispered", 
            "talked", 
            "told", 
            "spoke"
        ], 
        [
            "place", 
            "put", 
            "gave", 
            "lent"
        ], 
        [
            "punished", 
            "dismissed", 
            "praised", 
            "parted"
        ], 
        [
            "what", 
            "that", 
            "which", 
            "how"
        ], 
        [
            "attitude", 
            "activity", 
            "action", 
            "behavior"
        ], 
        [
            "what", 
            "if", 
            "that", 
            "where"
        ], 
        [
            "honest", 
            "dishonest", 
            "modest", 
            "disappointed"
        ], 
        [
            "promise", 
            "permit", 
            "recognize", 
            "prove"
        ], 
        [
            "wandering", 
            "reflecting", 
            "understanding", 
            "wondering"
        ], 
        [
            "of", 
            "in", 
            "from", 
            "on"
        ], 
        [
            "managed", 
            "planned", 
            "tried", 
            "promoted"
        ], 
        [
            "could", 
            "would", 
            "can", 
            "will"
        ], 
        [
            "right", 
            "only", 
            "slight", 
            "once"
        ], 
        [
            "remained", 
            "continued", 
            "kept", 
            "wanted"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "B", 
        "B", 
        "A", 
        "D", 
        "C", 
        "B", 
        "A", 
        "D", 
        "C", 
        "C", 
        "A", 
        "A", 
        "B"
    ], 
    "source": "high850"
}