{
    "article": "On a cold November afternoon, my mother and I were walking home from a pizza store. We were dressed warmly and equipped with the rented video we had been dying to  _  . I was feeling a little  _  , as I was carrying our shopping,bags of snacks and the  _  .They were so heavy that I decided to  throw away  some things. So I started to walk towards the garbage can  _  I noticed a poor man walking his bike out of the restaurant in front of us. He  _  a paper bag with his dirty hand. He headed over to another nearby garbage can and started  looking through  it. I suddenly felt very  _  because I was about to do away with a new drink just  _  it was heavy. I knew this man would take all he could  _  , so I walked up to him and  _  the drink and some snacks to him. The man looked up  in surprise  and took what I gave him. A huge smile spread  _  his face and this caused me to feel indescribable  _  . I felt like I  _  be happier with myself, but then he said, \"This is my son's lucky day!\" With that, he  thanked  me happily and started off on his bike. I even heard him  _  a song as he rode away. I got a warm feeling inside and I knew I had done something good for the man and his family. I now understand what is  _  by the saying \"Giving is getting\". Since then, every time I have the  _  to do something nice, the picture of the man's happiness caused by my small gift appears in my mind. This is the  _  of charity.", 
    "options": [
        [
            "watch", 
            "look", 
            "see", 
            "listen"
        ], 
        [
            "upset", 
            "happy", 
            "tired", 
            "excited"
        ], 
        [
            "video", 
            "books", 
            "pizza", 
            "clothes"
        ], 
        [
            "after", 
            "when", 
            "before", 
            "while"
        ], 
        [
            "owned", 
            "presented", 
            "held", 
            "sought"
        ], 
        [
            "stupid", 
            "guilty", 
            "disappointed", 
            "happy"
        ], 
        [
            "since", 
            "for", 
            "because", 
            "when"
        ], 
        [
            "get", 
            "search", 
            "hear", 
            "see"
        ], 
        [
            "dropped", 
            "kept", 
            "turned", 
            "handed"
        ], 
        [
            "around", 
            "across", 
            "over", 
            "to"
        ], 
        [
            "regret", 
            "satisfaction", 
            "failure", 
            "curiosity"
        ], 
        [
            "couldn't", 
            "shouldn't", 
            "needn't", 
            "mustn't"
        ], 
        [
            "singing", 
            "sounding", 
            "listening", 
            "making"
        ], 
        [
            "referred", 
            "said", 
            "meant", 
            "spoken"
        ], 
        [
            "time", 
            "chance", 
            "idea", 
            "effort"
        ], 
        [
            "power", 
            "effect", 
            "strength", 
            "mystery"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "A", 
        "B", 
        "C", 
        "B", 
        "C", 
        "A", 
        "D", 
        "B", 
        "B", 
        "A", 
        "A", 
        "C", 
        "B", 
        "A"
    ], 
    "source": "high2806"
}