{
    "article": "Linda British was an outstanding teacher who felt that if she had the time, she would like to create great art and poetry. When she was 28, however, she began to get severe   _  . Her doctors discovered that she had an enormous brain tumor  . They told her that her   _  of surviving an operation were about 2 percent. Therefore,  rather than  operate immediately, they chose to wait for six months.\nThe night before the operation after six months, she   _  to give herself away.\nShe made a  _  , in which she would donate all of her\nbody parts to those who needed them in  _  of her\ndeath.\n  _  , Linda died after the operation. Afterwards, her eyes went to an eye   _  in\nBethesda, Maryland, and from there to a recipient in South Carolina. A young\nman, aged 28, went from darkness to  _  . That young\nman was so  _  that he wrote to the eye bank thanking\nthem for existing.\n  _  , he said he wanted to thank the parents of the donator. They must   _  be\nmagnificent people to have a child who would  give away  her\neyes. He was given the  _  of the British family\non Staten Island. He arrived unannounced and rang the doorbell. After hearing\nhis introduction, Mrs. British  reached out  and hugged\nhim. She said, \"Young man, if you've got  _  to\ngo, my husband and I would love you to spend your weekend with us.\"\nHe stayed, and   _  he was looking around Linda's room, he saw that she'd read Hegel.\nHe'd read Hegel in Braille as well.\nThe next morning Mrs. British was looking at him and said, \"You know, I'm sure I've seen you somewhere before.\" All of a sudden she   _  . She ran upstairs and\npulled out the last picture Linda had drawn. It was a portrait of her ideal\nman.\nThe picture was almost the same as this young man who had received Linda's eyes.\nThen her mother read the   _  poem Linda had written on her deathbed. It  _  :\nTwo hearts passing in the night\nFalling in love\nNever able to gain each other's sight.", 
    "options": [
        [
            "heartaches", 
            "headaches", 
            "stomachaches", 
            "backaches"
        ], 
        [
            "risks", 
            "happenings", 
            "chances", 
            "moments"
        ], 
        [
            "decided", 
            "suggested", 
            "prepared", 
            "liked"
        ], 
        [
            "will", 
            "letter", 
            "notice", 
            "poem"
        ], 
        [
            "spite", 
            "case", 
            "charge", 
            "view"
        ], 
        [
            "Actually", 
            "Unbelievably", 
            "Surprisingly", 
            "Unfortunately"
        ], 
        [
            "hospital", 
            "center", 
            "school", 
            "bank"
        ], 
        [
            "silence", 
            "daytime", 
            "sight", 
            "delight"
        ], 
        [
            "excited", 
            "joyful", 
            "grateful", 
            "proud"
        ], 
        [
            "However", 
            "Therefore", 
            "Furthermore", 
            "Yet"
        ], 
        [
            "partly", 
            "hardly", 
            "seldom", 
            "indeed"
        ], 
        [
            "news", 
            "address", 
            "gift", 
            "hometown"
        ], 
        [
            "somewhere", 
            "anywhere", 
            "everywhere", 
            "nowhere"
        ], 
        [
            "as", 
            "after", 
            "until", 
            "since"
        ], 
        [
            "shouted", 
            "laughed", 
            "waked", 
            "remembered"
        ], 
        [
            "last", 
            "first", 
            "past", 
            "recent"
        ], 
        [
            "wrote", 
            "spoke", 
            "said", 
            "talked"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "A", 
        "B", 
        "D", 
        "D", 
        "C", 
        "C", 
        "C", 
        "D", 
        "B", 
        "D", 
        "A", 
        "D", 
        "A", 
        "C"
    ], 
    "source": "high3097"
}