{
    "article": "I still remember the year when I started university. It was a very  _  time for me. Like many other new students I missed my mother's cooking and my friends, got quite homesick and  _  thought of leaving university and going home.\nThe  _  time for many students was getting letters from home, and at first my mailbox was full. But  as time went by  the letters gradually became fewer and finally the day came when I found my mailbox was  _  . It made me feel quite miserable(,). Then one day while I was waiting for the postman I saw that I had a postcard in my box. Happily I sat down to read it,  _  that it was from one of my friends.  _  it was  _  of a young woman called Annie and her new baby. I took the card back to my room, put it into my desk drawer and  _  all about it.\nSeveral days later, I  _  another postcard. This time it was about Antonio, Annie's cousin. Soon later, another card came and then another,  _  full of interesting information about people I had  _  met. I began to really look forward to them,  _  to see what the writer would  write about  next. They made me feel  _  unhappy with my own life and I even began to smile.  At the same time  while the cards  _  coming, I joined some societies and made some new friends. At last I was beginning to enjoy  _  life. The postcards had made me feel happy and helped me begin a new life so I  _  all the cards and even now bring them out  _  I feel miserable.", 
    "options": [
        [
            "easy", 
            "difficult", 
            "good", 
            "bad"
        ], 
        [
            "often", 
            "sometimes", 
            "only", 
            "seldom"
        ], 
        [
            "busiest", 
            "hardest", 
            "happiest", 
            "worst"
        ], 
        [
            "open", 
            "closed", 
            "full", 
            "empty"
        ], 
        [
            "enjoying", 
            "expecting", 
            "hoping", 
            "writing"
        ], 
        [
            "So", 
            "Although", 
            "However", 
            "But"
        ], 
        [
            "postcards", 
            "emails", 
            "letters", 
            "news"
        ], 
        [
            "cared", 
            "forgot", 
            "thought", 
            "realized"
        ], 
        [
            "sent", 
            "accepted", 
            "received", 
            "wrote"
        ], 
        [
            "either", 
            "neither", 
            "every", 
            "each"
        ], 
        [
            "ever", 
            "never", 
            "once", 
            "always"
        ], 
        [
            "surprised", 
            "interested", 
            "frightened", 
            "worried"
        ], 
        [
            "more", 
            "most", 
            "less", 
            "least"
        ], 
        [
            "began", 
            "continued", 
            "stopped", 
            "finished"
        ], 
        [
            "college", 
            "home", 
            "hardship", 
            "common"
        ], 
        [
            "sold", 
            "sent", 
            "thrown", 
            "kept"
        ], 
        [
            "whenever", 
            "wherever", 
            "whichever", 
            "when"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "D", 
        "B", 
        "D", 
        "D", 
        "B", 
        "C", 
        "D", 
        "B", 
        "B", 
        "C", 
        "B", 
        "A", 
        "D", 
        "A"
    ], 
    "source": "high214"
}