{
    "article": "We all have storms through our lives. But we have no right to make everyone else suffer with our own  _  . The carpenter I  _  to help me restore an old farmhouse had just finished a(n)  _  first day on the job. A flat tire made him lose an hour of work, his electric saw quit, and now his truck  _  to start. While I drove him home, he sat in stony  _  . On arriving, he invited me in to meet his family. As we walked toward the front door, he paused  _  at a small tree,  _  tips of the branches with both hands. When opening the door, he underwent a(n)  _  transformation. His tanned face was wreathed in smiles, and he  _  his two small children and gave his wife a kiss. The next day my  _  drove me to ask him about what I had seen. \"Oh, that's my trouble tree,\" he replied. \"I know I can't  _  having troubles on the job, but the troubles don't  _  to the house with my family. So I just  _  them up on the tree. Then in the morning I pick them up again.\" \"  _  thing is,\" he smiled, \"when I come out in the morning to pick them up, there aren't nearly as  _  as I remember the night before.\" Putting  _  around our problems is a really good idea --- it prevents our difficulties from spilling over onto loved people, who can't do anything about our problems. Why  _  them if they can't help us? So, plant yourself a trouble tree outside and use it  _  you come home. Be grateful that you have loved ones to go home to  even if  your loved one is simply your beloved dog. And when you picked up your troubles on the way each morning, be  _  that they're not as heavy as they were the night before.", 
    "options": [
        [
            "unhappiness", 
            "mistakes", 
            "helplessness", 
            "carelessness"
        ], 
        [
            "informed", 
            "hired", 
            "trusted", 
            "recommended"
        ], 
        [
            "enjoyable", 
            "smooth", 
            "rough", 
            "dull"
        ], 
        [
            "intended", 
            "desired", 
            "hesitated", 
            "refused"
        ], 
        [
            "amazement", 
            "astonishment", 
            "embarrassment", 
            "silence"
        ], 
        [
            "regularly", 
            "unusually", 
            "briefly", 
            "directly"
        ], 
        [
            "cutting", 
            "damaging", 
            "watching", 
            "touching"
        ], 
        [
            "exciting", 
            "amazing", 
            "confusing", 
            "annoying"
        ], 
        [
            "hugged", 
            "greeted", 
            "thanked", 
            "waved"
        ], 
        [
            "preference", 
            "sufferings", 
            "curiosity", 
            "doubt"
        ], 
        [
            "avoid", 
            "consider", 
            "continue", 
            "stand"
        ], 
        [
            "lack", 
            "belong", 
            "exist", 
            "stay"
        ], 
        [
            "set", 
            "throw", 
            "give", 
            "hang"
        ], 
        [
            "Sad", 
            "Terrible", 
            "Funny", 
            "Ridiculous"
        ], 
        [
            "many", 
            "few", 
            "good", 
            "light"
        ], 
        [
            "defence", 
            "boundaries", 
            "sympathy", 
            "secret"
        ], 
        [
            "burden", 
            "equip", 
            "expose", 
            "entertain"
        ], 
        [
            "however", 
            "whenever", 
            "wherever", 
            "whatever"
        ], 
        [
            "shameful", 
            "proud", 
            "astonished", 
            "grateful"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "C", 
        "D", 
        "D", 
        "C", 
        "D", 
        "B", 
        "A", 
        "C", 
        "A", 
        "B", 
        "D", 
        "C", 
        "A", 
        "B", 
        "A", 
        "B", 
        "D"
    ], 
    "source": "high2166"
}