{
    "article": "Sixth-grade schoolteacher Ms.Shelton believed in readiness.Students remembered how she walked in on the first day of class and began writing words of eighth-grade on the  _  .They quickly protested that the words were not on their  _  and they couldn't learn them.\nTheir teacher insisted that the students could and would learn these  _  .She said that she would teach them something that should be given.Ms.Shelton  _  by saying that one of the students in the classroom could go on to  _  , maybe even be president someday, and she wanted to prepare them for that day.\nMs.Shelton spoke those words many years ago.  _  did she know that someday one of her students--Jesse Jackson--would take them  _  .She believed that if they were well prepared, they could  _  high goals.\nRalph Waldo Emerson once said, \"People only see what they are  _  to see.\" If that's true, then it is also  _  that they only become what they are prepared to become.And many things in life are just about getting ready.\n\"I want to be doing something more  _  with my life than what I am doing now,\" a young man once said to me.He  _  what he was doing was just not that important.Other people have said things to me such as, \"I only  _  I had a meaningful relationship.\" And, \"I'd really like to get a better job, but I just don't see  _  .\"\nYou fill in the blanks.What is it you would like to  _  that isn't happening? Perhaps the answer is that you are not yet  _  .Maybe you need more time to prepare before you are truly ready for the things which you  _  .\nThink of today as another chance to  _  yourself for the exciting future you are looking for.Today is not wasted.If you desire more from  _  , then you can use today as training.For you will experience only what you are prepared to  _  .Something wonderful can happen.And you can use today to get ready for tomorrow.", 
    "options": [
        [
            "desk", 
            "wall", 
            "door", 
            "chalkboard"
        ], 
        [
            "duty", 
            "desk", 
            "level", 
            "mind"
        ], 
        [
            "grammars", 
            "words", 
            "pronunciations", 
            "sentences"
        ], 
        [
            "started", 
            "ended", 
            "warned", 
            "reminded"
        ], 
        [
            "greatness", 
            "wealth", 
            "honor", 
            "failure"
        ], 
        [
            "Seldom", 
            "Hardly", 
            "Little", 
            "Totally"
        ], 
        [
            "nervously", 
            "seriously", 
            "eagerly", 
            "simply"
        ], 
        [
            "achieve", 
            "have", 
            "set", 
            "keep"
        ], 
        [
            "prepared", 
            "forced", 
            "attracted", 
            "tempted"
        ], 
        [
            "proper", 
            "exact", 
            "legal", 
            "true"
        ], 
        [
            "difficult", 
            "interesting", 
            "pleasant", 
            "significant"
        ], 
        [
            "boasted", 
            "felt", 
            "behaved", 
            "looked"
        ], 
        [
            "hope", 
            "expect", 
            "wish", 
            "imagine"
        ], 
        [
            "what", 
            "when", 
            "how", 
            "why"
        ], 
        [
            "happen", 
            "survive", 
            "gain", 
            "win"
        ], 
        [
            "adventurous", 
            "active", 
            "ready", 
            "intelligent"
        ], 
        [
            "concern", 
            "arrange", 
            "adore", 
            "desire"
        ], 
        [
            "prepare", 
            "enjoy", 
            "imagine", 
            "conduct"
        ], 
        [
            "history", 
            "nature", 
            "marriage", 
            "life"
        ], 
        [
            "suffer", 
            "experience", 
            "struggle", 
            "work"
        ]
    ], 
    "answers": [
        "D", 
        "C", 
        "B", 
        "B", 
        "A", 
        "C", 
        "B", 
        "A", 
        "A", 
        "D", 
        "D", 
        "B", 
        "C", 
        "C", 
        "A", 
        "C", 
        "D", 
        "A", 
        "D", 
        "B"
    ], 
    "source": "high1936"
}