{
    "article": "Jenna, a popular girl from Westwood Middle School, had graduated first in her class and was ready for new  _  in high school.  _  , high school was different. In the first week, Jenna went to tryouts for cheerleaders . She was competing against very talented girls, and she knew it would be  _  for her to be selected. Two hours later, the  _  read a list of the girls for a second tryout. Her heart  _  as the list ended without her name. Feeling  _  , she walked home carrying her schoolbag full of homework. Arriving home, she started with math. She had always been a good math student, but now she was  _  . She moved on to English and history, and was  _  to find that she didn't have any trouble with those subjects. Feeling better, she decided not to  worry about  math for the time being. The next day Jenna went to see Mrs. Biden about being on the school  _  . Mrs. Biden wasn't as  _  as Jenna. \"I'm sorry, but we have enough  _  for the newspaper already. Come back next year and we'll talk then.\" Jenna smiled  _  and left. \"Why is high school so  _  ?\" she sighed. Later in  _  class, Jenna devoted herself to figuring out the problems that had given her so much  _  . By the end of class, she understood how to get them right. As she gathered her books, Jenna decided she'd continue to try to  fit in  at her new school. She wasn't sure if she'd succeed, but she knew she had to  _  . High school was just as her mom had said: \"You will feel like a small fish in a big pond  instead of  a big fish in a small pond. The challenge is to become the  _  fish you can be.\"", 
    "options": [
        [
            "processes", 
            "exercises", 
            "challenges", 
            "decision"
        ], 
        [
            "Therefore", 
            "Besides", 
            "Otherwise", 
            "However"
        ], 
        [
            "difficult", 
            "interesting", 
            "boring", 
            "easy"
        ], 
        [
            "editor", 
            "judge", 
            "candidate", 
            "boss"
        ], 
        [
            "jumped", 
            "raced", 
            "stopped", 
            "sank"
        ], 
        [
            "strange", 
            "lonely", 
            "awful", 
            "happy"
        ], 
        [
            "struggling", 
            "complaining", 
            "working", 
            "improving"
        ], 
        [
            "ashamed", 
            "relieved", 
            "shocked", 
            "disappointed"
        ], 
        [
            "committee", 
            "team", 
            "radio", 
            "newspaper"
        ], 
        [
            "enthusiastic", 
            "realistic", 
            "sympathetic", 
            "artistic"
        ], 
        [
            "speakers", 
            "writers", 
            "cheerleaders", 
            "readers"
        ], 
        [
            "widely", 
            "brightly", 
            "excitedly", 
            "weakly"
        ], 
        [
            "similar", 
            "familiar", 
            "different", 
            "ordinary"
        ], 
        [
            "physics", 
            "math", 
            "English", 
            "history"
        ], 
        [
            "pleasure", 
            "sorrow", 
            "trouble", 
            "hope"
        ], 
        [
            "swim", 
            "escape", 
            "ask", 
            "try"
        ], 
        [
            "slimmest", 
            "gentlest", 
            "best", 
            "smallest"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "A", 
        "B", 
        "D", 
        "C", 
        "A", 
        "B", 
        "D", 
        "A", 
        "B", 
        "D", 
        "C", 
        "B", 
        "C", 
        "D", 
        "C"
    ], 
    "source": "high2561"
}