{
    "article": "Once upon a time there were two brothers who lived near each other. One day, they had a  _  because of some small things. And neither was willing to  _  each other. One morning, there was a knock at door of the elder brother. He  _  it and found a man standing beside the door. \"I'm a carpenter . I'm  looking for  a few days' work. Perhaps you would have a few small jobs I could help with.\" \"Yes,\" said the elder brother. \"I do have a job for you.  _  at that farm across the small river. It is my younger brother's. We had a quarrel, so I won't like to see his place or his  _  any more. I want you to build me a 8-foot  _  .\" The man said, \"I think I understand the situation. Don't worry. I'll be able to do a job that makes you  _  .\" So the elder brother was very glad and left for the town nearby. In the evening, the carpenter had just  _  his job when the elder brother returned. But he was  _  to find, instead of a fence, before him, stood a  _  , which went from one side of the river  _  the other! On the other  _  of bridge, was his younger brother. \"Do you know the name of the bridge?\" The carpenter asked. \"No,\" the elder brother was  _  . \"OK, I can tell you. Its name is understanding and  _  ,\" the carpenter smiled. Suddenly they began to understand  _  . Surely, between two brothers there should be a bridge rather than a  _  . Standing on the bridge, they  _  each other's hands with  _  in their eyes. \"Could you stay another few days? I've a lot of other work for you,\" said the elder brother. \"I'd love to  _  on,\" the carpenter said. \"But I have many more bridges to build.\"", 
    "options": [
        [
            "meeting", 
            "question", 
            "decision", 
            "quarrel"
        ], 
        [
            "forgive", 
            "like", 
            "speak", 
            "believe"
        ], 
        [
            "got", 
            "opened", 
            "shut", 
            "left"
        ], 
        [
            "See", 
            "Watch", 
            "Observe", 
            "Look"
        ], 
        [
            "house", 
            "face", 
            "farm", 
            "eyes"
        ], 
        [
            "wall", 
            "fence", 
            "road", 
            "bridge"
        ], 
        [
            "excited", 
            "pleased", 
            "moved", 
            "surprised"
        ], 
        [
            "begun", 
            "done", 
            "finished", 
            "continued"
        ], 
        [
            "surprised", 
            "happy", 
            "anxious", 
            "sad"
        ], 
        [
            "house", 
            "bridge", 
            "fence", 
            "river"
        ], 
        [
            "to", 
            "between", 
            "across", 
            "till"
        ], 
        [
            "end", 
            "side", 
            "field", 
            "stage"
        ], 
        [
            "disappointed", 
            "puzzled", 
            "amazed", 
            "worried"
        ], 
        [
            "love", 
            "hate", 
            "joy", 
            "anger"
        ], 
        [
            "everything", 
            "nothing", 
            "anything", 
            "something"
        ], 
        [
            "river", 
            "fence", 
            "farm", 
            "wall"
        ], 
        [
            "brought", 
            "took", 
            "held", 
            "clapped"
        ], 
        [
            "smiles", 
            "tears", 
            "anger", 
            "sadness"
        ], 
        [
            "leave", 
            "get", 
            "stay", 
            "work"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "B", 
        "D", 
        "C", 
        "B", 
        "B", 
        "C", 
        "A", 
        "B", 
        "A", 
        "A", 
        "B", 
        "A", 
        "A", 
        "B", 
        "C", 
        "B", 
        "C"
    ], 
    "source": "high1143"
}