{
    "article": "By my third day in the hospital, I realized Tom didn't visit. I couldn't understand  _  my best friend wouldn't come to see me. Struggling against the  _  , I phoned his  _  . His mother answered, and when I asked for Tom, she got  _  . \"He's not here right now,\" she said. I thought it was  _  that she didn't tell me where he was or  _  to have him call me. But I was so weak, I just let it  _  . I found out later that Tom's mother called my parents right after we rang  _  . My phone call really made her  _  , and she  _  they talk to me. Later that night, my mom  came by  . Did I remember drinking? Did I remember in a car?I had  no idea  what she was talking about, so she finally told me the news: I'd hit a tree. Tom, in the  _  seat, was thrown from the car and killed instantly. The only reason I'd lived was because of my  _  . My first  _  was of shock. I'd been drink-driving? Hit a tree? Killed Tom? I felt like the  worst  person in the world. Even after I was able to  go home  several weeks later, I didn't want to eat, I didn't want to talk. I just  _  at the wall in my  _  and cried. The only person I wanted to see was Tom. I didn't feel like  hanging out  with any of my old friends.", 
    "options": [
        [
            "if", 
            "whether", 
            "how", 
            "why"
        ], 
        [
            "pain", 
            "doctor", 
            "nurse", 
            "wound"
        ], 
        [
            "company", 
            "office", 
            "school", 
            "house"
        ], 
        [
            "sad", 
            "quiet", 
            "calm", 
            "excited"
        ], 
        [
            "unfair", 
            "wrong", 
            "strange", 
            "unnecessary"
        ], 
        [
            "offer", 
            "allow", 
            "permit", 
            "refuse"
        ], 
        [
            "down", 
            "alone", 
            "be", 
            "go"
        ], 
        [
            "off", 
            "up", 
            "out", 
            "back"
        ], 
        [
            "disappointed", 
            "shocked", 
            "anxious", 
            "excited"
        ], 
        [
            "hoped", 
            "wished", 
            "insisted", 
            "ordered"
        ], 
        [
            "passenger", 
            "drive", 
            "front", 
            "spare"
        ], 
        [
            "doctor", 
            "friend", 
            "luck", 
            "seat-belt"
        ], 
        [
            "view", 
            "reaction", 
            "action", 
            "idea"
        ], 
        [
            "looked", 
            "stared", 
            "glanced", 
            "glared"
        ], 
        [
            "sickroom", 
            "office", 
            "dormitory", 
            "bedroom"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "D", 
        "B", 
        "C", 
        "A", 
        "D", 
        "A", 
        "C", 
        "C", 
        "A", 
        "D", 
        "B", 
        "B", 
        "D"
    ], 
    "source": "high17"
}