{
    "article": "Last year I went to America and stayed there with an American family for two months.\n   As is said, \"the best house is in America, the best wife is in Japan, and the best food is in China.\" So I36 _  pride and pleasure to37 _ \"the best food\" for my American family. Each day, regardless of my poor skill of cooking, I would do something in   a new   way: changing the dishes color1, the meat's type or the soup's style. Thus, my American friends could discover the   _  of eating Chinese food. Because of my \"40 _ \" job, I was often rewarded by their41 _  of thanks such as \"very delicious\", \"excellent\", etc.\n   But something funny happened yesterday when I cooked Sichuan style 42 _  for dinner. I was43 _ with my work.\n   When the whole family sat round the table, they first looked 44 _  at the fish, then looked at me. \"Why do all the fish have their45 _ ?\" they asked,\"It's terrible!\"\n   Beautiful or terrible?I can't understand. But I 46 do  know that fish heads are delicious. The47 _  is the best part of fish; in48 China  only the important guest can have the honor of 49 enjoying  it.\n   Another 50 _  thing is: the American friends often said to me\"  51 help yourself   \"as they 52 brought home fruits or other things. According to Chinese tradition I would simply smile in answer to their kindness  53 without  actually helping myself to any of the food. 54 In return  , I said \"help yourself\" to them whenever I brought home fruits. Dear me! No matter how much or how often I brought home food, as long as it was nice to their taste, they55 _ hesitated\n  to use their hands to \"help themselves\" until all was finished.", 
    "options": [
        [
            "took", 
            "shared", 
            "held", 
            "had"
        ], 
        [
            "leave", 
            "fetch", 
            "cook", 
            "buy"
        ], 
        [
            "importance", 
            "joy", 
            "trouble", 
            "way"
        ], 
        [
            "new", 
            "daily", 
            "good", 
            "hard"
        ], 
        [
            "smile", 
            "flowers", 
            "talk", 
            "expressions"
        ], 
        [
            "egg", 
            "fish", 
            "soup", 
            "meat"
        ], 
        [
            "surprised", 
            "pleased", 
            "good", 
            "praised"
        ], 
        [
            "worriedly", 
            "excitedly", 
            "surprisedly", 
            "happily"
        ], 
        [
            "heads", 
            "skins", 
            "tails", 
            "bones"
        ], 
        [
            "flesh", 
            "head", 
            "soup", 
            "tail"
        ], 
        [
            "easy", 
            "exciting", 
            "interesting", 
            "real"
        ], 
        [
            "had", 
            "often", 
            "never", 
            "usual"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "B", 
        "C", 
        "D", 
        "B", 
        "B", 
        "C", 
        "A", 
        "B", 
        "C", 
        "C"
    ], 
    "source": "high1067"
}