{
    "article": "When I was in primary school, I got into an argument with a boy in my class. I have forgotten  _  the argument was about, but I have never forgotten the  _  learnt that day. I was convinced that \"I\" was right and \"he\" was wrong ----- and he was just as convinced that I was wrong and \"he\" was right. The teacher decided to  _  us a very important lesson. She brought us up to the front of the class and  _  him on one side of her desk and me on the other. In the middle of her desk was a large, round object. I could  _  see that it was black. She asked the boy what  _  the object was \"White\", he answered. I couldn't  _  he said the object was white, for it was obviously black! Another argument started between my classmates anytime, this time about the color of the object. The teacher told me to go to stand where the boy had been  _  and told him to come to stand where I had been. We  _  places, and now she asked me what the color of the object was. I had to answer, \"white\". It was an object with two differently-colored sides, and from his viewpoint it was white.  _  from my side was it black. My teacher taught me a very important lesson that day: You must stand in the other persons' shoes and look at the  _  through their eyes in order to truly understand their  _  .", 
    "options": [
        [
            "how", 
            "which", 
            "what", 
            "who"
        ], 
        [
            "theory", 
            "way", 
            "lesson", 
            "knowledge"
        ], 
        [
            "teach", 
            "tell", 
            "realize", 
            "recognize"
        ], 
        [
            "avoided", 
            "gained", 
            "watched", 
            "placed"
        ], 
        [
            "hardly", 
            "quickly", 
            "smartly", 
            "clearly"
        ], 
        [
            "color", 
            "shape", 
            "material", 
            "property"
        ], 
        [
            "understand", 
            "believe", 
            "surprise", 
            "relieve"
        ], 
        [
            "listening", 
            "noticing", 
            "standing", 
            "thinking"
        ], 
        [
            "rushed", 
            "remained", 
            "delivered", 
            "changed"
        ], 
        [
            "Though", 
            "Yet", 
            "Only", 
            "However"
        ], 
        [
            "situation", 
            "crack", 
            "limitation", 
            "ideal"
        ], 
        [
            "position", 
            "view", 
            "values", 
            "feelings"
        ]
    ], 
    "answers": [
        "C", 
        "C", 
        "A", 
        "D", 
        "D", 
        "A", 
        "A", 
        "C", 
        "D", 
        "C", 
        "A", 
        "D"
    ], 
    "source": "high2382"
}