{
    "article": "On Easter Day 1722,some European explorers found a lonely island in the middle of the Pacific Ocean. They   named  it\nEaster Island. The explorers found that the island had good soil  _  the 200 natives living there survived with little food. Even more  _  , these people also lived among the ruins of what might have been a once\ngreat civilization. All that is left of it are around 800 giant stone statues  resembling  human heads. They  _  up to 270 tons and\nthe tallest measures over 11 metres. The stone men face  _  ,\nrather than out to sea, and their eyes are focused upon the sky. They are all\ncarved from  _  volcanic rock   and some have hats on their heads and eyes made from white coral. Since their   _  , these huge stone men  have created  one of the greatest\nmysteries of all time. Who built them? Why did they do it? Some experts believe\nthe stone men are  _  to Inca stonework, and\nsuggest the figures were created by people of Peruvian descent  .   _  have even gone so far as to say that they came from outer space. The\nlatest suggestion  is based on  the idea that Easter Island\nrepresents one of the worst cases of resource abuse in human history. It is\nsaid that a small group of Asians settled on Easter Island  sometime  between 400 and 700 AD. They developed a great civilization with huge\nforests and  plenty of  food. At the peak of their\ncivilization, the people began to build the giant  _  men.\nWhy they did this is still  _  but it is possible\nthe figures represent the settlers' gods or ancestors.  _  the\nstatues grew larger, the people's lifestyles became more and more wasteful. The\nforest began to disappear, which  resulted in  all the\nanimals dying out.  The people  couldn't get food and were\nforced to eat other humans. Society began to  break down  and\nthe islanders themselves finally destroyed the stone men.", 
    "options": [
        [
            "and", 
            "but", 
            "however", 
            "still"
        ], 
        [
            "surprise", 
            "surprised", 
            "surprising", 
            "surprisingly"
        ], 
        [
            "weigh", 
            "lift", 
            "get", 
            "measure"
        ], 
        [
            "forward", 
            "outward", 
            "onward", 
            "inward"
        ], 
        [
            "broken", 
            "soft", 
            "hard", 
            "burnt"
        ], 
        [
            "looking", 
            "invention", 
            "discovery", 
            "covering"
        ], 
        [
            "usual", 
            "common", 
            "familiar", 
            "similar"
        ], 
        [
            "Another", 
            "Other", 
            "Others", 
            "Many"
        ], 
        [
            "clever", 
            "stone", 
            "wooden", 
            "iron"
        ], 
        [
            "welcome", 
            "known", 
            "unimportant", 
            "unknown"
        ], 
        [
            "While", 
            "After", 
            "With", 
            "As"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "A", 
        "D", 
        "B", 
        "C", 
        "D", 
        "C", 
        "B", 
        "D", 
        "D"
    ], 
    "source": "high1871"
}