{
    "article": "\"I am going home to Denmark, Son, and I just want to tell you I love you.\" In my dad's last telephone call to me, he  _  that line several times in half an hour. I wasn't listening at the right level. I heard the words, but not the message, and  _  not their deeper meaning. I believed my dad would live to be 100 years old,  _  my great uncle lived to be 107 years old. I hadn't felt his  _  over Mum's death, understood his loneliness or  _  most of his friends had left the world. He often asked my brother and me to create grandchildren  so that  he could be a devoted grandfather. I was too busy with my business to really listen. \"Dad's dead,\" sighed my brother not long after dad went back to Denmark. I was  _  and just cried for the loss of my dad. This isn't the  _  it's supposed to happen. If I had known these were to be dad's final days, I would have asked to go with him to Denmark. If I had been really listening and thinking, I would have offered comfort during his final hours. After all, a loved one should hold his hand and  _  him as he makes the transition from reality to another world. Dad  _  his departure repeatedly, but I  _  it. I felt sadness, pain and regret. Why had I not been there for him? He'd always been there for me. In the mornings when I was nine years old, he  _  come home from working 18 hours and  _  me up by patting my back lightly with his strong powerful hands and whispering, \"Time to get up, Son.\"  By the time  I was dressed and ready to go, he had put my schoolbag in my bicycle basket. Recalling these  _  moments with dad brings tears to my eyes. Now my heart is still in  _  because dad was there for me and I wasn't there for him. My hearty  _  is: always, always seize the moment to  _  your love with your loved ones, and keep them  _  when they leave the world. Experiencing the  _  of death with one you love will make you understand the meaning of life better.", 
    "options": [
        [
            "held", 
            "repeated", 
            "signed", 
            "declared"
        ], 
        [
            "possibly", 
            "fortunately", 
            "certainly", 
            "occasionally"
        ], 
        [
            "and", 
            "so", 
            "as", 
            "while"
        ], 
        [
            "sorrow", 
            "shock", 
            "disappointment", 
            "disadvantage"
        ], 
        [
            "achieved", 
            "regarded", 
            "admitted", 
            "realized"
        ], 
        [
            "speechless", 
            "hopeless", 
            "useless", 
            "homeless"
        ], 
        [
            "thing", 
            "result", 
            "case", 
            "way"
        ], 
        [
            "comfort", 
            "believe", 
            "blame", 
            "educate"
        ], 
        [
            "abandoned", 
            "afforded", 
            "announced", 
            "allowed"
        ], 
        [
            "damaged", 
            "missed", 
            "lost", 
            "replaced"
        ], 
        [
            "would", 
            "should", 
            "could", 
            "might"
        ], 
        [
            "dress", 
            "bring", 
            "break", 
            "wake"
        ], 
        [
            "terrible", 
            "sweet", 
            "stressful", 
            "delighted"
        ], 
        [
            "trouble", 
            "danger", 
            "confusion", 
            "pain"
        ], 
        [
            "advice", 
            "wish", 
            "dream", 
            "aim"
        ], 
        [
            "provide", 
            "spare", 
            "share", 
            "mix"
        ], 
        [
            "safe", 
            "company", 
            "alive", 
            "informed"
        ], 
        [
            "possibility", 
            "process", 
            "strength", 
            "warning"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "C", 
        "A", 
        "D", 
        "A", 
        "D", 
        "A", 
        "C", 
        "B", 
        "A", 
        "D", 
        "B", 
        "D", 
        "A", 
        "C", 
        "B", 
        "B"
    ], 
    "source": "high2049"
}