{
    "article": "Two men, both seriously ill, were in the same hospital room. One man was allowed to  _  up in his bed for an hour each afternoon. His bed was  next to  the room's only window. The other man on the other side of the room had to  _  all his time lying on his back in bed. Every afternoon when the man by the window could sit up he  _  pass the time by describing to his  _  all the things he could see outside the window. \"The window overlooks a  _  with a lovely lake. Ducks and swans play on the water  _  children sail their model boats. Young lovers walk  arm in arm  among flowers of every colour. Grand old trees grace the landscape, and a fine  _  of the city skyline can be seen in the distance.\" As the man by the window  _  all this in detail, the man on the other side of the room would close his eyes and  _  the scene. Days and weeks passed. On morning, the day nurse came only to find the man by the window had died  _  in his sleep. When the man's body was  taken away  , the other man asked if he could be moved next to the  _  . The nurse agreed and after making sure he was  _  , she left. Slowly and painfully, the man raised himself  _  to take his first look at the  _  world outside by himself. But to his  _  , he found it faced nothing  _  a blank wall. In fact, the man by the window was  _  and could not even see the wall. He just wanted to encourage his roommate.", 
    "options": [
        [
            "wake", 
            "climb", 
            "sit", 
            "stand"
        ], 
        [
            "spend", 
            "lose", 
            "waste", 
            "save"
        ], 
        [
            "could", 
            "would", 
            "might", 
            "should"
        ], 
        [
            "doctor", 
            "nurse", 
            "friend", 
            "roommate"
        ], 
        [
            "wall", 
            "street", 
            "fence", 
            "park"
        ], 
        [
            "when", 
            "while", 
            "since", 
            "though"
        ], 
        [
            "view", 
            "sign", 
            "symbol", 
            "mark"
        ], 
        [
            "explained", 
            "described", 
            "watched", 
            "heard"
        ], 
        [
            "think", 
            "expect", 
            "imagine", 
            "guess"
        ], 
        [
            "peacefully", 
            "bravely", 
            "helplessly", 
            "sadly"
        ], 
        [
            "wall", 
            "park", 
            "lake", 
            "window"
        ], 
        [
            "dead", 
            "amazed", 
            "comfortable", 
            "encouraged"
        ], 
        [
            "planning", 
            "trying", 
            "refusing", 
            "wishing"
        ], 
        [
            "previous", 
            "embarrassing", 
            "beautiful", 
            "favorite"
        ], 
        [
            "horror", 
            "delight", 
            "surprise", 
            "sadness"
        ], 
        [
            "like", 
            "as", 
            "but", 
            "and"
        ], 
        [
            "dead", 
            "deaf", 
            "pitiful", 
            "blind"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "B", 
        "D", 
        "D", 
        "B", 
        "A", 
        "B", 
        "C", 
        "A", 
        "D", 
        "C", 
        "B", 
        "C", 
        "C", 
        "C", 
        "D"
    ], 
    "source": "high2259"
}