{
    "article": "One day, a well-known speaker was invited to give a lecture to an audience of 200. He started his lecture by  holding up  a $ 20 bill. He looked around the room, and asked, \"Who would like this $20 bill?\"  _  started going up. He said, \"I am going to  _  this $20 to one of you, but first, let me do this.\" He crumpled up the 20-dollar bill. He then asked, \"Who  _  wants it?\" Still the hands were  _  in the air. \"Well\", he replied,\"  What if  I do this ?\" And he dropped it on the  _  and started to step on it with his shoes. He picked it up. Now it was crumpled and  _  . \"Now, who wants it?\" Still the hands went into the air. \"My friends, we have all learned a very  _  lesson. No matter what I did to the  _  , you still want it because it doesn't decrease in  _  . It is still worth $20, with  _  we can buy what we need. Many times in our lives, we are  _  , and trampled underfoot by the decision we  _  and the circumstances that come our way. We feel  as though  we were worthless. But no matter what has happened or what may happen to us, you will never  _  your value. Dirty or clean, you are still priceless to those who do love you. The worth of our lives is determined not by  _  we do or who we know, but by who we are. You are  _  . Don't ever forget it.\" If you  _  this lesson in mind, it will help you to  stand up  again when you fall. Each time it makes you grow much stronger.", 
    "options": [
        [
            "Chats", 
            "Voices", 
            "Hands", 
            "Talks"
        ], 
        [
            "pass", 
            "give", 
            "show", 
            "lend"
        ], 
        [
            "ever", 
            "even", 
            "also", 
            "still"
        ], 
        [
            "on", 
            "off", 
            "up", 
            "out"
        ], 
        [
            "floor", 
            "desk", 
            "shelf", 
            "dustbin"
        ], 
        [
            "usable", 
            "small", 
            "dirty", 
            "old"
        ], 
        [
            "meaningless", 
            "amazing", 
            "rare", 
            "valuable"
        ], 
        [
            "money", 
            "paper", 
            "book", 
            "card"
        ], 
        [
            "shape", 
            "value", 
            "quality", 
            "size"
        ], 
        [
            "which", 
            "what", 
            "that", 
            "whose"
        ], 
        [
            "warned", 
            "pushed", 
            "dropped", 
            "reminded"
        ], 
        [
            "prefer", 
            "receive", 
            "face", 
            "make"
        ], 
        [
            "take", 
            "lose", 
            "miss", 
            "win"
        ], 
        [
            "how", 
            "what", 
            "where", 
            "who"
        ], 
        [
            "honest", 
            "wise", 
            "young", 
            "special"
        ], 
        [
            "keep", 
            "forget", 
            "impress", 
            "leave"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "D", 
        "C", 
        "A", 
        "C", 
        "D", 
        "A", 
        "B", 
        "A", 
        "C", 
        "D", 
        "B", 
        "B", 
        "D", 
        "A"
    ], 
    "source": "high2378"
}