{
    "article": "A woman in a(n)41 _  suit stepped in.\"Hi, Libby.\" she said.Wow, what a    _  ! The first time she came to the cafe two years ago, she had no money to pay.   _   many customers, she volunteered to wash dishes and   _  . Look at her now: confident and hopeful. Wasn't this what we'd hoped for?\nIn 2003, we'd   _   this crazy dream: start a restaurant with a donation box instead of a cash register . Right away we hit hurdles  \" There is no such thing as a   _  lunch,\" one potential landlord sniffed. I met brokers, bankers and suppliers, only to watch them   walk away  , shaking their heads. No bank would lend us the money to open a restaurant with no   cash register    . The only fund we could get was our individual retirement account.   _   we rented space from a landlord on Colfax Street.We put flyers   around the neighborhood, asked friends to   _  the word, and held our breath.\nWord traveled fast,   thanks to   stories in the papers and on TV. Soon we had more than 50customers a day.A few ate without paying or   _   an hour of work. But most gave what they could,   even if  it was just a dollar. Those with money gave, and then more.One of our customers left a   _   for 500 dollars. Another bought 1000 dollars in gift certificates.   _  another donated a truck so we could transport   _   from suppliers.\nPeople came here partly for what our cafe   stood for   --SAME: So A11 May Eat, We   _  everyone with dignity  . We hoped to develop a sense of community---so that we might  _   one another. The woman in business suit was one of them. Our   _   to open the cafe was worth it.", 
    "options": [
        [
            "dinner", 
            "evening", 
            "business", 
            "summer"
        ], 
        [
            "change", 
            "beauty", 
            "fool", 
            "fun"
        ], 
        [
            "With", 
            "Like", 
            "Besides", 
            "Towards"
        ], 
        [
            "wait", 
            "sing", 
            "perform", 
            "sweep"
        ], 
        [
            "lived", 
            "hatched", 
            "ignored", 
            "achieved"
        ], 
        [
            "packed", 
            "delicious", 
            "free", 
            "delivered"
        ], 
        [
            "Unfortunately", 
            "Finally", 
            "Interestingly", 
            "Illegally"
        ], 
        [
            "analyze", 
            "read", 
            "spread", 
            "approve"
        ], 
        [
            "regretting", 
            "gaining", 
            "donating", 
            "balancing"
        ], 
        [
            "reward", 
            "check", 
            "bill", 
            "list"
        ], 
        [
            "Still", 
            "Instead", 
            "Otherwise", 
            "Thus"
        ], 
        [
            "lunch", 
            "customers", 
            "dish", 
            "produce"
        ], 
        [
            "respect", 
            "like", 
            "watch", 
            "treat"
        ], 
        [
            "protect", 
            "trust", 
            "help", 
            "treasure"
        ], 
        [
            "goal", 
            "struggle", 
            "management", 
            "style"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "B", 
        "D", 
        "B", 
        "C", 
        "B", 
        "C", 
        "C", 
        "B", 
        "A", 
        "D", 
        "D", 
        "C", 
        "B"
    ], 
    "source": "high333"
}