{
    "article": "For John and Amy, birthdays have always been a big deal--a welcome excuse to celebrate life. When their son, Alex,  _  three in 2005, they invited 20 friends to a nearby park. Not long after that the  _  were brainstorming ways to teach Alex about giving to  others  . \"We wanted to do something that would have a(n)  _  on our community , and that our young child could  _  in. We started wondering what  _  fortunate kids do on their birthdays. The next day, we called a local shelter, and learnt that  _  children typically didn't do  _  to celebrate at all. No cake. No gifts. No party.\" The couple said. Several weeks later,  the family  threw a party at the  _  for the children who had birthdays that month. They decorated, served cake, and danced with 50 kids. Alex helped  pass out  presents.  _  that first party, the couple have turned their simple idea  _  Birthday Blessings, a non-profit that hosts monthly parties at 10 shelters. To date, Birthday Blessings (birthdayblessings.org.) has thrown more than 500  _  at different shelters and handed out 22,000 party  _  to nearly 4,000 homeless children in and around their community. Birthday Blessings is  _  entirely by volunteers. The charity will take almost anything -- toys, clothing, candy, baby items--  as long as  it's not used. \"These kids never get anything new.\" John said, \"It makes a big  _  to them psychologically.\" Being \"part of this labor love\" is  _  making an impression on their son Alex. On his seventh birthday, his grandparents sent a check.  _  it, the first thing he said was that he wanted to give half to the birthday kids.", 
    "options": [
        [
            "turned", 
            "grew", 
            "came", 
            "got"
        ], 
        [
            "shelters", 
            "neighbors", 
            "friends", 
            "couple"
        ], 
        [
            "impression", 
            "influence", 
            "permission", 
            "limitation"
        ], 
        [
            "participate", 
            "take", 
            "bring", 
            "move"
        ], 
        [
            "fairly", 
            "less", 
            "rather", 
            "more"
        ], 
        [
            "penniless", 
            "jobless", 
            "homeless", 
            "hopeless"
        ], 
        [
            "nothing", 
            "anything", 
            "everything", 
            "something"
        ], 
        [
            "shelter", 
            "church", 
            "school", 
            "community"
        ], 
        [
            "Before", 
            "Until", 
            "After", 
            "Since"
        ], 
        [
            "into", 
            "down", 
            "out", 
            "off"
        ], 
        [
            "birthdays", 
            "parties", 
            "presents", 
            "donations"
        ], 
        [
            "cakes", 
            "honors", 
            "favors", 
            "surprises"
        ], 
        [
            "continued", 
            "undertaken", 
            "operated", 
            "performed"
        ], 
        [
            "difference", 
            "surprise", 
            "benefit", 
            "advantage"
        ], 
        [
            "never", 
            "always", 
            "hardly", 
            "already"
        ], 
        [
            "Realizing", 
            "Saving", 
            "Opening", 
            "Folding"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "B", 
        "A", 
        "B", 
        "C", 
        "B", 
        "A", 
        "D", 
        "A", 
        "B", 
        "C", 
        "C", 
        "A", 
        "D", 
        "C"
    ], 
    "source": "high1675"
}