{
    "article": "When Mr. Smith was walking one evening, he met four of his old friends. To be polite, he invited them to come home with him to  _  . He hoped that they would say no, but  to his surprise  , they quickly agreed and  went  home with him. Mr. Smith was a  _  man. There was never  much food  in his house. He knew that there  would be  very little for supper that night,  _  he did not know how to break away from his guests without being impolite, so he let them come with him to  _  house. But when they came  _  his front door, he suddenly rushed forward, opened the door, went in, closed in again and then locked it. He found  his wife  in the kitchen and quickly told her  _  had happened. Mr. Smith's guests were at first  _  . Then they thought he had perhaps gone ahead to get ready for the  _  . When nothing had yet happened for a few minutes, they began to  get angry  and to knock heavily at the door. After this had gone for some time, Mr. Smith sent his wife to a window to talk to  his friends  . She told them that Mr. Smith  wasn't in  . \"What do you mean, woman?\" shouted one of the men. \"We came here a few minutes ago  with him  and we saw him go into the house.\" Mr. Smith was now afraid that the noise  that  his friends were making would bring his neighbours around and that he would be  laughed at  , so he put his head out of the window and said to his friends, \"This house has a  _  door, too. Perhaps Mr. Smith came in through the front door and went out through the other.\"", 
    "options": [
        [
            "breakfast", 
            "lunch", 
            "supper", 
            "play"
        ], 
        [
            "poor", 
            "rich", 
            "strong", 
            "honest"
        ], 
        [
            "so", 
            "but", 
            "that", 
            "if"
        ], 
        [
            "their", 
            "a", 
            "his", 
            "her"
        ], 
        [
            "nearly", 
            "near", 
            "close", 
            "out"
        ], 
        [
            "that", 
            "it", 
            "what", 
            "this"
        ], 
        [
            "angry", 
            "interested", 
            "hungry", 
            "surprised"
        ], 
        [
            "water", 
            "room", 
            "bed", 
            "food"
        ], 
        [
            "front", 
            "back", 
            "big", 
            "next"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "B", 
        "C", 
        "B", 
        "C", 
        "D", 
        "D", 
        "B"
    ], 
    "source": "high2745"
}