{
    "article": "Benjamin Franklin invented a lot of things which made people's life easier. One of his earlier inventions was paddles for swimming. Ben had  _  if there were some way to help people  _  faster. He thought hard and slowly a picture of swimming paddles grew in his  _  . The paddles must be neither too big nor too small. The wood which  was used for  the paddles must be neither too heavy nor too  _  . He began to work on the paddles and a few days later the paddles were finished. And then on the next Saturday afternoon Ben decided to try them out at Green's pond  _  there were about a hundred boys waiting. All of them had heard of Ben's idea and wanted to see whether the paddle would  _  . They were talking to each other, \"What's to be done if the paddles don't work?\" \"What if he goes down?\" When Ben got into the  _  , he began to paddle. At first the swam  _  , then faster and faster until he was going through the water like a fish. The boys had  _  seen such a fast swimmer. The paddles did work. All of the boys cheered loudly for Ben, jumping up and down with joy.", 
    "options": [
        [
            "doubted", 
            "wondered", 
            "asked", 
            "tried"
        ], 
        [
            "travel", 
            "run", 
            "boat", 
            "swim"
        ], 
        [
            "heart", 
            "family", 
            "hand", 
            "mind"
        ], 
        [
            "light", 
            "small", 
            "big", 
            "slow"
        ], 
        [
            "that", 
            "where", 
            "which", 
            "when"
        ], 
        [
            "welcome", 
            "act", 
            "work", 
            "do"
        ], 
        [
            "water", 
            "river", 
            "sea", 
            "boat"
        ], 
        [
            "slowly", 
            "carefully", 
            "easily", 
            "happily"
        ], 
        [
            "always", 
            "almost", 
            "never", 
            "seldom"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "D", 
        "A", 
        "B", 
        "C", 
        "A", 
        "A", 
        "C"
    ], 
    "source": "high2493"
}