{
    "article": "In order to tell what I believe, I must briefly introduce some of my personal history. The turning point of my life was my decision to give up a promising business career and study music. My parents, sharing my love of music,  _  of it as a profession. This was understandable in view of the family  _  . My grandfather had taught music for nearly forty years and earned barely enough to  _  for his large family. My father often said it was only the hardheaded thriftiness of my grandmother that helped the family live a life. As a(an)  _  of this example in the family, my mention of music as a profession carried with it a picture of an existence with  _  financial rewards. My parents insisted upon college instead of a conservatory of a career of music, and so finally I went to college quite happily. Before my graduation from Columbia, the family met with severe financial problems and I felt it my duty to  _  college and take a job. Thus was I started a business career - which I always think of as the wasted years. Now I do not for a moment mean to disparage business. My whole point I is that it was not for me. I went into it for  _  , and apart from the satisfaction of being able to help the family, money is all I got out of it. It was not enough. I felt that life was passing me by. From being merely dissatisfied I became really  _  . I knew what I wanted is to save enough to  _  and go to Europe to study  _  . I used to get up at dawn to practice before I left for \"downtown\", disappointing my poor mother by eating a hurried breakfast at the last minute. I continued to make money, and finally, bit by bit, saved enough to  _  me to go abroad. And, by now, the family didn't need my help any longer. I ended my business career, feeling like a man released from prison, and sailed for Europe. I stayed four years, worked harder than ever and  _  every minute of it. \"Enjoyed\" is too mild a word. I walked on air. I really lived. I was a  _  man and I was doing what I loved to do and what I was meant to do. If I had stayed in business, I might be a  _  man today, but I do not believe I would have made a success of living. I would have given up all those inner satisfactions, which money can never buy. When I broken away from business, it was against the advice of all my friends and family. Most of us are so accustomed to the association of success with money  _  the thought of giving up a good income for an idea seemed rather crazy. If so, all I can say is \"Ah! It's great to be crazy.\"", 
    "options": [
        [
            "thought", 
            "disapproved", 
            "agreed", 
            "disagreed"
        ], 
        [
            "background", 
            "experience", 
            "tradition", 
            "belief"
        ], 
        [
            "offer", 
            "support", 
            "provide", 
            "give"
        ], 
        [
            "expectation", 
            "intention", 
            "cause", 
            "consequence"
        ], 
        [
            "certain", 
            "uncertain", 
            "sure", 
            "ensured"
        ], 
        [
            "enter", 
            "join", 
            "leave", 
            "apply"
        ], 
        [
            "interest", 
            "dreams", 
            "money", 
            "hope"
        ], 
        [
            "painful", 
            "excited", 
            "embarrassed", 
            "cheerful"
        ], 
        [
            "drop", 
            "satisfy", 
            "live", 
            "quit"
        ], 
        [
            "music", 
            "medicine", 
            "economy", 
            "Business"
        ], 
        [
            "let", 
            "make", 
            "encourage", 
            "enable"
        ], 
        [
            "spent", 
            "enjoyed", 
            "wasted", 
            "used"
        ], 
        [
            "free", 
            "wealthy", 
            "creative", 
            "enthusiastic"
        ], 
        [
            "strong", 
            "successful", 
            "wealthy", 
            "satisfied"
        ], 
        [
            "it", 
            "which", 
            "that", 
            "as"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "D", 
        "B", 
        "C", 
        "C", 
        "A", 
        "D", 
        "A", 
        "D", 
        "B", 
        "A", 
        "C", 
        "C"
    ], 
    "source": "high1302"
}