{
    "article": "Long ago there was a poor farmer in Russia. He had been very  _  with everything he had. However, when he found his elder brother was  _  than him, he felt disappointed. So he  _  hard about how he could also be richer. Finally he got an idea. He started to spend less money on food and clothes to  _  some money to buy more land. Once he had enough money, he started  _  for land. He  _  that on the neighboring land, there were some nomads living there. He bought some gifts and went to  _  their head. He presented the gifts to the head and told him the  _  of his visit. The head welcomed him, accepted the gifts and agreed to his  _  to get the land. The head told him that he could have the land  _  giving him anything. He can take as much land as he could  _  by walking through the land before sunset . He should start in the morning and whatever distance he could travel during the  _  , he could have it. The farmer became very  _  when he heard this offer. Now he could have lots of  _  without paying anything. He came  _  the next morning and started running, not walking,  so that  he could cover the largest area. To reach his goal, he neither ate food, nor drank water, nor had any rest. He just continued  _  . Without eating, or drinking, or resting he just got very  _  . When he came back to the head in the evening, he  _  right on the spot. Sadly his son buried him in a piece of land about 6 x 4 feet. Don't be greedy or you will  _  everything finally.", 
    "options": [
        [
            "careful", 
            "pleased", 
            "bored", 
            "busy"
        ], 
        [
            "healthier", 
            "stronger", 
            "richer", 
            "cleverer"
        ], 
        [
            "thought", 
            "learned", 
            "tried", 
            "worked"
        ], 
        [
            "borrow", 
            "spend", 
            "make", 
            "save"
        ], 
        [
            "waiting", 
            "looking", 
            "preparing", 
            "caring"
        ], 
        [
            "explained", 
            "hoped", 
            "noticed", 
            "guessed"
        ], 
        [
            "see", 
            "follow", 
            "help", 
            "cheat"
        ], 
        [
            "chance", 
            "result", 
            "condition", 
            "purpose"
        ], 
        [
            "promise", 
            "request", 
            "suggestion", 
            "order"
        ], 
        [
            "for", 
            "by", 
            "without", 
            "before"
        ], 
        [
            "cover", 
            "farm", 
            "buy", 
            "have"
        ], 
        [
            "year", 
            "month", 
            "week", 
            "day"
        ], 
        [
            "interested", 
            "sad", 
            "happy", 
            "calm"
        ], 
        [
            "land", 
            "crop", 
            "experience", 
            "knowledge"
        ], 
        [
            "quietly", 
            "early", 
            "finally", 
            "suddenly"
        ], 
        [
            "dreaming", 
            "walking", 
            "speaking", 
            "running"
        ], 
        [
            "nervous", 
            "excited", 
            "tired", 
            "worried"
        ], 
        [
            "refused", 
            "died", 
            "appeared", 
            "rested"
        ], 
        [
            "lose", 
            "face", 
            "change", 
            "defeat"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "D", 
        "B", 
        "C", 
        "A", 
        "D", 
        "B", 
        "C", 
        "A", 
        "D", 
        "C", 
        "A", 
        "B", 
        "D", 
        "C", 
        "B", 
        "A"
    ], 
    "source": "high2250"
}