{
    "article": "I had just started my second year studying at Cambridge University when I was faced with the news I had never expected. A lump in my neck   _   out to be cancer. I would   _   six months of chemotherapy .\nAfter the shock, I was struck by this thought: my   _   didn't have any room for cancer. I had so much I wanted to   _   and so many goals I wanted to chase.\nI was faced with the   _   job of telling my friends and family. Then, I had to decide whether to 26 _  in Cambridge and take five exams at the end of the year. My doctor   _  against it, and so did my parents and teachers.\nMy doctors and teachers convinced me that taking some time off to   _   and relax would be the best thing for me. I could not think of anything   _  . I did not want to 30 _  a year of my life, receiving pity from those around me.\nTogether with my parents, I tried to persuade the university to   _   me to stay at Cambridge and study only halt the course. At the end of the year I would take two exams. It was really a   _   to persuade them to agree.\nTreatment began and I was up and down from Cambridge to London every other week. It made me feel   _  , but to a much lesser degree than I had expected. I was   _   to read, eat and socialize exactly as I used to. I slept a lot and rested a lot, but I also worked hard at my studies. It gave me focus, and it also gave me purpose. Completing my   _   at the end of term felt like a great personal victory.\nI took a   _   to continue studying while undergoing treatment, and it   paid off   I was successful in my exams--and more   _  , I made a full recovery.\nEvery person facing a disease like cancer must make the   _   that are right for them. I am   _   that I made the decision that was right for me.", 
    "options": [
        [
            "stuck", 
            "came", 
            "turned", 
            "worked"
        ], 
        [
            "require", 
            "expect", 
            "sense", 
            "arrange"
        ], 
        [
            "body", 
            "memories", 
            "family", 
            "dreams"
        ], 
        [
            "face", 
            "achieve", 
            "show", 
            "understand"
        ], 
        [
            "necessary", 
            "temporary", 
            "difficult", 
            "disappointing"
        ], 
        [
            "join", 
            "treat", 
            "settle", 
            "continue"
        ], 
        [
            "fought", 
            "advised", 
            "acted", 
            "decided"
        ], 
        [
            "recover", 
            "exercise", 
            "study", 
            "play"
        ], 
        [
            "better", 
            "worse", 
            "more", 
            "less"
        ], 
        [
            "save", 
            "spend", 
            "take", 
            "miss"
        ], 
        [
            "help", 
            "remind", 
            "allow", 
            "invite"
        ], 
        [
            "struggle", 
            "failure", 
            "burden", 
            "trouble"
        ], 
        [
            "tired", 
            "relaxed", 
            "confident", 
            "nervous"
        ], 
        [
            "afraid", 
            "ready", 
            "able", 
            "eager"
        ], 
        [
            "purpose", 
            "projects", 
            "treatment", 
            "exams"
        ], 
        [
            "rest", 
            "risk", 
            "privilege", 
            "job"
        ], 
        [
            "clearly", 
            "interestingly", 
            "specifically", 
            "importantly"
        ], 
        [
            "choices", 
            "changes", 
            "efforts", 
            "chances"
        ], 
        [
            "surprised", 
            "excited", 
            "determined", 
            "proud"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "B", 
        "C", 
        "D", 
        "B", 
        "A", 
        "B", 
        "D", 
        "C", 
        "A", 
        "A", 
        "C", 
        "B", 
        "B", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "high790"
}