{
    "article": "The passengers on the bus watched sympathetically  as the attractive young woman with the white cane made her way carefully up the steps. She11 _ the driver and, using her hands to feel the 12 _ of the seats, walked down and found the13 _ which the driver had told her was empty. Then she settled in.\nIt's a year since Susan, 34,14 as a result of a medical misdiagnosis  , was suddenly thrown into a world of15 _ . Mark, her husband, was an Air Force officer and he loved Susan with all his heart. He  _  her how to depend on her other  _  especially her hearing, to decide where she was and  _  to adapt herself to the new environment. He helped her befriend the bus drivers who could  _  for her, and save her a seat.\n  _  , Susan decided that she was ready to try the  _  on her own. Monday morning, she said good-bye and for the first time, they went their  _  ways.\nOn Friday morning, Susan took the bus to work as usual. As she was  getting off  the bus, the driver said, \"Lady, I  _  envy  you.\" Susan had no  _  what the driver was talking about, and asked, \"What do you  _  ?\"\nThe driver answered, \"You know, every morning for the  _  week, a fine-looking gentleman in a military uniform has been standing   _  the corner,   _   you as you get off the bus. He  makes sure  you cross the street safely and he watches until you enter your office building. You are one lucky lady.\"           \nTears of gratitude  poured down Susan's cheeks.", 
    "options": [
        [
            "thanked", 
            "asked", 
            "discovered", 
            "paid"
        ], 
        [
            "position", 
            "shape", 
            "size", 
            "cost"
        ], 
        [
            "ticket", 
            "bus", 
            "seat", 
            "bag"
        ], 
        [
            "anger", 
            "darkness", 
            "happiness", 
            "light"
        ], 
        [
            "asked", 
            "encouraged", 
            "taught", 
            "appreciated"
        ], 
        [
            "feelings", 
            "sights", 
            "senses", 
            "abilities"
        ], 
        [
            "how", 
            "when", 
            "where", 
            "who"
        ], 
        [
            "ride", 
            "care", 
            "wait", 
            "approach"
        ], 
        [
            "Eventually", 
            "Fortunately", 
            "However", 
            "Besides"
        ], 
        [
            "visit", 
            "trip", 
            "bus", 
            "work"
        ], 
        [
            "opposite", 
            "separate", 
            "difficult", 
            "usual"
        ], 
        [
            "must", 
            "may", 
            "will", 
            "do"
        ], 
        [
            "idea", 
            "opinion", 
            "method", 
            "impression"
        ], 
        [
            "explain", 
            "mean", 
            "say", 
            "suggest"
        ], 
        [
            "next", 
            "old", 
            "past", 
            "following"
        ], 
        [
            "in", 
            "over", 
            "behind", 
            "across"
        ], 
        [
            "searching", 
            "watching", 
            "admitting", 
            "noticing"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "C", 
        "B", 
        "C", 
        "C", 
        "A", 
        "B", 
        "A", 
        "B", 
        "B", 
        "D", 
        "A", 
        "B", 
        "C", 
        "D", 
        "B"
    ], 
    "source": "high1547"
}