{
    "article": "There once lived a young man who was always unhappy and complained about his poverty. One day, he went to see a fortune teller to inquire how to become  _  . The fortune teller said, \"Young man, you are already wealthy now.\" \"Where is my wealth?\" the young man asked  _  . \"It is with you. Your  _  is (are) your wealth. You use them to see this world. You use them to see all the  _  things in this world. You can read, study and learn. Your hands are your wealth. You can use them to work. You can use them to hug your beloved ones. Your  _  are your wealth. You can go to any places...\" the fortune teller said. \"You call these wealth? Everyone has them,\" the young man said. \"These are wealth. What you have now are not what others can luckily have. Are you  _  to give your eyes to me? I am willing to give you a lot of money to  _  for them,\" the fortune teller said. \"No, are you crazy? I am not going to exchange my eyes for money! They are  _  to me!\" the young man  _  . \"Precisely, these are wealth to you. You will not exchange them for money. Furthermore, although a lot of people have their wealthy things, they do not  _  them or treasure them. They are not  _  to Heaven for giving them their wealth. They even complain that Heaven is unfair to them. Do you want to  _  one of them before you will treasure them?\" the fortune teller said. Everyone is wealthy. But we should not  _  it for granted. We need to treasure our wealth, take care of it and use it  _  . We should not overuse it because once it is  _  , it is gone forever. Remember it is our wealth that we do not want to lose.", 
    "options": [
        [
            "happy", 
            "young", 
            "wealthy", 
            "poor"
        ], 
        [
            "anxiously", 
            "sadly", 
            "quietly", 
            "patiently"
        ], 
        [
            "knowledge", 
            "skills", 
            "brain", 
            "eyes"
        ], 
        [
            "ugly", 
            "beautiful", 
            "strange", 
            "useful"
        ], 
        [
            "legs", 
            "cars", 
            "jewels", 
            "banknotes"
        ], 
        [
            "lovely", 
            "optimistic", 
            "angry", 
            "willing"
        ], 
        [
            "charge", 
            "buy", 
            "exchange", 
            "change"
        ], 
        [
            "precious", 
            "useless", 
            "extra", 
            "special"
        ], 
        [
            "wept", 
            "demonstrated", 
            "smiled", 
            "yelled"
        ], 
        [
            "see", 
            "realize", 
            "keep", 
            "hold"
        ], 
        [
            "grateful", 
            "careful", 
            "meaningful", 
            "faithful"
        ], 
        [
            "get", 
            "grasp", 
            "have", 
            "lose"
        ], 
        [
            "take", 
            "make", 
            "set", 
            "sell"
        ], 
        [
            "wrongly", 
            "wisely", 
            "naturally", 
            "really"
        ], 
        [
            "old", 
            "used", 
            "gone", 
            "dead"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "B", 
        "A", 
        "D", 
        "C", 
        "A", 
        "D", 
        "B", 
        "A", 
        "D", 
        "A", 
        "B", 
        "C"
    ], 
    "source": "high2967"
}