{
    "article": "If you do not use your arms or your legs for some time, they will become weak; and when you start using them again, they will slowly become strong again.  Everybody  knows this, but nobody would think of  _  the fact. Yet there are many people who  _  to know that the memory works in the same way. When someone says that  _  has a good memory, he  _  means that he keeps his memory in practice  _  exercising it very  _  , either consciously or unconsciously. When someone else says that his memory is  _  , he means that he does not give it enough  _  to become strong. The position is exactly the same as that of  _  people, one of  _  exercises his arms and legs by playing ball, while the other  _  in a chair or a car all day. If a friend of yours says that his arms are weak, we know that it is his own  _  , But if he tells us that he has a poor memory,  _  of us think that his parents are to blame, or that he is just  _  , and few of us realize that it is just as it was his arms or legs that were weak. Not all of us can become very strong in body or very clever in mind,  _  all of us can improve our strength and our memory by the same means that  _  Have you ever  _  that people who cannot read or write usually have  _  memories than those who can? Why is this? Of course, because they cannot write down something in a little notebook or something else. They have to remember names, places, songs and stories; so their memory is always being exercised. In a word, if you want to have a good memory, do practice  remembering.  things.", 
    "options": [
        [
            "proving", 
            "questioning", 
            "describing", 
            "indicating"
        ], 
        [
            "want", 
            "have", 
            "seem", 
            "need"
        ], 
        [
            "she", 
            "he", 
            "it", 
            "one"
        ], 
        [
            "always", 
            "nearly", 
            "really", 
            "almost"
        ], 
        [
            "with", 
            "in", 
            "to", 
            "by"
        ], 
        [
            "often", 
            "fast", 
            "quickly", 
            "soon"
        ], 
        [
            "bad", 
            "useless", 
            "helpless", 
            "poor"
        ], 
        [
            "time", 
            "chance", 
            "space", 
            "places"
        ], 
        [
            "two", 
            "four", 
            "three", 
            "five"
        ], 
        [
            "them", 
            "that", 
            "whom", 
            "which"
        ], 
        [
            "lies", 
            "sits", 
            "hides", 
            "stands"
        ], 
        [
            "business", 
            "interest", 
            "story", 
            "fault"
        ], 
        [
            "few", 
            "some", 
            "many", 
            "several"
        ], 
        [
            "unfortunate", 
            "unhappy", 
            "unthinkable", 
            "miserable"
        ], 
        [
            "because", 
            "but", 
            "for", 
            "since"
        ], 
        [
            "study", 
            "rest", 
            "play", 
            "work"
        ], 
        [
            "noticed", 
            "thought", 
            "believed", 
            "realized"
        ], 
        [
            "stranger", 
            "poorer", 
            "worse", 
            "better"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "B", 
        "C", 
        "D", 
        "A", 
        "D", 
        "B", 
        "A", 
        "C", 
        "B", 
        "D", 
        "C", 
        "A", 
        "B", 
        "D", 
        "A", 
        "D"
    ], 
    "source": "high1439"
}