{
    "article": "When I came to my new school three years ago, I was surprised at how lonely I felt. Then one of my classmates invited me to her house for a dinner  _  . I was a little anxious, but finally I gladly  _  . Not really knowing how  _  the bus ride should be, I  got off  when I saw the landmarks  shown  on my friend's hand-drawn map. But when I got close enough to the  street signs  , I found none of the streets were shown on the map. I was  _  on a busy road with cars driving past without a person in sight. I had no  _  when the next bus would come,  _  when a bus did come by, I  _  got on. I told the bus driver where I wanted to go and he said that I had caught the  _  bus, but he let me stay on. After he had finished his scheduled bus route, he  _  to help me out. I gratefully showed him my little hand-drawn map but  _  did not help much. He finally  _  me off at a main road to catch a different bus and was  _  that he could not help me more. After a few minutes of walking, I noticed a bus pull up beside me. It was the  _  bus driver. He explained that he didn't want to leave me there  _  . He sent out a call and someone radioed back, saying that the bus I needed to catch was about ten minutes away. At last I made it to the dinner party  _  I was over an hour late. I am forever thankful for the  _  that this bus driver had for me. His act of kindness left a  _  on my heart.", 
    "options": [
        [
            "meal", 
            "party", 
            "meeting", 
            "time"
        ], 
        [
            "accepted", 
            "refused", 
            "got", 
            "received"
        ], 
        [
            "far", 
            "difficult", 
            "long", 
            "bad"
        ], 
        [
            "queuing", 
            "sitting", 
            "standing", 
            "waiting"
        ], 
        [
            "meaning", 
            "idea", 
            "problem", 
            "way"
        ], 
        [
            "so", 
            "yet", 
            "but", 
            "still"
        ], 
        [
            "suddenly", 
            "luckily", 
            "finally", 
            "quickly"
        ], 
        [
            "right", 
            "wrong", 
            "best", 
            "fastest"
        ], 
        [
            "supplied", 
            "refused", 
            "offered", 
            "wanted"
        ], 
        [
            "it", 
            "he", 
            "she", 
            "they"
        ], 
        [
            "kept", 
            "dropped", 
            "drove", 
            "turned"
        ], 
        [
            "eager", 
            "worried", 
            "sorry", 
            "disappointed"
        ], 
        [
            "same", 
            "next", 
            "kind", 
            "silly"
        ], 
        [
            "helpless", 
            "lonely", 
            "unaccompanied", 
            "alone"
        ], 
        [
            "after", 
            "although", 
            "until", 
            "when"
        ], 
        [
            "respect", 
            "concern", 
            "help", 
            "love"
        ], 
        [
            "mark", 
            "sign", 
            "symbol", 
            "line"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "C", 
        "B", 
        "A", 
        "D", 
        "B", 
        "C", 
        "A", 
        "B", 
        "C", 
        "A", 
        "D", 
        "B", 
        "B", 
        "A"
    ], 
    "source": "high2101"
}