{
    "article": "The town I live in is about to put cameras at all traffic lights to catch people who run red lights. It  _  me of how many people I've seen who take the yellow light as a  _  to go faster. I also can't understand why people don't move when the traffic light has turned green. Above all, there are those  _  situations in which someone doesn't even  _  that the light turns red, and just keeps going. That is why so many  _  happen! All these situations make me  wonder about  the purpose of traffic lights.  _  ,it's even more frightening to imagine letting people make their own decisions at  _  crossroads. Do the biggest cars get to go first? Who decides who goes next? So I guess I do like the idea of a system to  _  traffic. And I'll do my best to  _  the traffic rules: to go, to be cautious, and to stop when I'm  _  to. It occurs to me that my  _  have done much the same for me  in terms of  teaching me how to live. They have given me many  _  lights: to get along well with others, to listen and talk to them, to help others, and to  _  with joy and purpose. They have also given me some red lights  _  my life goes astray : not to be greedy, to keep my temper, and to control my desires. And there  _  have been some yellow caution lights: to watch how much I drink, to keep control of my behavior, and to  _  school regularly and work hard. If I obey these rules, my life will be as  _  as it can be. Just as I'm wise to pay attention to the traffic lights when I'm walking across the street, I'm wise to pay attention to the\"  _  signals\"given to me by my parents.", 
    "options": [
        [
            "suggests", 
            "robs", 
            "reminds", 
            "warns"
        ], 
        [
            "sight", 
            "signal", 
            "message", 
            "switch"
        ], 
        [
            "instant", 
            "exciting", 
            "dangerous", 
            "cautious"
        ], 
        [
            "notice", 
            "sense", 
            "remember", 
            "feel"
        ], 
        [
            "events", 
            "problems", 
            "situations", 
            "accidents"
        ], 
        [
            "Besides", 
            "Anyway", 
            "Instead", 
            "However"
        ], 
        [
            "noisy", 
            "narrow", 
            "crowded", 
            "key"
        ], 
        [
            "control", 
            "direct", 
            "improve", 
            "serve"
        ], 
        [
            "learn", 
            "obey", 
            "protect", 
            "carry"
        ], 
        [
            "supposed", 
            "used", 
            "addicted", 
            "delighted"
        ], 
        [
            "teachers", 
            "friends", 
            "leaders", 
            "parents"
        ], 
        [
            "safe", 
            "green", 
            "beneficial", 
            "helpful"
        ], 
        [
            "live", 
            "share", 
            "work", 
            "communicate"
        ], 
        [
            "unless", 
            "when", 
            "before", 
            "till"
        ], 
        [
            "still", 
            "even", 
            "only", 
            "also"
        ], 
        [
            "start", 
            "attend", 
            "leave", 
            "miss"
        ], 
        [
            "good", 
            "colorful", 
            "meaningful", 
            "healthy"
        ], 
        [
            "traffic", 
            "light", 
            "life", 
            "confidence"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "C", 
        "A", 
        "D", 
        "D", 
        "C", 
        "A", 
        "B", 
        "A", 
        "D", 
        "B", 
        "A", 
        "C", 
        "D", 
        "B", 
        "A", 
        "C"
    ], 
    "source": "high3137"
}