{
    "article": "When I smoked with my family, I would feel so  _  and good that nothing else in the world seemed so  _  . I thought that smoking weed was okay since many of my family members and people at my school smoked.  _  ever happened to them.  For a time  I started smoking weed a lot more during lunch and after school. I never thought  too much  of it. At that time I just wanted to smoke. Then I began to  fall behind  in school. I would  _  classes, come home late and spend all my money. I would spend  at least  8 to 18 dollars a day. I never thought  _  that marijuana had a bad effect on those things. Maybe my coming to class high was the reason why I was failing or coming home late. As I continued to smoke marijuana, I began to notice that I would always have the strong desire to smoke and that I would get  lost in  cigarettes if I smoked those, but I don't.  Now that  I have learned more about marijuana, I have  _  the amount of marijuana that I use. I don't want marijuana to be the most important in my life. I'm not smoking every day, and not spending as much money. Since I have  cut down  on my habit, I am  _  more money. I'm ready to go back to school and do good, so that I can make myself  _  . Everyone is always saying how weed  _  your mind and how it solves problems. I think it only brings more  _  . Marijuana is not good for your body or your brain. I'm not trying to tell you not to smoke, I'm just letting you know that marijuana can be  _  to your health, and  in the long run  it may cause some long term negative effects. Help yourself now, before it is too late. I don't want to lecture anyone, just  _  my experience with you.", 
    "options": [
        [
            "worried", 
            "relaxed", 
            "disappointed", 
            "moved"
        ], 
        [
            "important", 
            "common", 
            "interesting", 
            "funny"
        ], 
        [
            "something", 
            "Everything", 
            "Nothing", 
            "Anything"
        ], 
        [
            "give", 
            "have", 
            "attend", 
            "cut"
        ], 
        [
            "once", 
            "twice", 
            "again", 
            "further"
        ], 
        [
            "reduced", 
            "increased", 
            "bought", 
            "continued"
        ], 
        [
            "wasting", 
            "spending", 
            "making", 
            "saving"
        ], 
        [
            "less", 
            "more", 
            "better", 
            "worse"
        ], 
        [
            "excites", 
            "fills", 
            "repairs", 
            "destroys"
        ], 
        [
            "problems", 
            "pleasure", 
            "convenience", 
            "excitements"
        ], 
        [
            "helpful", 
            "useful", 
            "dangerous", 
            "strange"
        ], 
        [
            "tell", 
            "explain", 
            "regret", 
            "share"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "D", 
        "B", 
        "A", 
        "D", 
        "C", 
        "A", 
        "A", 
        "C", 
        "D"
    ], 
    "source": "high2903"
}