{
    "article": "I met Chandra Rekha Shrestha, a visually damaged girl, on the way to Shanti Nagar. She was walking down the road with her white stick, and I saw her walking into a muddy   _  .\n  _   she continued, she might have fallen into the water. Not wanting this to happen, I stopped my motorbike and   called out  , \"There's a hole in front of you,Chandra. If it's all right with you, I'll   _  you to your place.\"\nShe happily   _  . I took her bag so she could climb on my motorbike. We talked about her\nprofession, and I  _  she was on her way to\nTinkune for a teacher's training program.\nChandra had called me a   _  of\ntimes since our first meeting. However, I had been unable to meet her  because of  my busy schedules. Finally,  _  at the\nKathmandu Mall, she said, \"If you hadn't given me your business card,I wouldn't have called you.\" We talked about a range of issues, and I came to know that Chandra possessed a wide knowledge which would challenge  \n  _   of many   _  fit people.\n  _   she has a mother and three brothers, Chandra has been   _  on her own\nfor the past years. She cooks for herself and washes her own clothes and even  _  to teach every morning at Anam Nagar's Rudramati Primary School.\nWhile doing her housework, she tries to remember people, places, and things in\norder to manage her daily life. She is a(n)  _  person,\ntelling me that she made the decision to live alone after her brothers said\nthey would  take turns  to look after her each month.\nChandra felt this would  _  her. Chandra's main\nsource of information is through her  _  , learning\nabout various news as they are broadcast. Chandra lost her eyesight as a baby\nand had to learn how to survive  _  an early age.\nI really admired her confidence and the way she behaved herself in her life.\nThank you, Chandra Rekha. You have reminded me of  _  truly\nmatter in life but are mostly lacking in our city.", 
    "options": [
        [
            "path", 
            "road", 
            "hole", 
            "pond"
        ], 
        [
            "Has", 
            "Should", 
            "Might", 
            "Had"
        ], 
        [
            "take", 
            "pick", 
            "fetch", 
            "arrange"
        ], 
        [
            "answered", 
            "nodded", 
            "received", 
            "accepted"
        ], 
        [
            "noticed", 
            "recognized", 
            "learned", 
            "saw"
        ], 
        [
            "several", 
            "couple", 
            "series", 
            "set"
        ], 
        [
            "rejecting", 
            "retiring", 
            "rescuing", 
            "reuniting"
        ], 
        [
            "those", 
            "this", 
            "that", 
            "these"
        ], 
        [
            "mentally", 
            "naturally", 
            "mildly", 
            "physically"
        ], 
        [
            "Once", 
            "Although", 
            "When", 
            "Since"
        ], 
        [
            "depending", 
            "involving", 
            "concentrating", 
            "contributing"
        ], 
        [
            "trying", 
            "attempting", 
            "managing", 
            "allowing"
        ], 
        [
            "stubborn", 
            "pitiful", 
            "confident", 
            "intelligent"
        ], 
        [
            "hurt", 
            "injure", 
            "help", 
            "damage"
        ], 
        [
            "TV", 
            "radio", 
            "computer", 
            "glasses"
        ], 
        [
            "at", 
            "in", 
            "by", 
            "on"
        ], 
        [
            "whom", 
            "which", 
            "that", 
            "what"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "A", 
        "D", 
        "C", 
        "B", 
        "D", 
        "C", 
        "D", 
        "B", 
        "A", 
        "C", 
        "C", 
        "A", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "high1740"
}