{
    "article": "Recently, I stopped by a convenience store to get a newspaper and a bottle of drink. The young woman at the check-out counter said, \"That'll be five dollars  in all  please,\" She then  _  down at the paper I was  _  and said, \"I'm sick and  tired of  all this negative stuff on the front  _  . I want to read some  _  news for a change.\" She then said, \"In fact, I think someone should just  _  a Good News newspaper -- a paper with wonderful, inspirational  _  about people overcoming difficulty and doing good things for  others  . I'd buy one every day!\" She then  _  me for coming in and said, \" Maybe we'll get some good news,\" and she laughed. She made my day.The following day after my business appointments, I  dropped by  the same store again to  pick up  bottled water and a piece of newspaper, but a  _  young lady was behind the counter. As I checked out I said, \"Good afternoon\" and handed her my  _  . She said nothing -- not a word, not a smile or not a gesture. She just handed me my change and  _  a negative tone ordered...\"Next!\" It hit me right between the eyes: Two people, the same age;  _  made me feel great, and the other, well, made me feel that I had inconvenienced her by  showing up  . Every morning, you should ask  _  this important question: \"Who do I want to be today? 'The Grouch ' or 'The Good News Girl'\"? Your answer will do great good to  _  the joy and happiness that you will experience in your  _  .", 
    "options": [
        [
            "stared", 
            "glared", 
            "glanced", 
            "noticed"
        ], 
        [
            "carrying", 
            "taking", 
            "reading", 
            "buying"
        ], 
        [
            "columns", 
            "editions", 
            "pages.", 
            "parts"
        ], 
        [
            "bad", 
            "good", 
            "latest", 
            "interesting"
        ], 
        [
            "collect", 
            "print", 
            "sell", 
            "publish"
        ], 
        [
            "stories", 
            "ideas", 
            "concepts", 
            "experiences"
        ], 
        [
            "praised", 
            "thanked", 
            "appreciated", 
            "criticized"
        ], 
        [
            "beautiful", 
            "fantastic", 
            "different", 
            "stupid"
        ], 
        [
            "card", 
            "money", 
            "dollar", 
            "change"
        ], 
        [
            "with", 
            "at", 
            "through", 
            "in"
        ], 
        [
            "one", 
            "who", 
            "what", 
            "it"
        ], 
        [
            "her", 
            "them", 
            "yourself", 
            "themselves"
        ], 
        [
            "creating", 
            "determining", 
            "enjoying", 
            "guaranteeing"
        ], 
        [
            "home", 
            "work", 
            "study", 
            "life"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "C", 
        "B", 
        "D", 
        "A", 
        "B", 
        "C", 
        "B", 
        "D", 
        "A", 
        "C", 
        "B", 
        "D"
    ], 
    "source": "high2044"
}