{
    "article": "Some years ago the captain of a ship was very interested  _  medicine. He always  _  medical books to sea and liked to talk about different diseases. One day a lazy sailor on his ship pretended  to be  ill. He lay on his bunk and groaned as if he  were  very sick. The captain came to see him and was very pleased to have a patient to  look after  . He told the man to rest for a few days and  _  the other sailors do his work. Three days later  another  sailor pretended that he had  something wrong  with his chest.  Once more  the captain looked in his medical books and told the \"sick\" man  to have a rest  The other sailors were very  _  because they had  more  work to do. The patients had the best food and laughed at their friends when the captain was not  present  .  At last  the mate decided to punish the sick men and mixed up some soap, soot , glue and other unpleasant things. Then he got  _  from the captain to give his new medicine to the \"sick\" men. When they tasted the medicine, they really did feel ill. It was  _  horrible that one of the patients jumped out of his bunk, ran up on deck and climbed the  highest  mast on the ship. The captain  realized  that the men had tried  to cheat  him. So he made them  work  very hard for the rest of the ship on the sea.", 
    "options": [
        [
            "on", 
            "for", 
            "at", 
            "in"
        ], 
        [
            "fetched", 
            "carried", 
            "had", 
            "got"
        ], 
        [
            "got", 
            "took", 
            "sent", 
            "made"
        ], 
        [
            "pleased", 
            "sorry", 
            "angry", 
            "surprised"
        ], 
        [
            "agreement", 
            "permission", 
            "permit", 
            "promise"
        ], 
        [
            "very", 
            "much", 
            "so", 
            "quite"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "D", 
        "C", 
        "B", 
        "C"
    ], 
    "source": "high192"
}