{
    "article": "Here's a surprising fact: Of the 1.1 million firefighters in the United States, about 780,000 are volunteers. Roughly a third of the population is   _   by mostly- or all-volunteer fire departments.\nAlso   _  , perhaps. Sometimes they have to pay for their own gear.\nI   _   this because I volunteer as a firefighter in Durango, Colorado. I responded to more than 50 calls in 2014, everything from   _   to car accidents. In that period, I spent close to $1,000 on optional gear not supplied by my   _  , things like higher-quality flashlights, knives, and better gloves, which make my   _   easier.\nYesterday, a   _   was introduced in Congress that would give a significant tax break to those who volunteer their time as   _   responders. I hope it passes, not because it will put some money in my pocket   _  , hey, (that'll be nice) but because it will ease the financial burden on volunteers and acknowledge their time commitment. I believe it will   _   more people to help.\nAnd we   _   that.\nIn   _   areas where population density is low and calls for fire and EMS services are relatively rare, it just doesn't   make sense   to have career firefighters on the staff 24/7  .   _  , volunteers are used to fill in the   _  . We are ready to put our regular lives aside to help someone on what is the   _   day of their life. We have likely never met before, and might never again, but it doesn't   _   in a crisis. Without volunteers, the whole system would collapse.\nThere's a T-shirt that's popular among us, reading \"For Pride, Not   _  .\" We volunteer because we know our   _   need us. We don't need a small tax break. Without one, we'll still put on our gear when the alarm goes off without any   _  . But we'd appreciate one, and if it encourages more people to join us, it's worth it.", 
    "options": [
        [
            "taught", 
            "inspired", 
            "supported", 
            "protected"
        ], 
        [
            "surprising", 
            "amusing", 
            "pleasing", 
            "worrying"
        ], 
        [
            "appreciate", 
            "know", 
            "prove", 
            "analyze"
        ], 
        [
            "wildfires", 
            "wars", 
            "lightning", 
            "embarrassments"
        ], 
        [
            "company", 
            "department", 
            "team", 
            "family"
        ], 
        [
            "manner", 
            "life", 
            "project", 
            "job"
        ], 
        [
            "guest", 
            "politician", 
            "bill", 
            "word"
        ], 
        [
            "wise", 
            "proud", 
            "same", 
            "first"
        ], 
        [
            "so", 
            "when", 
            "though", 
            "because"
        ], 
        [
            "encourage", 
            "persuade", 
            "invite", 
            "allow"
        ], 
        [
            "neglect", 
            "need", 
            "predict", 
            "admit"
        ], 
        [
            "dark", 
            "rural", 
            "dirty", 
            "cold"
        ], 
        [
            "Recently", 
            "Quickly", 
            "Instead", 
            "Besides"
        ], 
        [
            "time", 
            "hole", 
            "form", 
            "gap"
        ], 
        [
            "busiest", 
            "hottest", 
            "worst", 
            "shortest"
        ], 
        [
            "matter", 
            "pass", 
            "exist", 
            "happen"
        ], 
        [
            "Satisfaction", 
            "Pay", 
            "Strength", 
            "Education"
        ], 
        [
            "communities", 
            "neighbors", 
            "children", 
            "patients"
        ], 
        [
            "disappointment", 
            "trouble", 
            "hesitation", 
            "anxiety"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "B", 
        "A", 
        "B", 
        "D", 
        "C", 
        "D", 
        "C", 
        "A", 
        "B", 
        "B", 
        "C", 
        "D", 
        "C", 
        "A", 
        "B", 
        "A", 
        "C"
    ], 
    "source": "high2785"
}