{
    "article": "Parents feel that it is difficult to live with teenagers. Then again, teenagers have  _  feelings about their parents, saying that it is not easy living with them. According to a recent research, the most common  _  between parents and teenagers is that regarding untidiness and daily routine tasks. On the one hand, parents go mad over  _  rooms, clothes thrown on the floor and their children's refusal to help with the  _  . On the other hand, teenagers lose their patience continually when parents blame them for  _  the towel in the bathroom, not cleaning up their room or refusing to do the shopping at the supermarket. The research, conducted by St. George University, shows that different parents have different  _  to these problems. However, some approaches are more  _  than others. For example, those parents who yell at their children for their untidiness, but  _  clean the room for them, have fewer chances of changing their children's  _  . On the contrary, those who let teenagers experience the  _  of their actions can do better. For example, when teenagers who don't help their parents with the shopping don't find their favorite drink in the refrigerator, they are forced to  _  their actions. Psychologists say that  _  is the most important thing in parent-child relationships. Parents should  _  to their children but at the same time they should lend an ear to what they have to say. Parents may  _  their children when they are untidy but they should also understand that their room is their own private space. Communication is a two-way process. It is only by listening to and  _  each other that problems between parents and children can be settled.", 
    "options": [
        [
            "natural", 
            "strong", 
            "guilty", 
            "similar"
        ], 
        [
            "interest", 
            "argument", 
            "link", 
            "knowledge"
        ], 
        [
            "noisy", 
            "crowded", 
            "messy", 
            "locked"
        ], 
        [
            "homework", 
            "housework", 
            "problem", 
            "research"
        ], 
        [
            "washing", 
            "using", 
            "dropping", 
            "replacing"
        ], 
        [
            "approaches", 
            "contributions", 
            "introductions", 
            "attitudes"
        ], 
        [
            "complex", 
            "popular", 
            "scientific", 
            "successful"
        ], 
        [
            "later", 
            "deliberately", 
            "seldom", 
            "thoroughly"
        ], 
        [
            "behavior", 
            "taste", 
            "future", 
            "nature"
        ], 
        [
            "failures", 
            "changes", 
            "consequences", 
            "thrills"
        ], 
        [
            "defend", 
            "delay", 
            "repeat", 
            "reconsider"
        ], 
        [
            "communication", 
            "bond", 
            "friendship", 
            "trust"
        ], 
        [
            "reply", 
            "attend", 
            "attach", 
            "talk"
        ], 
        [
            "hate", 
            "scold", 
            "frighten", 
            "stop"
        ], 
        [
            "loving", 
            "observing", 
            "understanding", 
            "praising"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "C", 
        "B", 
        "C", 
        "A", 
        "D", 
        "A", 
        "A", 
        "C", 
        "D", 
        "A", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "high1030"
}