{
    "article": "Lose-Win is weak. It's easy to get stepped on. It's easy to be the nice guy. It's easy to give in, all in the name of being a peacemaker.\n     A girl named Jenny once told me about her 36 _  in the world of Lose-Win during her eighth-grade year before she finally broke 37 _ :\n     My 38 _  with my mom all started one day 39 _  she said to me sarcastically   \"Wow, you're surely lively today.\" I 40 _  it so literally   that then and there I decided to close off from her and never 41 _  back to her. So every time she would say something 42 even if  I disagreed with her I would just say. \"Okay,   whatever  you want, Mom.\" But I really got cold quickly. And my44 _ began to build. One night I talked to my mom about the school homework and she said, \"Oh, that's 45 _ \" and then went back to mop the floor.\n     \"Don't you ever 46 _ ?\" I thought. But I didn't say anything and stormed off. She had no idea I was 47 _ upset. She would have been willing to talk to me had I 48 _  her bow important it was to me.\n     At last I just blew up. \"Mom, this has got to 49 _  . You tell me everything you want me to do and I just do it because it's    _   than if fighting. Well, I'm sick of it.\" This all came as a 51 _  to her.\n     After my blow up, we felt like we were 52 _  all over in our relationship. But it's getting better all the lime. We discuss things now and I always 53 _  my feelings with her.\n     If you adopt Lose-Win as your basic 54 _  toward life, then people will wipe their dirty feet on you. You'll also be 55 _ your true feelings deep inside. And that's not healthy.", 
    "options": [
        [
            "wanderings", 
            "disappointment", 
            "lessons", 
            "helplessness"
        ], 
        [
            "out", 
            "down", 
            "up", 
            "free"
        ], 
        [
            "relationship", 
            "problems", 
            "quarrels", 
            "improvement"
        ], 
        [
            "as", 
            "since", 
            "when", 
            "before"
        ], 
        [
            "regarded", 
            "treated", 
            "received", 
            "took"
        ], 
        [
            "fight", 
            "struggle", 
            "talk", 
            "turn"
        ], 
        [
            "coldness", 
            "anger", 
            "disagreement", 
            "hope"
        ], 
        [
            "true", 
            "impossible", 
            "nice", 
            "important"
        ], 
        [
            "care", 
            "see", 
            "say", 
            "listen"
        ], 
        [
            "also", 
            "still", 
            "even", 
            "already"
        ], 
        [
            "warned", 
            "shown", 
            "asked", 
            "told"
        ], 
        [
            "end", 
            "change", 
            "last", 
            "stop"
        ], 
        [
            "worse", 
            "easier", 
            "more", 
            "less"
        ], 
        [
            "surprise", 
            "pleasure", 
            "gift", 
            "harm"
        ], 
        [
            "going", 
            "starting", 
            "thinking", 
            "reviewing"
        ], 
        [
            "share", 
            "have", 
            "discuss", 
            "improve"
        ], 
        [
            "way", 
            "method", 
            "attitude", 
            "theory"
        ], 
        [
            "hurting", 
            "waking", 
            "storing", 
            "hiding"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "B", 
        "C", 
        "D", 
        "C", 
        "B", 
        "C", 
        "A", 
        "C", 
        "D", 
        "B", 
        "B", 
        "A", 
        "B", 
        "A", 
        "C", 
        "D"
    ], 
    "source": "high38"
}