{
    "article": "People think children should play sports. Sports are fun, and children keep healthy while playing with others. However, playing sports can have   _  effects on children. It may produce feelings of poor self-respect or\naggressive behavior in some children. According to research on kids and\nsports,40,000,000 kids play sports in the US. Of these,18,000,000 say they have\nbeen  _  at or called names while playing\nsports. This leaves many children with a bad  _  of sports. They think sports are just too aggressive.\nMany researchers believe adults, especially parents and coaches, are the main   _  of too much aggression in children's sports. They believe children  _  aggressive adult behavior. This behavior is then further strengthened\nthrough both positive and negative feedback. Parents and coaches are powerful\nteachers because children usually look up to them. Often these adults behave\naggressively themselves, sending children the message that  _  is everything. Many parents go to children's sporting events and\nshout  _  at other players or cheer\nwhen their child behaves  _  . As well, children\nare even taught that hurting other players is  _  or are pushed to continue playing even when they are injured.  In addition  ,the media makes violence seem exciting. Children watch adult sports games\nand see violent behavior replayed over and over on television.\nAs a society, we really need to   face up to  this problem and do something\nabout it. Parents and coaches  in particular  should act as\nbetter examples for children. They also need to teach children better  _  . They should not just cheer when children win or act aggressively. They\nshould teach children to  _  themselves whether\nthey win or not. Besides, children should not be allowed to continue to play\nwhen they are injured. If adults allow children to play when injured, this\ngives the message that  _  is not as important as\nwinning.", 
    "options": [
        [
            "restrictive", 
            "negative", 
            "active", 
            "instructive"
        ], 
        [
            "knocked", 
            "glanced", 
            "smiled", 
            "shouted"
        ], 
        [
            "impression", 
            "concept", 
            "taste", 
            "expectation"
        ], 
        [
            "resource", 
            "cause", 
            "course", 
            "consequence"
        ], 
        [
            "question", 
            "understand", 
            "copy", 
            "neglect"
        ], 
        [
            "winning", 
            "practising", 
            "fun", 
            "sport"
        ], 
        [
            "praises", 
            "orders", 
            "remarks", 
            "insults"
        ], 
        [
            "proudly", 
            "ambitiously", 
            "aggressively", 
            "bravely"
        ], 
        [
            "acceptable", 
            "impolite", 
            "possible", 
            "accessible"
        ], 
        [
            "techniques", 
            "means", 
            "values", 
            "directions"
        ], 
        [
            "respect", 
            "relax", 
            "forgive", 
            "enjoy"
        ], 
        [
            "body", 
            "fame", 
            "health", 
            "spirit"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "A", 
        "B", 
        "C", 
        "A", 
        "D", 
        "C", 
        "A", 
        "C", 
        "D", 
        "C"
    ], 
    "source": "high2731"
}