{
    "article": "With time flying, people become aged. Then many people even in their middle age often start to notice that their memory and mental clarity are not what they used to be. We suddenly can't remember  _  we put the keys just a moment ago, or an old friend's name, or the name of an old band we used to love. As the brain  _  , we refer to these occurrences as \"senior moments\".  _  seemingly innocent, this loss of mental focus can potentially have a(n)  _  effect on our social and  _  well-being. Neuroscientists,experts who study the nervous system, are increasingly showing that there's actually a lot that can be done. It  _  out that the brain needs exercise in much the same way our muscles do, and the right mental  _  can significantly improve our basic cognitive  _  . Thinking is basically a  _  of making connections in the brain. To a certain extent, our ability to  _  in making the connections that drive intelligence is inherited .  _  , because these connections are made through effort and practice, scientists believe that intelligence can expand and wave  according to  mental effort. Now, a new Web-based company has taken a step  _  and developed the first \"brain training program\" designed to actually help people improve and  _  their mental sharpness. The Web-based program  _  you to systematically improve your memory and attention skills. The program keeps a(n)  _  of your progress and provides detailed feedback  _  your performance and improvement. Most importantly, it  _  changes and improves the games you play to  _  up the strengths you are developing-much like a(n)  _  exercise routine which requires you to increase resistance and vary your muscle use.", 
    "options": [
        [
            "where", 
            "when", 
            "that", 
            "why"
        ], 
        [
            "improves", 
            "fades", 
            "recovers", 
            "falls"
        ], 
        [
            "If", 
            "Unless", 
            "Once", 
            "While"
        ], 
        [
            "irregular", 
            "limited", 
            "damaging", 
            "positive"
        ], 
        [
            "personal", 
            "psychological", 
            "mental", 
            "physical"
        ], 
        [
            "turns", 
            "finds", 
            "points", 
            "figures"
        ], 
        [
            "connection", 
            "responses", 
            "workouts", 
            "associations"
        ], 
        [
            "style", 
            "functions", 
            "circumstances", 
            "atmosphere"
        ], 
        [
            "steps", 
            "condition", 
            "consequences", 
            "process"
        ], 
        [
            "insist", 
            "believe", 
            "succeed", 
            "fail"
        ], 
        [
            "Therefore", 
            "Moreover", 
            "Otherwise", 
            "However"
        ], 
        [
            "back", 
            "further", 
            "aside", 
            "around"
        ], 
        [
            "regain", 
            "reflect", 
            "review", 
            "respond"
        ], 
        [
            "suggests", 
            "makes", 
            "hurries", 
            "allows"
        ], 
        [
            "hold", 
            "record", 
            "order", 
            "pace"
        ], 
        [
            "to", 
            "with", 
            "for", 
            "about"
        ], 
        [
            "irregularly", 
            "habitually", 
            "constantly", 
            "unusually"
        ], 
        [
            "carry", 
            "put", 
            "build", 
            "take"
        ], 
        [
            "risky", 
            "effective", 
            "meaningless", 
            "familiar"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "D", 
        "C", 
        "A", 
        "A", 
        "C", 
        "B", 
        "D", 
        "C", 
        "D", 
        "B", 
        "A", 
        "D", 
        "B", 
        "D", 
        "C", 
        "C", 
        "B"
    ], 
    "source": "high1828"
}