{
    "article": "The sun shines brightly as I leave school, get into my car, and head for Bradley Hospital. This year, as a senior at Seekonk High School, I have been given the opportunity to leave the usual classroom setting once a week to volunteer. I  _  to spend this valuable time working with mentally disabled children at Bradley Children's Hospital. I work  _  a teacher in the outpatient/pre-school section, in a classroom with two children-- a classroom very different from  one  I have ever known. The difference of this classroom is  _  the children have been diagnosed with a mental disease. One child is , using supportive  _  . The other has a condition called PDD (one step above autism), and is  _  non-verbal. Both childrenrequire strong  _  and a lot of attention. This combination creates an atmosphere which is both demanding and sympathetic. My  _  in the classroom is not only to help the teacher, but to become part of the children's  _  experience. I work one-on-one completing academics with a student.  _  , we work as a group on such activities as cooking, artwork, abstract reasoning. Everyday activities, which may be taken for granted by others,  call for  a lot of strength from the children. This has opened my eyes vastly. One of the  _  reasons why I volunteer to take the work is that I desire to help those who are less  _  . However, it has also helped me to realize my competence. I now know that I have the  _  to work with the disabled. I have lost my fear, and I  believe in  myself a lot more. It is true that my work is very  _  ; there are many days that I  _  Bradley exhausted emotionally and physically. There have been times when I have left on the edge of tears  as well  . But pity doesn't heal, love does. And I have grown to love these children in my own way,  even though  I see them only once a week. This experience has been both rewarding and satisfying. I've learned also that I do have the ability to make a difference in their lives, no matter how small it may be. One smile makes it all  _  .", 
    "options": [
        [
            "promise", 
            "claim", 
            "bother", 
            "choose"
        ], 
        [
            "for", 
            "on", 
            "alongside", 
            "besides"
        ], 
        [
            "that", 
            "what", 
            "whether", 
            "how"
        ], 
        [
            "Transportation", 
            "communication", 
            "application", 
            "direction"
        ], 
        [
            "simply", 
            "completely", 
            "frequently", 
            "naturally"
        ], 
        [
            "treatment", 
            "commitment", 
            "motivation", 
            "sympathy"
        ], 
        [
            "choice", 
            "wish", 
            "decision", 
            "role"
        ], 
        [
            "agricultural", 
            "professional", 
            "technological", 
            "educational"
        ], 
        [
            "Additionally", 
            "Finally", 
            "Eventually", 
            "Gradually"
        ], 
        [
            "chief", 
            "legal", 
            "awkward", 
            "vital"
        ], 
        [
            "unforgettable", 
            "fortunate", 
            "hopeless", 
            "active"
        ], 
        [
            "honor", 
            "opportunity", 
            "courage", 
            "ability"
        ], 
        [
            "depressing", 
            "challenging", 
            "inspiring", 
            "relaxing"
        ], 
        [
            "approach", 
            "visit", 
            "leave", 
            "desert"
        ], 
        [
            "amusing", 
            "enjoyable", 
            "costly", 
            "worthwhile"
        ]
    ], 
    "answers": [
        "D", 
        "C", 
        "A", 
        "B", 
        "B", 
        "C", 
        "D", 
        "D", 
        "A", 
        "A", 
        "B", 
        "D", 
        "B", 
        "C", 
        "D"
    ], 
    "source": "high1907"
}