{
    "article": "It was already late when we set out for the next town,  _  according to the map was about fifteen miles away on the other side of the  _  . There we felt  _  that we would find a bed  _  the night. Darkness fell soon after we left the village, but luckily we met  _  as we drove fast along the narrow winding road that  led to  the hills. As we climbed  _  , it became colder and rain began to fall,  _  it difficult at times to see the road. I asked John, my companion, to drive more  _  . After we had traveled for about twenty miles, there was still no sign of the town which was  _  on the map. We were beginning to get  _  . Then without warning the car stopped. A quick  _  showed that we had run out of petrol. Although we had little food with us, we decided to  _  the night in the car. Our meal was soon over. I tried to go to sleep at once,  _  John, who was a  _  sleeper, got out of the car after a few minutes and went for a walk  _  the hills. Soon he came back. From the top of the hill he had seen, in the valley below, the  _  of the town we were looking for. We at once unloaded all our luggage and with a great effort,  _  to push the car to the top of the hill. Then we went back to the luggage, loaded the car again and set off down the hill.  _  less than a quarter of an hour we were in the town, where we found a  _  quite easily.", 
    "options": [
        [
            "which", 
            "it", 
            "where", 
            "that"
        ], 
        [
            "rivers", 
            "hills", 
            "towns", 
            "villages"
        ], 
        [
            "surprised", 
            "afraid", 
            "pleased", 
            "sure"
        ], 
        [
            "at", 
            "in", 
            "through", 
            "for"
        ], 
        [
            "everybody", 
            "somebody", 
            "nobody", 
            "anybody"
        ], 
        [
            "taller", 
            "higher", 
            "lower", 
            "faster"
        ], 
        [
            "getting", 
            "thinking", 
            "causing", 
            "making"
        ], 
        [
            "certainly", 
            "carefully", 
            "slowly", 
            "surely"
        ], 
        [
            "marked", 
            "set", 
            "built", 
            "drawn"
        ], 
        [
            "excited", 
            "worried", 
            "cold", 
            "warm"
        ], 
        [
            "attention", 
            "operation", 
            "examination", 
            "information"
        ], 
        [
            "spend", 
            "live", 
            "spare", 
            "stay"
        ], 
        [
            "since", 
            "though", 
            "so", 
            "but"
        ], 
        [
            "quick", 
            "fast", 
            "poor", 
            "heavy"
        ], 
        [
            "across", 
            "through", 
            "down", 
            "up"
        ], 
        [
            "lights", 
            "map", 
            "bus", 
            "situation"
        ], 
        [
            "ought", 
            "tried", 
            "succeeded", 
            "managed"
        ], 
        [
            "For", 
            "In", 
            "Since", 
            "At"
        ], 
        [
            "policeman", 
            "friend", 
            "hotel", 
            "cinema"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "D", 
        "D", 
        "C", 
        "B", 
        "D", 
        "C", 
        "A", 
        "B", 
        "C", 
        "A", 
        "D", 
        "C", 
        "D", 
        "A", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "high818"
}