{
    "article": "I can honestly say it was the best of times and the worst of times. I was joyfully expecting my first child at the same time that my mother was  _  her battle with a brain tumor . For ten years, my fiercely independent and  _  mother had fought, but none of the treatments had been successful.  _  , she never lost her ability to smile. But now, finally, she became totally  _  --unable to speak, walk, eat or dress on her own. As she grew closer and closer to death, my  _  grew closer and closer to life inside me. My biggest  _  was that their lives would never connect. I was sad not only at the  _  loss of my mother, but that she and my baby would never know each other. Her doctor did not  _  any hope; they told us her time was up. We brought Mother  _  to her own bed in her own house. As  _  as I could, I sat beside her and talked to her about the baby moving inside me. On February 3, 1989, at about the same time my labor  _  , Mother opened her eyes. When they told me this at the  _  , I called her home, \"Mom, listen. The baby is coming! You're going to have a new grandchild!\" \"Yes! Yes! I know!\" Four beautiful words! The first  _  words she'd spoken in months! When I  called up  again an hour later, the nurse at her house told the  _  message: Mom sat up, smiling, with her oxygen tubes removed. When I brought Jacob home. Mom was sitting in her chair and  _  to welcome him. Tears of joy blocked my vision as I  _  my son in her arms and she clucked at him. They  _  . Then she quietly clipped back into a coma and  passed away  peacefully. Memories of my son's birth will always be bittersweet for me, but it was then that I learned love has the  _  to overcome any worries and any sorrow. And love can last forever.", 
    "options": [
        [
            "attending", 
            "losing", 
            "quitting", 
            "defeating"
        ], 
        [
            "brave", 
            "interesting", 
            "funny", 
            "lucky"
        ], 
        [
            "So", 
            "Again", 
            "Instead", 
            "Still"
        ], 
        [
            "outstanding", 
            "blind", 
            "disabled", 
            "troublesome"
        ], 
        [
            "sorrow", 
            "love", 
            "baby", 
            "body"
        ], 
        [
            "problem", 
            "dream", 
            "surprise", 
            "fear"
        ], 
        [
            "coming", 
            "disappearing", 
            "falling", 
            "greeting"
        ], 
        [
            "admit", 
            "hold", 
            "drop", 
            "permit"
        ], 
        [
            "up", 
            "away", 
            "about", 
            "home"
        ], 
        [
            "soon", 
            "fast", 
            "early", 
            "often"
        ], 
        [
            "started", 
            "failed", 
            "ended", 
            "continued"
        ], 
        [
            "office", 
            "hospital", 
            "house", 
            "station"
        ], 
        [
            "common", 
            "caring", 
            "clear", 
            "correct"
        ], 
        [
            "impossible", 
            "possible", 
            "necessary", 
            "terrible"
        ], 
        [
            "likely", 
            "ready", 
            "free", 
            "nervous"
        ], 
        [
            "hugged", 
            "threw", 
            "took", 
            "laid"
        ], 
        [
            "joined", 
            "knew", 
            "nodded", 
            "cried"
        ], 
        [
            "depth", 
            "description", 
            "power", 
            "mask"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "D", 
        "C", 
        "C", 
        "D", 
        "A", 
        "B", 
        "D", 
        "D", 
        "A", 
        "B", 
        "C", 
        "A", 
        "B", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "high190"
}