{
    "article": "A person may have an idea about himself that will prevent him from doing good work. He may have the  _  that he is not capable of it. A child may think he is stupid because he does not understand how to make the  _  of his mental faculties . Older people may be mistaken that they are incapable of  _  anything new because of their age. A person who believes that he is incapable will not make a real  _  , because he feels that it  _  be useless, he won't go at a job with the confidence necessary for success, and he won't work his hardest, even though he may  _  he is doing so. He is  _  likely to fail, and the failure will  add to  belief in his incompetence . Alfred Adler, a famous doctor, had a (an)  _  like this. When he was a small boy, he had a poor  _  in maths. His teacher told his  _  he had no ability in maths in order that they would not  _  too much of him.  _  he too accepted  _  mistaken thinking of his ability, and he felt that it was useless to  _  , and was very poor at maths,  _  as they expected. One day he worked out a problem which  _  of the other students had been able to solve. Adler succeeded in solving the problem. This gave him confidence. He now  _  with interest, determination and purpose, and he soon became especially good at  _  . He not only proved that he could learn maths well, but luckily he learned early in his life from his own experience that if a person goes at a job with determination and purpose, he may  _  himself as well as others by his ability.", 
    "options": [
        [
            "belief", 
            "way", 
            "fact", 
            "condition"
        ], 
        [
            "biggest", 
            "most", 
            "highest", 
            "deepest"
        ], 
        [
            "teaching", 
            "learning", 
            "accepting", 
            "using"
        ], 
        [
            "decision", 
            "success", 
            "effort", 
            "trouble"
        ], 
        [
            "would", 
            "should", 
            "must", 
            "could"
        ], 
        [
            "forget", 
            "think", 
            "guess", 
            "understand"
        ], 
        [
            "nevertheless", 
            "moreover", 
            "however", 
            "therefore"
        ], 
        [
            "experience", 
            "example", 
            "thought", 
            "story"
        ], 
        [
            "state", 
            "mind", 
            "start", 
            "ending"
        ], 
        [
            "classmates", 
            "friends", 
            "neighbors", 
            "parents"
        ], 
        [
            "blame", 
            "expect", 
            "get", 
            "win"
        ], 
        [
            "Virtually", 
            "Gradually", 
            "Fortunately", 
            "Especially"
        ], 
        [
            "it", 
            "her", 
            "its", 
            "their"
        ], 
        [
            "manage", 
            "succeed", 
            "try", 
            "act"
        ], 
        [
            "only", 
            "almost", 
            "just", 
            "nearly"
        ], 
        [
            "none", 
            "all", 
            "many", 
            "most"
        ], 
        [
            "lived", 
            "worked", 
            "played", 
            "graduated"
        ], 
        [
            "1essons", 
            "medicine", 
            "subjects", 
            "maths"
        ], 
        [
            "encourage", 
            "love", 
            "astonish", 
            "disappoint"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "B", 
        "C", 
        "A", 
        "B", 
        "D", 
        "A", 
        "C", 
        "D", 
        "B", 
        "A", 
        "D", 
        "C", 
        "C", 
        "A", 
        "B", 
        "D", 
        "C"
    ], 
    "source": "high649"
}