{
    "article": "I always long for romantic moments, like a little girl longing for candies.However, my husband is my complete  _  . His inability to bring romantic moments into our life has made me get tired of our  _  . One day, I finally told him that I wanted a divorce. \"Why?\" he asked,  _  . \"I am tired; there are no  _  for everything in the world!\" I answered. He kept  _  , seeming to be in deep thought, with a lighted cigarette in his hands. Finally he asked, \"What can I do to change your  _  ?\" Looking deep into his eyes I slowly answered, \"Let's say, I want a flower on a mountain cliff and picking the flower will cause your  _  . Will you do it for me?\" He answered, \"I will give you my answer tomorrow.\" I  woke up  the next morning, finding a piece of paper on the dining table, which read: \"My dear, I would not pick that flower for you, but please allow me to  _  \" My feeling of disappointment only  _  , but I continued reading: \"You always leave the  _  keys behind, so I have to save my legs to  _  home to open the door for you. You always like to stay indoors and I  _  that you will feel too lonely, so I have to save my mouth to tell you jokes and stories. You always stare  _  the computer and that will do nothing  _  for your eyes, so I have to save my eyes so that when we grow  _  , I can help to clip your nails. Thus, my dear,  _  I am sure that there is someone who loves you more than I do, I could not pick that flower yet, and die.\" My tears fell on the  _  and I continued reading: \"Now that you have finished reading my answer, if you are  _  , please open the front door for I am standing outside  _  your favorite bread and fresh milk.\" Love, not words, wins arguments.", 
    "options": [
        [
            "supporter", 
            "opposite", 
            "follower", 
            "advocate"
        ], 
        [
            "marriage", 
            "connection", 
            "career", 
            "future"
        ], 
        [
            "annoyed", 
            "shocked", 
            "frightened", 
            "amused"
        ], 
        [
            "results", 
            "signs", 
            "causes", 
            "reasons"
        ], 
        [
            "easy", 
            "normal", 
            "silent", 
            "calm"
        ], 
        [
            "habit", 
            "feeling", 
            "attitude", 
            "mind"
        ], 
        [
            "death", 
            "injury", 
            "happiness", 
            "trouble"
        ], 
        [
            "love", 
            "explain", 
            "stay", 
            "change"
        ], 
        [
            "arose", 
            "disappeared", 
            "reduced", 
            "increased"
        ], 
        [
            "car", 
            "office", 
            "bicycle", 
            "house"
        ], 
        [
            "leave", 
            "walk", 
            "rush", 
            "get"
        ], 
        [
            "worry", 
            "think", 
            "believe", 
            "remind"
        ], 
        [
            "at", 
            "to", 
            "on", 
            "in"
        ], 
        [
            "bad", 
            "good", 
            "terrible", 
            "important"
        ], 
        [
            "weak", 
            "ill", 
            "old", 
            "close"
        ], 
        [
            "unless", 
            "if", 
            "since", 
            "because"
        ], 
        [
            "photos", 
            "flowers", 
            "floor", 
            "letter"
        ], 
        [
            "hungry", 
            "thirsty", 
            "satisfied", 
            "regretted"
        ], 
        [
            "buying", 
            "bringing", 
            "heating", 
            "catching"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "B", 
        "D", 
        "C", 
        "D", 
        "A", 
        "B", 
        "D", 
        "D", 
        "C", 
        "A", 
        "A", 
        "B", 
        "C", 
        "A", 
        "D", 
        "C", 
        "B"
    ], 
    "source": "high793"
}