{
    "article": "The survey about childhood in the Third World shows that the struggle for survival is long and hard. But in the rich world, children can  _  from a different kind of poverty -- of the spirit.  For instance  , one Western country alone now sees 14, 000 attempted suicides ( ) every year by children under 15, and one child  _  five needs psychiatric advice. There are many good things about  _  in the Third World. Take the close and constant relation between children and their parents, relatives and neighbors for example. In the West, the very nature of work puts distance between  _  and children. But in most Third World villages mother and father do not go miles away each day to work in offices.  _  , the child sees mother and father, relations and neighbors working  _  and often shares in that work.. A child  growing up  in this way learns his or her role through joining in the community's  _  :helping to dig or build, look after animals or babies -- rather than  _  playing with water and sand in kindergarten, keeping pets  _  playing with dolls. These children may grow up with a less oppressive sense of space and time than the  _  children. Their sense of days and time has a lot to do with the change of seasons and positions of the sun or the moon in the sky. Children in the rich world,  on the other hand  , are provided with a watch as one of the  _  signs of growing up, so that they can  _  along with their parents about being late for school times, meal times, bed times, the times of TV shows ... Third World children do not usually  _  to stay indoors, still less in high-rise apartments. Instead of dangerous roads, \"keep off the grass\" signs and \"don't speak to strangers\", there is often a sense of  _  to study and play. Parents can see their children outside rather than observe them  _  from ten floors up.  Of course  , twelve million children under five still die every year through hunger and disease. But childhood in the Third World is not all  _", 
    "options": [
        [
            "come", 
            "survive", 
            "suffer", 
            "learn"
        ], 
        [
            "in", 
            "by", 
            "to", 
            "under"
        ], 
        [
            "childhood", 
            "poverty", 
            "spirit", 
            "survival"
        ], 
        [
            "neighbors", 
            "fathers", 
            "adults", 
            "relatives"
        ], 
        [
            "Anyhow", 
            "Instead", 
            "However", 
            "Still"
        ], 
        [
            "away", 
            "alone", 
            "nearby", 
            "along"
        ], 
        [
            "fun", 
            "life", 
            "study", 
            "work"
        ], 
        [
            "by", 
            "through", 
            "from", 
            "with"
        ], 
        [
            "or", 
            "but", 
            "and", 
            "so"
        ], 
        [
            "Western", 
            "good", 
            "poor", 
            "Eastern"
        ], 
        [
            "easiest", 
            "quickest", 
            "happiest", 
            "earliest"
        ], 
        [
            "care", 
            "worry", 
            "hurry", 
            "fear"
        ], 
        [
            "dare", 
            "expect", 
            "have", 
            "require"
        ], 
        [
            "freedom", 
            "danger", 
            "disappointment", 
            "control"
        ], 
        [
            "eagerly", 
            "anxiously", 
            "impatiently", 
            "proudly"
        ], 
        [
            "poor", 
            "good", 
            "rich", 
            "bad"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "A", 
        "C", 
        "B", 
        "C", 
        "D", 
        "B", 
        "A", 
        "A", 
        "D", 
        "A", 
        "C", 
        "A", 
        "B", 
        "D"
    ], 
    "source": "high3061"
}