{
    "article": "The last time I saw my mother, she didn't know who I was. Although having  _  from dementia for many years, mother was never  _  . All our family came to the hospital to spend time with her. She didn't  _  them either, but we wanted to be there with her. I have just flown back from Texas. Mother  _  looked at me, or past me, and said \"Yeah\". That's  _  she responded to  _  around her. In spite of this, I held her hand and talked to her. I told her about the big old house in Highland where I  grew up  . When we first  _  there from Mascoutah when I was 5 years old, I was  _  of that house. The yard was full of  _  and the house was falling apart. But my father and mother were intelligent and  _  and we eight kids helped to turn it into a home. All of a sudden, I wasn't frightened any more. I told her she must have been very  _  when I decided to go to college to study journalism  instead of  being a priest , which she thought was the highest  _  for a family. But she didn't show it. She just saw me  _  with my favorite chocolate chip cookies. When I told her all about Texas,  _  she and father had been to visit me, mother seemed  _  by that Texas beach on which they had taken a  _  . She  _  the trip and kept the picture in the living room all the time. We had too many stories to tell. It was time for me to say  _  to mother and I told her I'd see her again. \"Yeah,\" she answered. But I wasn't able to.", 
    "options": [
        [
            "recovered", 
            "suffered", 
            "damaged", 
            "lived"
        ], 
        [
            "healthy", 
            "awake", 
            "unconscious", 
            "alone"
        ], 
        [
            "see", 
            "understand", 
            "recognize", 
            "like"
        ], 
        [
            "never", 
            "just", 
            "excitedly", 
            "seldom"
        ], 
        [
            "because", 
            "when", 
            "how", 
            "what"
        ], 
        [
            "somewhere", 
            "everywhere", 
            "something", 
            "everything"
        ], 
        [
            "moved", 
            "visited", 
            "left", 
            "withdrew"
        ], 
        [
            "fond", 
            "afraid", 
            "curious", 
            "tired"
        ], 
        [
            "weeds", 
            "flowers", 
            "trees", 
            "waste"
        ], 
        [
            "fortunate", 
            "easy-going", 
            "hospitable", 
            "hard-working"
        ], 
        [
            "disappointed", 
            "excited", 
            "surprised", 
            "anxious"
        ], 
        [
            "praise", 
            "prize", 
            "honor", 
            "encouragement"
        ], 
        [
            "away", 
            "out", 
            "about", 
            "off"
        ], 
        [
            "which", 
            "that", 
            "where", 
            "when"
        ], 
        [
            "delight", 
            "interested", 
            "happy", 
            "impressed"
        ], 
        [
            "note", 
            "boat", 
            "picture", 
            "bath"
        ], 
        [
            "enjoyed", 
            "hated", 
            "remembered", 
            "accounted"
        ], 
        [
            "thanks", 
            "goodbye", 
            "sorry", 
            "hello"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "C", 
        "B", 
        "C", 
        "D", 
        "A", 
        "B", 
        "A", 
        "D", 
        "A", 
        "C", 
        "D", 
        "C", 
        "D", 
        "C", 
        "A", 
        "B"
    ], 
    "source": "high73"
}