{
    "article": "It was an afternoon in the winter. Some friends and I were talking at a restaurant. We talked and talked and soon swimming became the  _  . Suddenly I hit upon an idea. \"Wouldn't it be  _  if we went swimming? Others went swimming in winter, and  _  couldn't we? Besides, we could be  _  if we did. \" I told them about this and they all said it was a good idea indeed. Early in the morning, three days  _  , we four were standing at the bus stop, with bags in our hands,  _  for a bus to take us to the  sands  . The sky was clear, the sun was shining, but all the same, it was very cold,  _  our heavy overcoats were not enough to keep us  _  . We all felt that we should go back, but no one wanted to  speak out  . We soon reached the sands. There was nobody there, but we were not to be discouraged.  _  we were proud that we were the  _  ones that dared to challenge the weather. Besides, the sun could keep us warm. So we  _  ourselves quickly. But things were not going to be so nice as we thought. The sea wind was blowing, we felt  very  cold and we shook from head to feet. At last we decided to  jump into  the sea water. We put our feet in first, only to take them back  _  . The water was unbelievably cold.  _  I suggested that we should all jump in at the same time. We all went back ten steps. I gave the order and we all rushed forward. We jumped. That feeling I had when I was in the water I shall never  _  . I was up and rushed again to the seaside. So  _  my friends. We put on our clothes as quickly as possible and went home. We four did not go to school the next three days, for we all  _  a bad cold. We missed the lessons, but we had this unforgettable experience.", 
    "options": [
        [
            "object", 
            "topic", 
            "opinion", 
            "center"
        ], 
        [
            "interesting", 
            "lucky", 
            "happy", 
            "surprising"
        ], 
        [
            "what", 
            "how", 
            "that", 
            "why"
        ], 
        [
            "worse", 
            "ill", 
            "stronger", 
            "better"
        ], 
        [
            "later", 
            "past", 
            "since", 
            "before"
        ], 
        [
            "asking", 
            "meeting", 
            "waiting", 
            "looking"
        ], 
        [
            "only", 
            "though", 
            "even", 
            "since"
        ], 
        [
            "cold", 
            "warm", 
            "hot", 
            "cool"
        ], 
        [
            "For", 
            "Instead", 
            "Sometimes", 
            "Unless"
        ], 
        [
            "only", 
            "lucky", 
            "younger", 
            "happy"
        ], 
        [
            "helped", 
            "enjoyed", 
            "dressed", 
            "changed"
        ], 
        [
            "carefully", 
            "quickly", 
            "bravely", 
            "finally"
        ], 
        [
            "Last", 
            "Next", 
            "When", 
            "Then"
        ], 
        [
            "remember", 
            "forget", 
            "believe", 
            "tell"
        ], 
        [
            "did", 
            "do", 
            "were", 
            "had"
        ], 
        [
            "became", 
            "felt", 
            "turned", 
            "caught"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "D", 
        "C", 
        "A", 
        "C", 
        "C", 
        "B", 
        "B", 
        "A", 
        "D", 
        "B", 
        "D", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "high1521"
}