{
    "article": "The Dragon Boat Festival, also called Double Fifth Festival, is celebrated on the 5 day of the fifth moon of the lunar calendar. It is one of the most important Chinese festivals,  the other  two being the Autumn Moon Festival and Chinese New Year. The origin of this summer festival  _  around a scholarly government official named Chu Yuan. He was a good and  _  man, but because of the  misdeeds  of jealous rivals he eventually fell into disfavor in the emperor's court. Unable to  _  the respect of the emperor, in his sorrow Chun Yuan threw himself into Mi Low river. Because of their  _  for Chu Yuan, the local people living adjacent to the Mi low River rushed into their boats to  search for  him while throwing rice into the waters to appease the river dragons.  _  they were unable to find Chu Yuan, their efforts are still commemorated today during the Dragon Boat Festival. Many competing teams drive their colorful dragon boats forward  _  the rhythm of beating drums on that day. These exciting races were inspired by the villager's valiant attempts to rescue Chun Yan from the Milo river. This tradition has remained  _  for centuries.", 
    "options": [
        [
            "centers", 
            "dates", 
            "comes", 
            "goes"
        ], 
        [
            "respective", 
            "respecting", 
            "respectful", 
            "respected"
        ], 
        [
            "obtain", 
            "acquire", 
            "gain", 
            "regain"
        ], 
        [
            "admiration", 
            "memory", 
            "celebration", 
            "expectation"
        ], 
        [
            "Despite", 
            "However", 
            "Although", 
            "If"
        ], 
        [
            "by", 
            "on", 
            "with", 
            "to"
        ], 
        [
            "unbroken", 
            "unchanged", 
            "still", 
            "living"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "D", 
        "A", 
        "C", 
        "D", 
        "A"
    ], 
    "source": "high1962"
}