{
    "article": "It was at a concert that I happened to find David. He was holding his head at a strange  _  as if he were stating down at something. Then the truth struck me. He was blind. The last thing he remembers  _  was his daughter being born. Then the world went  _  . Bad luck is no stranger to this 44-year-old man. His mother died of cancer, and his weak father had to  give up  11-year-old David to the care of the state. Things seemed always to go from bad to  _  . Two years ago, his beloved guide dog pulled him out of the  _  of a truck. David was not hurt. The dog  died  . But David does not feel sorry for himself. \"These are just little obstacles you have to  _  in your life,\" he said. He has to make a daily two-hour trip to his working place -- the X-ray department of an  _  room. It was a hard job to  come by  . Before he got it, David was determined to escape the workshop ran by the Lighthouse, an organization  _  to help blind people. He wanted a job of developing X-ray film, something  _  , not just he, must do in the dark, including people with  _  eyesight. The Lighthouse called many hospitals, with no result,  even though  they offered to pay his first three months' salary. David works alone in a dark room that  _  of chemicals. He cannot wear gloves.  _  , he could not feel. Since this is an emergency room, lives can be put  at risk  or out of danger. His directress says she trusts him 100 percent. He makes $20,000 a year. But his motivation goes  _  money. \"By working, I can actualize my own  _  . That's the most important!\" he said. What a shining example for us to  _  !", 
    "options": [
        [
            "ankle", 
            "direction", 
            "angle", 
            "altitude"
        ], 
        [
            "doing", 
            "feeling", 
            "seeing", 
            "hearing"
        ], 
        [
            "blank", 
            "colorful", 
            "empty", 
            "silent"
        ], 
        [
            "worse", 
            "good", 
            "better", 
            "mad"
        ], 
        [
            "bottom", 
            "path", 
            "wheel", 
            "back"
        ], 
        [
            "seek", 
            "overcome", 
            "surround", 
            "search"
        ], 
        [
            "upstairs", 
            "emergency", 
            "information", 
            "underground"
        ], 
        [
            "intended", 
            "aimed", 
            "offered", 
            "devoted"
        ], 
        [
            "everyone", 
            "nobody", 
            "someone", 
            "none"
        ], 
        [
            "common", 
            "poor", 
            "normal", 
            "actual"
        ], 
        [
            "consists", 
            "smells", 
            "allows", 
            "fills"
        ], 
        [
            "However", 
            "Unfortunately", 
            "Otherwise", 
            "Besides"
        ], 
        [
            "into", 
            "beyond", 
            "onto", 
            "below"
        ], 
        [
            "blindness", 
            "income", 
            "value", 
            "experiences"
        ], 
        [
            "set", 
            "take", 
            "hold", 
            "follow"
        ]
    ], 
    "answers": [
        "C", 
        "C", 
        "A", 
        "A", 
        "B", 
        "B", 
        "B", 
        "A", 
        "A", 
        "C", 
        "B", 
        "C", 
        "B", 
        "C", 
        "D"
    ], 
    "source": "high2294"
}