{
    "article": "Megan's Library of Love book drive began in 2006, in memory of a student who passed away. The  _  to send books to a school  in need  was created by Megan's classmates at Cedar Grove-Belgium Middle School as a tribute to her. The project formed out of the desire to23  _  Megan, to help our community heal, and to make a  _  in the life of others. Students have many  _  of Megan, but the most vivid was her love for her family and the diligent 26  _  she gave to her classmates. They combined this with her  _  for learning and reading to create the Library of Love. This project honors Megan's special qualities. In the  _  of one of her classmates, Megan was, \"A good daughter, a good student, a good friend. \"We are all blessed to have been a  _  of Megan's life. Every February, on Megan's birthday, fifth graders at Cedar Grove-Belgium Middle School  _  donations of newly purchased books and send them to a school in need. The \"Love books\" are truly a  _  of love meant to  _  reading and learning. Students earn the money for postage by writing letters to local  _  .The fifth graders also have the  _  of labeling every book with a Library of Love sticker ,  _  the books into categories , and  _  all the books for shipping. In the two years since the Library of Love  _  began, students have collected over 5000 newly purchased books to send to schools in need. In 2006, 3419 books were sent to St. Bernard's Parish to help  _  38 their school library after Hurricane Katrina destroyed the community. In 2007, 1613 books were sent to White Mountain School in Alaska, who  _  their high school in a fire. Students look forward to sending the gift of  _  to other schools in the future.", 
    "options": [
        [
            "move", 
            "thought", 
            "idea", 
            "offer"
        ], 
        [
            "help", 
            "honor", 
            "keep", 
            "save"
        ], 
        [
            "contribution", 
            "mark", 
            "difference", 
            "start"
        ], 
        [
            "images", 
            "pictures", 
            "stories", 
            "memories"
        ], 
        [
            "effort", 
            "advice", 
            "help", 
            "example"
        ], 
        [
            "interest", 
            "passion", 
            "preference", 
            "determination"
        ], 
        [
            "case", 
            "ideas", 
            "words", 
            "look"
        ], 
        [
            "company", 
            "witness", 
            "part", 
            "friend"
        ], 
        [
            "get", 
            "count", 
            "seek", 
            "collect"
        ], 
        [
            "measure", 
            "force", 
            "gift", 
            "mark"
        ], 
        [
            "push", 
            "reward", 
            "inspire", 
            "connect"
        ], 
        [
            "families", 
            "communities", 
            "factories", 
            "businesses"
        ], 
        [
            "chance", 
            "responsibility", 
            "pleasure", 
            "work"
        ], 
        [
            "dividing", 
            "placing", 
            "sorting", 
            "passing"
        ], 
        [
            "cleaning", 
            "checking", 
            "packing", 
            "examining"
        ], 
        [
            "plan", 
            "organization", 
            "campaign", 
            "project"
        ], 
        [
            "repair", 
            "rebuild", 
            "remove", 
            "restart"
        ], 
        [
            "lost", 
            "ruined", 
            "closed", 
            "escaped"
        ], 
        [
            "comforting", 
            "reading", 
            "encouraging", 
            "writing"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "C", 
        "D", 
        "C", 
        "B", 
        "C", 
        "C", 
        "D", 
        "C", 
        "C", 
        "D", 
        "B", 
        "C", 
        "C", 
        "D", 
        "B", 
        "A", 
        "B"
    ], 
    "source": "high349"
}