{
    "article": "For several years, we lived at the end of a long Texas country road. Every evening when I was away from home on business, my little boy would ask permission of his mother to take his black  _  and his daddy's walking stick, to make the half-mile  _  from the house to the fence which  _  the beginning of the dirty driveway. One day, I was busy with my business and was  _  for about an hour, completely forgetting about the  _  little boy down the road who might be  _  for his daddy. On my way home, the rain was so thick that I could not  _  ten feet in front of me. All I could  think of  was finishing my journey and getting out of the rain.  At last  , the downpour began to abate . It was only a drizzle by the time my car turned the last  _  and approached the final street between me and a warm home and nice meal.  All of a sudden  , I caught sight of my little boy, who was  _  an umbrella in one hand, a walking stick in the other, and was wearing the biggest and most beautiful smile ever to lighten the  _  of a little boy. As I stopped the car and  _  the door, he ran into my arms and held me long and hard. He was wet and  _  with cold, but he never  _  the rain, nor the hour-long wait. He simply said, \"Daddy, I missed you. I am so glad you are home.\" Last year, we  _  to a wonderful new home provided for a special season in our lives. We no longer have a long country road.  _  , I have never forgotten the rainy day and the little boy and his black dog. Often, perhaps a thousand times, that  _  has occurred in my mind.  _  all events in our lives, it happens once, and must be treasured.", 
    "options": [
        [
            "bag", 
            "dog", 
            "umbrella", 
            "toy"
        ], 
        [
            "journey", 
            "flight", 
            "effort", 
            "ride"
        ], 
        [
            "discovered", 
            "explained", 
            "marked", 
            "described"
        ], 
        [
            "controlled", 
            "trained", 
            "delayed", 
            "bothered"
        ], 
        [
            "hopeful", 
            "grateful", 
            "careful", 
            "faithful"
        ], 
        [
            "waiting", 
            "sending", 
            "searching", 
            "calling"
        ], 
        [
            "drive", 
            "see", 
            "feel", 
            "hear"
        ], 
        [
            "moment", 
            "corner", 
            "street", 
            "way"
        ], 
        [
            "holding", 
            "taking", 
            "folding", 
            "carrying"
        ], 
        [
            "body", 
            "head", 
            "face", 
            "hand"
        ], 
        [
            "closed", 
            "locked", 
            "knocked", 
            "opened"
        ], 
        [
            "worrying", 
            "nervous", 
            "trembling", 
            "anxious"
        ], 
        [
            "noticed", 
            "doubted", 
            "judged", 
            "mentioned"
        ], 
        [
            "moved", 
            "turned", 
            "returned", 
            "traveled"
        ], 
        [
            "Therefore", 
            "Besides", 
            "Otherwise", 
            "However"
        ], 
        [
            "time", 
            "scene", 
            "act", 
            "sight"
        ], 
        [
            "With", 
            "For", 
            "Like", 
            "Among"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "C", 
        "D", 
        "A", 
        "B", 
        "B", 
        "A", 
        "C", 
        "D", 
        "C", 
        "D", 
        "A", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "high478"
}