{
    "article": "One day an out of work mime  was visiting the zoo and attempted to earn some money as a street performer. As soon as he started to draw a 31)  _  , a zoo keeper grabbed him and dragged him into his office. The zoo keeper explained to the mime that the zoo's most popular attraction, a gorilla, had died suddenly and the keeper feared that 32)  attendance   at the zoo would fall off. He offered the mime a job to 33)  dress up as   the gorilla until they could get another one. The mime 34)  _  .\nSo the next morning the mime put on the gorilla suit and entered the cage before the crowd came. He discovered that it was a35)  _   job. He could sleep if he wanted, play and 36)  make fun of   people and he drew bigger crowds than he ever had as a mime. 37)  _  , eventually the crowds got tired of him and he got tired of just swinging on tails. He 38)  _   to notice that he people were paying more attention to the lion in the cage next to his. Not wanting to lose the attention of his audience, he climbed to the top of his cage, crawled across a partition , and dangled  from the top to the lion's cage. Of course, this made the lion very angry, but the crowd 39)  _   it.\nAt the end of the day, the zoo keeper came and gave the mime a 40)  _   for being such an attraction. Well, this went on for some time, the mime kept 41)  _   the lion, the crowds grew larger, and his salary kept going up. Then one terrible day when he was dangling over the angry lion, he slipped and fell. The mime was 42)  _  .\nThe lion gathered itself and prepared to pounce . The mime was so scared that he began to run round and round the cage with the lion close 43)  _  . Finally, the mime started screaming and yelling, \"Help me,help me!\", but the lion was quick and pounced. The mime soon found himself flat on his back, looking up at the angry lion and the lion said, \"44)  Shut up  you fool! Do you want to get us 45)  _  .\"", 
    "options": [
        [
            "ticket", 
            "profit", 
            "crowd", 
            "lesson"
        ], 
        [
            "declined", 
            "hesitated", 
            "accepted", 
            "doubted"
        ], 
        [
            "great", 
            "demanding", 
            "meaningless", 
            "busy"
        ], 
        [
            "Surprisingly", 
            "However", 
            "Therefore", 
            "Additionally"
        ], 
        [
            "failed", 
            "refused", 
            "managed", 
            "began"
        ], 
        [
            "loved", 
            "feared", 
            "forgot", 
            "excused"
        ], 
        [
            "warning", 
            "direction", 
            "rise", 
            "punishment41."
        ], 
        [
            "fighting", 
            "insulting", 
            "boring", 
            "frightening"
        ], 
        [
            "caught", 
            "attacked", 
            "terrified", 
            "offended"
        ], 
        [
            "behind", 
            "ahead", 
            "beyond", 
            "aside"
        ], 
        [
            "helped", 
            "killed", 
            "favored", 
            "fired"
        ]
    ], 
    "answers": [
        "C", 
        "C", 
        "A", 
        "B", 
        "D", 
        "A", 
        "C", 
        "B", 
        "C", 
        "A", 
        "D"
    ], 
    "source": "high845"
}