{
    "article": "Our thoughts, words, and actions often cause harm to others and to us. Without reconciliation , we cannot deepen our understanding and only cause more suffering. \"Beginning Anew\" is a(n)  _  of reconciliation. It involves three steps ---- sharing appreciation, expressing  _  , and expressing hurt and difficulties. In the first step, we share appreciation. We acknowledge the  _  qualities of the other person. The second step----expressing regret, is to  _  with the other person our regrets for the things we have done or said that might have caused him or her  _  . This requires humility , and the  _  to let go of our own pride. In the third step, we express our own hurt with mindful and loving  _  without blaming or criticizing. We speak in such a way that the other person can listen and  _  our words. If we blame the other person, his heart will  _  and he will not be able to hear us. We ask the other person to help us to understand why he has spoken and acted as he has, causing us so much pain. Perhaps, later, he can share his feelings so that we can understand him more deeply. If a strong  _  arises in us while we are expressing our suffering, we should simply  _  and come back to our breathing until the emotion becomes  _  The other person can  _  us by following his breathing until we are ready to continue. We can enjoy practicing \"Beginning Anew\" with our partner, our family, or our friends  _  . By doing this, we will  _  misunderstandings from accumulating. Rather, we will take care of them as they arise, as we take care of our children.", 
    "options": [
        [
            "method", 
            "practice", 
            "example", 
            "experience"
        ], 
        [
            "concern", 
            "belief", 
            "regret", 
            "sympathy"
        ], 
        [
            "positive", 
            "poor", 
            "confident", 
            "selfish"
        ], 
        [
            "chat", 
            "compare", 
            "debate", 
            "share"
        ], 
        [
            "pain", 
            "anxiety", 
            "confusion", 
            "loss"
        ], 
        [
            "willingness", 
            "kindness", 
            "happiness", 
            "weakness"
        ], 
        [
            "speech", 
            "letter", 
            "story", 
            "question"
        ], 
        [
            "choose", 
            "accept", 
            "spread", 
            "change"
        ], 
        [
            "open", 
            "close", 
            "beat", 
            "melt"
        ], 
        [
            "emotion", 
            "responsibility", 
            "value", 
            "interest"
        ], 
        [
            "continue", 
            "stop", 
            "leave", 
            "repeat"
        ], 
        [
            "quieter", 
            "warmer", 
            "deeper", 
            "stronger"
        ], 
        [
            "forget", 
            "support", 
            "hate", 
            "remember"
        ], 
        [
            "quickly", 
            "carefully", 
            "regularly", 
            "willingly"
        ], 
        [
            "prevent", 
            "protect", 
            "separate", 
            "forbid"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "D", 
        "A", 
        "A", 
        "A", 
        "B", 
        "B", 
        "A", 
        "B", 
        "A", 
        "B", 
        "C", 
        "A"
    ], 
    "source": "high1959"
}