{
    "article": "Thomas Edison tried two thousand different materials to make the light bulb. When none worked successfully, his assistant  _  , \"All our work is in vain. We have learned nothing.\" Thomas Edison replied very  _  , \"Oh, we have come a long way and we have  _  a lot. We now know that there are two thousand materials which we cannot  _  to make a good light bulb.\" If you learn from your mistakes, then you are  _  . If you learn from someone else's mistakes, then you are a genius. Success is nothing more than a few simple disciplines  _  daily and failure is nothing more than a few small  _  repeated daily. How  _  the above lines are! Success takes  _  . We'll make mistakes  if  we do things in too much of a hurry. When we do not practice disciplines in life, we don't build enough confidence to  _  new and challenging tasks which are important and matter in life. Our confidence  depends on  what we think of ourselves and whether we believe in ourselves. We are all born with exceptional  _  , but only a few really  _  their true potentials and make efforts in life and the others just lead a(n)  _  life. Do you want to be exceptional? Success is a fruit which everyone wants to  _  , but it is not found everywhere and no one can  _  it without serious efforts. Those who want to succeed will find a way; those who don't will find a(n)  _  ! Success depends on previous  _  , and without it we will end in failure. When you are  _  , please enjoy it and give your hand to others who want to accomplish something.", 
    "options": [
        [
            "celebrated", 
            "complained", 
            "explained", 
            "answered"
        ], 
        [
            "confidently", 
            "madly", 
            "carelessly", 
            "angrily"
        ], 
        [
            "remembered", 
            "refused", 
            "learned", 
            "ordered"
        ], 
        [
            "test", 
            "ignore", 
            "invent", 
            "use"
        ], 
        [
            "healthy", 
            "enthusiastic", 
            "intelligent", 
            "generous"
        ], 
        [
            "shown", 
            "prevented", 
            "recorded", 
            "practiced"
        ], 
        [
            "errors", 
            "machines", 
            "jobs", 
            "steps"
        ], 
        [
            "common", 
            "strange", 
            "familiar", 
            "true"
        ], 
        [
            "effect", 
            "time", 
            "drugs", 
            "roles"
        ], 
        [
            "keep", 
            "attempt", 
            "give", 
            "see"
        ], 
        [
            "appearance", 
            "experiences", 
            "qualities", 
            "feelings"
        ], 
        [
            "own", 
            "realize", 
            "provide", 
            "research"
        ], 
        [
            "active", 
            "hard", 
            "rich", 
            "average"
        ], 
        [
            "sell", 
            "draw", 
            "eat", 
            "praise"
        ], 
        [
            "achieve", 
            "watch", 
            "offer", 
            "recognize"
        ], 
        [
            "story", 
            "excuse", 
            "key", 
            "plan"
        ], 
        [
            "preparation", 
            "influence", 
            "life", 
            "generation"
        ], 
        [
            "powerful", 
            "wonderful", 
            "successful", 
            "hopeful"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "D", 
        "C", 
        "D", 
        "A", 
        "D", 
        "B", 
        "B", 
        "C", 
        "B", 
        "D", 
        "C", 
        "A", 
        "B", 
        "A", 
        "C"
    ], 
    "source": "high2656"
}