{
    "article": "I was 17 when I walked into Carley's bookstore in Ashland. As I was looking at  _    on the shelves, the shop owner asked if I'd like     a job   . I needed to start     _   for college, so I said yes. I worked after school, and the job helped   pay for   my yearly tuition. I would work many other jobs: making coffee in the Students Union; a hotel maid and   _    making maps for a company. But selling books was one of the most    _   .\nOne day a woman asked me for books on cancer. She seemed fearful. I showed her almost everything    in store   and found other books we could order. She left the store less     _   . I've always remembered the    _   I felt in having helped her.\nYears later, as a   TV reporter   in Los Angles, I heard about an immigrant child born     _   his fingers connected. His family couldn't afford a corrective operation, and the boy lived in   _   , hiding his hand in his pocket.\nI   _    my  boss to let me do the story. After the story was broadcast, a doctor and a nurse called, offering to perform the    _   for free.\nI visited the boy soon after the operation. The first thing he did was to hold up his    _    hand and said, \"Thank you.\" I felt a sense of    _   .\nIn the past, while I was    at Carley's bookstore   , I always sensed I was working for the customers, not the store. Today it's the   _   . Fox pays my salary,   _   I feel as if I work for the    _    , helping them make sense of the world.", 
    "options": [
        [
            "maps", 
            "articles", 
            "reports", 
            "titles"
        ], 
        [
            "planning", 
            "saving", 
            "preparing", 
            "studying"
        ], 
        [
            "so", 
            "yet", 
            "even", 
            "still"
        ], 
        [
            "boring", 
            "satisfying", 
            "surprising", 
            "disappointing"
        ], 
        [
            "worried", 
            "satisfied", 
            "interested", 
            "puzzled"
        ], 
        [
            "surprise", 
            "failure", 
            "regret", 
            "pride"
        ], 
        [
            "with", 
            "in", 
            "by", 
            "for"
        ], 
        [
            "horror", 
            "honor", 
            "shame", 
            "danger"
        ], 
        [
            "advised", 
            "persuaded", 
            "forced", 
            "permitted"
        ], 
        [
            "action", 
            "program", 
            "treatment", 
            "operation"
        ], 
        [
            "repaired", 
            "connected", 
            "injured", 
            "improved"
        ], 
        [
            "humor", 
            "interest", 
            "pleasure", 
            "excitement"
        ], 
        [
            "opposite", 
            "same", 
            "different", 
            "right"
        ], 
        [
            "so", 
            "and", 
            "but", 
            "because"
        ], 
        [
            "viewers", 
            "readers", 
            "customers", 
            "passengers"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "C", 
        "B", 
        "A", 
        "D", 
        "A", 
        "C", 
        "B", 
        "D", 
        "A", 
        "C", 
        "B", 
        "C", 
        "A"
    ], 
    "source": "high286"
}