{
    "article": "One spring afternoon five years ago, Jimmy Liao was crying in the hall of Taipei's Sherwood Hotel. Life seemed  _  . The people who laughed as they walked past were taking their  _  for granted, just as he used to himself. Now, however, he felt  _  --and he couldn't even show his disappointment in his  _  . Seeking more personally satisfying  _  , he had just left a successful job as a commercial artist when it seemed that fate played a cruel  _  on him. It was at this time that he developed cancer and was  _  to work. But that moment in the hotel was a turning point for Jimmy. He began to  _  the fact that there is no such a thing as fate, only  _  . Since then, he has published several imaginative, illustrated books. According to Jimmy, you are what you choose to be. You can give up or you can work to be a happier person. Jimmy realized that, while the world sometimes seems unfair, your choice can change your life. This idea can be  _  in Jimmy's books, where his characters show the powerlessness they feel before making their choices. The message that goes with Jimmy's drawings, however, is  _  . Though the world may make us feel small, we must be  _  . Everything will be all right for us--as it is for the \"small people\" in Jimmy's books--if we make choices that are  _  for us. In spite of his new  _  and wealth, Jimmy prefers working  _  at home with his wife and daughter. He spends his mornings drawing. To Jimmy, living a life as he chooses means much more than money and fame could offer.", 
    "options": [
        [
            "unhappy", 
            "unusual", 
            "unfair", 
            "uneasy"
        ], 
        [
            "health", 
            "wealth", 
            "happiness", 
            "illnesses"
        ], 
        [
            "ashamed", 
            "disappointed", 
            "helpless", 
            "endless"
        ], 
        [
            "crying", 
            "painting", 
            "imagination", 
            "consideration"
        ], 
        [
            "home", 
            "condition", 
            "situation", 
            "work"
        ], 
        [
            "game", 
            "trick", 
            "role", 
            "part"
        ], 
        [
            "unable", 
            "impossible", 
            "uncomfortable", 
            "difficult"
        ], 
        [
            "understand", 
            "face", 
            "refuse", 
            "recognize"
        ], 
        [
            "failures", 
            "efforts", 
            "choices", 
            "interests"
        ], 
        [
            "found", 
            "drawn", 
            "written", 
            "accepted"
        ], 
        [
            "powerful", 
            "hopeful", 
            "useful", 
            "successful"
        ], 
        [
            "great", 
            "strong", 
            "brave", 
            "equal"
        ], 
        [
            "scientific", 
            "basic", 
            "right", 
            "simple"
        ], 
        [
            "product", 
            "fame", 
            "name", 
            "job"
        ], 
        [
            "rapidly", 
            "separately", 
            "slowly", 
            "quietly"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "C", 
        "B", 
        "D", 
        "B", 
        "A", 
        "A", 
        "C", 
        "A", 
        "B", 
        "C", 
        "C", 
        "B", 
        "D"
    ], 
    "source": "high1415"
}