{
    "article": "Two friends visited the zoo together. The zoo was very large and it was  _  to go everywhere. They had to decide where and which animal to visit as their time was  _  . So both of them agreed not to  retrace  after choosing a  branch  at every fork . A road sign at the first fork  _  one way to the lion quarters and the other to the tiger hill. They decided on the  former  after a  _  discussion because lions were \"the king of the grassland\". The second showed a division going separately to the panda and peacock. They  _  panda as it was the nation's treasure and went its way. Thus they made choices all along the way and each choice meant  taking  what they couldn't help regretting. But they had to make it, and  _  , for it brooked no delay. If they hesitated they would miss  _  . Only  _  decision could offer more chances for sightseeing and  _  possible regret. Life is  more or less  like this--choices often occur that one has to make, for example, between two  _  jobs, two fascinating wooers . To get one you  have to  give up the other----you can get half of it. If you  spend time  weighing the pros and cons and calculating gains and losses, you will most likely  end up in  empty-handedness. Don't be sad about it.  At least  you have got half of the desirable things in life----something that is  _  to come by.", 
    "options": [
        [
            "easy", 
            "eager", 
            "impossible", 
            "possible"
        ], 
        [
            "enough", 
            "limited", 
            "tight", 
            "plentiful"
        ], 
        [
            "showed", 
            "pointed", 
            "intended", 
            "made"
        ], 
        [
            "brief", 
            "long", 
            "no", 
            "heated"
        ], 
        [
            "hoped", 
            "wanted", 
            "favored", 
            "got"
        ], 
        [
            "slowly", 
            "immediately", 
            "timely", 
            "easily"
        ], 
        [
            "less", 
            "more", 
            "most", 
            "least"
        ], 
        [
            "high", 
            "slow", 
            "short", 
            "rapid"
        ], 
        [
            "increase", 
            "rid", 
            "reduce", 
            "raise"
        ], 
        [
            "unwanted", 
            "rejected", 
            "enjoyable", 
            "desirable"
        ], 
        [
            "stupid", 
            "delighted", 
            "hard", 
            "supported"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "A", 
        "A", 
        "C", 
        "D", 
        "B", 
        "D", 
        "C", 
        "D", 
        "C"
    ], 
    "source": "high2158"
}