{
    "article": "Every dream has something to do with our feelings, longings, wishes, needs, fears, and memories. But something on the \"outside\" may affect what we   _  . If a person is hungry or tired or cold, his dream may include a feeling of this kind. If the   _  on your body has slipped off your bed, you may dream that you are   _   or resting on the ice and snow. The material for the dream you will   _   tonight is probably to come from the experiences you have today.\n  _   the subject of your dream usually comes from something that has an effect on you   _   you are sleeping (feeling of cold, a noise, a discomfort, etc.) and it may also use your past experiences and the wishes and interests you have now. This is why very young   _   are likely to dream of fairies , older children of school examinations,   _   people of food, homesick soldiers of their families and prisoners of freedom.\nTo show you how that is   _   while you are asleep and how your wishes or needs can all be joined together in a dream,   _   is the story of an experiment. A man was asleep and the back of his   _   was rubbed   _   a piece of cotton. He would dream that he   _   in a hospital and his girlfriend was visiting him,   _   on the bed and feeling gently his hand!\nThere are some scientists who have made a special   _   of why we dream, what we dream and what those dreams   _  . Their explanation of dreams, though a bit reasonable, is not accepted by everyone, but it   _   an interesting approach to the problem. They believe that dreams are   _   expressions of wishes that didn't   come true  . In other words, a dream is a way of having your wishes   _   out.", 
    "options": [
        [
            "long", 
            "dream", 
            "think", 
            "wish"
        ], 
        [
            "blanket", 
            "book", 
            "shoe", 
            "trousers"
        ], 
        [
            "working", 
            "running", 
            "sleeping", 
            "studying"
        ], 
        [
            "meet", 
            "have", 
            "see", 
            "think"
        ], 
        [
            "But", 
            "For", 
            "So", 
            "Because"
        ], 
        [
            "before", 
            "while", 
            "after", 
            "during"
        ], 
        [
            "children", 
            "fathers", 
            "drivers", 
            "gentlemen"
        ], 
        [
            "happy", 
            "sad", 
            "hungry", 
            "old"
        ], 
        [
            "taking", 
            "carrying", 
            "dreaming", 
            "happening"
        ], 
        [
            "that", 
            "here", 
            "it", 
            "this"
        ], 
        [
            "leg", 
            "head", 
            "body", 
            "hand"
        ], 
        [
            "in", 
            "with", 
            "of", 
            "off"
        ], 
        [
            "left", 
            "lived", 
            "was", 
            "gave"
        ], 
        [
            "waiting", 
            "smiling", 
            "sitting", 
            "speaking"
        ], 
        [
            "study", 
            "watch", 
            "sleep", 
            "way"
        ], 
        [
            "stand", 
            "do", 
            "form", 
            "mean"
        ], 
        [
            "makes", 
            "finds", 
            "offers", 
            "demands"
        ], 
        [
            "any", 
            "almost", 
            "hardly", 
            "mostly"
        ], 
        [
            "carried", 
            "taken", 
            "kept", 
            "called"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "B", 
        "C", 
        "B", 
        "A", 
        "C", 
        "D", 
        "B", 
        "D", 
        "B", 
        "C", 
        "C", 
        "A", 
        "D", 
        "C", 
        "D", 
        "A"
    ], 
    "source": "high193"
}