{
    "article": "Where did all the tigers go? That's what Indian Prime Minister Manmohan Singh wants to know. India's Sariska Project Tiger Reserve, once home to 26 tigers, is now home to none. Singh has ordered a police investigation into the   _  ,and created a new taskforce to save the   _  animals.\nTigers are an endangered species . Half of the world's tiger   _  live in India. For years, tigers have\nbeen disappearing from India's national parks, but Sariska may be the last\nstraw. And the government has to react.\nOn Thursday, Singh held the first meeting of   _  officials,\nwildlife experts, and related leaders, aiming to count the nation's remaining\ntigers, and to come up with a plan to keep them safe.\nIt is not hard to guess why the tigers are disappearing. Poachers   can   _  the big cats for $50,000 each. Tiger skin\nand bones are popular in Chinese  _  . A single tiger\ntooth can fetch $120. Recently, a group of poachers admitted killing ten tigers\nin Sariska and were  _  .\n\"Indian tiger poaching is probably the biggest conservation problem in modern times.\" said Belinda Wright, the head of the Wildlife Protection Society of India.\nHowever, poaching isn't the only   _  . Many poachers use\nadvanced technologies, like night glasses and long-range binoculars. Forest security officers are paid so   _  that few of them bother\nto track down the poachers. Even if a security guard were to find a poacher,\nmany carry only a stick to make him obey the law.\nTiger fans hope that Singh's plans mean end for the poachers and   _  for\nthe endangered species.", 
    "options": [
        [
            "project", 
            "disappearance", 
            "reserve", 
            "home"
        ], 
        [
            "dangerous", 
            "huge", 
            "rare", 
            "fierce"
        ], 
        [
            "population", 
            "percentage", 
            "generation", 
            "group"
        ], 
        [
            "business", 
            "trade", 
            "army", 
            "forest"
        ], 
        [
            "raise", 
            "hunt", 
            "sell", 
            "shoot"
        ], 
        [
            "food", 
            "tradition", 
            "culture", 
            "medicine"
        ], 
        [
            "found", 
            "arrested", 
            "prohibited", 
            "controlled"
        ], 
        [
            "problem", 
            "worry", 
            "crime", 
            "factor"
        ], 
        [
            "commonly", 
            "poorly", 
            "slightly", 
            "highly"
        ], 
        [
            "success", 
            "lamp", 
            "hope", 
            "achievement"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "D", 
        "C", 
        "D", 
        "B", 
        "A", 
        "B", 
        "C"
    ], 
    "source": "high1078"
}