{
    "article": "Robeson was born in a very poor family. At seven, he had to pick coal in a deserted mine near his home, and then he sold  what ,  he had picked and earned a few coins to help his parents. He had  _  schooling, for being so poor, how could they  _  school fees? When he was fifteen, he worked  _  a servant in a school.Looking at other children studying in the classroom,he felt  _  for himself.How he  _  to have the same chance! He decided to study by  himself  .In the daytime, after the sweeping and cleaning was over, he  would  stand by the window outside the classroom trying to catch what the teacher said. At night, he tried his best to remember what he  had learned  during the day. He worked  _  hard at his lessons that he sometimes had just three or four hours to sleep. The more he learned, the greater  _  he showed in his lessons. A math teacher discovered him and came to like this diligent boy and  _  him to sit at the back of the class. In one exam, he was the  _  one in the whole school who reached the highest grade. He would have been given the scholarship if he  had been  a regular student of the school. Robeson  _  through six long years with his study of math and wrote several articles which captured the  _  of some university professors.They admired his talent  as well as  his diligence.To give him a good chance, they hired him as a librarian and  _  him free guidance.Robeson felt  _  , for he was sure that before him there was a broad road  leading to  success.", 
    "options": [
        [
            "many", 
            "few", 
            "little", 
            "much"
        ], 
        [
            "buy", 
            "afford", 
            "send", 
            "read"
        ], 
        [
            "as", 
            "like", 
            "for", 
            "by"
        ], 
        [
            "angry", 
            "happy", 
            "proud", 
            "sorry"
        ], 
        [
            "hated", 
            "decided", 
            "wished", 
            "regretted"
        ], 
        [
            "very", 
            "so", 
            "too", 
            "quite"
        ], 
        [
            "joy", 
            "interest", 
            "time", 
            "taste"
        ], 
        [
            "allowed", 
            "agreed", 
            "let", 
            "refused"
        ], 
        [
            "worst", 
            "only", 
            "last", 
            "laziest"
        ], 
        [
            "learned", 
            "listened", 
            "mastered", 
            "struggled"
        ], 
        [
            "notice", 
            "influence", 
            "eyes", 
            "attention"
        ], 
        [
            "taught", 
            "offered", 
            "lent", 
            "sent"
        ], 
        [
            "sad", 
            "angry", 
            "happy", 
            "disappointed"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "A", 
        "D", 
        "C", 
        "B", 
        "B", 
        "A", 
        "B", 
        "D", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "high2641"
}