{
    "article": "A woman named Emily renewing her driver's license at the County Clerk's office was asked to state her occupation. She   _  , uncertain how to classify herself.\n\"What I mean is,\" explained the recorder, \"do you have a job, or are you just a ...\"\n\"  Of course   I have a job,\" said Emily. \"I'm a mother.\"\n \"We don't list 'mother' as an occupation... 'housewife'   _  it,\" said the recorder.\nOne day I found myself in the same   _  . The clerk was obviously a career woman, efficient, confident and possessed of a high sounding title like, \"Official Interrogator\"or \"Town Registrar. \" \"What is your occupation?\" she asked.\nSomehow, the words simply   popped out  . \"I'm a Research Associate in the field of Child Development and Human Relations.\"\nThe clerk paused, ballpoint pen   _   in midair, and looked up as though she had not heard right.\nI repeated the   _   slowly, then I stared   with wonder   as my statement was written in  , black ink on the official questionnaire.\n\"Might I ask,\" said the clerk with new interest, \"just what you do in this field?\"\n  _  , without any trace of panic in my voice, I heard myself reply, \"I have a continuing program of research (what mother doesn't), in the lab and in the field (normally I   would have said   indoors and out). Of course, the job is one of the most demanding in the humanities(any mother care to disagree?), and I often work 14 hours a day (24 is more like   _  ), but rewards are more of a satisfaction   rather than  just money.\"\nThere was an increasing   _   of respect in the clerk's voice as she completed the form, stood up, and showed me out.\nAs I drove into our driveway, buoyed up  by my glamorous new career, I was greeted by my lab assistants--ages 13, 7, and 3.Upstairs I could hear our new experimental model (a 6 month old baby), in the child-development program,   testing out   a new vocal pattern.\nI felt proud! I had gone on the official records as someone more distinguished and indispensable  to mankind than \"just another mother.\"\nMotherhood...What a glorious career!   _   when there's a title on the door.", 
    "options": [
        [
            "doubted", 
            "interrupted", 
            "hesitated", 
            "admired"
        ], 
        [
            "covers", 
            "lists", 
            "replaces", 
            "means"
        ], 
        [
            "office", 
            "way", 
            "lab", 
            "situation"
        ], 
        [
            "frozen", 
            "shaking", 
            "dropped", 
            "flying"
        ], 
        [
            "career", 
            "title", 
            "field", 
            "question"
        ], 
        [
            "Fortunately", 
            "Excitedly", 
            "Obviously", 
            "Coolly"
        ], 
        [
            "them", 
            "it", 
            "one", 
            "others"
        ], 
        [
            "note", 
            "sound", 
            "amount", 
            "praise"
        ], 
        [
            "Certainly", 
            "Unexpectedly", 
            "Usually", 
            "Especially"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "A", 
        "B", 
        "D", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "high1156"
}