{
    "article": "A 16-year-old in foster care has finally found a home. His adoption caseworker  , who has known him since he was 7, will become his adoptive mother this month.\nIn October 2013, Davion Only spoke in front of a church congregation   in St. Petersburg, Florida, and made an   _  for adoption. He had recently learned that his  _  mother, who'd been in jail since Only was born, had died. He had spent years bouncing between foster homes. \"My name is Davion and I've been in foster care since I was born,\" he said. \"I know God hasn't given up on me, so I'm not giving up either.\"\nThe   _   plea   went viral, and Only's foster agency   _   calls from more than 10,000 people, according to the Tampa Bay Times. Only  ended up  traveling to Ohio to live with a minister's family. But after Only got into a physical  _  with one of his older would-be siblings  , the minister and his wife changed their minds.\nBack in Florida, Only passed through four different   _  homes over the next year, until he called Connie Going, his adoption caseworker, to make a special  _  .\nOnly had known Going for nearly ten years, and had asked every year if she would adopt him but she always  _  . \"I always believed there was a better family than us out there,\" Going tells Yahoo Parenting. \"He  _  so much in this world.\"\nBut this past July, when Only called and asked again if she might adopt him, Going says something felt  different  . \"In adoption there is a 'claiming moment,' when you know someone is your child. When he called me to ask, in that moment, I just knew,\" she says. \"When he asked me, my heart felt this   _  and I just knew he was my son.\"\nSo Going, 52, invited Only to start spending time  _  the rest of her family -- the other four children who she also adopted out of foster care.   _  , Going managed to rent a bigger home, got a lawyer, and started adoption  _  .\nOnly will officially join Going's family on April 22, when the adoption  goes through  . \"Today, I am feeling blessed and honored by being chosen to be the parent to all my children,\" she says. \"I work every day on being the best parent I can to them, to be patient and creative so that I can  _  all their needs.\"\nA spokesperson for Eckerd, Only's foster agency, told the Tampa Bay Times they were  _  with the new development. \"We are truly thrilled that Davion has been united with his forever family.\"\nWhile Going is waiting for the newest  _  to her family to become official in the eyes of the law, she says Only is already her child. \"I want him to know he is   _  loved for who he is, the way he is,\" she says. \"The changes he chooses to make in his life, and the choices, are his to make. As a family we will be there through it all, the good and the bad for our lifetime. He is home.\"", 
    "options": [
        [
            "apology", 
            "compensation", 
            "appeal", 
            "call"
        ], 
        [
            "biological", 
            "botanic", 
            "adoptive", 
            "adaptive"
        ], 
        [
            "delighting", 
            "satisfying", 
            "annoying", 
            "heartbreaking"
        ], 
        [
            "received", 
            "accepted", 
            "made", 
            "answered"
        ], 
        [
            "quarrel", 
            "experiment", 
            "examination", 
            "fight"
        ], 
        [
            "permanent", 
            "full-time", 
            "rich", 
            "temporary"
        ], 
        [
            "question", 
            "request", 
            "order", 
            "resolution"
        ], 
        [
            "determined", 
            "hesitated", 
            "involved", 
            "devoted"
        ], 
        [
            "declares", 
            "develops", 
            "discovers", 
            "deserves"
        ], 
        [
            "force", 
            "courage", 
            "ache", 
            "energy"
        ], 
        [
            "on", 
            "with", 
            "in", 
            "to"
        ], 
        [
            "Particularly", 
            "Constantly", 
            "Previously", 
            "Eventually"
        ], 
        [
            "performances", 
            "procedures", 
            "persuasion", 
            "production"
        ], 
        [
            "refuse", 
            "ignore", 
            "meet", 
            "neglect"
        ], 
        [
            "pleased", 
            "angry", 
            "disappointed", 
            "enthusiastic"
        ], 
        [
            "burden", 
            "brother", 
            "addition", 
            "trouble"
        ], 
        [
            "unconditionally", 
            "conditionally", 
            "partly", 
            "amazingly"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "A", 
        "D", 
        "D", 
        "B", 
        "B", 
        "D", 
        "C", 
        "B", 
        "D", 
        "B", 
        "C", 
        "A", 
        "C", 
        "A"
    ], 
    "source": "high2479"
}