{
    "article": "When the earth was very young, the night and the animals didn't exist. There were only trees, plants and people. During this time, the sun shone very   _  . The people\nwere always very  _  because they didn't sleep well.\nThe trees were faded because of the  _  weather.\n  Only the Big Snake who was a witch   could make the night   _  . She kept night on the bottom of\nthe river, inside a coconut .\n  The witch enjoyed seeing the people very tired and  _  . The Indians begged her to give them  _  , but it was useless.\n  One day, the snake's beautiful Indian daughter married. Like her   _  , she  didn't need  the night to rest. But her husband and the other people of the\nvillage were always tired. She didn't like to see them\n  _  . So she told her husband that she would ask her   _  to give\nher the night. Her mother never  _  her requests.\n  Her husband sent three faithful servants to take the night from the   _  . The witch\ndidn't like the idea about giving them night, but she couldn't refuse her\ndaughter's request.\n  She gave them the  _  with\nthe night inside and told them that only her daughter might  _  it.\nIf another person opened the coconut, the  _  would\ncover the earth forever. The servants agreed. During their return they heard\nstrange noises inside the coconut. They became very  _  and\ncould wait no longer and opened the coconut. When they did it, all became very  _  . No one could see anything. Far away at the village, the witch's daughter\ntold her husband that his three servants had opened the coconut. How could the\npeople live the dark?\n  But his wife had powers and thought of a solution. She took a string of her hair and cut the   _  with\nit. Soon the dawn appeared. Now there would be both day and night.\n  The three foolish servants tried to explain what they had   _  but it was  _  . The witch's daughter turned them into three monkeys.", 
    "options": [
        [
            "straightly", 
            "brightly", 
            "quickly", 
            "warmly"
        ], 
        [
            "happy", 
            "excited", 
            "tired", 
            "strong"
        ], 
        [
            "hot", 
            "cold", 
            "warm", 
            "strange"
        ], 
        [
            "disappear", 
            "appear", 
            "stay", 
            "stop"
        ], 
        [
            "ill", 
            "fine", 
            "weak", 
            "sleepy"
        ], 
        [
            "day", 
            "food", 
            "rest", 
            "night"
        ], 
        [
            "friend", 
            "father", 
            "mother", 
            "husband"
        ], 
        [
            "suffer", 
            "sleep", 
            "work", 
            "rest"
        ], 
        [
            "sister", 
            "brother", 
            "family", 
            "mother"
        ], 
        [
            "promised", 
            "finished", 
            "refused", 
            "received"
        ], 
        [
            "witch", 
            "sky", 
            "river", 
            "village"
        ], 
        [
            "box", 
            "basket", 
            "coconut", 
            "river"
        ], 
        [
            "close", 
            "open", 
            "see", 
            "take"
        ], 
        [
            "sun", 
            "day", 
            "coconut", 
            "darkness"
        ], 
        [
            "angry", 
            "tired", 
            "curious", 
            "asleep"
        ], 
        [
            "bright", 
            "dark", 
            "late", 
            "hot"
        ], 
        [
            "coconut", 
            "day", 
            "sky", 
            "night"
        ], 
        [
            "done", 
            "seen", 
            "got", 
            "thought"
        ], 
        [
            "useful", 
            "useless", 
            "terrible", 
            "nothing"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "B", 
        "D", 
        "D", 
        "C", 
        "A", 
        "D", 
        "C", 
        "A", 
        "C", 
        "B", 
        "D", 
        "C", 
        "B", 
        "C", 
        "A", 
        "B"
    ], 
    "source": "high3005"
}