{
    "article": "Recently I understood the true meaning of love. The  _  was Kane, my neighbor Joline's two-year-old son.\nKane was born with a physical problem on his  _  . And I witnessed the  _  that Kane's physical  shortcomings  had on his family. I also witnessed much  more than  that. I saw a  _  family that embraced   this special child. A family that wouldn't allow Kane to know he was  _  . Joline had constructed a small cart just a few inches off the floor for his son to  get around  . Kane used his hands to move about, and the cart  _  him to \"go to\" any place just as everyone else was able to do. Kane was not just a member of the family, but the  _  of the family.\nWith a wide smile, it was easy to see that even at the age of two, Kane liked to  _  with people very much. With wisdom of an individual, this boy even  _  the most complex of human emotions. Later I came to  _  that this child was sent to help some of us who weren't just getting what love was all about.\nKane demanded attention,  _  not because of his mobility   challenges or other apparent shortcomings. In his mind, he had no  _  or shortcomings. The  _  was that he received attention because he was alive and real and had so much to offer.\nKane  _  me in a deep way. His ability to refuse to be different has  _  me. Kane was and is  _  lots of warm and powerful energy to me. From him and his family I learnt the  _  : love surpasses   all things. I can only imagine that as the parent of a child like Kane one might be filled with  _  . But I believe that having a child like Kane is actually a(n)  _  . The parents of such special babies are angles too, just as the babies are.", 
    "options": [
        [
            "problem", 
            "reason", 
            "matter", 
            "pressure"
        ], 
        [
            "hands", 
            "eyes", 
            "legs", 
            "arms"
        ], 
        [
            "effect", 
            "comment", 
            "demand", 
            "look"
        ], 
        [
            "similar", 
            "wonderful", 
            "practical", 
            "fair"
        ], 
        [
            "irregular", 
            "difficult", 
            "different", 
            "terrible"
        ], 
        [
            "invited", 
            "allowed", 
            "advised", 
            "caused"
        ], 
        [
            "symbol", 
            "signal", 
            "center", 
            "mark"
        ], 
        [
            "communicate", 
            "compare", 
            "agree", 
            "compete"
        ], 
        [
            "reminded", 
            "understood", 
            "discovered", 
            "trusted"
        ], 
        [
            "recognize", 
            "experience", 
            "imagine", 
            "realize"
        ], 
        [
            "and", 
            "or", 
            "but", 
            "as"
        ], 
        [
            "challenges", 
            "expectations", 
            "promises", 
            "chances"
        ], 
        [
            "goal", 
            "result", 
            "possibility", 
            "truth"
        ], 
        [
            "touched", 
            "stopped", 
            "caught", 
            "kept"
        ], 
        [
            "puzzled", 
            "shocked", 
            "amused", 
            "inspired"
        ], 
        [
            "even", 
            "yet", 
            "still", 
            "almost"
        ], 
        [
            "lesson", 
            "subject", 
            "notice", 
            "skill"
        ], 
        [
            "excitement", 
            "determination", 
            "anger", 
            "anxiety"
        ], 
        [
            "ability", 
            "advantage", 
            "problem", 
            "Exception"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "B", 
        "C", 
        "B", 
        "C", 
        "A", 
        "B", 
        "D", 
        "C", 
        "A", 
        "D", 
        "A", 
        "D", 
        "C", 
        "A", 
        "D", 
        "B"
    ], 
    "source": "high987"
}