{
    "article": "One fine afternoon I was walking along the Fifth Avenue, when I remembered that it was necessary to buy a pair of socks. I  turned into  the first sock shop that caught my eye, and  a boy clerk  , not more than 17, came forward. \"What can I do for you, sir?\" \"I wish to  _  a pair of socks.\"  His eyes  glowed. \"Did you know that you had come into  the best place  in the world to buy socks?\" I had not been  aware of  that, as my entrance had been accidental. \"Come with me,\" said the boy happily. He began to  _  down from the shelves box after box. \"  Hold on  , boy, I'm going to buy only one pair!\" \"I know that, but I want you to see how beautiful these are. Aren't they wonderful?\" There was  on his face  an expression of joy,  as if  he were revealing to me the  _  of his religion. I became far more interested in him than in the socks. \"My friend,\" said I, \"if this is  not merely  the enthusiasm from freshness, and you can keep it up  day after day  , in ten years you'll own every sock in the United States.\" My amazement at his pride in  _  will be understood by all who read this article. In many shops the customer has to wait for someone to  wait upon  him. When  _  some clerk does notice you, you are made to feel as if you were interrupting him.  _  possibly that very clerk who is now so  _  began his career with enthusiasm. The freshness  wore off  ; he became a mechanical salesman. I've observed such change in the lives of so many men in so many occupations that I've come to the  _  that the fastest road to failure is to do things mechanically.", 
    "options": [
        [
            "buy", 
            "find", 
            "see", 
            "have"
        ], 
        [
            "push", 
            "force", 
            "look", 
            "drag"
        ], 
        [
            "beliefs", 
            "stories", 
            "values", 
            "mysteries"
        ], 
        [
            "passion", 
            "salesmanship", 
            "enthusiasm", 
            "job"
        ], 
        [
            "accidentally", 
            "occasionally", 
            "finally", 
            "disrespectfully"
        ], 
        [
            "Yet", 
            "So", 
            "Then", 
            "For"
        ], 
        [
            "enthusiastic", 
            "unconcerned", 
            "different", 
            "responsible"
        ], 
        [
            "response", 
            "realization", 
            "conclusion", 
            "circumstance"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "D", 
        "B", 
        "C", 
        "A", 
        "B", 
        "C"
    ], 
    "source": "high2462"
}