{
    "article": "You may be surprised to see \"making sure children never suffer\" as a mistake. The following  _  may help you understand how rescuing children from all suffering  _  weakness. A little boy felt sorry for a butterfly struggling to  _  from its chrysalis. He decided to  _  the butterfly. So he peeled the chrysalis open for the butterfly. The little boy was so  _  to watch the butterfly spread its wings and fly off into the sky. Then he was horrified  _  he watched the butterfly fall to the ground and die because it did not have the muscle  _  to keep flying. In fact, the butterfly's struggle to  break away from with  the chrysalis helps the butterfly become stronger. Like the little boy,  _  too often want to protect their children from struggle in the  _  of love. They don't realize that their children need to struggle, to experience  _  , to deal with disappointment, and to solve their own problems. Only in this way can children  _  their emotional strength, become  _  and develop the skills necessary for the even bigger struggles they will meet throughout their lives. Children experiencing sufferings can  _  the ups and downs of life. However, it isn't helpful either in this case when parents  _  lectures , blame and shame to what the child is experiencing. Mothers  _  to say, \"Stop crying and acting like a spoiled boy. You can't always get what you want.\" These  _  words should be avoided. Instead, parents can offer loving support. You can say, \"Don't lose  _  . Be brave! You will succeed if you try again.\" Then comes the tough part--no  _  a no lectures. Simply allow him to discover that he can get over his disappointment and  figure out  what he can do to get what he wants in the future.", 
    "options": [
        [
            "story", 
            "proverb", 
            "saying", 
            "Experiment"
        ], 
        [
            "damages", 
            "burns", 
            "creates", 
            "experiences"
        ], 
        [
            "hear", 
            "suffer", 
            "date", 
            "emerge"
        ], 
        [
            "kill", 
            "feed", 
            "help", 
            "rescue"
        ], 
        [
            "excited", 
            "moved", 
            "puzzled", 
            "depressed"
        ], 
        [
            "as", 
            "since", 
            "before", 
            "until"
        ], 
        [
            "power", 
            "energy", 
            "strength", 
            "force"
        ], 
        [
            "teachers", 
            "parents", 
            "relatives", 
            "friends"
        ], 
        [
            "case", 
            "charge", 
            "name", 
            "course"
        ], 
        [
            "friendships", 
            "scholarships", 
            "relationships", 
            "hardships"
        ], 
        [
            "strengthen", 
            "require", 
            "get", 
            "achieve"
        ], 
        [
            "warm-hearted", 
            "strong-willed", 
            "absent-mind", 
            "cold-blooded"
        ], 
        [
            "expect", 
            "predict", 
            "survive", 
            "avoid"
        ], 
        [
            "add", 
            "adapt", 
            "devote", 
            "contribute"
        ], 
        [
            "pretend", 
            "happen", 
            "tend", 
            "seem"
        ], 
        [
            "discouraging", 
            "inspiring", 
            "interesting", 
            "touching"
        ], 
        [
            "heart", 
            "face", 
            "sight", 
            "weight"
        ], 
        [
            "parking", 
            "smoking", 
            "drinking", 
            "rescuing"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "D", 
        "C", 
        "A", 
        "A", 
        "C", 
        "B", 
        "C", 
        "D", 
        "A", 
        "B", 
        "C", 
        "A", 
        "C", 
        "A", 
        "A", 
        "D"
    ], 
    "source": "high896"
}