{
    "article": "I take the firm position that parents do not owe their children a college education. If they can  _  it, they will certainly send them to the best universities. But they need not feel  _  if they can't. If the children really want to go, they'll find a  _  . There are plenty of loans and scholarships for the bright and  _  ones who can't afford to pay. When children grow up and want to  get married  , their parents do not owe them a down payment on a house. They do not have the  _  to baby-sit their grandchildren. If they want to do it, it must be considered a  _  not an obligation (, ). Do parents owe their children anything? Yes, they owe them a great deal. One of their obligations is to give their children a personal  _  . A child who is constantly made to feel stupid and unworthy, constantly  _  to brighter brothers, sisters, or cousins will become so  _  , so afraid of failing that he (or she) won't try at all. Of course they should be  _  corrected when they do wrong, but it's often better to let children learn their mistakes by themselves  in time  . All our parents should do is to trust them, respect them, tolerate them and give them chances to try and fail. They must learn to stand  _  . When criticisms are really needed, they should be  _  with praises, with a smile and a kiss. That is the way children learn. Parents owe their children a set of solid values around  _  to build their lives. This means teaching them to  _  the rights and opinions of others; it means being respectful to elders, to teachers, and to the law. The best way to teach such values is by deed and  _  . A child who is lied to will  _  . A child who sees no laughter and no love in the home will have difficulty laughing and loving. No child asks to be  _  . If you bring a life into the world, you owe the child  _  .", 
    "options": [
        [
            "find", 
            "afford", 
            "get", 
            "accept"
        ], 
        [
            "disappointed", 
            "unhappy", 
            "guilty", 
            "dissatisfied"
        ], 
        [
            "supply", 
            "hope", 
            "way", 
            "hand"
        ], 
        [
            "healthy", 
            "honest", 
            "eager", 
            "wealthy"
        ], 
        [
            "time", 
            "duty", 
            "right", 
            "energy"
        ], 
        [
            "service", 
            "pleasure", 
            "habit", 
            "favor"
        ], 
        [
            "affair", 
            "value", 
            "belief", 
            "ability"
        ], 
        [
            "compared", 
            "brought", 
            "forced", 
            "taken"
        ], 
        [
            "unusual", 
            "unsure", 
            "unknown", 
            "unfair"
        ], 
        [
            "gently", 
            "properly", 
            "nearly", 
            "possibly"
        ], 
        [
            "honor", 
            "failure", 
            "progress", 
            "test"
        ], 
        [
            "mixed", 
            "included", 
            "balanced", 
            "shared"
        ], 
        [
            "it", 
            "which", 
            "whom", 
            "what"
        ], 
        [
            "consider", 
            "refuse", 
            "follow", 
            "respect"
        ], 
        [
            "blame", 
            "experience", 
            "example", 
            "lesson"
        ], 
        [
            "lie", 
            "win", 
            "lose", 
            "cry"
        ], 
        [
            "praised", 
            "born", 
            "alone", 
            "poor"
        ], 
        [
            "everything", 
            "nothing", 
            "anything", 
            "something"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "C", 
        "C", 
        "B", 
        "D", 
        "B", 
        "A", 
        "B", 
        "B", 
        "B", 
        "C", 
        "B", 
        "D", 
        "C", 
        "A", 
        "B", 
        "D"
    ], 
    "source": "high2923"
}