{
    "article": "The train shook back and forth, its wheels making a loud noise against the tracks. Outside the window the freezing cold of winter ruled. The carriage was filled with cold, 31 _  passengers.\nSuddenly a little boy 32 _  his way through the grown-up legs and sat down by the window. He was all alone among the 33 _  grown-ups. What a brave child, I thought. His father 34 _  to stay by the door behind us. The train began to crawl into a tunnel. Then something very strange happened suddenly. The serious little boy 35 _  down from his seat and leaned   his hand on my knee. 36 For a moment , I thought that he wanted to 37 _  me and return to his father, so I helped him to stand up. But instead he leaned forward and held his 38 _  up towards mine. He wanted to say something to me, I thought. I lowered my head to receive the 39 _ . Wrong again! What I received was a 40 _  kiss on the cheek.\nThe boy calmly returned to his seat, leaned back and continued looking out of the window. I was 41 _ . What had just happened? A child kissing a(n) 42 _  grown-up on the train. How could anybody want to kiss such a man that had so much beard? Soon enough, all of my neighbors were duly 43 _ . Nervous and a little surprised, we 44 _  at the father. When he saw our questioning    _   as he got ready for his stop, he offered a clue.\n\"He's so happy to be alive,\" the father said. \"He has been very sick.\"\nFather and son 46 _  into the crowd moving towards the exit. Then doors closed and the train went on. On my cheek I can still 47 _  the child's kiss -- a kiss that has triggered   some soul-searching inside me. How many grown-ups 48 go around  kissing each other from the joy of being alive? How many even give much thought to the privilege of 49 _ ?\nThe little kisser had taught us a sweet but serious lesson: Be careful. You don't let yourself 50 _  before your heart stops!", 
    "options": [
        [
            "excited", 
            "tired", 
            "pleased", 
            "surprised"
        ], 
        [
            "felt", 
            "lost", 
            "pushed", 
            "picked"
        ], 
        [
            "unfriendly", 
            "outspoken", 
            "angry", 
            "easygoing"
        ], 
        [
            "liked", 
            "longed", 
            "chose", 
            "agreed"
        ], 
        [
            "turned", 
            "slid", 
            "settled", 
            "pulled"
        ], 
        [
            "tell", 
            "strike", 
            "approach", 
            "pass"
        ], 
        [
            "nose", 
            "hand", 
            "head", 
            "shoulder"
        ], 
        [
            "news", 
            "message", 
            "information", 
            "opinion"
        ], 
        [
            "loud", 
            "foolish", 
            "strange", 
            "fortunate"
        ], 
        [
            "pleased", 
            "shocked", 
            "satisfied", 
            "interested"
        ], 
        [
            "sceptical", 
            "sensitive", 
            "unknown", 
            "familiar"
        ], 
        [
            "praised", 
            "kissed", 
            "scolded", 
            "persuaded"
        ], 
        [
            "shouted", 
            "smiled", 
            "aimed", 
            "whispered"
        ], 
        [
            "glances", 
            "images", 
            "mouths", 
            "gestures"
        ], 
        [
            "looked", 
            "returned", 
            "disappeared", 
            "separated"
        ], 
        [
            "touch", 
            "trust", 
            "smell", 
            "feel"
        ], 
        [
            "sharing", 
            "kissing", 
            "living", 
            "touching"
        ], 
        [
            "die", 
            "stop", 
            "sleep", 
            "live"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "C", 
        "B", 
        "D", 
        "C", 
        "B", 
        "A", 
        "B", 
        "C", 
        "B", 
        "B", 
        "A", 
        "C", 
        "D", 
        "C", 
        "A"
    ], 
    "source": "high285"
}