{
    "article": "About ten years ago, I was on a plane going west, and a young woman boarded and sat across the aisle from me. I  _  her for two reasons. She was very attractive, and she was holding a teddy bear about half her  _  . I teased her by asking if she had a  _  for the bear. She laughed and said no. About halfway through the flight she  _  over and told me she was going to Tucson to enter rehab . She  _  to share her life story with me. She had been working as a dancer in a nightclub. That  _  had led her down a dark  _  to drugs and alcohol. As I listened to her story. I was  _  at all she had gone through. I listened to all she shared and told her I was sure she was going to  _  it. At the end of the flight, she  _  me for listening to her. A few years later, I got a  _  in the mail saying, \"Wow, it's been years since we met on that plane. It is  _  how you touched my life.\" She went on to tell me that she had  _  to stay away from drugs, and had been working for a radio station. She felt she had achieved things she could not have  _  that day on the plane. We agreed to set up a time to get  _  . When I saw her, she was  _  the attractive young woman I remembered. She told me that that little  _  we had had turned her life around. She had boarded the plane  _  anything would work in her life, and my affirmation of her as a person and of her  _  had given her the last bit of  _  she needed to work through her problems. The young woman taught me it's never too late to make a new start in life.", 
    "options": [
        [
            "found", 
            "helped", 
            "recognized", 
            "noticed"
        ], 
        [
            "shape", 
            "size", 
            "weight", 
            "leg"
        ], 
        [
            "name", 
            "friend", 
            "ticket", 
            "cloth"
        ], 
        [
            "moved", 
            "leaned", 
            "looked", 
            "pulled"
        ], 
        [
            "agreed", 
            "learned", 
            "continued", 
            "refused"
        ], 
        [
            "manner", 
            "feeling", 
            "event", 
            "lifestyle"
        ], 
        [
            "door", 
            "path", 
            "key", 
            "point"
        ], 
        [
            "disappointed", 
            "worried", 
            "surprised", 
            "blamed"
        ], 
        [
            "own", 
            "reach", 
            "leave", 
            "make"
        ], 
        [
            "criticized", 
            "avoided", 
            "thanked", 
            "remembered"
        ], 
        [
            "note", 
            "word", 
            "case", 
            "text"
        ], 
        [
            "effective", 
            "amazing", 
            "easy", 
            "clear"
        ], 
        [
            "managed", 
            "tried", 
            "decided", 
            "worked"
        ], 
        [
            "realized", 
            "produced", 
            "required", 
            "imagined"
        ], 
        [
            "through", 
            "along", 
            "together", 
            "off"
        ], 
        [
            "never", 
            "still", 
            "once", 
            "even"
        ], 
        [
            "expectation", 
            "explanation", 
            "information", 
            "conversation"
        ], 
        [
            "doubting", 
            "promising", 
            "believing", 
            "admitting"
        ], 
        [
            "condition", 
            "discoveries", 
            "criticism", 
            "possibilities"
        ], 
        [
            "delight", 
            "interest", 
            "strength", 
            "character"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "C", 
        "B", 
        "C", 
        "D", 
        "B", 
        "C", 
        "D", 
        "C", 
        "A", 
        "B", 
        "A", 
        "D", 
        "C", 
        "B", 
        "D", 
        "A", 
        "D", 
        "C"
    ], 
    "source": "high2147"
}