{
    "article": "My son was badly hurt in a fire. After he  _  from a series of treatments, the doctors told him they would not do any operation for six months  _  it took long for the skin to stop shrinking . So, he had to return to college with a visible 10-inch  _  on his face. I said to my son, \"Keaton,  no one  will pay any more attention to your scar  _  you do. If it does not bother you, it will not bother  _  .\" He took my advice to heart and returned to school with his head  _  high -- glad he was alive.  In fact  , everyone has scars and shortcomings. Some of you may spend much time thinking that people would like you better,  if  you looked different, or dressed differently, or could have a different and newer  _  . But you see, like Keaton's scar, people will only judge you by your looks, or your  _  , or your car, if you are judging yourself by these same false  _  . One of my friends in college was very  _  . At first, when people met him, they noticed his  _  for about 10 seconds. This man felt  _  about himself and spent most of his time  _  about other people's comfort and welfare .  _  , people ignored his looks. What people  _  was his kindness and his concern for them. He didn't act in an ugly way so people didn't treat him as an ugly man. Therefore, concentrate on what you value  _  yourself, because if you can see that beautiful person, everyone you are in contact with will see the same  _  .", 
    "options": [
        [
            "cured", 
            "recovered", 
            "improved", 
            "returned"
        ], 
        [
            "because", 
            "though", 
            "until", 
            "before"
        ], 
        [
            "cut", 
            "wound", 
            "injure", 
            "scar"
        ], 
        [
            "as", 
            "like", 
            "than", 
            "when"
        ], 
        [
            "another", 
            "others", 
            "all", 
            "us"
        ], 
        [
            "put", 
            "held", 
            "taken", 
            "hung"
        ], 
        [
            "house", 
            "telephone", 
            "job", 
            "car"
        ], 
        [
            "clothes", 
            "hairstyle", 
            "figure", 
            "salary"
        ], 
        [
            "means", 
            "standards", 
            "comments", 
            "rules"
        ], 
        [
            "smart", 
            "optimistic", 
            "rude", 
            "ugly"
        ], 
        [
            "manners", 
            "expressions", 
            "looks", 
            "actions"
        ], 
        [
            "lucky", 
            "worried", 
            "good", 
            "sad"
        ], 
        [
            "inquiring", 
            "asking", 
            "knowing", 
            "caring"
        ], 
        [
            "Completely", 
            "Gradually", 
            "Obviously", 
            "Suddenly"
        ], 
        [
            "wanted", 
            "understood", 
            "brought", 
            "saw"
        ], 
        [
            "within", 
            "beyond", 
            "except", 
            "above"
        ], 
        [
            "kindness", 
            "concern", 
            "beauty", 
            "perfection"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "D", 
        "C", 
        "B", 
        "B", 
        "D", 
        "A", 
        "B", 
        "D", 
        "C", 
        "C", 
        "D", 
        "B", 
        "D", 
        "A", 
        "C"
    ], 
    "source": "high1704"
}