{
    "article": "When my son unexpectedly volunteered for the Marines , I was busy writing my novels and giving little thought to the men and women in the army .\nMy son John Schaeffer, recently came home   _   from the Middle East. He slowly appeared from a broken car. John   had driven   all night from a base near Washington,   _   he had landed the day before. He did not want me to   _   him there. \"I need time to myself,\" my son said   _   calling from Kuwait on the way home.\nI gave my wife a head start. Mother   _   son. \"I was so worried,\" Genie said. She pulled away to look up again and again to   make sure   he was really there.\nMy wife gave me a great gift:   _   alone with my boy. John was tired and lay   _   on his bed. I lay down next to him and was grasping his hand the whole time. I just wanted to be certain that the nightmares I'd had about John being killed were   _   .\nI kept holding my son, the way I   used to   when he was two and came into our bed after a   _   dream. I asked John if he'd rather sleep than talk, and he said there would be time for   _   later.\nWith the   _   over, under and around me came incredible tiredness. I slept with his voice dying away. It was the first good   _   I'd had in months. I woke and John was asleep next to me. Sitting by his bed watching him breathe, I found myself praying and   _   for all the fathers, mothers, sons, daughters, husbands and wives of those who were not coming home. For the first time in my life, I was weeping for   _   .\nBefore my son went to war I would never have shed tears for them. My son   _   me. He taught me that our men and women in uniform are not the \"54 _ \". They are our sons, daughters, brothers and sisters. Sometimes shedding tears for strangers is a holy   _   . Sometimes it's all we can do.", 
    "options": [
        [
            "angry", 
            "alive", 
            "frightened", 
            "excited"
        ], 
        [
            "when", 
            "where", 
            "which", 
            "who"
        ], 
        [
            "meet", 
            "congratulate", 
            "permit", 
            "accept"
        ], 
        [
            "once", 
            "when", 
            "unless", 
            "since"
        ], 
        [
            "abandoned", 
            "patted", 
            "concluded", 
            "embraced"
        ], 
        [
            "period", 
            "chance", 
            "time", 
            "moment"
        ], 
        [
            "expanded", 
            "stretched", 
            "extending", 
            "spreading"
        ], 
        [
            "facts", 
            "truth", 
            "proofs", 
            "lies"
        ], 
        [
            "happy", 
            "cheerful", 
            "scary", 
            "dull"
        ], 
        [
            "advice", 
            "discussion", 
            "talk", 
            "sleep"
        ], 
        [
            "chat", 
            "worries", 
            "meeting", 
            "curiosity"
        ], 
        [
            "conversation", 
            "observation", 
            "sleep", 
            "difficulty"
        ], 
        [
            "crying", 
            "cursing", 
            "screaming", 
            "regretting"
        ], 
        [
            "friends", 
            "neighbors", 
            "strangers", 
            "soldiers"
        ], 
        [
            "persuaded", 
            "changed", 
            "frightened", 
            "accused"
        ], 
        [
            "another", 
            "other", 
            "others", 
            "one"
        ], 
        [
            "function", 
            "adventure", 
            "duty", 
            "shame"
        ]
    ], 
    "answers": [
        "B", 
        "B", 
        "A", 
        "B", 
        "D", 
        "C", 
        "B", 
        "D", 
        "C", 
        "D", 
        "B", 
        "C", 
        "A", 
        "C", 
        "B", 
        "C", 
        "C"
    ], 
    "source": "high1232"
}