{
    "article": "The Internet affords anonymity  to its users, a blessing to privacy and freedom of speech. But that very anonymity is also behind the explosion of cyber-crime that has  _  across the Web.\n  Can privacy be preserved   _  bringing\nsafety and security to a world that seems increasingly  _  ? \n  Last month, Howard Schmidt, the nation's cyber-czar, offered the federal government a  _  to make the Web a\nsafer place-a \"voluntary trusted identity\" system that would be the high-tech  _  of a physical key, a fingerprint and a photo ID card, all rolled  _  one. The system might use\na smart identity card, or a digital credential  _  to\na specific computer .and would authenticate  users at a range of online services. \n  The idea is to  _  a federation of\nprivate online identity systems. User could  _  which system to join, and only registered users whose identities have been authenticated could navigate  those systems. The approach contrasts with one that would require an Internet driver's license  _  by\nthe government.\n  Google and Microsoft are among companies that already have these \"single sign-on\" systems that make it possible for users to  log in  just once but use many different services.\n    In effect   .the approach would create a \"walled garden\" n cyberspace, with safe \"neighborhoods\" and bright \"streetlights\" to establish a sense of a  _  community.\n  Mr. Schmidt described it as a \"voluntary ecosystem\" in which \"individuals and organizations can complete online transactions with  _  ,trusting the identities of each other and the identities of the infrastructure  _  which the\ntransaction runs\".  \n  Still, the administration's plan has  _  privacy rights activists. Some applaud\nthe approach; others are concerned. It seems clear that such a scheme is an initiative push toward what would  _  be a\ncompulsory Internet \"drive's license\" mentality.\n  The plan has also been greeted with  _  by some computer security experts, who worry that the \"voluntary ecosystem\" envisioned (,)by Mr. Schmidt would still leave much of the Internet  _  .They argue that all\nInternet users should be  _  to register and identify themselves, in the same way that drivers must be licensed to drive on public roads.", 
    "options": [
        [
            "swept", 
            "skipped", 
            "walked", 
            "ridden"
        ], 
        [
            "for", 
            "within", 
            "while", 
            "though"
        ], 
        [
            "careless", 
            "lawless", 
            "pointless", 
            "helpless"
        ], 
        [
            "reason", 
            "reminder", 
            "compromise", 
            "proposal"
        ], 
        [
            "information", 
            "interference", 
            "entertainment", 
            "equivalent"
        ], 
        [
            ".by", 
            "into", 
            "from", 
            "over"
        ], 
        [
            "linked", 
            "directed", 
            "chained", 
            "compared"
        ], 
        [
            "dismiss", 
            "discover", 
            "create", 
            "improve"
        ], 
        [
            "recall", 
            "suggest", 
            "select", 
            "realize"
        ], 
        [
            "released", 
            "issued", 
            "distributed", 
            "delivered"
        ], 
        [
            "trusted", 
            "modernized", 
            ".thriving", 
            ".competing"
        ], 
        [
            "caution", 
            "delight", 
            "confidence", 
            "patience"
        ], 
        [
            ".on", 
            ".after", 
            "beyond", 
            ".across"
        ], 
        [
            "divided", 
            "disappointed", 
            ".protected", 
            "united"
        ], 
        [
            "frequently", 
            ".incidentally", 
            ".occasionally", 
            "eventually"
        ], 
        [
            "skepticism", 
            "relerance", 
            "indifference", 
            "enthusiasm"
        ], 
        [
            "manageable", 
            "defendable", 
            "vulnerable", 
            "invisible"
        ], 
        [
            "invited", 
            "appointed", 
            "allowed", 
            "forced"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "B", 
        "D", 
        "D", 
        "B", 
        "A", 
        "C", 
        "C", 
        "A", 
        "A", 
        "C", 
        "A", 
        "C", 
        "D", 
        "A", 
        "C", 
        "D"
    ], 
    "source": "high1221"
}