{
    "article": "While my friends went away to their universities in great delight, I restarted my senior high school life. My spirits  _  at the prospect of starting all over again.  _  by strange classmates, I felt as though I was in a maze and felt  _  for my-self. There were some complex feelings in my mind. I was frightened, nervous and lonely. To make  _  worse, I recalled my failure again and again,  _  put more pressure on me than I could bear. As a result, I was always feeling  _  during class. One of my teachers noticed my depression and one day he asked me to come to his office, where he told me about his  _  towards life. He said we might  _  from making mistakes, but it's important to model ourselves into people we  _  . All the growing  _  and the embarrassing things we  _  are parts of the process. We never stop  growing up  , so learn from it and keep up your spirits up! If you are optimistic, things you want may  _  to you!  _  feelings rushed through me. I  _  saw the sun shining again when I stepped out of his office. With the teacher's help, I finally  got over  my depression. From then on, I no longer  _  my head but began smiling at my classmates. I put up my hand  _  in class and tried to answer the teacher's questions correctly. I  _  have a thirst to go to my dream university,  _  I'm not afraid of failure because I can benefit from it.", 
    "options": [
        [
            "sank", 
            "failed", 
            "disappeared", 
            "ran"
        ], 
        [
            "Hit", 
            "Surrounded", 
            "Struck", 
            "Loved"
        ], 
        [
            "unlucky", 
            "angry", 
            "sorry", 
            "afraid"
        ], 
        [
            "scores", 
            "studies", 
            "experiences", 
            "matters"
        ], 
        [
            "which", 
            "what", 
            "that", 
            "who"
        ], 
        [
            "high", 
            "down", 
            "lonely", 
            "happy"
        ], 
        [
            "way", 
            "method", 
            "measure", 
            "attitude"
        ], 
        [
            "learn", 
            "suffer", 
            "hear", 
            "judge"
        ], 
        [
            "reach", 
            "enjoy", 
            "like", 
            "hate"
        ], 
        [
            "aches", 
            "pains", 
            "joys", 
            "injuries"
        ], 
        [
            "feel", 
            "experience", 
            "taste", 
            "get"
        ], 
        [
            "refer", 
            "turn", 
            "stick", 
            "happen"
        ], 
        [
            "Warm", 
            "Thoughtful", 
            "Cool", 
            "Regretful"
        ], 
        [
            "suddenly", 
            "generally", 
            "naturally", 
            "sadly"
        ], 
        [
            "buried", 
            "shook", 
            "bowed", 
            "nodded"
        ], 
        [
            "freely", 
            "hopefully", 
            "quickly", 
            "confidently"
        ], 
        [
            "even", 
            "ever", 
            "still", 
            "yet"
        ], 
        [
            "otherwise", 
            "or", 
            "but", 
            "instead"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "C", 
        "D", 
        "A", 
        "B", 
        "D", 
        "B", 
        "C", 
        "B", 
        "B", 
        "D", 
        "A", 
        "A", 
        "C", 
        "D", 
        "C", 
        "C"
    ], 
    "source": "high2284"
}