{
    "article": "The party began shortly after Mr. Wood, who lived in the flat below, signed to himself as he heard excited voices and the noisy music. Luckily he had  _  some work home from the office,  with which  he kept himself busy for a couple of hours, thus managing to pay no attention to the noise  _  . But by eleven o'clock he felt  _  and was ready to go to bed, though from his earlier experience he knew it was  _  trying to get to sleep. He undressed and lay for a while on the bed, trying to read, but he  _  himself reading the same page over and over again. He then turned off the light and  _  his head in the pillow . But  even so  he could not shut off the  _  ,finally after  _  seemed hours his  _  was gone. He jumped out of bed,  put on  some clothing, marched  _  up the stairs and walked into his neighbor's flat. The owner of the flat, who  caught sight of  him in his dressing gown came  _  the room and  _  Mr. Wood could say anything, cried \"My dear fellow, come and  join us  . I know our parties  would trouble  you. I meant to send you  an invitation  .\" Mr. Wood's anger disappeared then and there. He said \"I'd better go and get  _  .\" Minutes later, he returned properly dressed, only to find that the party was nearly over.", 
    "options": [
        [
            "taken", 
            "carried", 
            "brought", 
            "fetched"
        ], 
        [
            "outside", 
            "overhead", 
            "downstairs", 
            "nearby"
        ], 
        [
            "bad", 
            "tired", 
            "sick", 
            "hopeless"
        ], 
        [
            "useless", 
            "necessary", 
            "possible", 
            "helpful"
        ], 
        [
            "had", 
            "found", 
            "caught", 
            "felt"
        ], 
        [
            "buried", 
            "rested", 
            "shook", 
            "turned"
        ], 
        [
            "sound", 
            "noise", 
            "voice", 
            "tone"
        ], 
        [
            "it", 
            "what", 
            "that", 
            "which"
        ], 
        [
            "sleep", 
            "strength", 
            "patience", 
            "anger"
        ], 
        [
            "sadly", 
            "proudly", 
            "quietly", 
            "firmly"
        ], 
        [
            "across", 
            "around", 
            "towards", 
            "by"
        ], 
        [
            "as", 
            "before", 
            "though", 
            "until"
        ], 
        [
            "washed", 
            "changed", 
            "dressed", 
            "prepared"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "B", 
        "A", 
        "B", 
        "A", 
        "B", 
        "B", 
        "C", 
        "D", 
        "A", 
        "B", 
        "B"
    ], 
    "source": "high554"
}