{
    "article": "Entering the drama room I am immediately surrounded by the familiar sights, smells and sounds. Streaks(,) of light cast by the blinds of the tall  _  send shafts of light through the dusty air. I take a  deep breath  and the concrete and paint  _  tickle my nose. I  _  everything about this room. Some of the  _  times of my life have been spent here. It's ironic , but the  _  is the only place where I feel that I don't have to  _  to be someone I'm not. Like many teenagers, I almost  _  think that people are judging me, but when I act, that feeling disappears. People only look at your  _  ability, not your clothing, money, choice of friends, or any of the other ways people are usually  judged  . When I'm on stage, everything else vanishes . All the worries and  _  of the outside world are put on hold. Nervousness is still present,  _  it's the excited and tingly kind, not the queasy  _  of being different and alone. I  _  love to work backstage and on lighting. I  _  you could find another girl who would work on a ladder  up to  her elbows in cables and dust and love every second of it. It makes me unique and gives me a sense of  _  to know that I succeed in an area where  few  others--and virtually no girls--do. High school is a difficult atmosphere, to put it  _  . Like others, I'm often insecure , not  sure of  who I am or where I'm going in life. Wherever that may be, I will always have the confidence I get from theater.", 
    "options": [
        [
            "doors", 
            "windows", 
            "roofs", 
            "walls"
        ], 
        [
            "smells", 
            "tastes", 
            "sounds", 
            "looks"
        ], 
        [
            "hate", 
            "love", 
            "miss", 
            "forget"
        ], 
        [
            "worst", 
            "tiring", 
            "best", 
            "better"
        ], 
        [
            "room", 
            "office", 
            "building", 
            "stage"
        ], 
        [
            "pretend", 
            "expect", 
            "want", 
            "decide"
        ], 
        [
            "hardly", 
            "seriously", 
            "always", 
            "happily"
        ], 
        [
            "acting", 
            "speaking", 
            "moving", 
            "repeating"
        ], 
        [
            "happiness", 
            "anxieties", 
            "chances", 
            "pressures"
        ], 
        [
            "and", 
            "however", 
            "but", 
            "though"
        ], 
        [
            "feeling", 
            "idea", 
            "hope", 
            "fact"
        ], 
        [
            "seldom", 
            "almost", 
            "relatively", 
            "absolutely"
        ], 
        [
            "hope", 
            "doubt", 
            "think", 
            "suspect"
        ], 
        [
            "pride", 
            "duty", 
            "humor", 
            "sight"
        ], 
        [
            "cruelly", 
            "tensely", 
            "friendly", 
            "mildly"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "B", 
        "C", 
        "D", 
        "A", 
        "C", 
        "A", 
        "D", 
        "C", 
        "A", 
        "D", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "high444"
}