{
    "article": "It was the first morning of the New Year and the weather was very cold. I have always been an early bird and my morning walks have been the   _  for the last 7 years, so I put on my shoes to42 _ for my first walk of the New Year.\nThere was complete 43 _ outside. Litter could be seen everywhere. It seemed that everyone had an all-night   _  . It was too cold to45 _ anyone to be awake to clear all the walkways at 5 in the morning. I was 46 _ to walk on the dirty walkways and decided to go back home.\nI was about to leave47 _ I saw Sam cleaning the garden. He is an employee of our society association and is   _  to take care of the walkways and the garden. I walked up to Sam as it was a(n)49 _ to see him there cleaning at this time. He saw me and politely 50 _ me, \"Happy New Year!\"\n\"How come you are here and doing all thins on the very first day of a new year?\" I asked . Sam answered51 _ , \"It is just a day like any other day. I do not want people to walk on 52 _ walkways. It is the first day of the year so they should feel good and special. For me, today is like any other day and my job starts with the53 _ .\"\nIt was good to see someone so54 _ at heart. Like other staff members, Sam could have taken a day 55 _ , but he woke up early and came for all of us. I suddenly realized life does not56 _ when the clock strikes twelve at midnight and a New Year begins. We 57 _ all night, drinking and feeding ourselves. Then we leave the place in high spirits. However, we make the surroundings dirty. Life goes on and others need to 58 _ up early and clear the garbage. Isn't the very next morning a new day of a New Year for all those who clear our garbage? Why can't we also keep our 59 _ clean so that everyone can have a New Year the very next day? It is true that small things can make a big 60 _ in our lives.", 
    "options": [
        [
            "manner", 
            "routine", 
            "trend", 
            "procedure"
        ], 
        [
            "look", 
            "send", 
            "long", 
            "head"
        ], 
        [
            "silence", 
            "freedom", 
            "waste", 
            "absence"
        ], 
        [
            "decoration", 
            "tradition", 
            "celebration", 
            "pollution"
        ], 
        [
            "order", 
            "catch", 
            "trust", 
            "expect"
        ], 
        [
            "annoyed", 
            "scared", 
            "puzzled", 
            "tired"
        ], 
        [
            "because", 
            "though", 
            "unless", 
            "when"
        ], 
        [
            "advised", 
            "promoted", 
            "determined", 
            "supposed"
        ], 
        [
            "pleasure", 
            "success", 
            "surprise", 
            "honor"
        ], 
        [
            "suggested", 
            "wished", 
            "asked", 
            "congratulated"
        ], 
        [
            "coldly", 
            "calmly", 
            "casually", 
            "hopefully"
        ], 
        [
            "dirty", 
            "narrow", 
            "busy", 
            "cold"
        ], 
        [
            "beginning", 
            "special", 
            "same", 
            "new"
        ], 
        [
            "devoted", 
            "cautious", 
            "honest", 
            "polite"
        ], 
        [
            "over", 
            "off", 
            "up", 
            "out"
        ], 
        [
            "improve", 
            "change", 
            "return", 
            "happen"
        ], 
        [
            "sleep", 
            "clean", 
            "work", 
            "party"
        ], 
        [
            "put", 
            "stay", 
            "wake", 
            "pick"
        ], 
        [
            "surroundings", 
            "conditions", 
            "background", 
            "location"
        ], 
        [
            "decision", 
            "difference", 
            "promise", 
            "suggestion"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "A", 
        "C", 
        "D", 
        "A", 
        "D", 
        "D", 
        "C", 
        "B", 
        "B", 
        "A", 
        "C", 
        "C", 
        "B", 
        "B", 
        "D", 
        "C", 
        "A", 
        "B"
    ], 
    "source": "high2346"
}