{
    "article": "Once upon a time, there lived two parent parrots. Every morning they flew out to  _  food for their two young birds. One day, a hunter  _  the young birds. The young birds  _  to free themselves from the hands of the hunter. One  _  from the hunter, while the other was taken in a cage by the hunter to his house. He gave it to his  _  .\nThe other parrot flew away and came to a place where some holy men lived. They did not  _  the young parrot, so it stayed there. It  listened to  their talk and learned to say a few words.\nSeveral years later, a traveler was walking near the hunter's hut . He sat near the hut, extremely  _  . He heard the parrot that lived there say, \"  _  , why have you come here? I will cut your throat.\" The traveler  _  got up and left the place in a hurry. Then he happened to reach the place where the other parrot lived. The parrot was sitting on a tree. Seeing the traveler, it said, \"Welcome, traveler. Welcome to this hermitage . We have a lot of good  _  in this forest, which looks sweet and delicious. Eat whatever you like. The holy men will  _  you well.\"\nThe traveler was  _  . He couldn't understand why this parrot was so polite  _  the other one was so rude. They were both parrots, after all.  _  it wasn't strange. The parrot he met first lived with the hunter's children who often spoke  _  words, while the parrot he met later had learned the  _  of holy people.\nOur growing environment is of great  _  . It is the company that shapes our words and deeds. Good company helps us learn good things while bad company  leads to  the contrary. Therefore, choose the  _  people to grow up with.", 
    "options": [
        [
            "get", 
            "preserve", 
            "cook", 
            "buy"
        ], 
        [
            "defeated", 
            "threatened", 
            "caught", 
            "observed"
        ], 
        [
            "flew", 
            "screamed", 
            "advanced", 
            "struggled"
        ], 
        [
            "disappeared", 
            "learned", 
            "escaped", 
            "died"
        ], 
        [
            "cousins", 
            "kids", 
            "neighbors", 
            "parents"
        ], 
        [
            "harm", 
            "follow", 
            "know", 
            "demand"
        ], 
        [
            "disappointed", 
            "tired", 
            "concerned", 
            "excited["
        ], 
        [
            "Father", 
            "Officer", 
            "Fool", 
            "Sir"
        ], 
        [
            "suddenly", 
            "gradually", 
            "hardly", 
            "immediately"
        ], 
        [
            "rice", 
            "fruit", 
            "meat", 
            "bread"
        ], 
        [
            "treat", 
            "understand", 
            "guide", 
            "protect"
        ], 
        [
            "interested", 
            "thrilled", 
            "surprised", 
            "relaxed"
        ], 
        [
            "though", 
            "unless", 
            "as", 
            "while"
        ], 
        [
            "Necessarily", 
            "Actually", 
            "Fortunately", 
            "Strangely"
        ], 
        [
            "dirty", 
            "short", 
            "dishonest", 
            "amazing"
        ], 
        [
            "language", 
            "joy", 
            "attitude", 
            "experience"
        ], 
        [
            "difference", 
            "shock", 
            "value", 
            "importance"
        ], 
        [
            "lucky", 
            "right", 
            "kind-hearted", 
            "educated"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "D", 
        "C", 
        "B", 
        "A", 
        "B", 
        "C", 
        "D", 
        "B", 
        "B", 
        "C", 
        "D", 
        "B", 
        "B", 
        "B", 
        "D", 
        "B"
    ], 
    "source": "high785"
}