{
    "article": "Fiona Famous was a very popular girl at school. She felt  _  as no other girl had so many friends at school and in the neighborhood. But everything  _  on National Friendship Day. On that day in class everyone had to make three presents to give to their three best friends. Fiona  _  the task of choosing three from all the dozens of her friends. However, she was the only one in her class who did not  _  a present! She felt terrible, and spent hours  _  . Everyone came and comforted her for a while.But each one only stayed for a short time before leaving.This was  _  what Fiona had done so many times to others. She  _  that she was a good companion and acquaintance , but she had not been a true friend to anyone. She had tried to be close to everyone, but now she found that was not enough to create  _  friendships. When she got home that night, Fiona told her mother about the whole thing. Her mother said, \"You can't be a close friend to everybody.It's only  _  to have a few true friends.The others will just be playmates or acquaintances.\" Hearing this, Fiona decided to change her way so that she could finally have some true friends. That night, in  _  , she thought about what she could do to get them. She thought about her mother. Her mother was always willing to  _  her, she put up with all of Fiona's dislikes and  _  , she always forgave her, she loved her a great deal ... That was what makes a  _  ! And Fiona  _  , realizing that she already had the best friend that anyone could  _  .She fell asleep and had a good dream.", 
    "options": [
        [
            "tired", 
            "lucky", 
            "strange", 
            "surprised"
        ], 
        [
            "mattered", 
            "developed", 
            "changed", 
            "appeared"
        ], 
        [
            "enjoyed", 
            "improved", 
            "failed", 
            "ruined"
        ], 
        [
            "receive", 
            "show", 
            "complete", 
            "make"
        ], 
        [
            "remaking", 
            "thinking", 
            "crying", 
            "checking"
        ], 
        [
            "especially", 
            "gradually", 
            "briefly", 
            "exactly"
        ], 
        [
            "forgot", 
            "realized", 
            "doubted", 
            "complained"
        ], 
        [
            "new", 
            "true", 
            "long", 
            "smart"
        ], 
        [
            "possible", 
            "fair", 
            "important", 
            "natural"
        ], 
        [
            "chair", 
            "bed", 
            "school", 
            "table"
        ], 
        [
            "correct", 
            "follow", 
            "help", 
            "find"
        ], 
        [
            "dreams", 
            "ideas", 
            "stories", 
            "problems"
        ], 
        [
            "playmate", 
            "parent", 
            "friend", 
            "mother"
        ], 
        [
            "smiled", 
            "suffered", 
            "screamed", 
            "hesitated"
        ], 
        [
            "compare", 
            "protect", 
            "remember", 
            "want"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "A", 
        "C", 
        "D", 
        "B", 
        "B", 
        "A", 
        "B", 
        "C", 
        "D", 
        "C", 
        "A", 
        "D"
    ], 
    "source": "high607"
}