{
    "article": "James sat outside the office waiting for the interview. He felt so  _  that he didn't know what to do with himself. The person who had gone in  _  him had been in there for nearly an hour. And she looked so confident when she went in, not like James. He felt  _  that she had already got the job. The problem was that he wanted his job so much. It meant everything to him. He had  thought about  it such a lot before the day of the interview. He had imagined himself  _  brilliantly at the interview and being offered the job immediately. But now here he was feeling  _  . He couldn't remember all those things he  had planned  to say. At that moment, he almost decided to get up and leave. But no - he had to do this. He had spent so much time considering it that he couldn't  give up  like that. His hands were hot and sticky and his mouth felt dry. At last the door of the office opened. The woman who had gone in an hour earlier came out looking very  _  with herself. She smiled sympathetically at James. At the moment, James  _  her. The managing director then appeared at the office door. \"would you like to come in now, Mr. Davis? I'm sorry to have kept you  waiting  .\" James suddenly wished that he had gone home after all. He got up, legs  _  and forehead sweating and wondered he looked as terrified as he felt.", 
    "options": [
        [
            "healthy", 
            "nervous", 
            "careless", 
            "confident"
        ], 
        [
            "by", 
            "with", 
            "before", 
            "after"
        ], 
        [
            "doubtful", 
            "sure", 
            "angry", 
            "astonished"
        ], 
        [
            "explaining", 
            "performing", 
            "answering", 
            "writing"
        ], 
        [
            "mad", 
            "excited", 
            "certain", 
            "terrible"
        ], 
        [
            "ugly", 
            "pleased", 
            "sad", 
            "pretty"
        ], 
        [
            "noticed", 
            "loved", 
            "missed", 
            "hated"
        ], 
        [
            "shaking", 
            "bending", 
            "broken", 
            "stopped"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "B", 
        "B", 
        "D", 
        "B", 
        "D", 
        "A"
    ], 
    "source": "high2519"
}