{
    "article": "When an NBA player is young, he thinks he can win the championship by himself. It is only later  _  he has aged and been through many battles that he learns an important lesson: there is no \"I\" in \"team\". There is no better example of the value of  _  than the Boston Celtics. Paul Pierce, Ray Allen and Kevin Garnett were all superstars on three different teams.  _  , none of them had any titles to show for it. Then, last season, they decided to play together, caring little  _  money and fame. Garnett and Allen  _  Pierce on the Celtics and changed the NBA in the process. It started in simple ways. Garnett and Allen are two of the best athletes in the world. They treat every second of every  _  as it is the NBA championship. If you want to play alongside them then you will have to do the same. Therefore, the young guys on the Celtics started giving their  _  effort too. Pierce had been the star of the Celtics for many years. He used to shoot the ball many times a game. But with the addition of Allen and Garnett he shot less and  centered on  defense . His selflessness showed the young players that doing what made the team better was the only thing that  _  . When the Celtics were winning and the game was almost  _  , Garnett, Pierce and Allen would come out of the game. But they wouldn't just sit on the bench.  _  , they stood and cheered and screamed for their teammates. They wanted to  _  their friends and teammates. Now, the guys who don't play know they can still affect the game by cheering, so they scream and cheer when Garnett, Allen and Pierce are playing. The Celtics have  _  a strong relationship. They are  more than  just teammates. They are brothers. The result: the Boston Celtics won the 2008 NBA championship and are considered the favorites to win the Eastern Conference championship again this year. There is a saying that goes, \"A successful team beats with one  _  .\" If that is the case, the Celtics may have the biggest heart in the NBA.", 
    "options": [
        [
            "which", 
            "that", 
            "when", 
            "where"
        ], 
        [
            "determination", 
            "chance", 
            "teamwork", 
            "advantage"
        ], 
        [
            "Or", 
            "Though", 
            "And", 
            "Yet"
        ], 
        [
            "of", 
            "for", 
            "to", 
            "about"
        ], 
        [
            "joined", 
            "noticed", 
            "persuaded", 
            "encouraged"
        ], 
        [
            "detail", 
            "practice", 
            "partner", 
            "request"
        ], 
        [
            "full", 
            "proud", 
            "happy", 
            "confident"
        ], 
        [
            "helped", 
            "decided", 
            "cared", 
            "mattered"
        ], 
        [
            "on", 
            "over", 
            "off", 
            "in"
        ], 
        [
            "Instead", 
            "Finally", 
            "Then", 
            "Besides"
        ], 
        [
            "calm", 
            "support", 
            "organize", 
            "advise"
        ], 
        [
            "understood", 
            "accepted", 
            "enjoyed", 
            "developed"
        ], 
        [
            "heart", 
            "person", 
            "attitude", 
            "tip"
        ]
    ], 
    "answers": [
        "C", 
        "C", 
        "D", 
        "D", 
        "A", 
        "B", 
        "A", 
        "D", 
        "B", 
        "A", 
        "B", 
        "D", 
        "A"
    ], 
    "source": "high268"
}