{
    "article": "If you travel in some areas in India, you'll be lucky enough to be waited on by special guide-monkeys.   Dressed in   waistcoat, these monkeys are always    _  to be of service to you. Hungry, you only have to    point to   your own stomach and they will lead you to a restaurant.    _  , you put both your hands    _   your head and the monkeys will take you to a hotel. If you want    to drink   , the monkeys will send you to a bar. But do not    feel puzzled   they put out their hairy hands after    the service   is done. They're just asking for    a little    money as a tip. After that, they wave their hands as if they were saying    _   to you.\nBelieve it or not, the monkeys are     from   the School for Monkeys in India,  _   they were trained for one year to get their diplomas. They are not    the only  monkey students in the world. Some are now being trained   as  nurses in an American medical college. These monkeys    are able to   look after patients and help them with house- work after graduation. A three-year-old monkey named Helen had learned to turn on and off the lights, use a recorder and open doors and windows, when she   is told to   . In the tropical Malaysia,   where  coconut trees reach high up to the sky, monkeys would  climb up to  the top and pick off the coconuts for people.  _    the job is done, they would rush to their master   _  to get some wild fruit as rewards.", 
    "options": [
        [
            "pleased", 
            "happy", 
            "afraid", 
            "ready"
        ], 
        [
            "Tired", 
            "Sleepy", 
            "Sorry", 
            "Thirsty"
        ], 
        [
            "near", 
            "before", 
            "behind", 
            "below"
        ], 
        [
            "hello", 
            "sorry", 
            "thanks", 
            "yes"
        ], 
        [
            "there", 
            "where", 
            "and", 
            "because"
        ], 
        [
            "As", 
            "Once", 
            "Since", 
            "Because"
        ], 
        [
            "expect", 
            "want", 
            "hoping", 
            "hope"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "C", 
        "C", 
        "B", 
        "B", 
        "C"
    ], 
    "source": "high1371"
}