{
    "article": "My neighbor Jennifer is blind, but you'd never know it. She makes such good use of her other  _  , including her \"sixth sense\", that she hardly gives the impression that she has  _  anything. Jennifer looks after her children much like the rest of us,  _  that she doesn't push too hard on them,  _  really benefit a lot from her relaxed attitude. She knows when to clean the house, and she moves around so fast that  _  often don't realize she's blind. I  _  this the first time after my six-year-old daughter, Kayla, went to play there. When Kayla came home, she was very  _  about her day. She told me they had baked cookies, played games and done art projects. But she was  especially  excited about her finger-painting project. \"Mom, guess what?\" said Kayla, all smiles. \"I learned how to  _  colors today! Blue and red make purple, and yellow and blue make green! And Jennifer  _  with us\". To my great  _  , my child had learnt about color from a blind friend! Then Kayla continued, \"Jennifer told me my  _  showed joy, pride and a sense of accomplishment . She really  _  what I was doing!\" Kayla said she had never known how good finger paints felt  _  Jennifer showed her how to paint without looking at her paper. I realized Kayla didn't know that Jennifer was blind. It had just never  come up  in conversation. When I told my daughter that Jennifer was blind, she was  _  for a moment. At first, she didn't believe me. \"But Mommy, Jennifer knew exactly what was in my picture!\" Kayla  _  . And I knew my child was  _  because Jennifer had listened to Kayla describe her art work. Jennifer had also heard Kayla's  _  in her work. We were silent for a minute. Then Kayla said slowly, \"You know, Mommy, Jennifer really did 'see' my picture. She just used my  _  .\" Indeed, she uses a special type of \"vision\" that all mothers have.", 
    "options": [
        [
            "senses", 
            "means", 
            "methods", 
            "ways"
        ], 
        [
            "enjoyed", 
            "found", 
            "missed", 
            "got"
        ], 
        [
            "instead", 
            "except", 
            "since", 
            "but"
        ], 
        [
            "which", 
            "it", 
            "she", 
            "who"
        ], 
        [
            "children", 
            "family", 
            "guests", 
            "friends"
        ], 
        [
            "witnessed", 
            "heard", 
            "recognized", 
            "realized"
        ], 
        [
            "sad", 
            "satisfied", 
            "excited", 
            "sorry"
        ], 
        [
            "mix", 
            "draw", 
            "write", 
            "paint"
        ], 
        [
            "stayed", 
            "painted", 
            "talked", 
            "studied"
        ], 
        [
            "surprise", 
            "encouragement", 
            "delight", 
            "excitement"
        ], 
        [
            "attitude", 
            "picture", 
            "homework", 
            "paper"
        ], 
        [
            "understood", 
            "found", 
            "saw", 
            "touched"
        ], 
        [
            "after", 
            "unless", 
            "until", 
            "when"
        ], 
        [
            "curious", 
            "quiet", 
            "puzzled", 
            "worried"
        ], 
        [
            "cried", 
            "insisted", 
            "required", 
            "informed"
        ], 
        [
            "uncertain", 
            "wrong", 
            "worried", 
            "right"
        ], 
        [
            "shortcomings", 
            "difficulties", 
            "pride", 
            "description"
        ], 
        [
            "eyes", 
            "pens", 
            "hands", 
            "paper"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "B", 
        "D", 
        "C", 
        "D", 
        "C", 
        "A", 
        "B", 
        "A", 
        "B", 
        "A", 
        "C", 
        "B", 
        "B", 
        "D", 
        "C", 
        "A"
    ], 
    "source": "high27"
}