{
    "article": "My whole life began to make more sense after I was diagnosed with Turner syndrome at 12. Before that, I  _  understood why when the rest of my classmates were growing like weeds, I  _  a seed stuck in the ground. I had always struggled being the  _  girl in my class and was known as \"Shorty\" . Though this  _  me deeply, I refused to let my classmates  _  my enthusiasm for school and learning. I  got involved in  lots of after-school activities, though they sometimes presented problems. Because girls with Turner syndrome tend to have  _  coordination  , I hardly had any athletic ability. I loved to sing, but it proved  _  to share a microphone with a group of girls seven inches taller. Despite this, I  _  to drive myself to prove that heart and brains could make up for lack of  _  . Once diagnosed, I was given a  _  plan that involved daily growth hormone   injections. I am the type of person who  worries about  a doctor's appointment for weeks in advance,  _  getting used to injections every day -- and even worse, giving them to myself -- was a true test of my character.  _  , I got over this difficulty and after five years, I have grown 11 inches. This was a(n)  _  response and I consider it my own little miracle. I am not  _  that I have Turner syndrome. It has built up my character and  _  me into the person I am today. I have learned that you need to try your best to  _  the difficulties in your life. Someone once told me, \"No one can make you feel inferior   without your permission.\"This statement has always  _  me and so I will journey on to the next stage of my life with  _  and self-confidence.", 
    "options": [
        [
            "sometimes", 
            "always", 
            "also", 
            "never"
        ], 
        [
            "dug", 
            "remained", 
            "searched", 
            "shared"
        ], 
        [
            "cleverest", 
            "shyest", 
            "shortest", 
            "stupidest"
        ], 
        [
            "touched", 
            "helped", 
            "hurt", 
            "bothered"
        ], 
        [
            "weaken", 
            "check", 
            "build", 
            "develop"
        ], 
        [
            "good", 
            "physical", 
            "poor", 
            "personal"
        ], 
        [
            "difficult", 
            "interesting", 
            "popular", 
            "important"
        ], 
        [
            "stopped", 
            "failed", 
            "continued", 
            "pretended"
        ], 
        [
            "money", 
            "power", 
            "height", 
            "time"
        ], 
        [
            "diet", 
            "study", 
            "business", 
            "treatment"
        ], 
        [
            "but", 
            "or", 
            "until", 
            "so"
        ], 
        [
            "Therefore", 
            "However", 
            "Besides", 
            "Meanwhile"
        ], 
        [
            "wrong", 
            "formal", 
            "amazing", 
            "complex"
        ], 
        [
            "glad", 
            "sure", 
            "upset", 
            "sensible"
        ], 
        [
            "persuaded", 
            "transformed", 
            "forced", 
            "pushed"
        ], 
        [
            "overcome", 
            "create", 
            "ignore", 
            "increase"
        ], 
        [
            "shocked", 
            "pleased", 
            "inspired", 
            "confused"
        ], 
        [
            "love", 
            "tear", 
            "praise", 
            "pride"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "C", 
        "C", 
        "A", 
        "C", 
        "A", 
        "C", 
        "C", 
        "D", 
        "D", 
        "B", 
        "C", 
        "C", 
        "B", 
        "A", 
        "C", 
        "D"
    ], 
    "source": "high2113"
}