{
    "article": "_  me for six hours a week to help her in the shop. I was very   _  to earn my own pocket money and my parents   _  interfered  with how I spent it, even when I was spending it   _  . They believed that by earning money, spending it, and learning from the   _  , I would become more mature  and   _  about how to handle work, relationships with others, and money.\nLike many   _  parents, my parents also let me and my brothers do things over which they\n43 _  a great deal. When I was sixteen, for example, after I finished high school and before I entered university, I wanted to spend the summer months traveling around   _  . My mother was against the idea of my traveling alone at such a young age, but my father felt that it would be a great   _  for me. In the end, my father won the   _  on the condition that I limited my traveling to France, my mother's home, where I had many uncles, aunts and cousins   spread out  through the country who could   _  shelter and help if I need them.\nThree years later, my younger brother decide to 49 _ a year off after his first year in university and travel through the United States and the Caribbean. Again my mother was very worried and not   _  to see my brother leave school, but my father encouraged him and my brother had a(n)   _  year working his way on trains and ships to   _  passage to different ports and cities, and discovering many fascinating places and people.\nThese kinds of experiences are probably rare  for children in many countries but in the US they are fairly   _  . Most parents start   _  their children at a young age to do small things by themselves. By the time they have finished high school, many American kids have already had part-time jobs, traveled around the US or other countries on their own, have   _  the university they plan to attend and maybe even decided on their future career, and so on.", 
    "options": [
        [
            "taught", 
            "allowed", 
            "treated", 
            "hired"
        ], 
        [
            "anxious", 
            "content", 
            "proud", 
            "hopeful"
        ], 
        [
            "never", 
            "ever", 
            "always", 
            "even"
        ], 
        [
            "quickly", 
            "foolishly", 
            "seriously", 
            "honesty"
        ], 
        [
            "work", 
            "mistakes", 
            "others", 
            "books"
        ], 
        [
            "strict", 
            "reasonable", 
            "polite", 
            "responsible"
        ], 
        [
            "American", 
            "Japanese", 
            "Chinese", 
            "British"
        ], 
        [
            "helped", 
            "supported", 
            "shared", 
            "worried"
        ], 
        [
            "Asia", 
            "Africa", 
            "Europe", 
            "Oceania"
        ], 
        [
            "journey", 
            "experience", 
            "chance", 
            "possibility"
        ], 
        [
            "argument", 
            "game", 
            "discussion", 
            "plan"
        ], 
        [
            "promise", 
            "afford", 
            "provide", 
            "serve"
        ], 
        [
            "leave", 
            "make", 
            "take", 
            "prepare"
        ], 
        [
            "angry", 
            "eager", 
            "sorry", 
            "sad"
        ], 
        [
            "unusual", 
            "hard", 
            "strange", 
            "busy"
        ], 
        [
            "accept", 
            "earn", 
            "find", 
            "search"
        ], 
        [
            "welcome", 
            "fit", 
            "necessary", 
            "common"
        ], 
        [
            "bringing", 
            "forcing", 
            "pushing", 
            "protecting"
        ], 
        [
            "selected", 
            "admired", 
            "afforded", 
            "left"
        ]
    ], 
    "answers": [
        "D", 
        "C", 
        "A", 
        "B", 
        "B", 
        "D", 
        "A", 
        "D", 
        "C", 
        "B", 
        "A", 
        "C", 
        "C", 
        "B", 
        "A", 
        "B", 
        "D", 
        "C", 
        "A"
    ], 
    "source": "high2751"
}