{
    "article": "Every year on my birthday, from the time I turned twelve, a white gardenia was delivered to my house. No card or note came with it.  _  to the flower shop were always useless---it was a cash  _  . After a while I stopped trying to  _  who the sender was and just delighted in the beauty and perfume of the white flower. But I never  _  imagining who the sender might be. My mother asked me whether there was someone for whom I had done a(n)  _  kindness who might be showing  _  . Perhaps the neighbor I helped when she was  _  a car full of groceries. Or maybe it was the old man  _  the street whose mail I helped to get during the  _  so he wouldn't have to venture down his icy steps. As a teenager,  _  , I had more fun guessing that it might be a  _  who had noticed me  even though  I didn't know him. One month before my high school graduation, my father died of a heart attack. I was completely  _  in my upcoming graduation and the dance. I forgot the dance and the dress for it. The next day before the dance, I found a dress on the sofa. I didn't  _  if I had a new dress or not, but my mother did. She wanted her children to feel loved and be lovable, imaginative, believing that there was a magic in the world and beauty in the face of hard times. Actually my mother wanted her children to see themselves much like the gardenia---lovable,  _  and perfect. The gardenia stopped coming when my mother died.", 
    "options": [
        [
            "Calls", 
            "Quarrels", 
            "Messages", 
            "Letters"
        ], 
        [
            "service", 
            "deal", 
            "bargain", 
            "offer"
        ], 
        [
            "recognize", 
            "imagine", 
            "wonder", 
            "discover"
        ], 
        [
            "failed", 
            "stopped", 
            "succeeded", 
            "enjoyed"
        ], 
        [
            "special", 
            "common", 
            "valuable", 
            "important"
        ], 
        [
            "concern", 
            "attitude", 
            "interest", 
            "appreciation"
        ], 
        [
            "repairing", 
            "washing", 
            "unloading", 
            "starting"
        ], 
        [
            "across", 
            "through", 
            "from", 
            "onto"
        ], 
        [
            "spring", 
            "summer", 
            "autumn", 
            "winter"
        ], 
        [
            "though", 
            "anyway", 
            "therefore", 
            "indeed"
        ], 
        [
            "friend", 
            "superman", 
            "teacher", 
            "boy"
        ], 
        [
            "disappointed", 
            "uninterested", 
            "discouraged", 
            "concentrated"
        ], 
        [
            "wonder", 
            "believe", 
            "care", 
            "know"
        ], 
        [
            "strong", 
            "beautiful", 
            "smelly", 
            "lucky"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "D", 
        "B", 
        "A", 
        "D", 
        "C", 
        "A", 
        "D", 
        "A", 
        "D", 
        "B", 
        "C", 
        "A"
    ], 
    "source": "high3117"
}