{
    "article": "As the pace of life continues to increase, we are fast losing the art of relaxation. Once you are in the habit of rushing through life, being   _   from morning till night, it is hard to   _   down. But relaxation is necessary for a healthy mind and body.\nStress is a   _   part of everyday life and there is no way to avoid it. However, it is not the bad thing that is often supposed to be. A   _   amount of stress is important to provide motivation and give   _   to life. It is only when the stress gets out of control that it can lead to poor performance and   _   health.\nThe amount of stress a person can   _   depends very much on the individual. Some people are not afraid of stress, and such characters are obviously chief material for managerial responsibilities  . Others lose heart at the   _   of unusual difficulties. When exposed to stress, in whatever form, we react both chemically and   _  .\nIn fact, we make a choice between \"fright and fight\". And in more   _   days the choices made the difference between life and   _  . The crises we meet today are   _   to be so extreme, but however   _   the stress is, it requires the same response. It is when such a reaction lasts long, through continued exposure to stress, that   _   becomes endangered. Such serious conditions as high blood pressure and heart diseases have established links with   _  . Since we cannot remove stress from our lives (it would be unwise to do even if we could), we need to find ways to deal with it.", 
    "options": [
        [
            "angry", 
            "busy", 
            "well", 
            "happy"
        ], 
        [
            "slow", 
            "calm", 
            "get", 
            "turn"
        ], 
        [
            "physical", 
            "natural", 
            "hard", 
            "terrible"
        ], 
        [
            "small", 
            "certain", 
            "large", 
            "great"
        ], 
        [
            "purpose", 
            "resource", 
            "influence", 
            "instruction"
        ], 
        [
            "ill", 
            "good", 
            "strong", 
            "weak"
        ], 
        [
            "hear", 
            "see", 
            "bear", 
            "meet"
        ], 
        [
            "end", 
            "site", 
            "sight", 
            "impression"
        ], 
        [
            "physically", 
            "mentally", 
            "economically", 
            "spiritually"
        ], 
        [
            "modern", 
            "difficult", 
            "ancient", 
            "different"
        ], 
        [
            "work", 
            "hardship", 
            "unhappiness", 
            "death"
        ], 
        [
            "unlikely", 
            "likely", 
            "necessary", 
            "probable"
        ], 
        [
            "great", 
            "little", 
            "big", 
            "late"
        ], 
        [
            "situation", 
            "trouble", 
            "health", 
            "number"
        ], 
        [
            "stress", 
            "illness", 
            "bitter", 
            "happiness"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "B", 
        "B", 
        "A", 
        "A", 
        "C", 
        "C", 
        "A", 
        "C", 
        "D", 
        "A", 
        "B", 
        "C", 
        "A"
    ], 
    "source": "high2730"
}