{
    "article": "I was in the kitchen making lunch when I saw my six-year-old son, Billy, walking toward the woods. I could only see his back. He  _  to be walking with a great effort, trying to be as  _  as possible. A few minutes after he disappeared into the  _  , he came running toward the house again. I went back to making sandwiches,  _  that whatever task he had been doing was completed. Moments later,  _  , he was once again walking slowly toward the woods.  Out of  curiosity, I walked out and followed him on his journey. He was  _  both hands in front of him as he walked, being  _  not to spill the water he held in them. I secretly walked  _  behind him as he went into the woods and I saw the most amazing  _  . Several large deer loomed in front of him. Billy walked right up to them. I almost  _  at him to get away. A huge male deer with elaborate antlers was  _  close. But they didn't even move as Billy  knelt down  . And I saw a small deer lying on the ground, obviously suffering from  _  and extreme heat, lift its head  with difficulty  to drink the water cupped in my beautiful boy's hands. It was on this day that I learned the true lesson of  _  . You know, we hadn't had any rain for three months and our crops were  _  . As the tears that rolled down my face began to hit the ground, they were suddenly  _  by other drops. I looked up at the sky. It was  as if  God was moved to weep. The rain came that day and saved our farm, just like the  _  of one little boy who saved another.", 
    "options": [
        [
            "happened", 
            "seemed", 
            "managed", 
            "intended"
        ], 
        [
            "quickly", 
            "secret", 
            "smoothly", 
            "still"
        ], 
        [
            "distance", 
            "yard", 
            "woods", 
            "park"
        ], 
        [
            "wondering", 
            "thinking", 
            "studying", 
            "doubting"
        ], 
        [
            "eventually", 
            "actually", 
            "however", 
            "therefore"
        ], 
        [
            "holding", 
            "waving", 
            "surrounding", 
            "cupping"
        ], 
        [
            "careful", 
            "worried", 
            "eager", 
            "prepared"
        ], 
        [
            "away", 
            "close", 
            "out", 
            "off"
        ], 
        [
            "scene", 
            "story", 
            "view", 
            "game"
        ], 
        [
            "fought", 
            "signed", 
            "screamed", 
            "waited"
        ], 
        [
            "hardly", 
            "dangerously", 
            "easily", 
            "nearly"
        ], 
        [
            "hunger", 
            "disease", 
            "thirst", 
            "injury"
        ], 
        [
            "suffering", 
            "supporting", 
            "sharing", 
            "depending"
        ], 
        [
            "dying", 
            "reducing", 
            "harvesting", 
            "growing"
        ], 
        [
            "hidden", 
            "covered", 
            "joined", 
            "caught"
        ], 
        [
            "wish", 
            "dream", 
            "action", 
            "expectation"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "C", 
        "B", 
        "C", 
        "D", 
        "A", 
        "B", 
        "A", 
        "C", 
        "B", 
        "C", 
        "C", 
        "A", 
        "C", 
        "C"
    ], 
    "source": "high3132"
}