{
    "article": "It was Easter 1990, and my family was on a once-in-a-lifetime trip to the Solomon Islands for my sister's wedding.\nI was traveling with my husband, my four-year-old son and my daughter, who was nearly two. We'd been  41 _ it was very hot in the Solomons, so we'd  42 _ lots of light cotton clothes and were wearing the same as it was summer. The only problem was that we had to catch an overnight bus that  43 _ at midnight for the airport so we could make our early morning    _   to Honiara. It was cold on the bus! My husband and I were snuggling our children as best we could, trying to keep them  45 _ . The bus stopped many times as passengers got on and off, and we didn't take much  46 _ . The little ones were  47 _ , unable to sleep for the biting cold. Then at one stop, an older lady came forward from the back of the bus and paused by our seat. I sat forward to see what she wanted and she 48 _ out a small knee rug . My little girl reached  49 _ for it and pulled it tight  50 _ her. The lady said she'd made the rug herself and, seeing that we were cold, she wanted us to use it. After she went back to her seat, our now-warm children 51 _ off, and they slept snugly all the way to the airport. Just a stop or two 52 _ we arrived, the rug lady made her way to the door to get off. I tried to53 _ the children to return her blanket, but she protested. \"No,\" she said, \" 54 _ it. I can always make another one!\"\nOver the years, that little blanket became a     _   to me and to my children of the kindness of strangers. I told the story to the children over and over and hung the rug on the end of my daughter's bed so we would see it often. That rug was handmade with the color1s carefully chosen. Yet its maker 56 _ with it to keep my family warm for a night. If ever people were bad or 57 _ , it served as a     _  that there is goodness in the world.\nI am forever  59 _ , not just for the warmth that night, but for the lifelong reminder of the  60 _  of people. That blanket has warmed my life.", 
    "options": [
        [
            "confirmed", 
            "told", 
            "advised", 
            "persuaded"
        ], 
        [
            "offered", 
            "piled", 
            "packed", 
            "discovered"
        ], 
        [
            "left", 
            "went", 
            "pulled", 
            "drove"
        ], 
        [
            "train", 
            "trip", 
            "ride", 
            "flight"
        ], 
        [
            "comfortable", 
            "warm", 
            "calm", 
            "quiet"
        ], 
        [
            "care", 
            "notice", 
            "action", 
            "attention"
        ], 
        [
            "naughty", 
            "noisy", 
            "restless", 
            "energetic"
        ], 
        [
            "showed", 
            "made", 
            "put", 
            "held"
        ], 
        [
            "silently", 
            "eagerly", 
            "patiently", 
            "bravely"
        ], 
        [
            "around", 
            "on", 
            "over", 
            "towards"
        ], 
        [
            "slept", 
            "went", 
            "nodded", 
            "shook"
        ], 
        [
            "after", 
            "until", 
            "as", 
            "before"
        ], 
        [
            "unload", 
            "unwrap", 
            "unfold", 
            "unpack"
        ], 
        [
            "keep", 
            "possess", 
            "return", 
            "bring"
        ], 
        [
            "sign", 
            "mark", 
            "symbol", 
            "decoration"
        ], 
        [
            "remained", 
            "parted", 
            "deserted", 
            "handed"
        ], 
        [
            "cruel", 
            "sensitive", 
            "cautious", 
            "ugly"
        ], 
        [
            "story", 
            "gift", 
            "reminder", 
            "reward"
        ], 
        [
            "delighted", 
            "pitiful", 
            "excited", 
            "grateful"
        ], 
        [
            "goodness", 
            "warmth", 
            "welcome", 
            "Help"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "D", 
        "B", 
        "B", 
        "C", 
        "D", 
        "B", 
        "A", 
        "C", 
        "D", 
        "B", 
        "A", 
        "C", 
        "B", 
        "A", 
        "C", 
        "D", 
        "A"
    ], 
    "source": "high2684"
}