{
    "article": "The Colors of Friendship Once upon a time the colors of the world started to quarrel. Green said, \"Clearly I am the most important. I am the sign of life and hope. I was chosen for grass, trees and leaves. Without me, all animals would  die  .\" Blue interrupted, \"You only think about the  _  , but consider the sky and the sea.  It is  the water that is the basis of life and drawn up by the clouds from the deep sea. Without my peace, you would all be  _  . Yellow laughed, \" You are all so serious. I bring laughter, fun, and  _  into the world.\" Orange started next to blow her trumpet, \" I am the color of health and strength. I may be  _  , but I am priceless for I serve the needs of human life. When I fill the sky at sunrise or  sunset  , my beauty is so striking that no one gives another  _  to any of you. Red could stand it  no longer  and he shouted out, \"I am the ruler of all of you. I am the color of danger and bravery. I am willing to  fight for  truth. I am also the color of passion and of love.\" Then came Purple and Indigo. The colors went on boasting , each convinced of his or her won superiority . Their  _  became louder and louder. Suddenly there was a startling flash of bright lightning thunder. Rain started to pour down  _  . The colors crouched down  in fear  , drawing close to one another for comfort. In the midst of the shout, rain began to speak, \"You foolish colors, fight  _  yourselves, each trying to dominate  the rest  . Don't you know that you were each made for a special purpose,  _  and different? Join hands with one  another  and come to me.\" Doing as they were told, the colors  _  and joined hands. They formed a colorful rainbow. From then on, whenever a good  _  washes the world, a rainbow appears in the sky. They remember to  appreciate  one another.", 
    "options": [
        [
            "earth", 
            "moon", 
            "star", 
            "sun"
        ], 
        [
            "anything", 
            "nothing", 
            "something", 
            "everything"
        ], 
        [
            "warmth", 
            "sadness", 
            "depression", 
            "anxiety"
        ], 
        [
            "usual", 
            "normal", 
            "common", 
            "scarce"
        ], 
        [
            "gift", 
            "honor", 
            "thought", 
            "respect"
        ], 
        [
            "quarrel", 
            "discussion", 
            "laughter", 
            "talk"
        ], 
        [
            "gently", 
            "quietly", 
            "violently", 
            "peacefully"
        ], 
        [
            "among", 
            "by", 
            "for", 
            "against"
        ], 
        [
            "equal", 
            "ordinary", 
            "similar", 
            "unique"
        ], 
        [
            "combined", 
            "separated", 
            "united", 
            "divided"
        ], 
        [
            "snow", 
            "rain", 
            "wind", 
            "fog"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "A", 
        "D", 
        "C", 
        "A", 
        "C", 
        "A", 
        "D", 
        "C", 
        "B"
    ], 
    "source": "high1358"
}