{
    "article": "In the 4th century, there was a man called Saint Nicholas in Myra. He was very rich and  _  to help others. He also cared for the  _  very much. He often  _   many kinds of gifts, money and other  _  things to the houses of the poor. He did this at night  _  so that no one knew, because he wanted no  _   . He just wanted to help others. At that time, there were three poor  _   in his town. Both of their parents died. They could hardly  _  enough money to make a living. Nicholas felt sorry for them and  _  to do something to  _  them. On Christmas Eve, when everyone was  _  , Nicholas walked through the streets to the house where the three sisters lived. Quietly, he  _  onto the roof and dropped three bags of  _  into the chimney. It so happened that the three sisters had  _  their stockings before they went to bed. The stockings had been  _  by the fire to dry. When Nicholas dropped the gold, each bag fell into a stocking. The three sisters were surprised and  _  to find the three bags of gold in their stockings the next morning. Now they didn't have to worry about their  _  as they could use the gold to get food. Soon, the story began to get around. Other  _  began to hang up stockings on Christmas Eve  in the hope of  finding bags of gold when they woke up the next morning.\nOver the years, Saint Nicholas became associated   with Christmas. The  _  of hanging stockings up by the chimney on Christmas Eve is known all over the world. And Santa Claus, famous for the red cape   and the white beard, became the most popular guest to children on Christmas.", 
    "options": [
        [
            "hated", 
            "refused", 
            "failed", 
            "liked"
        ], 
        [
            "old", 
            "sick", 
            "poor", 
            "young"
        ], 
        [
            "lent", 
            "brought", 
            "posted", 
            "moved"
        ], 
        [
            "expensive", 
            "simple", 
            "beautiful", 
            "useful"
        ], 
        [
            "slowly", 
            "secretly", 
            "freely", 
            "fairly"
        ], 
        [
            "praise", 
            "money", 
            "surprise", 
            "pay"
        ], 
        [
            "sisters", 
            "brothers", 
            "workers", 
            "farmers"
        ], 
        [
            "beg", 
            "find", 
            "make", 
            "borrow"
        ], 
        [
            "needed", 
            "agreed", 
            "decided", 
            "promised"
        ], 
        [
            "save", 
            "help", 
            "raise", 
            "teach"
        ], 
        [
            "quiet", 
            "busy", 
            "happy", 
            "asleep"
        ], 
        [
            "landed", 
            "climbed", 
            "jumped", 
            "fell"
        ], 
        [
            "gold", 
            "food", 
            "toys", 
            "clothes"
        ], 
        [
            "changed", 
            "bought", 
            "repaired", 
            "washed"
        ], 
        [
            "shown", 
            "thrown", 
            "hung", 
            "stored"
        ], 
        [
            "puzzled", 
            "excited", 
            "worried", 
            "sad"
        ], 
        [
            "meals", 
            "study", 
            "house", 
            "stockings"
        ], 
        [
            "students", 
            "men", 
            "women", 
            "children"
        ], 
        [
            "rule", 
            "habit", 
            "custom", 
            "Manner"
        ]
    ], 
    "answers": [
        "D", 
        "C", 
        "B", 
        "D", 
        "B", 
        "A", 
        "A", 
        "C", 
        "C", 
        "B", 
        "D", 
        "B", 
        "A", 
        "D", 
        "C", 
        "B", 
        "A", 
        "D", 
        "C"
    ], 
    "source": "high510"
}