{
    "article": "I don't know your name, and I'm guessing that you are about high school age. I  _  you in action yesterday as you saved a little boy from  _  at Lake Elmo beach.\nI was sitting on a bench with my friends,  _  their children played in the water. I remember  _  you taking off your shorts, grabbing your  _  device and heading into the water. My friends and I noticed at that moment the little boy's  _  moving up and down. He couldn't have been more than two years old and  _  to be alone in the water.\nYou got to him, put your floatation device around him, and  _  him back to shore. We could see the boy was  _  as you carried him out of the water and laid him on the  _  . You started doing compressions on his chest, that is when we knew it was a bad  _  . We reached you and knew you needed  _  . I picked up my phone and dialed 911.\nSoon, the ambulance  pulled in  and several doctors were there to assist you. You appeared  _  as you walked away, as anyone would be. I  _  if this is your first rescue -- it doesn't matter. What you did was heroic, and I  _  you.\nHad you been a few seconds later, this  _  could have ended quite differently. You were alert  and  aware of  what was going on in the water, responsible for watching over a hundred kids at that time.  Regardless of  your fear, you took action. Because of you, the little boy and his family are  _  together today.", 
    "options": [
        [
            "accompanied", 
            "witnessed", 
            "expected", 
            "ignored"
        ], 
        [
            "drowning", 
            "missing", 
            "bleeding", 
            "falling"
        ], 
        [
            "although", 
            "unless", 
            "if", 
            "while"
        ], 
        [
            "imagining", 
            "minding", 
            "stopping", 
            "noticing"
        ], 
        [
            "digital", 
            "convenient", 
            "rescue", 
            "nuclear"
        ], 
        [
            "feet", 
            "head", 
            "legs", 
            "arms"
        ], 
        [
            "pretended", 
            "determined", 
            "appeared", 
            "prepared"
        ], 
        [
            "allowed", 
            "lifted", 
            "swam", 
            "dropped"
        ], 
        [
            "frozen", 
            "weak", 
            "excited", 
            "calm"
        ], 
        [
            "beach", 
            "stone", 
            "board", 
            "bench"
        ], 
        [
            "meaning", 
            "process", 
            "presentation", 
            "situation"
        ], 
        [
            "food", 
            "money", 
            "help", 
            "time"
        ], 
        [
            "proud", 
            "confident", 
            "independent", 
            "frightened"
        ], 
        [
            "know", 
            "predict", 
            "wonder", 
            "believe"
        ], 
        [
            "applaud", 
            "protect", 
            "doubt", 
            "greet"
        ], 
        [
            "idea", 
            "performance", 
            "game", 
            "story"
        ], 
        [
            "pitifully", 
            "strictly", 
            "happily", 
            "sincerely"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "D", 
        "D", 
        "C", 
        "B", 
        "C", 
        "C", 
        "B", 
        "A", 
        "D", 
        "C", 
        "D", 
        "C", 
        "A", 
        "D", 
        "C"
    ], 
    "source": "high1138"
}