{
    "article": "When my oldest son was in high school, he planned to attend a Christian contemporary concert with the youth group from our church. To my  _  , Aaron invited me to go along. I  _  accepted; however, by the time the date of the concert arrived, my youngest son had been ill, and I was  _  about him. My husband  _  me to attend the concert, promising he would take care of our youngest. I hesitated. Finally, it  _  me. Aaron was sixteen years old. How many  _  would I have to do something fun with him  _  he went away to college? And how many youth actually  _  their mothers to attend a concert with them that was clearly for teens? The  _  was made. I would not miss this opportunity. At the concert, I sat with Aaron in the third row, stuffing cotton in my ears to block out the  _  , ear-splitting music of the first performer. I stood when the kids stood, clapped when they clapped, and never let anyone know how  _  I was to feel the floor vibrate beneath my feet. Aaron and his friends were  _  at my enthusiasm. By the time we left the concert, my ears were ringing, but it quickly passed.  _  did my son's teenage years.  In no time  he was in college and away from home. I missed him more than I could say. On days when I was especially  _  for his ready smile and his teasing manner, I would think back to the concert we attended and be thankful once again that I didn't  _  an opportunity to spend time with my son. Aaron is now grown and has a family of his own, but we are still very  _  . Some days he calls just to  _  and tell me about his day. I drop everything and  _  the moment, knowing these times too shall  _  .", 
    "options": [
        [
            "amazement", 
            "agreement", 
            "argument", 
            "disappointment"
        ], 
        [
            "hardly", 
            "suddenly", 
            "rapidly", 
            "readily"
        ], 
        [
            "crazy", 
            "merciful", 
            "concerned", 
            "patient"
        ], 
        [
            "prevented", 
            "encouraged", 
            "stopped", 
            "refused"
        ], 
        [
            "determined", 
            "hit", 
            "controlled", 
            "annoyed"
        ], 
        [
            "moments", 
            "years", 
            "festivals", 
            "opportunities"
        ], 
        [
            "after", 
            "since", 
            "before", 
            "when"
        ], 
        [
            "advised", 
            "invited", 
            "allowed", 
            "promised"
        ], 
        [
            "invitation", 
            "design", 
            "decision", 
            "demand"
        ], 
        [
            "silly", 
            "loud", 
            "pleasant", 
            "sweet"
        ], 
        [
            "nervous", 
            "excited", 
            "curious", 
            "surprised"
        ], 
        [
            "puzzled", 
            "annoyed", 
            "disappointed", 
            "amused"
        ], 
        [
            "Such", 
            "So", 
            "Neither", 
            "Either"
        ], 
        [
            "tired", 
            "worried", 
            "upset", 
            "lonely"
        ], 
        [
            "miss", 
            "have", 
            "obtain", 
            "grasp"
        ], 
        [
            "open", 
            "close", 
            "young", 
            "positive"
        ], 
        [
            "talk", 
            "speak", 
            "communicate", 
            "chat"
        ], 
        [
            "wait", 
            "enjoy", 
            "listen", 
            "spend"
        ], 
        [
            "lose", 
            "gain", 
            "pass", 
            "keep"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "C", 
        "B", 
        "B", 
        "D", 
        "C", 
        "B", 
        "C", 
        "B", 
        "A", 
        "D", 
        "B", 
        "D", 
        "A", 
        "B", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "high2898"
}