{
    "article": "I have always lived in India, and was recently traveling from Mumbai to Jaipur for work. Arriving at the airport   _  , I was asked to hang out in the waiting area   _  , without much else to do, I decided to check out the gift shop. As I walked around the store, I saw two American   _   having a nap on a recliner  outside. It looked as if they had been at the airport for hours, and I felt I had to do something to help ease their   _  . \nI looked around the store for a few moments, and   ended up  purchasing a medium-sized stuffed by toy which looked like the cartoon character Sponge Bob Square Pants (though it was orange instead of the normal yellow). I asked the owner of the shop for a   _   and a pen and wrote, \"When you get up   _   this makes you smile, it would   _   the world to me. Have a good trip and an awesome experience. \" \nI walked   _   towards the two women and placed the toy and the note next to them. Not wanting to shock on   _   them, I tried to be as slow as possible, but in my   _   to flee the scene, one of them woke up and   _  me in the act. At first when she looked at me, I   _  : maybe she thinks I'm a thief?   _  when she looked at the soft toy and the note, she brightened up, as if this was the   _  thing anyone had ever done for her. \"Is this for me?\" she asked. I gave her a huge   _   and nodded. \nShe was so excited! For a minute, it didn't feel like we were   _   anymore. I shook hands with her, and her smile   _  my day. I walked away with nothing but   _   for her, and came to feel that, even though we were from   _   places, she was just like me.", 
    "options": [
        [
            "directly", 
            "early", 
            "hurriedly", 
            "late"
        ], 
        [
            "which", 
            "what", 
            "that", 
            "where"
        ], 
        [
            "men", 
            "boys", 
            "girls", 
            "women"
        ], 
        [
            "wait", 
            "sadness", 
            "time", 
            "thought"
        ], 
        [
            "book", 
            "paper", 
            "note", 
            "pencil"
        ], 
        [
            "when", 
            "if", 
            "although", 
            "as"
        ], 
        [
            "give", 
            "pass", 
            "take", 
            "mean"
        ], 
        [
            "quietly", 
            "anxiously", 
            "happily", 
            "unbelievably"
        ], 
        [
            "wake", 
            "trouble", 
            "disturb", 
            "encourage"
        ], 
        [
            "dream", 
            "try", 
            "attempt", 
            "track"
        ], 
        [
            "saw", 
            "reminded", 
            "caught", 
            "greeted"
        ], 
        [
            "desired", 
            "worried", 
            "screamed", 
            "feared"
        ], 
        [
            "But", 
            "So", 
            "Because", 
            "However"
        ], 
        [
            "fittest", 
            "last", 
            "best", 
            "first"
        ], 
        [
            "handshake", 
            "present", 
            "laugh", 
            "smile"
        ], 
        [
            "strangers", 
            "passengers", 
            "passers-by", 
            "tourists"
        ], 
        [
            "cheered", 
            "found", 
            "made", 
            "took"
        ], 
        [
            "love", 
            "appreciation", 
            "kindness", 
            "satisfaction"
        ], 
        [
            "same", 
            "faraway", 
            "strange", 
            "different"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "D", 
        "A", 
        "C", 
        "B", 
        "D", 
        "A", 
        "A", 
        "C", 
        "C", 
        "B", 
        "A", 
        "C", 
        "D", 
        "A", 
        "C", 
        "B", 
        "D"
    ], 
    "source": "high704"
}