{
    "article": "Chinese are very generous   when it comes to educating their children. Not   caring about  the money, parents often send their\nchildren to the best schools or even abroad. They also want their children to\ntake extra-course  _  through which they will learn\neither an instrument or ballet  , or other classes which will give them a head start in life.\nChinese believe that the   more expensive  an education is, the better it is. So\nparents would like to spend a large amount of money on education. Even  _  couples will buy a computer for their son or daughter. However, what\nmost parents  _  to see is that the best early\neducation they can give their children is usually very cheap. Parents can see\nthat their children's skills vary, skilled in some areas while poor in others.  _  most parents fail to realize is that today's children lack\nself-respect and self-confidence.ks5u\nThe problem is that parents are only   _  their children by teaching\nthem how to take multiple-choice tests and how to study well, but parents are\nnot teaching them the most important skills they need to be  _  ,\nhappy and clever. Parents can achieve this by teaching  _  skills\nlike cooking, sewing and doing other housework.  _  a\nchild to cook will improve many of the skills that he will need later in life.", 
    "options": [
        [
            "parties", 
            "sports", 
            "clubs", 
            "activities"
        ], 
        [
            "rich", 
            "old", 
            "poor", 
            "young"
        ], 
        [
            "fail", 
            "try", 
            "want", 
            "manage"
        ], 
        [
            "Why", 
            "That", 
            "What", 
            "Which"
        ], 
        [
            "advising", 
            "educating", 
            "persuading", 
            "suggesting"
        ], 
        [
            "outgoing", 
            "quiet", 
            "serious", 
            "confident"
        ], 
        [
            "actual", 
            "practical", 
            "real", 
            "true"
        ], 
        [
            "Teaching", 
            "Asking", 
            "Advising", 
            "Telling"
        ]
    ], 
    "answers": [
        "D", 
        "C", 
        "A", 
        "C", 
        "B", 
        "D", 
        "B", 
        "A"
    ], 
    "source": "high1147"
}