{
    "article": "One day, Miss Ellis gave her pupils a new kind of homework: homework on happiness. Her pupils would be \"happiness  _  \", and were to see what would happen when they tried to bring happiness to those around them. As part of their homework, all the students did really  _  , wonderful things, but what Carla Chalmers did left everyone  _  . Several days after the homework had been handed out, Carla turned up carrying a big bag. \"Here in this bag I have all the happiness I've collected so far,\" she said  _  . On seeing this, everyone was filled with  _  , but Carla didn't want to show anyone what was in the bag. Instead, she pulled out a small box and gave it to her teacher. When Miss Ellis had taken the box, Carla took a(n)  _  camera out of her own pocket and stood with it at the ready. \"Open it, Miss Ellis.\" The teacher slowly opened the box and looked inside. A big smile  _  on her face, and at that moment Carla took a photo, Carla's photo came out of the camera immediately, and she  _  it to Miss Ellis along with a sheet of paper. The teacher read the paper in silence, and when she, had finished, she gestured at the  _  . \"Oh, so it's...\" \"Yes!\"  _  Carla, opening the bag. \"It's a great big pile of smiles!\" She opened the bag and photos of different  _  fell out. The rest of the class tried to  figure out  how Carla had managed to create such a great big chain of happiness. All there in the box was a photo of a big smile. But everyone who had seen it felt happiness being transmitted to them, and in return, without  _  , every person  _  with a smile of their own. She managed to  _  understanding of the smile truth that every time you smile you are sending a gift to the world.", 
    "options": [
        [
            "explorers", 
            "instructors", 
            "players", 
            "collectors"
        ], 
        [
            "regretful", 
            "delightful", 
            "stressful", 
            "thankful"
        ], 
        [
            "surprised", 
            "satisfied", 
            "annoyed", 
            "depressed"
        ], 
        [
            "disappointedly", 
            "sadly", 
            "amazedly", 
            "smilingly"
        ], 
        [
            "astonishment", 
            "kindness", 
            "expectation", 
            "pride"
        ], 
        [
            "expensive", 
            "old-fashioned", 
            "instant", 
            "good-looking"
        ], 
        [
            "disappeared", 
            "froze", 
            "faded", 
            "shone"
        ], 
        [
            "offered", 
            "sold", 
            "packed", 
            "paid"
        ], 
        [
            "box", 
            "bag", 
            "camera", 
            "pocket"
        ], 
        [
            "added", 
            "questioned", 
            "replied", 
            "interrupted"
        ], 
        [
            "smiles", 
            "teachers", 
            "ceremonies", 
            "friends"
        ], 
        [
            "imagination", 
            "expression", 
            "hesitation", 
            "reason"
        ], 
        [
            "responded", 
            "refused", 
            "demanded", 
            "proved"
        ], 
        [
            "hide", 
            "correct", 
            "appreciate", 
            "spread"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "A", 
        "D", 
        "C", 
        "C", 
        "D", 
        "A", 
        "B", 
        "D", 
        "A", 
        "C", 
        "A", 
        "D"
    ], 
    "source": "high920"
}