{
    "article": "After 21 years of marriage, my wife wanted me to take another woman out to dinner.  This other  woman was my mother, who has been a widow for 19 years, but my work had made  _  impossible to visit her very often. That night I called to  _  her to go out for dinner.\"What's wrong? Are you  _  ?\"she asked. \"I thought that it would be  _  to spend some time with you. Just the two of us,\"I answered. She thought about it  for a  moment, and agreed. That Friday after work,  _  I drove to pick her up, I was a bit nervous. When I arrived at her house, I  _  that, she, too, seemed to be  _  about our date. She had curled her hair and was wearing the dress that she had worn to  _  her last wedding anniversary. We went to a restaurant that,  _  not elegant, was very nice and cozy. When I read the menu, Mom sat there  _  at me. A nostalgic smile was  _  her lips. During the dinner, we had a(an)  _  conversation--nothing special but catching up on recent events of each other's life. A few days  _  , my mother died of a heart attack. It happened so suddenly that I didn't have a chance to do  _  for her. Sometime later, I received an envelope with a note  _  \"You will never know what that night meant to me. I'm looking forward to the  _  dinner. I love you, Son.\" At that moment, I understood the importance of saying in time\"I LOVE YOU\". Nothing in life is more important than your  _  . Give them the time they deserve, because these things cannot be  put off  till\"some other time\".", 
    "options": [
        [
            "this", 
            "that", 
            "one", 
            "it"
        ], 
        [
            "force", 
            "order", 
            "advise", 
            "invite"
        ], 
        [
            "happy", 
            "good", 
            "well", 
            "bad"
        ], 
        [
            "glad", 
            "pleasant", 
            "interesting", 
            "pleased"
        ], 
        [
            "until", 
            "after", 
            "as", 
            "since"
        ], 
        [
            "noticed", 
            "observed", 
            "watched", 
            "heard"
        ], 
        [
            "confused", 
            "calm", 
            "nervous", 
            "easy"
        ], 
        [
            "congratulate", 
            "celebrate", 
            "memorize", 
            "honor"
        ], 
        [
            "though", 
            "even", 
            "but", 
            "yet"
        ], 
        [
            "glancing", 
            "staring", 
            "glaring", 
            "smiling"
        ], 
        [
            "in", 
            "beyond", 
            "above", 
            "on"
        ], 
        [
            "deep", 
            "curious", 
            "agreeable", 
            "short"
        ], 
        [
            "later", 
            "after", 
            "before", 
            "ago"
        ], 
        [
            "anything", 
            "everything", 
            "nothing", 
            "something"
        ], 
        [
            "writing", 
            "saying", 
            "speaking", 
            "telling"
        ], 
        [
            "first", 
            "second", 
            "last", 
            "next"
        ], 
        [
            "mother", 
            "wife", 
            "family", 
            "work"
        ]
    ], 
    "answers": [
        "D", 
        "D", 
        "C", 
        "B", 
        "C", 
        "A", 
        "C", 
        "D", 
        "A", 
        "B", 
        "D", 
        "C", 
        "A", 
        "A", 
        "B", 
        "D", 
        "C"
    ], 
    "source": "high887"
}