{
    "article": "He never believed that true love existed. His parents divorcedwhen he was young and he didn't think that true love was able to survive in today's world. He was  _  wrong. His grandparents were always supportive to the kids and tried to help them when their parents  _  . He knew they loved each other, he just wasn't sure it was true love. He had  _  heard them say, \"I love you\" or they hadn't shown any affection  other than  hugging. They had been married for over fifty years and he thought that their true love was gone. But again he was wrong. His grandfather, Ralph, was struck ill in his junior year of college and he didn't know how serious it was until he fell and hurt his hip . While in the hospital, the doctors  found out  ) in his lungs. They told him that he had lung cancer and due to previous illnesses, they could not operate and he was too  _  for chemotherapy . It was around Thanksgiving and by Christmas his condition worsened. The cancer spread and in late January his sister away at college too, called him crying and said she was on her way home because the doctors told their family that their  _  had only a week to live, that by the weekend he would  no longer  be with them. Their family came in from around the country and stayed next to his side. It was not until then that he  _  that true love did exist and would survive beyond death. Every night as his grandfather grew more fragile, he would  _  sweet words to grandmother, Madge. The night before he died grandmother was walking out of his room and he said to her \"I love you Madgie baby\". The next morning he received a phone call at work that grandfather had passed during the night. Throughout his short battle  _  cancer, he realized how much two people can love each other and he realized how much it means to be loved and give love. It is the greatest  _  on earth and it lasts beyond life because you never forget your one true love.", 
    "options": [
        [
            "believed", 
            "proved", 
            "asked", 
            "realized"
        ], 
        [
            "died", 
            "married", 
            "divorced", 
            "fought"
        ], 
        [
            "ever", 
            "never", 
            "even", 
            "often"
        ], 
        [
            "strong", 
            "fat", 
            "short", 
            "weak"
        ], 
        [
            "grandfather", 
            "grandmother", 
            "father", 
            "mother"
        ], 
        [
            "realized", 
            "said", 
            "saw", 
            "mentioned"
        ], 
        [
            "speak", 
            "shout", 
            "whisper", 
            "talk"
        ], 
        [
            "by", 
            "in", 
            "on", 
            "with"
        ], 
        [
            "smile", 
            "battle", 
            "gift", 
            "surprise"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "B", 
        "D", 
        "A", 
        "A", 
        "C", 
        "D", 
        "C"
    ], 
    "source": "high1742"
}