{
    "article": "The last day of the final examination arrived. In a large eastern university, on the steps of one building, a group of students were talking about the exam that was going to begin in a few  _  . On their faces was confidence. This was their  _  exam--then on to graduation and jobs. Some talked of jobs they already had, others talked of jobs they  would  get. With the certainty of four years of college, they felt  _  and able to take control of the world. The coming exam, they knew, would be a(n)  _  task, as the professor had said they could bring  _  books or notes they wanted, requesting only that they did not  talk to  each other during the test.  _  they entered the classroom. The professor handed out the papers. And smiles  _  on the students' faces as they found there were only five questions. Three hours had passed  _  the professor began to collect papers. The students no longer looked confident. On their faces was a frightened expression. Papers in hand, no one spoke as the professor faced the class. He looked at the  _  faces before him, and then asked, \"How many completed all five questions?\"  _  \"How many answered four?\" Still no hand. \"Three? Two?\" The students moved restlessly in their seats. \"One, then? Certainly somebody finished  _  \"But the class remained silent. The professor put down the papers. \"That is exactly what I  _  ,\" he said. \"I just want you to know that, although you have completed four years of study, there are  _  many things about the  _  you don't know. These questions you could not answer are relatively common in  everyday  practice.\" Then, smiling, he added, \"You will all  _  this course, but remember--even though you are now college graduates, your education had just  _  .\" The years have weakened the name of the professor, but not the  _  he taught.", 
    "options": [
        [
            "seconds", 
            "minutes", 
            "hours", 
            "days"
        ], 
        [
            "only", 
            "first", 
            "very", 
            "last"
        ], 
        [
            "glad", 
            "ready", 
            "sorry", 
            "nice"
        ], 
        [
            "interesting", 
            "necessary", 
            "easy", 
            "unusual"
        ], 
        [
            "no", 
            "either", 
            "any", 
            "some"
        ], 
        [
            "Hardly", 
            "Happily", 
            "Quickly", 
            "Carefully"
        ], 
        [
            "appeared", 
            "changed", 
            "failed", 
            "stopped"
        ], 
        [
            "then", 
            "as", 
            "before", 
            "after"
        ], 
        [
            "pleased", 
            "worried", 
            "surprised", 
            "moved"
        ], 
        [
            "Not", 
            "Once", 
            "Only", 
            "Even"
        ], 
        [
            "all", 
            "none", 
            "one", 
            "it"
        ], 
        [
            "wondered", 
            "enjoyed", 
            "hated", 
            "expected"
        ], 
        [
            "even", 
            "already", 
            "so", 
            "still"
        ], 
        [
            "exam", 
            "subject", 
            "question", 
            "college"
        ], 
        [
            "pass", 
            "fail", 
            "take", 
            "start"
        ], 
        [
            "begun", 
            "completed", 
            "failed", 
            "succeeded"
        ], 
        [
            "subject", 
            "things", 
            "words", 
            "lessons"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "B", 
        "C", 
        "C", 
        "B", 
        "A", 
        "C", 
        "B", 
        "A", 
        "C", 
        "D", 
        "D", 
        "B", 
        "A", 
        "A", 
        "D"
    ], 
    "source": "high359"
}