{
    "article": "Do you find getting up in the morning so difficult that it's painful? This might be called laziness, but Dr. Kleitman has a new  _  . He has proved that everyone has a daily energy cycle. During the hours when you labour through your work, you  _  say that you're \"hot\". That's true. The time of day when you feel most energetic is when your cycle of body temperature is  at its peak  . For some people the peak comes during the forenoon. For others it comes in the afternoon or evening. No one has discovered  _  this is so , but it leads to such familiar monologues  as  \"Get up , John ! You'll be late for work again!\" The  _  explanation to the trouble is that John is at his temperature--and --energy peak in the evening. Much family quarrelling  ends  when husbands and wives realize what these energy cycles mean, and which cycle each member of the family has. You can't change your  energy cycle  , but you can make your life  fit  it better. Habit can help. Dr. Kleitman believes. Maybe you're sleepy in the evening but feel you must stay up late  anyway  . Counteract your cycle to some extent by  _  staying up later than you want to . If your energy is  _  in the morning but you have an important job to do early in the day,  rise  before your usual hour. This won't change your cycle, but you'll get up steam and work better  at your low point  . Get off to a slow start  _  saves your energy. Get up with a yawn and  _  . Sit on the edge of the bed a minute before  putting your feet  on the floor. Avoid the  _  search for clean clothes by laying them out  the night before  . Whenever possible , do routine work in the afternoon and save tasks  _  more energy for your sharper hours .", 
    "options": [
        [
            "impression", 
            "explanation", 
            "exploration", 
            "translation"
        ], 
        [
            "must", 
            "should", 
            "can", 
            "may"
        ], 
        [
            "why", 
            "that", 
            "whether", 
            "whatever"
        ], 
        [
            "steady", 
            "occasional", 
            "surprised", 
            "possible"
        ], 
        [
            "sensitively", 
            "especially", 
            "carefully", 
            "habitually"
        ], 
        [
            "low", 
            "high", 
            "old", 
            "new"
        ], 
        [
            "which", 
            "whichever", 
            "what", 
            "whatever"
        ], 
        [
            "express", 
            "attend", 
            "open", 
            "stretch"
        ], 
        [
            "tired", 
            "troublesome", 
            "immediate", 
            "dangerous"
        ], 
        [
            "suggesting", 
            "demanding", 
            "requiring", 
            "persuading"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "A", 
        "D", 
        "D", 
        "A", 
        "A", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "high556"
}