{
    "article": "When I come across a good article in reading newspapers, I often want to   _   and keep it. But just as I am about to do so I find the article on the   _   side is as much interesting. It may be a discussion of the   _   to keep in good health, or advice about how to behave and conduct oneself in   _  . If I cut the front article, the opposite one is likely to suffer   _  , leaving out half of it or keeping the   _   without the title. Therefore, the scissors would   _   before they start, or halfway done when I find out the regretful   _  .\nSometimes two things are to be done at the same time, both   _   your attention. You can only take up one of them,   the other   has to wait or be given up. But you know the   _   is unpredictable--the changed situation may not allow you to do what is   _   behind. Thus you are caught in a difficult   _   and feel sad. How   _   that nice changes and brilliant ideas should gather around all at once? It may happen that your life changes greatly on your   _   of one choice to the other.\nIn fact that is what   _   is like: we are often faced with the two opposite   _   of a thing which are both desirable like a newspaper cutting. It often occurs that our attention is   _   to one thing only after we get into another. The former may be more important than the   _   and give rise to a divided mind. I still remember a philosopher's remarks: \"When one door shuts, another opens in life.\" So a casual   _   may not be a bad one.", 
    "options": [
        [
            "cut", 
            "collect", 
            "buy", 
            "print"
        ], 
        [
            "other", 
            "opposite", 
            "front", 
            "back"
        ], 
        [
            "way", 
            "situation", 
            "manner", 
            "attitude"
        ], 
        [
            "class", 
            "society", 
            "play", 
            "designing"
        ], 
        [
            "pain", 
            "damage", 
            "wound", 
            "injury"
        ], 
        [
            "test", 
            "word", 
            "paper", 
            "text"
        ], 
        [
            "use", 
            "cut", 
            "stay", 
            "continue"
        ], 
        [
            "condition", 
            "result", 
            "pain", 
            "trouble"
        ], 
        [
            "value", 
            "worth", 
            "means", 
            "favourite"
        ], 
        [
            "future", 
            "past", 
            "force", 
            "dream"
        ], 
        [
            "remained", 
            "left", 
            "worried", 
            "interested"
        ], 
        [
            "position", 
            "surrounding", 
            "ground", 
            "part"
        ], 
        [
            "dares", 
            "comes", 
            "deals", 
            "happens"
        ], 
        [
            "dislike", 
            "job", 
            "feeling", 
            "preference"
        ], 
        [
            "cutting", 
            "life", 
            "weather", 
            "friendship"
        ], 
        [
            "methods", 
            "conditions", 
            "sides", 
            "opening"
        ], 
        [
            "drawn", 
            "placed", 
            "paid", 
            "put"
        ], 
        [
            "head", 
            "latter", 
            "above", 
            "below"
        ], 
        [
            "action", 
            "remark", 
            "movement", 
            "choice"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "A", 
        "B", 
        "B", 
        "D", 
        "C", 
        "B", 
        "B", 
        "A", 
        "B", 
        "A", 
        "B", 
        "D", 
        "B", 
        "C", 
        "A", 
        "B", 
        "D"
    ], 
    "source": "high2660"
}