{
    "article": "One night I decided to spend some time building a happier and closer relationship with my daughter. For several weeks she had been  _  me to play chess with her, so I suggested a game and she eagerly accepted. It was a school night, however, and at nine o'clock my daughter asked if I could hurry my moves, because she  _  to go to bed; she had to get up at six in the morning. I  _  she had strict sleeping habits,  _  I thought she ought to be able to  give up  some of this strictness. I said to her, \"  Come on  , you can stay up late for once. We're having  _  .\" We played on for another fifteen minutes, during which time she looked  _  . Finally she said, \"Please, Daddy, do it quickly.\" \"No,\" I replied. \"If you're going to play it  _  , you're going to play it slowly.\" And so we  _  for another ten minutes, until suddenly my daughter burst into tears, and admitted that she was beaten. Clearly I had made  a mistake  . I had started the evening wanting to have a  _  time with my daughter but had allowed my desire to win to become more  _  than my relationship with my daughter. When I was a child, my desire to win  _  me well. As a parent, I  _  that it got in my way. So I had to change.", 
    "options": [
        [
            "guiding", 
            "asking", 
            "training", 
            "advising"
        ], 
        [
            "agreed", 
            "needed", 
            "begged", 
            "hated"
        ], 
        [
            "knew", 
            "learned", 
            "guessed", 
            "heard"
        ], 
        [
            "so", 
            "for", 
            "but", 
            "or"
        ], 
        [
            "patience", 
            "luck", 
            "fun", 
            "success"
        ], 
        [
            "excited", 
            "proud", 
            "anxious", 
            "angry"
        ], 
        [
            "well", 
            "again", 
            "fairly", 
            "regularly"
        ], 
        [
            "discussed", 
            "continued", 
            "counted", 
            "argued"
        ], 
        [
            "free", 
            "different", 
            "full", 
            "happy"
        ], 
        [
            "important", 
            "attractive", 
            "practical", 
            "interesting"
        ], 
        [
            "offered", 
            "served", 
            "controlled", 
            "taught"
        ], 
        [
            "realized", 
            "apologized", 
            "imagined", 
            "explained"
        ]
    ], 
    "answers": [
        "B", 
        "B", 
        "A", 
        "C", 
        "C", 
        "C", 
        "A", 
        "B", 
        "D", 
        "A", 
        "B", 
        "A"
    ], 
    "source": "high2183"
}