{
    "article": "I believe I had the perfect life. Because I was about to  _  my high school, and on my way to college, I had great friends and a loving family. There was nothing  _  . But I spoke too soon.\nIt was around 9:25 a. m. that I heard the news that would  _  my life forever. My brother Zach had been in a car accident. He fought for five days before he  passed away  . That day, I became an only child. I felt desperately  _  .\nAfter Zach's death, I found  _  in food. I ate, then I slept, then I ate again. I couldn't cry. I could barely feel anything, and I was  _  . I stopped building relationships for fear that they would end just as  _  as Zach's life. Also, I became nervous about any potentially  _  situations--driving late at night--but I couldn't express this fear of life  _  I wanted to be strong for my parents. I saw my parents'   _  worse than mine on account of the losing of their son. I didn't want them to  care about  me. I also experienced a lot of  _  , because I was angry about why the sadness had happened to me, and I never  _  from this emotion.\nNow, it has been nearly five years since Zach's death. I don't  _  life anymore: I face it bravely. I  _  my friendships and began socializing more. I even  _  Zach's story with people around me. Although my new friends never met him, they know about Zach.\nOne lesson I learned from losing my brother was never to be  _  to say, \" I love you.\" I loved my brother, but it was too late to  _  it loudly. The last time I remember telling my brother I loved him was when he was dying. Don't make this  _  like me.", 
    "options": [
        [
            "skip", 
            "finish", 
            "admit", 
            "determine"
        ], 
        [
            "earning", 
            "missing", 
            "competing", 
            "reaching"
        ], 
        [
            "slip", 
            "change", 
            "simplify", 
            "spoil"
        ], 
        [
            "lonely", 
            "deserted", 
            "abandoned", 
            "remote"
        ], 
        [
            "nutrition", 
            "relief", 
            "guidance", 
            "benefit"
        ], 
        [
            "funny", 
            "numb", 
            "patient", 
            "endless"
        ], 
        [
            "finally", 
            "suddenly", 
            "appropriately", 
            "violently"
        ], 
        [
            "complicated", 
            "risky", 
            "particular", 
            "tense"
        ], 
        [
            "so", 
            "if", 
            "because", 
            "unless"
        ], 
        [
            "discouragement", 
            "pain", 
            "tolerance", 
            "memory"
        ], 
        [
            "unpleasantness", 
            "anger", 
            "unhappiness", 
            "power"
        ], 
        [
            "hated", 
            "escaped", 
            "stopped", 
            "measured"
        ], 
        [
            "damage", 
            "choose", 
            "leave", 
            "fear"
        ], 
        [
            "produced", 
            "rebuilt", 
            "promoted", 
            "insured"
        ], 
        [
            "imitate", 
            "share", 
            "advertise", 
            "perform"
        ], 
        [
            "stubborn", 
            "afraid", 
            "tight", 
            "nervous"
        ], 
        [
            "explore", 
            "express", 
            "circulate", 
            "scream"
        ], 
        [
            "mistake", 
            "explanation", 
            "decision", 
            "comment"
        ]
    ], 
    "answers": [
        "B", 
        "B", 
        "B", 
        "A", 
        "B", 
        "B", 
        "B", 
        "B", 
        "C", 
        "B", 
        "B", 
        "B", 
        "D", 
        "B", 
        "B", 
        "B", 
        "B", 
        "A"
    ], 
    "source": "high615"
}