{
    "article": "We often talk about ourselves as if we have permanent genetic defects that can never be changed. \"I'm impatient.\" \"I'm always behind.\" \"I always put things  _  !\" You've surely heard them. Maybe you've used them to describe  _  . These comments may come from stories about us that have been  _  for years--often from  as far back as  childhood. These stories may have no  _  in fact. But they can set low expectations for us. As a child, my mother said to me, \"Marshall, you have no mechanical skills, and you will never have any mechanical skills for the rest of your life.\" How did these expectations  _  my development? I was never  _  to work on cars or be around  _  . When I was 18, I took the US Army's Mechanical Aptitude Test. My scores were in the bottom for the entire nation! Six years later,  _  , I was at California University, working on my doctor's degree. One of my professors, Dr. Bob Tannbaum, asked me to write down things I did well and things I couldn't do. On the positive side, I  _  down, \"research, writing, analysis, and speaking.\" On the  _  side, I wrote, \"I have no mechanical skills.\" Bob asked me how I knew I had no mechanical skills. I explained my life  _  and told him about my  _  performance on the Army test. Bob then asked, \"  _  is it that you can solve  _  mathematical problems, but you can't solve simple mechanical problems?\" Suddenly I realized that I didn't  _  from some sort of genetic defect. I was just living out expectations that I had chosen to  _  . At that point, it wasn't just my family and friends who had been  _  my belief that I was mechanically hopeless. And it wasn't just the Army test, either. I was the one who kept telling myself, \"You can't do this!\" I realized that as long as I kept saying that, it was going to remain true.  On the contrary  , if we don't treat ourselves as if we have incurable genetic defects, we can do well in almost  _  we choose.", 
    "options": [
        [
            "away", 
            "down", 
            "up", 
            "off"
        ], 
        [
            "yourself", 
            "myself", 
            "them", 
            "others"
        ], 
        [
            "said", 
            "repeated", 
            "spread", 
            "spoken"
        ], 
        [
            "cause", 
            "plot", 
            "basis", 
            "meaning"
        ], 
        [
            "affect", 
            "improve", 
            "lead", 
            "change"
        ], 
        [
            "hoped", 
            "demanded", 
            "encouraged", 
            "agreed"
        ], 
        [
            "means", 
            "hammers", 
            "facilities", 
            "tools"
        ], 
        [
            "therefore", 
            "however", 
            "instead", 
            "somehow"
        ], 
        [
            "took", 
            "turned", 
            "settled", 
            "got"
        ], 
        [
            "negative", 
            "active", 
            "passive", 
            "subjective"
        ], 
        [
            "roads", 
            "trips", 
            "experiences", 
            "paths"
        ], 
        [
            "unexpected", 
            "average", 
            "excellent", 
            "poor"
        ], 
        [
            "When", 
            "Why", 
            "How", 
            "What"
        ], 
        [
            "common", 
            "advanced", 
            "complex", 
            "primary"
        ], 
        [
            "suffer", 
            "separate", 
            "arise", 
            "come"
        ], 
        [
            "adopt", 
            "suspect", 
            "believe", 
            "receive"
        ], 
        [
            "weakening", 
            "accepting", 
            "abandoning", 
            "strengthening"
        ], 
        [
            "nothing", 
            "something", 
            "anything", 
            "all"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "B", 
        "C", 
        "A", 
        "C", 
        "D", 
        "B", 
        "A", 
        "A", 
        "C", 
        "D", 
        "B", 
        "C", 
        "A", 
        "C", 
        "D", 
        "C"
    ], 
    "source": "high1991"
}