{
    "article": "There is an amusing story about King Alfred during his wars. At one time the enemy was  winning  . Alfred's soldiers had all run away, and the King was alone in a forest. It was late, and Alfred was tired and  _  . After walking for  some times  he came to a little cottage. He knocked at the door and asked for  _  and shelter for the night. There was a poor woman in the cottage. She did not know that Alfred was king  _  his clothes were torn and dirty. She let him in, and told him to sit down by  the fire  to warm himself. She asked him to  watch  her cakes, which were baking, while she went to the well to  _  water. Poor Alfred had  _  important things to think about than the cakes, which he soon forgot. When the woman came back, her cakes were all burnt. She was very angry. \"You good-for-nothing, worthless man!\" she said. \"You want to  _  , but you can not even watch them for a quarter of an hour. Take that! And that! And that!\" She began beating  the poor king  with a big stick. Just then some of the enemy's soldiers came to the cottage. When they saw the woman  _  him they never considered that he was the King; they thought that he was her husband. So they laughed and passed on. Later some of Alfred's own soldiers found him and bowed before him. When the poor woman learnt that it was the King that she had beaten, she was very much  _  . She knelt down and asked for mercy. \"Don't be afraid, my good woman, \" said Alfred laughing. \" Your stick  saved my life  When I have driven the enemy out of the country I shall remember the service you have done for me. \" He did not  _  his promise.", 
    "options": [
        [
            "cold", 
            "hot", 
            "hungry", 
            "cool"
        ], 
        [
            "trouble", 
            "advice", 
            "money", 
            "food"
        ], 
        [
            "although", 
            "until", 
            "unless", 
            "as"
        ], 
        [
            "fetch", 
            "take", 
            "bring", 
            "carry"
        ], 
        [
            "more", 
            "very", 
            "much", 
            "many"
        ], 
        [
            "rest", 
            "hide", 
            "eat", 
            "learn"
        ], 
        [
            "beating", 
            "hiding", 
            "teaching", 
            "helping"
        ], 
        [
            "proud", 
            "afraid", 
            "glad", 
            "calm"
        ], 
        [
            "keep", 
            "make", 
            "fulfill", 
            "break"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "D", 
        "A", 
        "A", 
        "C", 
        "A", 
        "B", 
        "D"
    ], 
    "source": "high1293"
}