{
    "article": "I met Jane Black in university, and soon we became friends.The first time I went to her home I found her family quite different from my own. In my family, it was always important to place  _  when anything bad happened. \"Who did this? \"my mother would scream about a dirty kitchen. \" This is all your  _  , Katharine, \" my father would insist when the cat got out or the dishwasher  _  . From the time we were little, my sister, brothers and I told on each other.We set a place for blame at the dinner table.  _  ,the Whites didn't worry about who had done what.They picked up the pieces and  moved on  with their lives.The beauty of this was driven home to me the summer Jane died. In July, the White sisters and I decided to take a car  _  from their home in Florida to New York.The two older sisters, Sarah and Jane, were college students, and the youngest, Amy, had recently  _  sixteen.Proud of having a new driver' s license, Amy was excited about practicing her driving on the trip.She  showed off  her license to everyone she met. The big sisters  _  the driving of Sarah' s new car during the first part of the trip, but when they reached  _  crowded areas, they let Amy  take over  .Somewhere in South Carolina, we pulled off the highway to eat.After lunch, Amy got behind the wheel.She came to a crossroads with a stop sign.Whether she was nervous or just didn't see the sign no one would  _  know, but Amy continued into the crossroads without stopping.The driver of a large truck, unable to stop in time, ran into our car. Jane was killed immediately.I was only  _  injured.The most difficult thing that I've ever done was to call the Whites to tell them about the accident and that Jane had died.Painful  _  it was for me to lose a good friend, I knew that it was far worse for them to lose a child. When Mr.and Mrs.White arrived at the hospital, they found their two daughters sharing a room.Sarah had a few cuts on the head and Amy' s leg was broken.They hugged us all and cried tears of  _  and of joy at seeing their daughters.They  _  away the girls' tears and made a few jokes at Amy as she learned to use her crutches . To both of their daughters, and especially to Amy, over and over they simply said, \"We' re so glad that you' re alive.\" I was  _  .No blame.No accusations. Later, I asked the Whites why they never talked about the fact that Amy was driving and had run a stop sign. Mrs. White said, \"Jane' s gone, and we miss her  _  .Nothing we say or do will ever bring her back.But Amy has her whole life ahead of her.How can she  _  a full and happy life if she feels we blame her for her sister' s death?\" They were right.Amy graduated from the University of California and got married several years ago.She works  _  a teacher of learning-disabled students.She' s also a mother of two little girls of her own, the oldest named Jane.", 
    "options": [
        [
            "anger", 
            "blame", 
            "scream", 
            "pride"
        ], 
        [
            "fault", 
            "mistake", 
            "benefit", 
            "action"
        ], 
        [
            "broke", 
            "caught", 
            "stopped", 
            "worked"
        ], 
        [
            "Then", 
            "However", 
            "Therefore", 
            "Still"
        ], 
        [
            "drive", 
            "voyage", 
            "trip", 
            "tour"
        ], 
        [
            "became", 
            "reached", 
            "got", 
            "turned"
        ], 
        [
            "took", 
            "tasted", 
            "shared", 
            "experienced"
        ], 
        [
            "more", 
            "less", 
            "far", 
            "quite"
        ], 
        [
            "hardly", 
            "never", 
            "even", 
            "ever"
        ], 
        [
            "seriously", 
            "slightly", 
            "lightly", 
            "quickly"
        ], 
        [
            "as", 
            "so", 
            "when", 
            "while"
        ], 
        [
            "pity", 
            "sadness", 
            "shame", 
            "sympathy"
        ], 
        [
            "swept", 
            "gave", 
            "wiped", 
            "cleaned"
        ], 
        [
            "delighted", 
            "excited", 
            "amused", 
            "astonished"
        ], 
        [
            "terribly", 
            "hard", 
            "gradually", 
            "rarely"
        ], 
        [
            "direct", 
            "guide", 
            "lead", 
            "conduct"
        ], 
        [
            "for", 
            "as", 
            "like", 
            "to"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "A", 
        "B", 
        "C", 
        "D", 
        "C", 
        "B", 
        "D", 
        "B", 
        "A", 
        "B", 
        "C", 
        "D", 
        "A", 
        "C", 
        "B"
    ], 
    "source": "high2118"
}