{
    "article": "Mr. and Mrs. Brown were going abroad for their holiday. They     _  a dog called Blackie which they were very fond of, but they could not take him abroad with   _  , so they looked for a good place to leave him in   _  they were away, and at last found a place which looked after dogs very well when their   _  were away. They took Blackie there just before they  _  for their holiday, and  _   said good-bye to him. \nAt the   _  of their holiday, they got back to England very late at night, and they  _  that the place where Blackie was staying might be   _   at that hour, they decided to wait until the next   _  before going to get him back.\n  So the next morning Mr. Brown got into his   _  and drove off happily to collect Blackie. When he arrived home with the dog, he said to his wife, \"Do you know, dear, I don't think Blackie have  _   his stay at that place very much. He barked all the   _  home in the car as if he wanted to tell me something.\"\nMrs. Brown looked at the dog   _  and then answered, \"You are quite right, dear. He was certainly trying to tell you something. But he wasn't trying to tell you that he hadn't enjoyed his stay at that place. He was only   _  that you were bringing the wrong dog home. This isn't Blackie.\"", 
    "options": [
        [
            "bought", 
            "had", 
            "borrowed", 
            "stole"
        ], 
        [
            "him", 
            "them", 
            "her", 
            "it"
        ], 
        [
            "since", 
            "because", 
            "while", 
            "although"
        ], 
        [
            "owners", 
            "friends", 
            "trainers", 
            "enemies"
        ], 
        [
            "left", 
            "waited", 
            "applied", 
            "pay"
        ], 
        [
            "nervously", 
            "rapidly", 
            "directly", 
            "sadly"
        ], 
        [
            "middle", 
            "beginning", 
            "break", 
            "end"
        ], 
        [
            "thought", 
            "hoped", 
            "wondered", 
            "saw"
        ], 
        [
            "open", 
            "noisy", 
            "closed", 
            "clean"
        ], 
        [
            "night", 
            "afternoon", 
            "evening", 
            "morning"
        ], 
        [
            "plane", 
            "bus", 
            "bike", 
            "car"
        ], 
        [
            "enjoyed", 
            "admired", 
            "respected", 
            "hated"
        ], 
        [
            "day", 
            "way", 
            "time", 
            "road"
        ], 
        [
            "quickly", 
            "politely", 
            "carefully", 
            "rudely"
        ], 
        [
            "thinking", 
            "complaining", 
            "guessing", 
            "joking"
        ]
    ], 
    "answers": [
        "B", 
        "B", 
        "C", 
        "A", 
        "A", 
        "D", 
        "D", 
        "A", 
        "C", 
        "D", 
        "D", 
        "A", 
        "B", 
        "C", 
        "B"
    ], 
    "source": "high1861"
}