{
    "article": "I believe honesty is one of the greatest gifts. I know they call it a lot of fancy names these days, like  _  and straightforward. And it's still what  _  a man a good citizen. This is my secret, and I try to live by. I've been in the taxi business for thirty-five years,  _  there is a lot about it that is not so good. Taxi drivers have to be rough and tumble fellows to be able to take it in New York. You've got to be  _  to fight the New York traffic eight hours a day. Because taxi drivers are tough, people get the  _  impression that they are bad. Taxi drivers are just like other people. Most of them will act as  _  fellows. You read in the papers almost every week  _  a taxi driver turns in money or jewels or like that people leave in their  _  . If they weren't honest, you wouldn't be reading those stories in the papers. One time, I found an emerald ring in my car. I remembered helping a lady with a lot of suitcases that day, so I went back to where I had  dropped her off  . It took me almost two days to wait for her in order to return her  _  to her. I didn't get as much as \"thank you.\"  _  , I felt good because I had done what was right. I think I felt better than she  _  . I was born and raised in Ireland until I was nineteen years old. I came to this country in 1913 where I  _  several jobs to earn a few dollars before joining the army in World War I. After being discharged , I bought my own car and have owned one ever since. It hasn't been too easy  at times  , but my wife takes care of our money and we have a good bit  put away  for a rainy day . In all my years of driving a taxi, I have never had  _  with the public, not even with drunks. Even if they get a little headstrong once in a while, I just agree with them and then they behave themselves. People ask me about tips. As far as I know,  _  everyone will give you something, because most Americans are  _  generous. I always try to be nice to everyone, whether they  _  or not. I believe in God and try to be a good member of my parish . I try to act toward others like I think God wants me to act. I have been trying this for a long time, and the  _  I try, the easier it gets.", 
    "options": [
        [
            "dishonor", 
            "dishonesty", 
            "upright", 
            "faithful"
        ], 
        [
            "takes", 
            "becomes", 
            "makes", 
            "has"
        ], 
        [
            "know", 
            "known", 
            "knew", 
            "knowing"
        ], 
        [
            "generous", 
            "tough", 
            "mild", 
            "warm-hearted"
        ], 
        [
            "right", 
            "proper", 
            "bad", 
            "wrong"
        ], 
        [
            "rude", 
            "honest", 
            "good", 
            "tough"
        ], 
        [
            "when", 
            "what", 
            "which", 
            "where"
        ], 
        [
            "houses", 
            "cars", 
            "pockets", 
            "rooms"
        ], 
        [
            "ring", 
            "suitcase", 
            "car", 
            "emerald"
        ], 
        [
            "So", 
            "Still", 
            "But", 
            "Though"
        ], 
        [
            "was", 
            "did", 
            "has", 
            "is"
        ], 
        [
            "made", 
            "put", 
            "held", 
            "took"
        ], 
        [
            "trouble", 
            "difficult", 
            "word", 
            "anything"
        ], 
        [
            "especially", 
            "specially", 
            "particularly", 
            "practically"
        ], 
        [
            "never", 
            "seldom", 
            "rather", 
            "fairly"
        ], 
        [
            "tip", 
            "advised", 
            "suggested", 
            "ask"
        ], 
        [
            "longer", 
            "harder", 
            "better", 
            "shorter"
        ]
    ], 
    "answers": [
        "C", 
        "C", 
        "D", 
        "B", 
        "D", 
        "B", 
        "D", 
        "B", 
        "A", 
        "B", 
        "B", 
        "C", 
        "A", 
        "D", 
        "D", 
        "A", 
        "A"
    ], 
    "source": "high2490"
}