{
    "article": "Joy to the World\nLights, decorations and Christmas trees filled the stores. Many people were there because Christmas was only two days away.\nThirteen-year-old Joy had just  _  her Christmas shopping. She knew her parents, grandparents so well that finding them  _  was a piece of cake.\nJoy went out of the store and came across her classmate, Nick, the least  _  student in school because he wore strange clothing and he had a face only a mother could love.\n\"What are you doing for Christmas?\" said Nick with a smile that showed all his yellow teeth.\n\"I'm opening presents and having dinner with my  _  ,\" said Joy, trying to be polite. \"What about you?\"\n\"My parents are away,\" he said. \"I live with my uncle, who doesn't like me very much.\"\nJoy wasn't sure how to  _  , so she said goodbye with an awkward smile. She felt sorry for Nick since he must feel  _  . But that wasn't really her problem.\nOn Christmas Eve, Joy's family were busy around  _  for the holiday. Joy's parents were cooking in the kitchen. Joy was a child for holiday cheer, dancing  _  the house.\nAfter dinner, the family  _  into their car and headed to church for the Christmas Eve service. When they walked into the old building, they were  _  by the flow of beautiful songs. A man stood up with Bible and  _  the story Joy had learned on her mother's knee. It was about a baby named Jesus who came to live on Earth to help people who  _  him.\nJoy's thoughts kept turning back to Nick. It must be  _  to be lonely on Christmas, a day that celebrated God's Son coming to Earth. Tears started to run down her  _  , but she brushed them away.\nJoy lay awake that night  _  everyone else was sleeping like a baby. She was thinking ways to help Nick. As soon as she heard parents get up, she  _  out of bed. She found them in the kitchen and told them about Nick. Then she asked, \"Can we  _  him over today?\" \"Sure,\" said her mother, who was always happy when  _  came. Her father smiled.\nWhen Joy called Nick later that day, he was excited. After getting his uncle's  _  , he joined them for dinner. To her surprise, Joy enjoyed spending time with him.\nJoy came to understand  _  Christmas cheer is a joy to Nick, even to the whole world.", 
    "options": [
        [
            "mentioned", 
            "finished", 
            "prepared", 
            "remembered"
        ], 
        [
            "presents", 
            "trees", 
            "lights", 
            "toys"
        ], 
        [
            "smart", 
            "brilliant", 
            "popular", 
            "interesting"
        ], 
        [
            "friends", 
            "classmates", 
            "colleagues", 
            "family"
        ], 
        [
            "remind", 
            "respond", 
            "command", 
            "correct"
        ], 
        [
            "surprised", 
            "happy", 
            "lonely", 
            "guilty"
        ], 
        [
            "applying", 
            "preparing", 
            "calling", 
            "paying"
        ], 
        [
            "beyond", 
            "for", 
            "on", 
            "around"
        ], 
        [
            "piled", 
            "looked", 
            "ran", 
            "flew"
        ], 
        [
            "surrounded", 
            "heard", 
            "frightened", 
            "introduced"
        ], 
        [
            "repeated", 
            "made", 
            "recorded", 
            "read"
        ], 
        [
            "attended", 
            "taught", 
            "helped", 
            "needed"
        ], 
        [
            "unexpected", 
            "joyful", 
            "terrible", 
            "delighted"
        ], 
        [
            "head", 
            "cheeks", 
            "eyes", 
            "mouth"
        ], 
        [
            "if", 
            "since", 
            "while", 
            "because"
        ], 
        [
            "jumped", 
            "ran", 
            "kept", 
            "took"
        ], 
        [
            "invite", 
            "request", 
            "please", 
            "let"
        ], 
        [
            "classmates", 
            "guests", 
            "teachers", 
            "leaders"
        ], 
        [
            "appreciation", 
            "consideration", 
            "punishment", 
            "permission"
        ], 
        [
            "enjoying", 
            "getting", 
            "sharing", 
            "creating"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "D", 
        "B", 
        "C", 
        "B", 
        "D", 
        "A", 
        "A", 
        "D", 
        "D", 
        "C", 
        "B", 
        "C", 
        "A", 
        "A", 
        "B", 
        "D", 
        "C"
    ], 
    "source": "high2943"
}