{
    "article": "What I noticed first about my new parrot, Chico, was that he couldn't fly. His wings had been cut short and he was stuck on the  _  just like us humans. When the weather turned nice, I took Chico outside. I sat him on a branch of a tree, hoping to make him  _  . At first he seemed  _  . He walked back and forth on the branch looking anxious or nervous. He didn't even flap his wings in an attempt to fly. Somehow he knew he was  _  . One day Chico got especially excited . He paced back and forth and made an incredible amount of  _  . Then all of a sudden he stopped and let out an even louder scream. He started  _  flapping his wings for the first time ever - then he lifted off the  _  like a space shuttle! I was amazed and  _  . Little did I know his feathers had been growing back, and Chico had been  _  until the moment was ripe for escape! Two days later Chico  _  . First I tried to trick him back with food, but he would not come near me. Then I took his  _  and put it away--still he would not come. Finally, I made him a firm promise that I would let him  _  every day the weather was nice if he did come back.  At that moment  , he flew onto my shoulder. From that day on, whenever the weather was good I would let him out early and he would fly around and be back before dark. The  _  lasted for two months before suddenly Chico became  _  . The vet said that he had been infected with a disease from the pigeons in the neighborhood. Within a few days he died. I was very sad. The  _  crossed my mind that if I had not set him free to fly, he would be still alive. But what  _  is there in being a bird if you can't fly? Chico made his first break for  _  on a late Monday afternoon in April. When will you make yours? You too can take a  _  when the conditions are right, knowing you too, in your own way, were built to fly. If you don't  set yourself free  , what will be the purpose of your life?", 
    "options": [
        [
            "floor", 
            "earth", 
            "scene", 
            "road"
        ], 
        [
            "smarter", 
            "healthier", 
            "happier", 
            "stronger"
        ], 
        [
            "disappointed", 
            "determined", 
            "frightened", 
            "confused"
        ], 
        [
            "incapable", 
            "disabled", 
            "wrong", 
            "stupid"
        ], 
        [
            "noise", 
            "progress", 
            "energy", 
            "consideration"
        ], 
        [
            "slowly", 
            "gently", 
            "madly", 
            "gracefully"
        ], 
        [
            "ground", 
            "tree", 
            "cage", 
            "branch"
        ], 
        [
            "moved", 
            "shocked", 
            "delighted", 
            "excited"
        ], 
        [
            "struggling", 
            "pacing", 
            "flying", 
            "waiting"
        ], 
        [
            "left", 
            "returned", 
            "survived", 
            "recovered"
        ], 
        [
            "cage", 
            "feather", 
            "chain", 
            "food"
        ], 
        [
            "in", 
            "out", 
            "off", 
            "alone"
        ], 
        [
            "action", 
            "attempt", 
            "routine", 
            "effort"
        ], 
        [
            "active", 
            "injured", 
            "sad", 
            "ill"
        ], 
        [
            "fact", 
            "concern", 
            "thought", 
            "detail"
        ], 
        [
            "sense", 
            "mistake", 
            "interest", 
            "problem"
        ], 
        [
            "life", 
            "freedom", 
            "fun", 
            "food"
        ], 
        [
            "break", 
            "holiday", 
            "chance", 
            "look"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "D", 
        "A", 
        "A", 
        "C", 
        "D", 
        "B", 
        "D", 
        "B", 
        "A", 
        "B", 
        "C", 
        "D", 
        "C", 
        "A", 
        "B", 
        "C"
    ], 
    "source": "high2214"
}