{
    "article": "What would life be like without television? Would you spend more time   playing outside  , reading, or studying? Well,\nnow it's your chance to turn off your TV and  find out  ! TV-Turnoff Week is here.\nThe goal of TV-Turnoff Week is to let people leave their TV sets  _  and participate in activities  from  drawing to biking.\nThe event was founded by TV-Turnoff Network, a non-profit organization which\nstarted the event in 1995. In the  _  , only a few thousand people took\npart. Last year more than 7.6 million people participated,  including  people in\nevery state in America and in more than 12 other countries! This is the 11th\nyear in which  _  are asking people to \"turn off the TV and turn on  life  .\"\n     According to the TV-Turnoff Network, the average  _  in the US spend  _  time in front of the\nTV (about 1,023 hours per year) than they do in school (about 900 hours per\nyear). Too much TV  _  has made many kids grow fat.  In fact  , in 2001's\nTV-Turnoff Week, US Surgeon General David Satcher said, \"We are raising the\nmost  _  generation of youngsters in American history. This week is about\nsaving lives.\"\nOver the years, studies have shown that watching a lot of TV  leads to  poor eating habits, too little exercise, and violence. Frank Vespe\nof the TV-Turnoff Network said that turning off the TV \"is or  should be  , part\nof a healthy lifestyle\".\n     \"One of the great lessons of  taking part in  TV-Turnoff Week is the realization that  every time  I turn on the TV, I'm\ndeciding not to do something else,\" Vespe said.\nTV-Turnoff Week seems to be making a   _  . Recent US\nCensus data  _  that\nabout 72 percent of kids under 12 have a limit on their TV time. That's  up from  about\n63 percent ten years ago.", 
    "options": [
        [
            "away", 
            "off", 
            "on", 
            "beside"
        ], 
        [
            "end", 
            "event", 
            "beginning", 
            "total"
        ], 
        [
            "governments", 
            "parents", 
            "organizers", 
            "businessmen"
        ], 
        [
            "grown-ups", 
            "kids", 
            "clerks", 
            "parents"
        ], 
        [
            "less", 
            "enough", 
            "little", 
            "more"
        ], 
        [
            "programmes", 
            "screen", 
            "hours", 
            "watching"
        ], 
        [
            "overweight", 
            "overeaten", 
            "overgrown", 
            "overseeing"
        ], 
        [
            "living", 
            "choice", 
            "difference", 
            "sense"
        ], 
        [
            "shows", 
            "says", 
            "reads", 
            "writes"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "C", 
        "B", 
        "D", 
        "D", 
        "A", 
        "C", 
        "A"
    ], 
    "source": "high1684"
}