{
    "article": "In Twain, many people know what a \"motorpool\" means. It is  _  known as a place for the maintenance of official business and government cars.  In general  it is a place for vehicle maintenance. More than ten years ago I came to America on business and I took advantage of the  _  to visit my friend. My friend drove a car to  _  me at the airport, and took me to his home. Out of the  _  , my friend drove his car into the innermost  _  , which had a sign \"carpool only\". I  _  what \"carpool\" meant. I felt doubted whether he was going to a motorpool.  _  I thought myself clever in asking: \"Is there anything wrong with the car?\" \"Nothing.  _  ?\" said he. \"Well then, why are you going to carpool?\" I  _  . My friend couldn't help  _  and told me that\"carpool\"refers to the lane that only the cars with two or more  _  can drive in. I felt rather embarrassed on  _  that. After dinner, my friend's neighbor came over to ask whether he  _  \"carpool\" the next day. \"  _  ,\" my friend said, \"I will accompany my friend to go shopping tomorrow.\" I was  _  again, wondering why he could not \"carpool\" with him since we had \"carpooled\"  _  . My friend explained to me again that the \"carpool\" that his neighbor  _  meant they in turn drove the car to work so as to save energy. The first \"carpool\" is a noun,  _  the second \"carpool\" is a verb. It is really  _  for newcomers in America to understand it in a short time.", 
    "options": [
        [
            "commonly", 
            "probably", 
            "partly", 
            "simply"
        ], 
        [
            "break", 
            "time", 
            "chance", 
            "place"
        ], 
        [
            "watch", 
            "help", 
            "meet", 
            "catch"
        ], 
        [
            "house", 
            "airport", 
            "station", 
            "waiting-room"
        ], 
        [
            "road", 
            "lane", 
            "street", 
            "route"
        ], 
        [
            "wondered", 
            "knew", 
            "understood", 
            "learned"
        ], 
        [
            "For", 
            "Thus", 
            "Then", 
            "Though"
        ], 
        [
            "How", 
            "What", 
            "Why", 
            "Where"
        ], 
        [
            "replied", 
            "asked", 
            "explained", 
            "answered"
        ], 
        [
            "saying", 
            "talking", 
            "laughing", 
            "speaking"
        ], 
        [
            "passengers", 
            "drivers", 
            "gentlemen", 
            "ladies"
        ], 
        [
            "noticing", 
            "seeing", 
            "informing", 
            "hearing"
        ], 
        [
            "needed", 
            "could", 
            "should", 
            "would"
        ], 
        [
            "Sure", 
            "Sorry", 
            "Pardon", 
            "Good"
        ], 
        [
            "believed", 
            "doubted", 
            "confused", 
            "worried"
        ], 
        [
            "today", 
            "tomorrow", 
            "yesterday", 
            "tonight"
        ], 
        [
            "used", 
            "insisted", 
            "learned", 
            "provided"
        ], 
        [
            "as", 
            "so", 
            "while", 
            "for"
        ], 
        [
            "interesting", 
            "difficult", 
            "important", 
            "necessary"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "C", 
        "B", 
        "B", 
        "A", 
        "B", 
        "C", 
        "B", 
        "C", 
        "A", 
        "D", 
        "B", 
        "B", 
        "C", 
        "A", 
        "A", 
        "C", 
        "B"
    ], 
    "source": "high2977"
}