{
    "article": "Every fast-food employee knows that the drive-through window is the worst position. The window sticks with constant ice; the roar of engines hurts your  _  ; your words are lost in the howling wind. On a  _  afternoon, everything changed. Every once in a while, the sub-zero temperatures seal a  _  windows shut. Drivers don't exactly enjoy having to stand outside in the cold,  _  their orders into a speaker box, when they expect to drive through on their heated leather seats. In such cases, most customers tend to show their annoyance to the employees. This woman was  _  . \"I'll get the next car's  _  as well,\" she said as she came up to the window to pay. She stood outside,  _  much snow on her hair. Though she was obviously freezing, her bright  _  lit up her face like a fire. \"You can't  _  their drinks,\" I said, confused and tired. \"No, but I'll buy them,\" she said. \"Pay it forward and all that.\" Completely puzzled, I charged her as  _  , and when the next customer arrived at the window I explained what had just happened. I watched as his  _  changed -- first angry to be out in the cold, then  _  at the random act of kindness, and finally, delighted by his  _  . \"I suppose I'll pay for the next order then,\" he replied, nodding and waving at the impatient driver  _  him. He  _  over the cash and received his pre-paid hot drink. The trend continued. Customers arrived annoyed, only to leave  _  and pleased. Some were shocked to spend much more than they had expected,  _  others ended up receiving their order for less than half the price. Five vehicles passed, then ten, then twenty. No one refused to pay. Customers stood at my window  _  a fist-full of change to buy drinks for a complete stranger. Cars drove off, honking and  _  their thanks. It only takes one customer, one person, to change the entire  _  of traffic. It only takes one moment, one smile, to warm up even the coldest of days.", 
    "options": [
        [
            "ears", 
            "hands", 
            "feet", 
            "back"
        ], 
        [
            "freezing", 
            "sunny", 
            "warm", 
            "usual"
        ], 
        [
            "truck's", 
            "vehicle's", 
            "car's", 
            "lorry's"
        ], 
        [
            "offering", 
            "throwing", 
            "screaming", 
            "cancelling"
        ], 
        [
            "polite", 
            "angry", 
            "popular", 
            "different"
        ], 
        [
            "number", 
            "coffee", 
            "fee", 
            "order"
        ], 
        [
            "covering", 
            "increasing", 
            "gathering", 
            "falling"
        ], 
        [
            "eyes", 
            "smile", 
            "hair", 
            "annoyance"
        ], 
        [
            "pay", 
            "take", 
            "buy", 
            "bring"
        ], 
        [
            "instructed", 
            "requested", 
            "directed", 
            "suggested"
        ], 
        [
            "gesture", 
            "expression", 
            "figure", 
            "feeling"
        ], 
        [
            "inspired", 
            "upset", 
            "surprised", 
            "disappointed"
        ], 
        [
            "turn", 
            "sense", 
            "deed", 
            "luck"
        ], 
        [
            "beyond", 
            "before", 
            "beside", 
            "behind"
        ], 
        [
            "took", 
            "looked", 
            "handed", 
            "thought"
        ], 
        [
            "shy", 
            "calm", 
            "anxious", 
            "regretful"
        ], 
        [
            "while", 
            "since", 
            "as", 
            "unless"
        ], 
        [
            "making", 
            "emptying", 
            "lying", 
            "holding"
        ], 
        [
            "explaining", 
            "sending", 
            "introducing", 
            "casting"
        ], 
        [
            "jam", 
            "row", 
            "flow", 
            "line"
        ]
    ], 
    "answers": [
        "A", 
        "A", 
        "B", 
        "C", 
        "D", 
        "D", 
        "C", 
        "B", 
        "B", 
        "B", 
        "B", 
        "C", 
        "D", 
        "D", 
        "C", 
        "B", 
        "A", 
        "B", 
        "B", 
        "C"
    ], 
    "source": "high1651"
}