{
    "article": "I live in Albuquerque, New Mexico. I used to give a lot of money to the homeless, feeling  _  for them. But as time passed, I became a mom with no home, a huge  _  , and hardly any income. As a result, I  _  giving money to the people on the side of the road and became very  _  . Things started to change for me  _  . I had a home, a backyard for my daughter, and plenty of food, and I started to  _  myself out of debt. One day we saw a homeless person with the  _  , \"Will work for food.\" I  passed by  . My daughter commented. \"Mommy, you used to always give money to those people in  _  .\" I replied, \"Honey, they just use that money for  _  , or other bad things.\" She didn't respond.  _  when I said that, I didn't feel right. Three days later, I was driving to  pick up  my daughter from school. A man was standing on the corner, and something deep  _  me said, \"Just help the guy.\" So I  _  down my window, and he ran over excitedly. He said, \"God bless you, I only need 77 cents.\" I  _  into my ashtray and strangely enough, there  _  three quarters and two pennies. I picked them up and gave them to him. He  burst out  with joy and tears in his eyes. \"Wow, you just made it  _  for me to see my mom for Christmas! Thank you so much; the  _  that had this great sale is leaving in 20 minutes!\" It was a moment I'll  _  forever. I think that man won't forget it either, but I was the one who got the best gift in life--GIVING.", 
    "options": [
        [
            "angry", 
            "grateful", 
            "sorry", 
            "strange"
        ], 
        [
            "problem", 
            "burden", 
            "disease", 
            "debt"
        ], 
        [
            "continued", 
            "stopped", 
            "hated", 
            "appreciated"
        ], 
        [
            "rich", 
            "bitter", 
            "relaxed", 
            "pleased"
        ], 
        [
            "slowly", 
            "immediately", 
            "quickly", 
            "greatly"
        ], 
        [
            "save", 
            "pull", 
            "run", 
            "feed"
        ], 
        [
            "determination", 
            "sign", 
            "child", 
            "advertisement"
        ], 
        [
            "danger", 
            "love", 
            "need", 
            "sadness"
        ], 
        [
            "life", 
            "book", 
            "food", 
            "smoking"
        ], 
        [
            "And", 
            "So", 
            "But", 
            "Even"
        ], 
        [
            "on", 
            "inside", 
            "behind", 
            "over"
        ], 
        [
            "rolled", 
            "pushed", 
            "blew", 
            "took"
        ], 
        [
            "reached", 
            "went", 
            "knocked", 
            "shouted"
        ], 
        [
            "hid", 
            "stood", 
            "sat", 
            "slept"
        ], 
        [
            "wonderful", 
            "meaningful", 
            "possible", 
            "interesting"
        ], 
        [
            "plane", 
            "man", 
            "woman", 
            "bus"
        ], 
        [
            "thank", 
            "remember", 
            "respect", 
            "hold"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "B", 
        "B", 
        "A", 
        "B", 
        "B", 
        "C", 
        "D", 
        "C", 
        "B", 
        "A", 
        "A", 
        "C", 
        "C", 
        "D", 
        "B"
    ], 
    "source": "high924"
}