{
    "article": "Soon it would be the holidays, but before that, there were year exams. All the  _  had been working hard for some time, reviewing their lessons for the exams. If they didn't  _  , they would have to retake them in September. There were usually a few who  _  , but Jane didn't want to be one of them. She had worked hard all year,  _  just before the exams she was working so hard that her sister Barbara was  _  about her. She went to bed too  _  . The night before the first exam, Barbara  _  that she have an early night and take a  _  pill. She promised to wake  _  up in the morning. As she was falling asleep, Jane was afraid that she might oversleep. Her  _  kept jumping from subject to subject. At last, with the help of  the medicine  , she went to sleep. In no time at all, she was sitting in the examination hall, looking at the examination  _  , but she couldn't answer any of the questions.  Everyone  around her was writing pages and gages.  _  she thought hard, she couldn't find anything to write  _  . She kept looking at her  _  . Time was running out. There was only an hour to go. She started one question, wrote two sentences,  gave up  and tried another one. With only half an hour left she wrote another two sentences. By this time she was so worried that she started  _  . Her whole body shook. It shook so much that she  _  up. She was still in bed and it had all been a  _  dream. A minute later, Barbara called her name.", 
    "options": [
        [
            "teachers", 
            "students", 
            "classmates", 
            "schools"
        ], 
        [
            "prepare", 
            "miss", 
            "join", 
            "pass"
        ], 
        [
            "succeeded", 
            "failed", 
            "ended", 
            "called"
        ], 
        [
            "but", 
            "so", 
            "and", 
            "because"
        ], 
        [
            "excited", 
            "frightened", 
            "worried", 
            "pleased"
        ], 
        [
            "early", 
            "late", 
            "heavily", 
            "eagerly"
        ], 
        [
            "insisted", 
            "hoped", 
            "ordered", 
            "wished"
        ], 
        [
            "sleeping", 
            "resting", 
            "exciting", 
            "breathing"
        ], 
        [
            "him", 
            "her", 
            "them", 
            "herself"
        ], 
        [
            "hand", 
            "eye", 
            "mind", 
            "body"
        ], 
        [
            "result", 
            "marks", 
            "desk", 
            "paper"
        ], 
        [
            "If", 
            "Though", 
            "So", 
            "How"
        ], 
        [
            "with", 
            "about", 
            "on", 
            "to"
        ], 
        [
            "watch", 
            "textbook", 
            "sister", 
            "subject"
        ], 
        [
            "examining", 
            "leaving", 
            "copying", 
            "crying"
        ], 
        [
            "raised", 
            "woke", 
            "stood", 
            "cheered"
        ], 
        [
            "nice", 
            "wonderful", 
            "terrible", 
            "special"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "B", 
        "A", 
        "C", 
        "B", 
        "A", 
        "A", 
        "B", 
        "C", 
        "D", 
        "B", 
        "B", 
        "A", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "high3076"
}