{
    "article": "I walked through the door of the office building I worked in. Then I realized that I needed some money so I went to the   _   at the corner of the street.\nAs I finished and turned to  _  , I saw a wallet on the counter . The wallet was brown and  _  three hundred dollars, a driver's license, and a   _  card. I didn't know the name on the license, but  _  he was, he was going to be in panic.\nI went home with the wallet. In my apartment, I  _   the online phone book and found no one to  _  the name on the card in the wallet. I really wanted to   _  the man. If it had been my wallet, I would have been sick to my stomach with   _  . I   picked up  the bank card and became  _  in thought.   _  , a fresh idea flashed through my mind. On the back was the number to his bank.\n\"Thank you for   _  Wachovia Bank. Can I help you?\" \"I found a wallet at one of your bank machines today and I am trying to find the  _  .\" \"That's very nice of you, sir. Can you  _  me the number on the card please?\" I did what I was told and  , \"Can you tell me his phone number? I want to contact him to   _  his wallet.\" \"I'm sorry, sir, but we cannot give out the  _  information of our customers.\" \"I understand. Can I give you my telephone number? You could call him and tell him who I am.\" \"I can  _  do that, sir.\"\nI gave her my contact information and hung up. Two days later, a gentleman found me. He   _  thought he would see his wallet again. He was so  _   that he kept saying \"thanks\" many times.\nI smiled all day long. Doing good for others does good for you.", 
    "options": [
        [
            "restaurant", 
            "bank", 
            "hotel", 
            "supermarket"
        ], 
        [
            "pass", 
            "inform", 
            "watch", 
            "leave"
        ], 
        [
            "existed", 
            "replaced", 
            "contained", 
            "gathered"
        ], 
        [
            "name", 
            "identity", 
            "record", 
            "bank"
        ], 
        [
            "whoever", 
            "whatever", 
            "however", 
            "whichever"
        ], 
        [
            "published", 
            "checked", 
            "compared", 
            "reviewed"
        ], 
        [
            "need", 
            "recognize", 
            "match", 
            "remember"
        ], 
        [
            "blame", 
            "help", 
            "follow", 
            "study"
        ], 
        [
            "worry", 
            "doubt", 
            "curiosity", 
            "sadness"
        ], 
        [
            "interested", 
            "confused", 
            "crazy", 
            "lost"
        ], 
        [
            "Immediately", 
            "Strangely", 
            "Generally", 
            "Recently"
        ], 
        [
            "visiting", 
            "choosing", 
            "calling", 
            "trusting"
        ], 
        [
            "seller", 
            "designer", 
            "winner", 
            "owner"
        ], 
        [
            "give", 
            "send", 
            "write", 
            "suggest"
        ], 
        [
            "return", 
            "gain", 
            "keep", 
            "confirm"
        ], 
        [
            "enough", 
            "personal", 
            "special", 
            "obvious"
        ], 
        [
            "certainly", 
            "usually", 
            "luckily", 
            "simply"
        ], 
        [
            "often", 
            "never", 
            "seldom", 
            "once"
        ], 
        [
            "nervous", 
            "curious", 
            "modest", 
            "grateful"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "C", 
        "D", 
        "A", 
        "B", 
        "C", 
        "B", 
        "A", 
        "D", 
        "A", 
        "C", 
        "D", 
        "A", 
        "A", 
        "B", 
        "A", 
        "B", 
        "D"
    ], 
    "source": "high275"
}