{
    "article": "About once a month I have to go to Bedford for my work. One day I went into a  _  there to have something to  _  . The waiter took my coat and put it in a small room. About an hour later I was  _  to go. The waiter  _  me my coat. Something fell out of the pocket onto the floor. It was a small white box. I took a  _  look at the  _  . \"Oh, you've brought  someone else's  coat,\" I said to the waiter. \"It looks very much like mine,  _  it is quite new, and this isn't my box, either.\" \"Oh, then I  _  someone has taken your coat and left his,\" said the waiter. \"This kind of thing  _  sometimes.\" I opened the box. There was a beautiful gold  _  in it. The waiter and I  _  to go to the police station. \"Has anyone lost a ring?\" I asked at the station. \"Yes,\" said a policeman. \"A young man who came in this morning lost a ring, he lost it in London.\" He  _  the young man. A few minutes later, the man arrived. \"Yes, this is my ring,\" he said. \"How can I  _  you, sir? You see, I paid a lot of money for this ring and  _  I lost it on the train!\" After I told him the  _  of the coat, he said, \"You haven't been on the train. I haven't been in the hotel, so how did my ring  _  in the coat?\" \"Did anyone sit or stand next to you on the train?\" asked the policeman. \"Yes,\" said the young man. \"But I don't remember his face.\" \"You may remember this  _  ,\" said the policeman. \"Was it like this one?\" \"Yes, it was,\" said the young man. \"But my friend here isn't the thief.\" The policeman laughed. \"No,\" he said. \"The thief on the train stole your ring, and  _  our friend here, he went into the hotel to get some food. Only he didn't take the  _  coat away with him.\"", 
    "options": [
        [
            "hotel", 
            "restaurant", 
            "company", 
            "shop"
        ], 
        [
            "do", 
            "buy", 
            "eat", 
            "make"
        ], 
        [
            "asked", 
            "glad", 
            "invited", 
            "ready"
        ], 
        [
            "showed", 
            "returned", 
            "brought", 
            "dressed"
        ], 
        [
            "special", 
            "close", 
            "usual", 
            "near"
        ], 
        [
            "waiter", 
            "box", 
            "coat", 
            "pocket"
        ], 
        [
            "but", 
            "and", 
            "instead", 
            "for"
        ], 
        [
            "know", 
            "wonder", 
            "suppose", 
            "find"
        ], 
        [
            "appears", 
            "happens", 
            "meets", 
            "changes"
        ], 
        [
            "ring", 
            "coin", 
            "pen", 
            "sign"
        ], 
        [
            "realized", 
            "thought", 
            "wanted", 
            "decided"
        ], 
        [
            "searched", 
            "remembered", 
            "telephoned", 
            "asked"
        ], 
        [
            "return", 
            "thank", 
            "pay", 
            "help"
        ], 
        [
            "then", 
            "so", 
            "yet", 
            "however"
        ], 
        [
            "thing", 
            "price", 
            "story", 
            "problem"
        ], 
        [
            "come", 
            "put", 
            "set", 
            "get"
        ], 
        [
            "person", 
            "ring", 
            "box", 
            "coat"
        ], 
        [
            "after", 
            "before", 
            "like", 
            "as"
        ], 
        [
            "right", 
            "good", 
            "same", 
            "other"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "D", 
        "C", 
        "B", 
        "C", 
        "A", 
        "C", 
        "B", 
        "A", 
        "D", 
        "C", 
        "B", 
        "A", 
        "C", 
        "D", 
        "D", 
        "C", 
        "A"
    ], 
    "source": "high941"
}