{
    "article": "My father was in the navy, which meant that my mother was married to both my father and the sea. As was often the  _  , we had to pack our belongings into boxes and  leave behind  those we had grown to love. We would arrive at our new home and find ourselves once again  _  at the pier waving good-bye to my father as his ship pulled him away from us. My mother would turn my brother and me around before the ship was out of  _  , wipe our tears, and take us back home to start the process of  _  in the new environment again. Throughout the years of changing  _  , schools and friends, there remained one constant in my childhood -- my mother. For both my  _  and me, she was the cook, maid and teacher. She played these roles while  _  some type of part-time job. Leaving a promising career is just one of the  _  which my mother made for my family as we moved around the world with our father every three years or so.  _  she had to deal with only a small budget, my mother  _  managed to make each house the very home that is safe and  _  . This probably sounds like a depressing way to live,  _  with two small children: \"single\" parenthood, short-term friendships, and the inability to  _  a career or establish a home. But it was not for my mother. She turned this  _  into adventure for us all! Each relocation was a chance to  _  another part of the world. My mother  _  each new culture, climate and neighborhood. Each new house was a  _  to rearrange furniture, make curtains and hang pictures. Every part-time job was an opportunity to learn something new and work with interesting people. No matter how difficult the life was, she was always having a  _  attitude. She always had strength in the face of struggle and change. My mother was so  _  all those years of my childhood -- she was my island in a sea of change. She is my hero.", 
    "options": [
        [
            "situation", 
            "case", 
            "matter", 
            "rule"
        ], 
        [
            "arriving", 
            "staring", 
            "standing", 
            "looking"
        ], 
        [
            "range", 
            "shape", 
            "sight", 
            "control"
        ], 
        [
            "adapting", 
            "suiting", 
            "matching", 
            "fitting"
        ], 
        [
            "names", 
            "jobs", 
            "addresses", 
            "directions"
        ], 
        [
            "father", 
            "classmates", 
            "brother", 
            "relatives"
        ], 
        [
            "performing", 
            "seeking", 
            "waiting", 
            "applying"
        ], 
        [
            "programs", 
            "sacrifices", 
            "contributions", 
            "cooperations"
        ], 
        [
            "Once", 
            "While", 
            "When", 
            "Unless"
        ], 
        [
            "somewhere", 
            "somewhat", 
            "sometime", 
            "somehow"
        ], 
        [
            "romantic", 
            "comfortable", 
            "mysterious", 
            "wealthy"
        ], 
        [
            "generally", 
            "actually", 
            "especially", 
            "unfairly"
        ], 
        [
            "desert", 
            "pursue", 
            "affect", 
            "limit"
        ], 
        [
            "lifestyle", 
            "value", 
            "journey", 
            "opportunity"
        ], 
        [
            "acquire", 
            "explore", 
            "occupy", 
            "realize"
        ], 
        [
            "met", 
            "greeted", 
            "agreed", 
            "suspected"
        ], 
        [
            "load", 
            "sadness", 
            "result", 
            "challenge"
        ], 
        [
            "changeable", 
            "cautious", 
            "positive", 
            "negative"
        ], 
        [
            "experienced", 
            "brave", 
            "ordinary", 
            "annoyed"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "C", 
        "D", 
        "C", 
        "C", 
        "A", 
        "B", 
        "B", 
        "D", 
        "B", 
        "C", 
        "B", 
        "A", 
        "B", 
        "B", 
        "D", 
        "C", 
        "B"
    ], 
    "source": "high604"
}