{
    "article": "As Christmas drew near, Ursula was faced with just that problem. She had come to live in an American home and learn English.  In return  , she would mind the children and do anything she was asked. One of her tasks was to keep track of arriving Christmas presents. Ursula did this faithfully, but she became increasingly worried. What could she buy for her  American family  with the little money she had that would compare with the gifts she was recording daily?  _  , even without any of the gifts , her employer seems to have everything. Ursula  _  long and hard. On Christmas Eve, she went to a store. She moved slowly through crowds of shoppers,  _  things in her mind. Finally she bought a baby dress. She immediately called a taxi. \"Excuse me, please, can you help me find a poor family with a baby?\" \"A poor family?\" said the  _  driver. \"Yes, a very poor family.\" Ursula told the man what she was trying to do. He listened in silence, and then said, \"I know a family who needs just about everything.\" When they reached a building, the driver said, \"They live on the third floor.\" Ursula shook her head, \"Would you take this dress to them and tell them it's from someone ...someone who has everything.\" Early the next day, Ursula  _  everyone for the presents she received. Then, she began to  _  why there seemed to be none from her. She told about what she did the night before. When she finished, there was a long  _  . \"You see,\" she added, \"I try to do a kindness in your  _  . And this is my Christmas present to you.\"", 
    "options": [
        [
            "Otherwise", 
            "Therefore", 
            "Besides", 
            "But"
        ], 
        [
            "talked", 
            "thought", 
            "waited", 
            "worked"
        ], 
        [
            "selecting", 
            "matching", 
            "remembering", 
            "organizing"
        ], 
        [
            "delighted", 
            "anxious", 
            "surprised", 
            "respectful"
        ], 
        [
            "thanked", 
            "encouraged", 
            "praised", 
            "admired"
        ], 
        [
            "settle", 
            "repeat", 
            "argue", 
            "explain"
        ], 
        [
            "delay", 
            "silence", 
            "time", 
            "break"
        ], 
        [
            "case", 
            "opinion", 
            "memory", 
            "name"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "A", 
        "C", 
        "A", 
        "D", 
        "B", 
        "D"
    ], 
    "source": "high2094"
}