{
    "article": "The sun was shining when I got on No. 151 bus. We passengers sat jammed in heavy clothes. No one spoke. That's one of the  _  rules. Although we see the same faces every day, we prefer to  _  behind our newspapers. People who sit so close together are using those thin sheets of newsprint to keep their  _  . As the bus came near the Mile, a  _  suddenly rang out, \"  _  ! This is your driver speaking.\" We  looked at  the back of the driver's head. \"Put your papers down. All of you.\" The  _  came down. \"Now, turn and face the person next to you. Go  _  .\" Surprisingly we all did it. Still no one smiled. I faced an older woman, her head wrapped in a red scarf. I saw her  _  every day. Our eyes met. We waited for the next  _  from the driver. \"Now repeat after me. Good morning, neighbor!\" Our voices were  _  . For many of us, these were the  _  words we had spoken that day. But we said them together, like  _  , to the strangers beside us. We couldn't help  _  . There was the feeling of relief that we were not being robbed. Moreover, there was the sense of ice being  _  . \"Good morning, neighbor.\" It was not so  _  after all. Some of us repeated it, others shook hands, and many laughed. The bus driver said nothing more. He didn't  _  to. Not a single newspaper went back up. I heard laughter, a warm sound I had  _  heard before in bus No. 151. When I  _  my stop, I said goodbye to my seatmate, and then jumped off the bus. That day I was  _  off happily.", 
    "options": [
        [
            "unwritten", 
            "strict", 
            "legal", 
            "important"
        ], 
        [
            "read", 
            "sit", 
            "talk", 
            "hide"
        ], 
        [
            "ways", 
            "methods", 
            "respect", 
            "distance"
        ], 
        [
            "message", 
            "warning", 
            "suggestion", 
            "voice"
        ], 
        [
            "Attention", 
            "Mind", 
            "Help", 
            "Listen"
        ], 
        [
            "papers", 
            "passengers", 
            "neighbors", 
            "tears"
        ], 
        [
            "on", 
            "round", 
            "ahead", 
            "down"
        ], 
        [
            "still", 
            "nearly", 
            "even", 
            "hardly"
        ], 
        [
            "turn", 
            "talk", 
            "order", 
            "remark"
        ], 
        [
            "high", 
            "fast", 
            "slow", 
            "weak"
        ], 
        [
            "first", 
            "last", 
            "best", 
            "only"
        ], 
        [
            "teachers", 
            "citizens", 
            "patients", 
            "schoolchildren"
        ], 
        [
            "shouting", 
            "crying", 
            "smiling", 
            "wondering"
        ], 
        [
            "formed", 
            "heated", 
            "broken", 
            "frozen"
        ], 
        [
            "sad", 
            "hard", 
            "ordinary", 
            "shy"
        ], 
        [
            "need", 
            "want", 
            "like", 
            "begin"
        ], 
        [
            "often", 
            "never", 
            "ever", 
            "always"
        ], 
        [
            "stopped", 
            "reached", 
            "came", 
            "found"
        ], 
        [
            "starting", 
            "seeing", 
            "taking", 
            "turning"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "D", 
        "D", 
        "A", 
        "A", 
        "C", 
        "B", 
        "C", 
        "D", 
        "A", 
        "D", 
        "C", 
        "C", 
        "B", 
        "A", 
        "B", 
        "B", 
        "A"
    ], 
    "source": "high458"
}