{
    "article": "Hope in my arms\nLast year, I was invited to participate in a carnival for Tuesday's Child, an organization that helps children with AIDS.\nAll the children that had gathered at one particular room could  _  a square on a piece of cloth. Later the squares would be sewn  together to  _  a quilt. The quilt would be    _  to a man who had devoted his life to the  _  and would soon be  _  .\nThe kids were given paints in bright colors and asked to paint something that would make the quilt  _  . As I looked around at all the squares, I saw pink hearts, blue clouds, orange sunrises and red flowers. The pictures were all bright and  _  . All  _  one.\nOne boy was painting a heart, but it was dark and lifeless. It  _  the bright colors that his fellow artists had used. I asked why. He told me that he was very  _  and so was his mom. He said that his sickness was not ever going to get better and neither was his mom's. He looked   _  into my eyes and said, \"There is no hope in my life.\"\nI told him I was sorry and I could understand why he had made his heart a dark color. I told him that  even though  we couldn't make him better, we can give  _  , which can really help when you are feeling sad. I told him that if he would like, I would be  _  to give him one so he could see  _  I meant. he instantly crawled into my lap. I thought my own heart would burst for this sweet little boy.\nHe sat there for a long time. Finally he  _  down to finish his coloring. As I was getting ready to  _  home, I felt a tug   on my jacket. Standing there was the little boy,   _  . He said, \"My heart is changing  _  . It is getting brighter. I think those hugs really do  _  .\"\nOn my way home I felt my own heart. It too had changed to a brighter color.", 
    "options": [
        [
            "convey", 
            "draw", 
            "adapt", 
            "paint"
        ], 
        [
            "fold", 
            "make", 
            "spread", 
            "annoy"
        ], 
        [
            "attempt", 
            "sold", 
            "presented", 
            "conduct"
        ], 
        [
            "organization", 
            "country", 
            "education", 
            "neighborhood"
        ], 
        [
            "retiring", 
            "abolish", 
            "predict", 
            "dying"
        ], 
        [
            "ambitious", 
            "suitable", 
            "beautiful", 
            "comfortable"
        ], 
        [
            "ridiculous", 
            "inspiring", 
            "confusing", 
            "puzzling"
        ], 
        [
            "without", 
            "besides", 
            "beside", 
            "except"
        ], 
        [
            "lacked", 
            "appeal", 
            "contained", 
            "favour"
        ], 
        [
            "curious", 
            "disappointed", 
            "sick", 
            "adequate"
        ], 
        [
            "straight", 
            "flexible", 
            "forward", 
            "even"
        ], 
        [
            "prizes", 
            "smiles", 
            "hugs", 
            "necklace"
        ], 
        [
            "grand", 
            "relaxed", 
            "eager", 
            "happy"
        ], 
        [
            "which", 
            "where", 
            "what", 
            "that"
        ], 
        [
            "witnessed", 
            "jumped", 
            "dragged", 
            "fell"
        ], 
        [
            "leave", 
            "stay", 
            "head", 
            "arrive"
        ], 
        [
            "smiling", 
            "crying", 
            "glaring", 
            "declaring"
        ], 
        [
            "shape", 
            "color", 
            "weight", 
            "form"
        ], 
        [
            "approve", 
            "desire", 
            "fail", 
            "work"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "C", 
        "A", 
        "A", 
        "C", 
        "B", 
        "D", 
        "A", 
        "C", 
        "A", 
        "C", 
        "D", 
        "C", 
        "B", 
        "C", 
        "A", 
        "B", 
        "D"
    ], 
    "source": "high1227"
}