{
    "article": "One of the most important lessons I learned from my father took place in our driveway when I was in elementary school. We used to play basketball every day, and he   _  that I needed to learn how to shoot and dribble with my left hand. Being naturally athletic, I quickly became frustrated with my lack of left-handed   _  . I became very angry,   _   down on the driveway, and began to cry, and my father stood there and looked at me as he waited   _   for me to get over my tears. When I realize that my behavior was not getting me   _  , I got back up. He passed me the   _   and I continued to practice. His lesson of   _   giving up and working harder to accomplish my goals was conveyed to me without a word. I   _   became skillful with my left hand, but what I really learned that day was a road map for overcoming my biggest   _   in life.\n  _   I was eighteen I was in a car accident, where I broke a vertebra in my spine. I was going to   _   to play soccer, and now I was told that I would never again be able to   _   athletically. For half a year I was not even able to   put on   my own clothes. I wanted to   _   school and give up. I wanted to lie down and cry that life was   _  , much as I had done in our driveway so long ago.   _  every time I felt that way, that earlier memory danced in my mind. I knew that   _   I was patient and continued to work hard, I could overcome this difficulty.\nFor three years I continued to go to school, doing three to four hours of   _  rehabilitation every day, with constant support from my parents. And I finally earned my   _   back on the playing field. That lesson in the driveway had   _   me to be on the field, and I owed it all to my dad. I succeeded because of who my father is, and who I am because of him.", 
    "options": [
        [
            "suggested", 
            "decided", 
            "recommended", 
            "predicted"
        ], 
        [
            "success", 
            "failure", 
            "glory", 
            "loss"
        ], 
        [
            "lied", 
            "laid", 
            "lain", 
            "lay"
        ], 
        [
            "briefly", 
            "patiently", 
            "steadily", 
            "faithfully"
        ], 
        [
            "anywhere", 
            "nowhere", 
            "everywhere", 
            "somewhere"
        ], 
        [
            "ticket", 
            "smile", 
            "ball", 
            "map"
        ], 
        [
            "never", 
            "always", 
            "nearly", 
            "seldom"
        ], 
        [
            "absolutely", 
            "abnormally", 
            "breathlessly", 
            "eventually"
        ], 
        [
            "challenge", 
            "weakness", 
            "shortcoming", 
            "disadvantage"
        ], 
        [
            "While", 
            "When", 
            "Because", 
            "Since"
        ], 
        [
            "college", 
            "hospital", 
            "kindergarten", 
            "gym"
        ], 
        [
            "work", 
            "perform", 
            "organize", 
            "manage"
        ], 
        [
            "drop", 
            "enter", 
            "change", 
            "quit"
        ], 
        [
            "unusual", 
            "unexpected", 
            "uncertain", 
            "unfair"
        ], 
        [
            "However", 
            "But", 
            "And", 
            "So"
        ], 
        [
            "because", 
            "although", 
            "if", 
            "as"
        ], 
        [
            "painful", 
            "impressive", 
            "harmful", 
            "pleasant"
        ], 
        [
            "money", 
            "respect", 
            "living", 
            "way"
        ], 
        [
            "asked", 
            "forced", 
            "allowed", 
            "persuaded"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "D", 
        "B", 
        "A", 
        "C", 
        "A", 
        "D", 
        "A", 
        "B", 
        "A", 
        "B", 
        "D", 
        "D", 
        "B", 
        "C", 
        "A", 
        "D", 
        "C"
    ], 
    "source": "high2233"
}