{
    "article": "Mark was seven when he joined his father and two other elder brothers at sunrise in the fields.  _  the time he was eight he was helping Dad fix up old furniture. He was given a cent for every nail he  _  out of old boards. He got his first  _  job at BT's Restaurant in town, when he reached twelve. His main tasks were  _  tables and washing dishes,  _  sometimes he helped cook. Every day after school he would  _  to BT's and work till ten. Even on Saturdays he  _  from two till eleven. At that age it was difficult going to work and  _  his friends run off to swim or play. He didn't necessarily like work, but he loved what working  _  him to have. Because of his  _  he was always the one buying when his friends and he went to the local shop. That made him  _  . Word that he was trustworthy and hard-working  _  around the town. A local clothing shop offered him credit  _  he was only in Grade 7. He immediately  _  a $ 68 sports coats and a $ 22 pair of shoes. He was  _  only 65 cents an hour, and he already owed the shopkeeper $ 90! So he learned  _  the danger of easy credit. He paid it  _  as soon as he could. The first job taught him self-control, responsibility and brought him a  _  of personal satisfaction few of his friends had experienced. As his father,  _  worked three jobs, once told him, \"If you  _  sacrifice and responsibility, there are not many things in life you cannot have.\" How right he was!", 
    "options": [
        [
            "Before", 
            "Within", 
            "From", 
            "By"
        ], 
        [
            "pulled", 
            "put", 
            "picked", 
            "pressed"
        ], 
        [
            "usual", 
            "real", 
            "main", 
            "participate"
        ], 
        [
            "sweeping", 
            "packing", 
            "clearing", 
            "empting"
        ], 
        [
            "or", 
            "so", 
            "but", 
            "even"
        ], 
        [
            "head", 
            "turn", 
            "change", 
            "move"
        ], 
        [
            "studied", 
            "worked", 
            "played", 
            "slept"
        ], 
        [
            "helping", 
            "having", 
            "watching", 
            "letting"
        ], 
        [
            "asked", 
            "told", 
            "promised", 
            "allowed"
        ], 
        [
            "study", 
            "power", 
            "age", 
            "job"
        ], 
        [
            "proud", 
            "friendly", 
            "lucky", 
            "hopeful"
        ], 
        [
            "ran", 
            "got", 
            "flew", 
            "carried"
        ], 
        [
            "although", 
            "while", 
            "if", 
            "since"
        ], 
        [
            "sold", 
            "borrowed", 
            "charged", 
            "wore"
        ], 
        [
            "keeping", 
            "making", 
            "paying", 
            "taking"
        ], 
        [
            "gradually", 
            "greatly", 
            "hardly", 
            "early"
        ], 
        [
            "out", 
            "over", 
            "away", 
            "off"
        ], 
        [
            "point", 
            "level", 
            "part", 
            "sign"
        ], 
        [
            "he", 
            "that", 
            "who", 
            "whoever"
        ], 
        [
            "understand", 
            "demand", 
            "offer", 
            "fear"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "B", 
        "C", 
        "C", 
        "A", 
        "B", 
        "C", 
        "D", 
        "D", 
        "A", 
        "B", 
        "A", 
        "C", 
        "B", 
        "D", 
        "D", 
        "B", 
        "C", 
        "A"
    ], 
    "source": "high1104"
}