{
    "article": "I lived in a big city in Australia and I used to give much money to the homeless around, feeling sorry for their misfortune. But later I became a single mom with no home, a huge  _  and hardly any income. As a result, I stopped giving and became very  _  . Things started to change. I became  _  enough to have a home, and even a backyard, and I started to pull myself out of debt. One day we saw a  _  person with the sign, \"Will work for food.\" I  passed by  . My daughter asked why I no longer helped the people in  _  . I replied, \"Honey, they just use that money for  _  or other bad things.\" She didn't respond. But when I said that, it didn't feel right. Three days later, I was  _  to pick up my daughter from school. A man was standing on the corner and something deep inside my heart drove me to help him. So I stopped my car, and he ran over with  _  . He said, \"God bless you, I only need 77 cents.\" I reached into my ashtray and  _  enough, there sat 3 quarter and 2 pennies. Greatly shocked by this  _  , I gave him all the money in the ashtray. He  burst into  tears with joy, \"You just made it  _  for me to see my mom for Christmas! The bus  _  this great sale is leaving right away!\" Undoubtedly, it was a moment I, together with the man will never forget, but I was the one who got the best gift in life--giving. It also  _  me that nothing is a coincidence, and everything has meaning.", 
    "options": [
        [
            "debt", 
            "responsibility", 
            "shadow", 
            "pressure"
        ], 
        [
            "awkward", 
            "hopeless", 
            "sensitive", 
            "bitter"
        ], 
        [
            "fortunate", 
            "wealthy", 
            "generous", 
            "successful"
        ], 
        [
            "hopeful", 
            "careless", 
            "homeless", 
            "aimless"
        ], 
        [
            "emergency", 
            "need", 
            "danger", 
            "panic"
        ], 
        [
            "alcohol", 
            "food", 
            "medicine", 
            "entertainment"
        ], 
        [
            "cycling", 
            "jogging", 
            "wandering", 
            "driving"
        ], 
        [
            "courage", 
            "care", 
            "enthusiasm", 
            "anxiety"
        ], 
        [
            "amusingly", 
            "strangely", 
            "gradually", 
            "naturally"
        ], 
        [
            "incident", 
            "condition", 
            "coincidence", 
            "circumstance"
        ], 
        [
            "necessary", 
            "difficult", 
            "possible", 
            "suitable"
        ], 
        [
            "offering", 
            "demanding", 
            "delivering", 
            "serving"
        ], 
        [
            "impresses", 
            "informs", 
            "persuades", 
            "reminds"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "B", 
        "C", 
        "B", 
        "A", 
        "D", 
        "C", 
        "B", 
        "C", 
        "C", 
        "A", 
        "D"
    ], 
    "source": "high2603"
}