{
    "article": "I will never forget that night, when I pulled into my drivewayafter a busy day of school and baby-sitting. I still  _  to write a physics paper, which must be handed in the next day. There were many things on my mind. At that time I was having many problems with my family and friends,  _  I was in a very bad mood . And I was unhappy with  myself  and the way that my life was going. A major  _  I was struggling with was drug use. For two years I had been smoking marijuana and got used to it,  _  could not stop. I did not let drugs affect my grades or personality, but it made a (n)  _  in how I thought about myself. I had always been a good kid and still tried to be, but drugs brought me  _  . I frequently thought about  _  drugs were not something I wanted as part of my life. I wanted to  _  but I was frightened to make it. I looked up at the sky as I got out of my  _  . The moon gave off tiny beams of light. The sky was a dark, ink-black colour  _  millions of stars. I stood outside in the cool fall air for what seemed a long time of heaven and  _  . The joy that I had not  _  for ages came upon me. I closed my eyes to decide if this dream could be  _  . I slowly opened my eyes and caught a shooting star flying over treetops. Tears fell from my eyes and streamed down my cheeks. I had  _  the true beauty of nature. Those few  _  helped me find the  _  to change. It is not easy to make the decision to stop using drugs. It is even harder to stop  _  . Giving it up has given me hope and a reason to be  proud of  myself. It has helped me grow  _  and more mature .", 
    "options": [
        [
            "promised", 
            "had", 
            "wished", 
            "stopped"
        ], 
        [
            "so", 
            "however", 
            "then", 
            "yet"
        ], 
        [
            "problem", 
            "situation", 
            "subject", 
            "condition"
        ], 
        [
            "while", 
            "or", 
            "but", 
            "rather"
        ], 
        [
            "difference", 
            "effort", 
            "plan", 
            "mistake"
        ], 
        [
            "down", 
            "out", 
            "up", 
            "back"
        ], 
        [
            "which", 
            "what", 
            "how", 
            "why"
        ], 
        [
            "escape", 
            "change", 
            "live", 
            "forget"
        ], 
        [
            "way", 
            "house", 
            "school", 
            "car"
        ], 
        [
            "in", 
            "with", 
            "for", 
            "beyond"
        ], 
        [
            "sadness", 
            "luck", 
            "happiness", 
            "regret"
        ], 
        [
            "received", 
            "learned", 
            "known", 
            "felt"
        ], 
        [
            "real", 
            "surprising", 
            "useless", 
            "helpful"
        ], 
        [
            "recognized", 
            "seen", 
            "guessed", 
            "imagined"
        ], 
        [
            "minutes", 
            "stars", 
            "thoughts", 
            "nights"
        ], 
        [
            "fact", 
            "courage", 
            "reason", 
            "chance"
        ], 
        [
            "actually", 
            "simply", 
            "gradually", 
            "quickly"
        ], 
        [
            "weaker", 
            "richer", 
            "poorer", 
            "stronger"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "A", 
        "C", 
        "A", 
        "A", 
        "C", 
        "B", 
        "D", 
        "B", 
        "C", 
        "D", 
        "A", 
        "B", 
        "A", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "high3127"
}