{
    "article": "In the doorway of my home, I looked closely at my 23yearold son, Daniel. In a few hours he would be flying to France to   _   a different life. It was a transitional   period in  Daniel's life. I wanted to   _   him some words of significance. But nothing came from my lips, and this was not the   _   time I had let such moments pass.\nWhen Daniel was five, I took him to the bus stop on his first day of kindergarten. He asked,\"What is it going to be like, Dad? Can I do it?\" Then he walked   What   the steps of the bus and disappeared inside. The bus drove away and I said nothing. A decade later, a similar   _   was played out. I drove him to college. As I started to leave, I tried to think of something to say to give him   _   and confidence as he started this new stage of life. Again, words   _   me.\nNow, as I stood before him, I thought of those   _   opportunities. How many times have I let such moments   _  ? I don't find a quiet moment to tell him what he has   _   to me or what he might   only too   to face in the years  that followed. Maybe I thought it was not necessary to say anything.\nWhat does it matter in the course of a lifetime if a father never tells a son what he really thinks of him?   _   as I stood before Daniel, I knew that it did matter. My father and I loved each other. Yet I always   _   never hearing him put his   _   into words. Now I could feel my palms sweat and my throat tighten. Why is it so   _   to tell a son something from the heart?\nMy mouth turned   _  , and I knew I would be able to get out only a few words clearly. \"Daniel,\" I said, \"if I could have picked one, I would have picked you.\"That's all I could say. He hugged me. For a moment, the world   _  , and there were just Daniel and me. He was saying something, but tears misted my eyes, and I couldn't understand what he was saying. All I was    _   of was the stubble   on his chin as his face pressed against mine. What I had said to Daniel was   _  . It was nothing. And yet, it was   _  .", 
    "options": [
        [
            "experience", 
            "undertake", 
            "enjoy", 
            "shape"
        ], 
        [
            "show", 
            "convey", 
            "leave", 
            "instruct"
        ], 
        [
            "last", 
            "first", 
            "very", 
            "next"
        ], 
        [
            "sign", 
            "scene", 
            "scenery", 
            "sight"
        ], 
        [
            "interest", 
            "hope", 
            "courage", 
            "wisdom"
        ], 
        [
            "failed", 
            "discouraged", 
            "struck", 
            "disappointed"
        ], 
        [
            "future", 
            "embarrassing", 
            "obvious", 
            "lost"
        ], 
        [
            "counted", 
            "meant", 
            "valued", 
            "cared"
        ], 
        [
            "think", 
            "want", 
            "expect", 
            "wish"
        ], 
        [
            "But", 
            "And", 
            "Instead", 
            "Then"
        ], 
        [
            "wondered", 
            "regretted", 
            "minded", 
            "tried"
        ], 
        [
            "views", 
            "actions", 
            "feelings", 
            "attitudes"
        ], 
        [
            "important", 
            "essential", 
            "hard", 
            "complex"
        ], 
        [
            "disappeared", 
            "changed", 
            "progressed", 
            "advanced"
        ], 
        [
            "sensitive", 
            "convinced", 
            "aware", 
            "tired"
        ], 
        [
            "into", 
            "against", 
            "on", 
            "with"
        ], 
        [
            "clumsy", 
            "gentle", 
            "absurd", 
            "moving"
        ], 
        [
            "none", 
            "all", 
            "anything", 
            "everything"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "B", 
        "B", 
        "C", 
        "A", 
        "D", 
        "B", 
        "B", 
        "A", 
        "B", 
        "C", 
        "C", 
        "B", 
        "A", 
        "C", 
        "A", 
        "D"
    ], 
    "source": "high474"
}