{
    "article": "Kevin is a boy who might be described as \"slow\". He didn't learn his ABCs as fast as other kids. But Kevin was  _  with people, for his bright smile and big heart won him plenty of friends.\nMy friend Randy decided they needed a  _  team for boys.Kevin  _  up and practiced hard. But he simply shot baskets. Or more correctly, he threw the ball at the basket. He had a   _  spot near the free throw line . He threw and threw, and it   _  went in.\nThe team did well but they never won a game that season except the night when it snowed and the opposing team never  showed up  . At the end of the  _  lot of playing against the best team.\nGame day arrived. The game went as  _  .Near the end of the last quarter, Kevin's team stood nearly 30 points behind. It was then that one of the boys called timeout. \"Coach Randy, \" he said, \"this is our  _  game and Kevin has never made a basket. I think we should let him make a basket.\" \nThe team agreed. Kevin wan   _  to stand at his special place near the free throw line and wait. When the ball was  _  to him, he shot and missed. A moment later, Kevin got the ball again, but shot and missed again.\nSlowly the other team seemed to  figure out  what was going on. Both teams circled the boy by their time and all the other players were shouting, \"Kevin! Kevin!\" Soon everyone in the   _   joined in.\nKevin attempted again and again, and one of his shots took a crazy bounce on the basket. Everyone held their  _  .The ball dropped in. Nobody remained   _  . Everyone stood and cheered as if one boy had won a world champion.\nThat day, an undefeated team kept their perfect record. But everybody won because everybody had participated in a crazy conspiracy   of kindness.", 
    "options": [
        [
            "patient", 
            "familiar", 
            "popular", 
            "careful"
        ], 
        [
            "basketball", 
            "football", 
            "swimming", 
            "climbing"
        ], 
        [
            "got", 
            "signed", 
            "went", 
            "set"
        ], 
        [
            "strange", 
            "special", 
            "wrong", 
            "safe"
        ], 
        [
            "randomly", 
            "automatically", 
            "possibly", 
            "occasionally"
        ], 
        [
            "favorite", 
            "difficult", 
            "unfortunate", 
            "important"
        ], 
        [
            "reported", 
            "designed", 
            "arranged", 
            "expected"
        ], 
        [
            "first", 
            "last", 
            "excellent", 
            "poor"
        ], 
        [
            "forbidden", 
            "wished", 
            "trained", 
            "instructed"
        ], 
        [
            "passed", 
            "kicked", 
            "carried", 
            "shot"
        ], 
        [
            "school", 
            "gym", 
            "town", 
            "team"
        ], 
        [
            "hands", 
            "breath", 
            "places", 
            "ground"
        ], 
        [
            "seated", 
            "excited", 
            "amazed", 
            "puzzled"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "B", 
        "B", 
        "D", 
        "C", 
        "D", 
        "B", 
        "D", 
        "A", 
        "B", 
        "B", 
        "A"
    ], 
    "source": "high3026"
}