{
    "article": "My husband and I sat outside. A small child about three came up the street, accompanied by her mother. As she saw another girl a few feet away, she gave her admiring comment, \"Mommy, I like her dress.\" Her mom  _  , \"Well, why don't you go and tell her?\" The little girl walked  _  toward the girl wearing the pretty dress. The other one,  _  the same age, was standing with her  _  turned, alongside her parents. They had not heard the compliment . Receiving no answer, this little one  _  . My husband said to the other girl, \"  Someone  wants to tell you something.\" As she turned around,  _  was made. Once again, the little one  _  \"I like your dress,\" and upon hearing those words, the other one gave her a big smile and excitedly  _  \"Look, it's a spinning dress!\", at which moment she began to spin. Both of them smiled widely. Now, the one stopped spinning and said, \"It's my favorite dress and I have (a)  _  that match!\" She  took off  running toward a stroller parked nearby. The mom and daughter started to  _  down the street,  _  the encounter had ended. Moments later, the \"spinning dress girl\" reappeared, shoes in hand,  looking for  her new friend who had seemingly disappeared. Now, an elderly couple, seated on a bench, had obviously been  _  of all this. The man  _  the child, saying, \"There's someone coming behind you.\" Then we saw one showed and the other  _  the beautiful shoes. If you can make a  _  better, do it. I have no idea how many others that evening might have  _  this act, hoping to help good things to happen. But such brief moments,  _  together, make up what might very well be the important times in our lives.", 
    "options": [
        [
            "replied", 
            "scolded", 
            "laughed", 
            "required"
        ], 
        [
            "secretly", 
            "shyly", 
            "heavily", 
            "suddenly"
        ], 
        [
            "usually", 
            "hopefully", 
            "likely", 
            "luckily"
        ], 
        [
            "back", 
            "head", 
            "nose", 
            "hand"
        ], 
        [
            "shouted", 
            "left", 
            "cried", 
            "hesitated"
        ], 
        [
            "difference", 
            "advance", 
            "connection", 
            "impression"
        ], 
        [
            "suggested", 
            "apologized", 
            "explained", 
            "announced"
        ], 
        [
            "turned", 
            "shared", 
            "jumped", 
            "agreed"
        ], 
        [
            "shoes", 
            "socks", 
            "shirt", 
            "hat"
        ], 
        [
            "lead", 
            "look", 
            "head", 
            "get"
        ], 
        [
            "remembering", 
            "hoping", 
            "saying", 
            "thinking"
        ], 
        [
            "watchful", 
            "careful", 
            "proud", 
            "fond"
        ], 
        [
            "calmed", 
            "comforted", 
            "stopped", 
            "seated"
        ], 
        [
            "wore", 
            "admired", 
            "compared", 
            "bought"
        ], 
        [
            "moment", 
            "life", 
            "girl", 
            "dress"
        ], 
        [
            "learned", 
            "performed", 
            "praised", 
            "observed"
        ], 
        [
            "seized", 
            "spent", 
            "threaded", 
            "lost"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "C", 
        "A", 
        "D", 
        "C", 
        "D", 
        "B", 
        "A", 
        "C", 
        "D", 
        "A", 
        "C", 
        "B", 
        "A", 
        "D", 
        "C"
    ], 
    "source": "high2023"
}