{
    "article": "My fiance   and I were excited about shopping for our first home. But our funds were   _  , and none of the houses in our price range seemed satisfactory.\nOne agent  _  a house in particular. Although her description sounded wonderful, the price was  _  our range, so we declined. But she kept urging us to have a look  at least  .\nWe finally did and it was  _  at first sight. It was Our Home, small and charming, overlooking a quiet lake. Walking through the rooms and talking with the owners, a nice elderly couple, we felt the warmth and  _  of the marriage within that home. As perfect as it was, the price remained too high for us. But every day, we would sit by the lake, looking at the house and dreaming of  _  it would be like to live there.\nDays later, we made a(n)   _  --far below the asking price. Surprisingly, they didn't  laugh at  us. They renewed their offer  _  . It was also much more than we could afford, but far  _  than the original asking price.\nThe next day, we got a  _  message that another buyer had offered a much higher price. Even so, we decided to talk with the  _  directly. We made our final offer, which  _  was thousands of dollars less than the other buyer's bid. We knew it,   _  we had to try.\n\"Sold!\" said the owner. Then he  _  : He'd seen us sitting by the lake all those times; he knew how much we loved the place and that we'd  _  the years of work they had put into their home; he realized he would take a  _  by selling it to us, but it was worthwhile; we were the people they wanted to live there. He told us to consider the  _  in the price \"an early wedding present.\"\nThat's how we found our home and how I learned that when people are  _  they are not strangers, only friends we haven't yet met.", 
    "options": [
        [
            "needed", 
            "enough", 
            "limited", 
            "large"
        ], 
        [
            "decorated", 
            "recommended", 
            "sold", 
            "rented"
        ], 
        [
            "beyond", 
            "below", 
            "within", 
            "between"
        ], 
        [
            "relief", 
            "love", 
            "concern", 
            "curiosity"
        ], 
        [
            "pride", 
            "challenge", 
            "happiness", 
            "desire"
        ], 
        [
            "which", 
            "why", 
            "what", 
            "that"
        ], 
        [
            "effort", 
            "promise", 
            "profit", 
            "offer"
        ], 
        [
            "aside", 
            "indeed", 
            "instead", 
            "apart"
        ], 
        [
            "worse", 
            "less", 
            "better", 
            "higher"
        ], 
        [
            "relaxing", 
            "pleasant", 
            "disappointing", 
            "regular"
        ], 
        [
            "owners", 
            "buyers", 
            "managers", 
            "agents"
        ], 
        [
            "still", 
            "already", 
            "generally", 
            "ever"
        ], 
        [
            "so", 
            "but", 
            "for", 
            "or"
        ], 
        [
            "apologized", 
            "complained", 
            "explained", 
            "criticized"
        ], 
        [
            "check", 
            "analyze", 
            "ignore", 
            "appreciate"
        ], 
        [
            "risk", 
            "loss", 
            "chance", 
            "lead"
        ], 
        [
            "increase", 
            "interest", 
            "difference", 
            "average"
        ], 
        [
            "energetic", 
            "polite", 
            "smart", 
            "kind"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "A", 
        "B", 
        "C", 
        "C", 
        "D", 
        "C", 
        "B", 
        "C", 
        "A", 
        "A", 
        "B", 
        "C", 
        "D", 
        "B", 
        "C", 
        "D"
    ], 
    "source": "high1298"
}