{
    "article": "Bowen was grown-up, and for his birthday that year his father gave him a  _  without any pictures in it! Bowen's father found he was not  _  about it, and told him, \"Son, this isn't just any  _  book; it's a magic book. But to discover its magic you'll have to  _  it.\" Well, that was better. Bowen liked  _  to do with magic. He started reading it,  _  he wasn't very willing to. The next morning, his  _  asked him, \"Have you found the magic  _  ?\" So... there was a key to find! Bowen flicked through the book, but there was no  _  of the key. And then his father  _  him, \"You won't find it like that. You have to read the book. \" Bowen didn't have much patience , thinking his father just told a  _  .A little later, his little sister, Rainer, asked him  _  the book. After several days, she  _  shouted, \"I've found the key! \" And she wouldn't stop  talking about  all the places she had visited using the magic key. This made Bowen read the book again. At first it was a  _  ; there wasn't even one single  _  in the book. But, gradually, Bowen became  interested in  the adventurous prince's life. Then, suddenly, he was there. The book  _  was the key! It was true that every time he  _  it, he felt going to its valleys and seas, and he lived the adventures of the prince. From then on, with every new book, Bowen never  _  being attracted by the letters and words inside.", 
    "options": [
        [
            "diary", 
            "book", 
            "box", 
            "bag"
        ], 
        [
            "sad", 
            "surprised", 
            "happy", 
            "angry"
        ], 
        [
            "ordinary", 
            "special", 
            "new", 
            "famous"
        ], 
        [
            "keep", 
            "take", 
            "read", 
            "value"
        ], 
        [
            "somebody", 
            "everything", 
            "nothing", 
            "anybody"
        ], 
        [
            "though", 
            "so", 
            "and", 
            "or"
        ], 
        [
            "uncle", 
            "father", 
            "mother", 
            "aunt"
        ], 
        [
            "key", 
            "page", 
            "word", 
            "stick"
        ], 
        [
            "mark", 
            "signal", 
            "sign", 
            "way"
        ], 
        [
            "asked", 
            "praised", 
            "told", 
            "followed"
        ], 
        [
            "will", 
            "story", 
            "joke", 
            "lie"
        ], 
        [
            "for", 
            "of", 
            "to", 
            "back"
        ], 
        [
            "badly", 
            "happily", 
            "slowly", 
            "quickly"
        ], 
        [
            "pity", 
            "pleasure", 
            "success", 
            "pain"
        ], 
        [
            "note", 
            "picture", 
            "text", 
            "title"
        ], 
        [
            "it", 
            "yourself", 
            "itself", 
            "himself"
        ], 
        [
            "put", 
            "opened", 
            "threw", 
            "covered"
        ], 
        [
            "stopped", 
            "tried", 
            "felt", 
            "began"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "C", 
        "B", 
        "A", 
        "B", 
        "A", 
        "C", 
        "C", 
        "D", 
        "A", 
        "B", 
        "D", 
        "B", 
        "C", 
        "B", 
        "A"
    ], 
    "source": "high846"
}