{
    "article": "One day a heavy storm hit a village. Nothing was  _  but a rock fell from the nearby mountain. The rock rolled down from the mountain and  _  in the middle of the main oad in the village. It was very big and shaped more or less  _  a ball. The villagers decided to move it away since it was blocking the street. Several of the  _  men came to try to lift it out of the road. No matter  how hard  they tried, they couldn't move it. All of this time a young boy was  _  the men trying to move the rock.. \"Excuse me,\" he said, \"but I think I could move it.\" \"You,\" they shouted, \"  _  are you talking about? All of us have just tried and can't  even  move it a little.\" They all  laughed at  the boy. The next  _  some villagers came to the street. To their great  _  , the rock was gone. More people ran out to see for themselves. It was true the rock was not in the road any more. The little boy stood in the street, smiling, \" I told you I could move it. I did it last night.\"  Then  he walked over to  where  the rock had been and  _  some dirt with a shovel( ) \"You see,\" he said, \" I dug a hole  next to  the rock and it rolled down into the hole by itself. Then I covered it with dirt.\"", 
    "options": [
        [
            "hurt", 
            "found", 
            "destroyed", 
            "broken"
        ], 
        [
            "lay", 
            "stopped", 
            "stood", 
            "placed"
        ], 
        [
            "as", 
            "for", 
            "alike", 
            "like"
        ], 
        [
            "happiest", 
            "biggest", 
            "weakest", 
            "strongest"
        ], 
        [
            "seeing", 
            "hearing", 
            "watching", 
            "staring"
        ], 
        [
            "whom", 
            "how", 
            "where", 
            "what"
        ], 
        [
            "night", 
            "evening", 
            "afternoon", 
            "morning"
        ], 
        [
            "joy", 
            "interest", 
            "satisfaction", 
            "surprise"
        ], 
        [
            "gave", 
            "covered", 
            "uncovered", 
            "put"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "D", 
        "C", 
        "D", 
        "D", 
        "D", 
        "C"
    ], 
    "source": "high1951"
}