{
    "article": "Living one's life is really like driving on a highway. First, to make a good driving, the driver must carefully examine the  _  of his car, just as he cares for his health for a good life. Once he enters into the highway, he must  follow  certain rules for his own safety. It also can be said that he must obey certain rules of  _  when living as a decent adult. For example, on the highway, he is  _  to keep a constant speed which can be compared with his  _  activities through his life. Neither driving nor living must be taken at too  _  a speed nor at too slow a speed. If he drives too  _  , the police will give him a ticket, just as he will be arrested when he breaks the law.  _  too conservatively , he will be called an out-of-date person  _  the others driving at the proper speed. When he wants to change his lanes, he must give careful  _  to every direction of his car. It is sometimes  _  to change the way of life  _  he can be sure of completion by doing so. He  _  not make any unnecessary changing of lanes which gives him only danger. Finally, he must  _  where he is now by recognizing some  _  appearing now and then. If he takes the wrong way, he must return to the right as  _  as he can. But he may thus lose  _  and energy both on the road and in life.  _  the whole, driving on a highway and living one's life are both hard work.  _  if he is careful and serious enough,  _  will provide him much pleasure.", 
    "options": [
        [
            "seat", 
            "condition", 
            "petrol", 
            "passenger"
        ], 
        [
            "society", 
            "school", 
            "group", 
            "highway"
        ], 
        [
            "glad", 
            "required", 
            "made", 
            "anxious"
        ], 
        [
            "broken", 
            "outdoor", 
            "good", 
            "continuous"
        ], 
        [
            "large", 
            "high", 
            "limited", 
            "expected"
        ], 
        [
            "speedily", 
            "slowly", 
            "orderly", 
            "willingly"
        ], 
        [
            "Doing", 
            "Acting", 
            "Going", 
            "Working"
        ], 
        [
            "persuading", 
            "getting", 
            "interrupting", 
            "refusing"
        ], 
        [
            "notice", 
            "attention", 
            "signs", 
            "regards"
        ], 
        [
            "dangerous", 
            "worthy", 
            "unfit", 
            "troublesome"
        ], 
        [
            "if", 
            "when", 
            "unless", 
            "because"
        ], 
        [
            "dare", 
            "need", 
            "may", 
            "should"
        ], 
        [
            "think", 
            "discover", 
            "prove", 
            "look"
        ], 
        [
            "signs", 
            "roads", 
            "posters", 
            "people"
        ], 
        [
            "possible", 
            "soon", 
            "much", 
            "hard"
        ], 
        [
            "money", 
            "luck", 
            "time", 
            "trust"
        ], 
        [
            "In", 
            "With", 
            "About", 
            "On"
        ], 
        [
            "Therefore", 
            "But", 
            "And", 
            "Then"
        ], 
        [
            "it", 
            "he", 
            "they", 
            "you"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "B", 
        "D", 
        "B", 
        "A", 
        "B", 
        "C", 
        "B", 
        "A", 
        "C", 
        "D", 
        "B", 
        "A", 
        "B", 
        "C", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "high1686"
}