{
    "article": "When I was thirteen, my family moved from Boston to Tucson, Arizona.  _  the move, my father  _  us in the living-room on a freezing January night. My sisters and I sat around the fire, not  _  that the universe would suddenly change its course. \"In May, we're  _  to Arizona.\" The words, so small, didn't seem  _  enough to hold my new life. But the world changed and I awoke on a tram moving across the country.1 watched the  _  change from green trees to flat dusty plains to high mountains as I saw strange new plants that  _  mysteries yet to come. Finally, we arrived and  _  into our new home.  _  my older sisters were sad at the loss of friends, I  _  explored our new surroundings. One afternoon, I was out exploring  as usual  and saw a new kind of cactus . I crouched down for a closer look. \"You'd better not  _  that\" I turned around to see an old woman. \"Are you new to this neighborhood?\" I explained that I was,  in fact  ,new to the entire state. \"My name is Ina Thorne.\" Have you got used to life in the  _  ? It must be quite a  _  after living in Boston.\" How could I explain how I  _  the desert? I couldn't seem to find the right words. \"It's vastness,\" she offered. \"That vastness  _  you stand on the mountains overlooking the desert--you can  _  how little you are in comparison with the world.  _  , you feel that the possibilities are limitless.\" That was it. That was the feeling I'd had ever since I'd first seen the mountains of my new home. Again, my  _  would change with just a few simple words. \"Would you like to come to my home tomorrow?\" Someone should teach you which plant you should and shouldn't touch.\"", 
    "options": [
        [
            "During", 
            "Until", 
            "Upon", 
            "Before"
        ], 
        [
            "gathered", 
            "warned", 
            "organized", 
            "comforted"
        ], 
        [
            "hoping", 
            "admitting", 
            "realizing", 
            "believing"
        ], 
        [
            "going", 
            "moving", 
            "driving", 
            "flying"
        ], 
        [
            "good", 
            "simple", 
            "big", 
            "proper"
        ], 
        [
            "picture", 
            "ground", 
            "scene", 
            "area"
        ], 
        [
            "suggested", 
            "solved", 
            "discovered", 
            "explained"
        ], 
        [
            "settled", 
            "walked", 
            "hurried", 
            "stepped"
        ], 
        [
            "If", 
            "After", 
            "Once", 
            "While"
        ], 
        [
            "bitterly", 
            "easily", 
            "proudly", 
            "eagerly"
        ], 
        [
            "move", 
            "dig", 
            "pull", 
            "touch"
        ], 
        [
            "desert", 
            "city", 
            "state", 
            "country"
        ], 
        [
            "luck", 
            "doubt", 
            "shock", 
            "danger"
        ], 
        [
            "found", 
            "examined", 
            "watched", 
            "reached"
        ], 
        [
            "why", 
            "when", 
            "how", 
            "where"
        ], 
        [
            "prove", 
            "guess", 
            "sense", 
            "expect"
        ], 
        [
            "However", 
            "Otherwise", 
            "Therefore", 
            "Meanwhile"
        ], 
        [
            "idea", 
            "life", 
            "home", 
            "family"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "C", 
        "B", 
        "C", 
        "C", 
        "A", 
        "A", 
        "D", 
        "D", 
        "D", 
        "A", 
        "C", 
        "A", 
        "B", 
        "C", 
        "D", 
        "B"
    ], 
    "source": "high2920"
}