{
    "article": "When I first entered university, my aunt, who is an English professor, gave me s new English dictionary. I was   _  to see that it was an English-English dictionary, also known as a monolingual dictionary.  _  it was a dictionary intended for non-native learners, none of my classmates had one   _  , to be honest, I found it extremely   _   to use at first. I would look up words in the dictionary and   _   not fully understand the meanings. I was used to the   _   bilingual dictionaries, in which the words are   _   both in English and Chinese. I really wondered why my aunt   _   to make things so difficult for me. Now, after studying English at university for three years, I   _   that monolingual dictionaries are   _   in learning a foreign language\nAs I found out, there is   in fact  , often no perfect equivalence  between two   _   in two language. My aunt even goes so far as to   _   that a Chinese \"equivalent\" can never give you the   _   meaning of a word in English!   _   , she insisted that I read the definition  of a world in a monolingual dictionary   _   I wanted to get a better understanding of its meaning.   _  , I have come to see what she meant.\nUsing a monolingual dictionary for learners has helped me in another important way. This dictionary uses a(n)   _   number of words, around 2, 000, in its definitions. When I read these definitions, I am   _   exposed to the basic words and learn how they are used to explain objects and ideas.   Because of   this, I can express myself more easily in English.", 
    "options": [
        [
            "sad", 
            "surprised", 
            "worried", 
            "nervous"
        ], 
        [
            "Because", 
            "If", 
            "Unless", 
            "Although"
        ], 
        [
            "and", 
            "so", 
            "or", 
            "but"
        ], 
        [
            "interesting", 
            "difficult", 
            "ambitious", 
            "practical"
        ], 
        [
            "thus", 
            "even", 
            "again", 
            "still"
        ], 
        [
            "new", 
            "familiar", 
            "earlier", 
            "ordinary"
        ], 
        [
            "described", 
            "expressed", 
            "explained", 
            "created"
        ], 
        [
            "decided", 
            "agreed", 
            "offered", 
            "happened"
        ], 
        [
            "imagine", 
            "recommend", 
            "predict", 
            "understand"
        ], 
        [
            "natural", 
            "easier", 
            "better", 
            "convenient"
        ], 
        [
            "ideas", 
            "names", 
            "words", 
            "characters"
        ], 
        [
            "declare", 
            "hope", 
            "doubt", 
            "tell"
        ], 
        [
            "basic", 
            "exact", 
            "translated", 
            "expected"
        ], 
        [
            "Rather", 
            "However", 
            "Therefore", 
            "Instead"
        ], 
        [
            "while", 
            "before", 
            "until", 
            "when"
        ], 
        [
            "Gradually", 
            "Generally", 
            "Largely", 
            "Probably"
        ], 
        [
            "extra", 
            "average", 
            "total", 
            "limited"
        ], 
        [
            "nearly", 
            "repeatedly", 
            "immediately", 
            "anxiously"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "A", 
        "B", 
        "D", 
        "B", 
        "C", 
        "A", 
        "D", 
        "C", 
        "C", 
        "A", 
        "B", 
        "C", 
        "D", 
        "A", 
        "D", 
        "B"
    ], 
    "source": "high1001"
}