{
    "article": "Karen, Judy and I were the last ones back in the school room after lunch and all of the other sixth graders were already playing outside. \"Wow! How  _  it would be to write on the blackboard while everyone is  _  . \" Judy said. \"But Mrs. Eiffler doesn't want us writing on the  _  ,\" I responded. \"Janet, everyone is outside. No one will ever know, \" said Karen, reaching into box and drawing out a piece of  _  . Judy also began drawing. I reluctantly joined my friends, but afraid of being  _  . Then Judy had all idea. \"We're all right-handed. Let's see who can write their  _  best using their left hand. \" Judy and Karen started  _  . I chose a piece of white chalk from the box and wrote my name. \"We'd better get this board cleaned off  _  Mrs. Eiffier comes back, \"said Judy, but I found it wasn't chalk at all, but a white crayon ! At last, Karen got a knife and scraped it. It  came off  finally, but we left an abrasion on the blackboard. Mrs. Eiffler never asked about the abrasion but I always remember the lesson. \"No one will ever know\" is never  _  . Even if no one else found out, I myself knew.", 
    "options": [
        [
            "useful", 
            "fun", 
            "stupid", 
            "necessary"
        ], 
        [
            "asleep", 
            "worried", 
            "outside", 
            "lucky"
        ], 
        [
            "blackboard", 
            "book", 
            "desk", 
            "floor"
        ], 
        [
            "bread", 
            "wood", 
            "paper", 
            "chalk"
        ], 
        [
            "followed", 
            "praised", 
            "caught", 
            "affected"
        ], 
        [
            "address", 
            "class", 
            "name", 
            "dream"
        ], 
        [
            "writing", 
            "singing", 
            "shouting", 
            "reading"
        ], 
        [
            "until", 
            "before", 
            "unless", 
            "since"
        ], 
        [
            "true", 
            "typical", 
            "important", 
            "different."
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "D", 
        "C", 
        "C", 
        "A", 
        "B", 
        "A"
    ], 
    "source": "high1537"
}