{
    "article": "There is an old proverb \"The writer creates half the text; the reader creates the other half\". The statement is quite apt and very clear to clarify the fact that  _  is very important aspect of education. Conversation, experience, reading and observation are the ways by which an individual  _  . And so it is clear that process of learning is  _  without reading.\nA very suitable example fitting in this context is from our evolution. We have  _  different ages, from Stone Age to Iron Age and from iron to space age, just by reading the hand  _  articles of our own ancestors and learning  _  their mistakes.\nWhen we  go through  the pages of dictionary or search for a literal definition of \"Reading\", we will find that it actually is a way of words attainment for active communication, and for  _  ideas and information. It is also a  _  of complicated interaction between the transcript and the  _  . The reading process obliges constant practices, progress, and improvement.\nReading and education is not just going through the text; it is actually a skill, talent or an expertise. It is measured by  _  parameters like phonics, vocabulary, fluency and comprehension. Although there are a number of  _  and techniques in reading, there are three tools by which one can improve reading and  _  skills. Let's find the three:\nSkimming: It is a skill by which readers gather the most prior information. In this process one has to only go through the text, grasping  _  information. Understanding does not actually  _  here. Reading morning newspaper is the  _  of this skill.\nScanning: It is used to locate or mind a particular piece of information. The reader in this process is more conscious.  _  here is also not so vital. One can go just reading and noting the important information which he/she are  Searching for  . Going through the travel ticket is the best example of this process.\nIntensive Reading: As the name suggest, this skill  _  thorough reading. Understanding is also one of its important aspects. It requires a concentration from the part of readers. Going through educational note or property papers are the example of\n  _  reading.", 
    "options": [
        [
            "listening", 
            "respecting", 
            "reading", 
            "speaking"
        ], 
        [
            "practices", 
            "remembers", 
            "grows", 
            "learns"
        ], 
        [
            "incomplete", 
            "useless", 
            "incorrect", 
            "inconvenient"
        ], 
        [
            "passed", 
            "repeated", 
            "moved", 
            "saw"
        ], 
        [
            "spoken", 
            "written", 
            "bought", 
            "shown"
        ], 
        [
            "in", 
            "from", 
            "at", 
            "on"
        ], 
        [
            "sharing", 
            "arguing", 
            "enjoying", 
            "collecting"
        ], 
        [
            "thought", 
            "relief", 
            "process", 
            "topic"
        ], 
        [
            "buyer", 
            "waiter", 
            "writer", 
            "reader"
        ], 
        [
            "different", 
            "difficult", 
            "reliable", 
            "classic"
        ], 
        [
            "ideas", 
            "marks", 
            "copies", 
            "tools"
        ], 
        [
            "occupation", 
            "measure", 
            "comprehension", 
            "education"
        ], 
        [
            "political", 
            "personal", 
            "important", 
            "interesting"
        ], 
        [
            "differ", 
            "matter", 
            "work", 
            "occur"
        ], 
        [
            "explanation", 
            "example", 
            "moment", 
            "idiom"
        ], 
        [
            "Research", 
            "Understanding", 
            "Information", 
            "Survey"
        ], 
        [
            "requires", 
            "meets", 
            "replaces", 
            "attracts"
        ], 
        [
            "creative", 
            "active", 
            "native", 
            "Intensive"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "A", 
        "A", 
        "B", 
        "B", 
        "A", 
        "C", 
        "D", 
        "A", 
        "D", 
        "D", 
        "C", 
        "B", 
        "B", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "high2243"
}