{
    "article": "Frank laughed as he tried to tear at the wrapping paper on his birthday present. He was so  _  ! Finally, he would have the coolest pair of name-brand basketball shoes. All the guys on his team were wearing the name-brand shoes of a popular basketball  _  , Chuck Hart. While Hart was  _  for his poor sportsmanship and infamous  _  , he was a great player. In fact, Frank wasn't thinking about Hart's behavior; he had only expected to see Hart's  _  on the side of the box. The first indication that something was  _  came as he tore away the last piece of paper. Not Hart's. The new shoes were the name-brand of another player, Robert Ryann, who was  _  for his amazing work in the community. Frank's hands  _  ; his heart stopped. It wasn't that the Ryann shoes weren't nice, but what would his friends think ? They were the wrong shoes and Frank would be  _  by the other players. When he looked up into his dad's eyes, however, Frank decided he  _  not tell him. \"Thanks, Dad. I was really hoping for shoes,\" Frank said as he pulled the shoes out of the box. The next morning his dad drove him to school. When they  pulled up  in front of his destination, Frank slowly opened the car door. Just then, his dad stopped him. \"Hey, Frank, wait a minute, look...\" his dad said  _  ,\"Frank, I know those aren't the shoes you had hoped for, but I saw the names of the two guys and made a(n)  _  . The guy whose name is on those shoes,\" he said, pointing down at Frank's feet, \"is someone I  _  . Do you know how often Ryann has found himself in  _  ?\" \"No,\" Frank said. \"Never. He's never talked back to his coach or started a fight, and he's a team player. You could have acted like a (n)  _  when you didn't get the shoes you wanted, Frank ,  _  you were polite and made the best of it. You have such a good  _  , like the guy whose name is on these shoes. I'm hoping that someday, your name will be on the coolest pair of shoes I'll ever see.\" When Frank looked down at his feet, he saw the shoes  _  . His dad had used his mind and heart to give the son a thoughtful  _  .", 
    "options": [
        [
            "amazed", 
            "excited", 
            "ashamed", 
            "worried"
        ], 
        [
            "team", 
            "player", 
            "coach", 
            "game"
        ], 
        [
            "criticised", 
            "praised", 
            "adored", 
            "accused"
        ], 
        [
            "skill", 
            "performance", 
            "behavior", 
            "action"
        ], 
        [
            "name", 
            "photo", 
            "sign", 
            "model"
        ], 
        [
            "strange", 
            "wrong", 
            "true", 
            "funny"
        ], 
        [
            "known", 
            "encouraged", 
            "adopted", 
            "influenced"
        ], 
        [
            "fell", 
            "froze", 
            "shook", 
            "folded"
        ], 
        [
            "questioned", 
            "noticed", 
            "teased", 
            "attacked"
        ], 
        [
            "can", 
            "need", 
            "would", 
            "may"
        ], 
        [
            "peacefully", 
            "hesitantly", 
            "delightedly", 
            "naturally"
        ], 
        [
            "choice", 
            "effort", 
            "comment", 
            "mistake"
        ], 
        [
            "believe", 
            "miss", 
            "admire", 
            "remember"
        ], 
        [
            "danger", 
            "surprise", 
            "sorrow", 
            "trouble"
        ], 
        [
            "teammate", 
            "adult", 
            "kid", 
            "student"
        ], 
        [
            "however", 
            "and", 
            "but", 
            "so"
        ], 
        [
            "quality", 
            "courage", 
            "dream", 
            "belief"
        ], 
        [
            "clearly", 
            "carefully", 
            "patiently", 
            "differently"
        ], 
        [
            "gift", 
            "look", 
            "hope", 
            "lesson"
        ]
    ], 
    "answers": [
        "B", 
        "B", 
        "A", 
        "C", 
        "A", 
        "B", 
        "A", 
        "B", 
        "C", 
        "C", 
        "B", 
        "A", 
        "C", 
        "D", 
        "C", 
        "C", 
        "A", 
        "D", 
        "A"
    ], 
    "source": "high1725"
}