{
    "article": "Several years ago, a well- known writer and editor Norman Cousins became very ill. His body ached and he felt constantly tired. It was difficult for him to even  _  around. His doctors told him that he would lose the ability to move and eventually  _  from the disease. He was told he had only a 1 in 60  _  of survival.\n  In spite of  the diagnosis( ) , Cousins was determined to overcome the disease and survive. He had always been interested in  _  and had read a book, which discussed the idea of how body chemistry and health can be damaged by emotional stress and negative( )  _  . The book made Cousins think about the possible  _   of positive attitudes and emotions. He thought, \"Is it possible that love, hope, faith, laughter, confidence, and the will to live have positive treatment value?\"\nHe decided to focused all his  _  on positive emotions as a way to treat some of the symptoms of his disease. In addition to his traditional medical treatment, he tried to put himself in situations that would bring about positive emotions. \"Laugh therapy\" became part of his treatment. He  _  time each day for watching comedy films, reading humorous books, and doing other activities that would draw out positive emotions. Within eight days of starting his \"Laugh therapy\" program his pain began to  _  and he was able to sleep more easily. He was able to return to work in a few months' time and actually achieved complete recovery after a few years.", 
    "options": [
        [
            "run", 
            "pass", 
            "move", 
            "travel"
        ], 
        [
            "suffer", 
            "die", 
            "separate", 
            "recover"
        ], 
        [
            "time", 
            "value", 
            "chance", 
            "opportunity"
        ], 
        [
            "medicine", 
            "sports", 
            "books", 
            "chemistry"
        ], 
        [
            "attitude", 
            "beliefs", 
            "goals", 
            "positions"
        ], 
        [
            "shortcomings", 
            "harm", 
            "benefits", 
            "interests"
        ], 
        [
            "money", 
            "time", 
            "hobbies", 
            "attention"
        ], 
        [
            "afforded", 
            "appointed", 
            "offered", 
            "arranged"
        ], 
        [
            "escape", 
            "decrease", 
            "increase", 
            "end"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "C", 
        "A", 
        "A", 
        "C", 
        "D", 
        "D", 
        "B"
    ], 
    "source": "high2958"
}