{
    "article": "Several years ago, while attending a communication course, I experienced a most unusual process. The instructor asked us to list anything in our past that we felt  _  of, regretted, or incomplete about and read our lists aloud. This seemed like a very  _  process, but there's always some brave soul in the crowd who will volunteer. The instructor then  _  that we find ways to  make an apology to  people, or take some action to right any wrongdoings. I was seriously wondering how this could ever  _  my communication. Then the man next to me raised his hand and volunteered this story: \"Making my  _  , I remembered an incident from high school. I grew up in a small town. There was a Sheriff none of us kids liked. One night, my two buddies and I decided to play a  _  on him.\" \"After drinking a few beers, we climbed the tall water tank in the middle of the town, and wrote on the tank in bright red paint: Sheriff Brown is a FOX. The next day, almost the whole town saw our glorious  _  . Within two hours, Sheriff Brown had us in his office. My friends told the truth but I lied. No one  _  found out.\" \"Nearly 20 years later, Sheriff Brown's name  _  on my list. I didn't even know if he was still  _  . Last weekend, I dialed the information in my hometown and found there was a Roger Brown still listed. I tried his number. After a few  _  , I heard, \"Hello?\" I said, \"Sheriff Brown?\" Paused \"Yes\". \"Well, this is Jimmy Calkins.\" \"And I want you to know that I did it.\" Paused. \"I knew it!\" he yelled back. We had a good laugh and a  _  discussion. His closing words were: \"Jimmy, I always felt bad for you because your buddies got it off their chest, but you were carrying it around all these years. I want to thank you for calling me ... for your sake.\" Jimmy inspired me to  clear up  all 101 items on my list within two years, and I always remember what I learned from the course: It's never too late to  _  the past wrongdoings.", 
    "options": [
        [
            "ashamed", 
            "afraid", 
            "sure", 
            "proud"
        ], 
        [
            "private", 
            "secret", 
            "interesting", 
            "funny"
        ], 
        [
            "expected", 
            "suggested", 
            "ordered", 
            "demanded"
        ], 
        [
            "improve", 
            "continue", 
            "realize", 
            "keep"
        ], 
        [
            "notes", 
            "list", 
            "plan", 
            "stories"
        ], 
        [
            "part", 
            "game", 
            "trick", 
            "record"
        ], 
        [
            "view", 
            "sign", 
            "attention", 
            "remark"
        ], 
        [
            "also", 
            "even", 
            "still", 
            "ever"
        ], 
        [
            "appears", 
            "considers", 
            "presents", 
            "remembers"
        ], 
        [
            "angry", 
            "happy", 
            "doubtful", 
            "alive"
        ], 
        [
            "words", 
            "calls", 
            "repeats", 
            "rings"
        ], 
        [
            "lively", 
            "plain", 
            "nervous", 
            "cold"
        ], 
        [
            "regret", 
            "forgive", 
            "right", 
            "punish"
        ]
    ], 
    "answers": [
        "A", 
        "A", 
        "B", 
        "A", 
        "B", 
        "C", 
        "B", 
        "D", 
        "A", 
        "D", 
        "D", 
        "A", 
        "C"
    ], 
    "source": "high551"
}