{
    "article": "A little boy almost considered himself as the most unfortunate child in the world because a terrible illness made his leg lame  . He   _   played with his classmates and when the teacher asked him to answer questions, he always   _   his head without a word.\nOne spring, the boy's father got some saplings     _   the neighbor and told his   _   to plant one each person. The father also   _   to buy a favorite gift for whoever grew best. The boy also wanted to get his father's   _  . But seeing his brothers and sisters carry water actively, he lost   _  . So after watering it once or twice, he never   looked after   it.\nA few days later, when the little boy went to see his tree again, he was   _   to find that it appeared greener and   _   than his sisters' and brothers'. His father   _   his promise, and said that he would surely become an outstanding botanist   when he   _   up.\nFrom then on, the little boy slowly became   _  . One night, looking at the bright moonlight outside, he suddenly recalled what the   _   teacher once said: plants generally grow at night. Then he came to the courtyard and unexpectedly found his father   _   under his tree with a big spoon.   _  , he understood: his father had been secretly watering his small tree! He   _   to his room, tears running down out of control...\nYears passed. The little boy didn't become a botanist,   _   he was elected President of the United States. His name was Franklin Roosevelt.\n  _   is the best nutrition   of life, even if it is just one spoonful of clear   _  , it can make the tree of life lively.", 
    "options": [
        [
            "always", 
            "often", 
            "seldom", 
            "sometimes"
        ], 
        [
            "nodded", 
            "raised", 
            "bent", 
            "lowered"
        ], 
        [
            "through", 
            "from", 
            "of", 
            "into"
        ], 
        [
            "children", 
            "sons", 
            "daughters", 
            "neighbours"
        ], 
        [
            "promised", 
            "demanded", 
            "agreed", 
            "wished"
        ], 
        [
            "tool", 
            "praise", 
            "gift", 
            "help"
        ], 
        [
            "touch", 
            "heart", 
            "sight", 
            "face"
        ], 
        [
            "disappointed", 
            "excited", 
            "surprised", 
            "worried"
        ], 
        [
            "stronger", 
            "weaker", 
            "heavier", 
            "shorter"
        ], 
        [
            "changed", 
            "kept", 
            "made", 
            "broke"
        ], 
        [
            "turned", 
            "woke", 
            "grew", 
            "stayed"
        ], 
        [
            "peaceful", 
            "hopeful", 
            "helpful", 
            "useful"
        ], 
        [
            "biology", 
            "physics", 
            "chemistry", 
            "history"
        ], 
        [
            "sleeping", 
            "resting", 
            "working", 
            "singing"
        ], 
        [
            "Fortunately", 
            "Therefore", 
            "However", 
            "Suddenly"
        ], 
        [
            "returned", 
            "came", 
            "turned", 
            "walked"
        ], 
        [
            "and", 
            "or", 
            "so", 
            "but"
        ], 
        [
            "Love", 
            "Help", 
            "Work", 
            "Promise"
        ], 
        [
            "sand", 
            "soup", 
            "water", 
            "soil"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "B", 
        "A", 
        "A", 
        "C", 
        "B", 
        "C", 
        "A", 
        "B", 
        "C", 
        "B", 
        "A", 
        "C", 
        "D", 
        "A", 
        "D", 
        "A", 
        "C"
    ], 
    "source": "high1150"
}