{
    "article": "When I was a teenager, my dad did everything he could do to advise me against becoming a brewer . He'd  _  his life brewing beer for local breweries only to make a living,  so  had his father and grandfather before him. He didn't want me  _  near a vat of beer. So I did as he asked. I got good  _  , went to Harvard and in 1971 was accepted into a graduate program there that  _  me to study law and business at the same time. In my second year of graduate school, I began to realize that I'd  _  done anything but go to school. So, at 24 I decided to drop out.  _  , my parents didn't think this was a great idea. But I felt strongly that you can't  _  till you're 65 to do what you want in life. I packed my stuff into a bus and headed for Colorado to become an instructor at Outward Bound. Three years later, I was ready to go back to  school  . I finished Harvard and got a highly-paid job at the Boston Consulting Group Still, after working there five years, I  _  , \"Is this what I want to be doing when I'm 50?\" At that time, Americans spent good money on beer in  _  quality. Why not make good beer for  Americans  ? I thought. I decided to give up my job to become  a brewer  . When I told Dad, he was  _  , but in the end he  _  me. I called my beer Samuel Adams,  _  the brewer and patriot who helped to start the Boston Tea Party.  _  I sold the beer direct to beer drinkers to get the  _  out. Six weeks later, at the Great American Beer Festival, Sam Adams Boston Lager won the top prize for American beer. In the end I was destined to be a brewer. My  _  to the young is simple: Life is very  _  , so don't rush to make decisions. Life doesn't let you plan.", 
    "options": [
        [
            "cost", 
            "spent", 
            "taken", 
            "paid"
        ], 
        [
            "anywhere", 
            "anyway", 
            "anyhow", 
            "somewhere"
        ], 
        [
            "habits", 
            "teachers", 
            "grades", 
            "work"
        ], 
        [
            "promised", 
            "convinced", 
            "advised", 
            "allowed"
        ], 
        [
            "never", 
            "ever", 
            "always", 
            "hardly"
        ], 
        [
            "Fortunately", 
            "Obviously", 
            "Possibly", 
            "Surprisingly"
        ], 
        [
            "assure", 
            "decline", 
            "deny", 
            "wait"
        ], 
        [
            "thrilled", 
            "stressed", 
            "wondered", 
            "sneezed"
        ], 
        [
            "cheap", 
            "expensive", 
            "low", 
            "high"
        ], 
        [
            "astonished", 
            "satisfied", 
            "interested", 
            "anxious"
        ], 
        [
            "hated", 
            "supported", 
            "raised", 
            "left"
        ], 
        [
            "for", 
            "at", 
            "in", 
            "after"
        ], 
        [
            "Therefore", 
            "Otherwise", 
            "Also", 
            "Yet"
        ], 
        [
            "price", 
            "name", 
            "company", 
            "party"
        ], 
        [
            "advice", 
            "life", 
            "job", 
            "experience"
        ], 
        [
            "hard", 
            "busy", 
            "short", 
            "long"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "D", 
        "A", 
        "B", 
        "D", 
        "C", 
        "C", 
        "A", 
        "B", 
        "D", 
        "C", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "high552"
}