{
    "article": "I have always believed the saying , \"Any man can be a father, but it  _  someone special to be a dad.\" This is true. Since the  _  of my son, Joshua, things have changed a lot in my life, but the  _  have been good! My wife and I have been through many  _  moments which have made both of us stronger. My son was born with a serious breathing problem and he couldn't keep his  _  down. He was put on several different medications,  _  he did not get any better. My wife and I were both told many times by people that Joshua  looked like  he was born early; he had not  _  much weight since he was born. As time progressed his regular doctor  _  my wife and me to visit Dr. Eid, a specialist in Louisville. He was  _  by my son's condition and so we were sent to Louisville's Children's Hospital . Joshua  went through  many different checkups. The  _  spent there was very demanding for my wife and me. But we did make it  _  . Our son Joshua was diagnosed with asthma , and with acid reflux syndrome . After the treatment, his  _  began to improve slowly. Joshua is 1 year and 1 month old now and his progress has been  _  --- he is up to 27 pounds now. I keep telling my wife that if he keeps  _  like this he might become a football  _  someday. There is a saying that has  _  me get through these troublesome times, \"Problems will either  _  you or break you.\" When you think the  _  hours are upon you, remember the dawn is just in sight.", 
    "options": [
        [
            "takes", 
            "asks", 
            "tells", 
            "brings"
        ], 
        [
            "return", 
            "illness", 
            "birth", 
            "death"
        ], 
        [
            "doctors", 
            "friends", 
            "causes", 
            "changes"
        ], 
        [
            "boring", 
            "challenging", 
            "exciting", 
            "puzzling"
        ], 
        [
            "food", 
            "water", 
            "weight", 
            "medicine"
        ], 
        [
            "so", 
            "but", 
            "since", 
            "until"
        ], 
        [
            "gained", 
            "lost", 
            "kept", 
            "raised"
        ], 
        [
            "followed", 
            "ordered", 
            "invited", 
            "advised"
        ], 
        [
            "angered", 
            "shocked", 
            "disappointed", 
            "scared"
        ], 
        [
            "time", 
            "money", 
            "hour", 
            "holiday"
        ], 
        [
            "out", 
            "down", 
            "off", 
            "through"
        ], 
        [
            "diet", 
            "study", 
            "health", 
            "weight"
        ], 
        [
            "great", 
            "slow", 
            "little", 
            "enough"
        ], 
        [
            "walking", 
            "running", 
            "training", 
            "growing"
        ], 
        [
            "supporter", 
            "player", 
            "coach", 
            "fan"
        ], 
        [
            "left", 
            "moved", 
            "helped", 
            "watched"
        ], 
        [
            "cheat", 
            "make", 
            "beat", 
            "find"
        ], 
        [
            "easiest", 
            "latest", 
            "brightest", 
            "darkest"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "D", 
        "B", 
        "A", 
        "B", 
        "A", 
        "D", 
        "B", 
        "A", 
        "D", 
        "C", 
        "A", 
        "D", 
        "B", 
        "C", 
        "B", 
        "D"
    ], 
    "source": "high1925"
}