{
    "article": "It had been a tiring day and I was looking forward to a quiet evening. My husband wouldn't come back until late and I had  _  to sit down in a comfortable armchair in the living room and read a book. I  _  the children to bed early and  _  a cold supper and some coffee. Soon I was sitting comfortably with a plate  filled  with food before me and a book at my side. I was just beginning to eat when the telephone rang. I put down my knife and fork and hurried to  _  it. By the time I got back to the living room, my coffee  had got  cold. After I finished my  _  I began to drink my coffee with my book  open  at page one. Suddenly there was a  _  at the door. It gave me such a great surprise that I spilt the  _  and made an ugly stain on my skirt. Some stranger had got  _  and wanted me to show him the way. It  _  ages to get rid of him. At last I  _  to sit down again and actually read a whole page without any more interruption until the baby woke up. He began crying loudly and I rushed upstairs. The baby was  _  awake at eleven o'clock when my husband came home. I should have cried myself when he asked me if I had a(n)  _  evening!", 
    "options": [
        [
            "decided", 
            "started", 
            "come", 
            "hurried"
        ], 
        [
            "put", 
            "made", 
            "threw", 
            "allowed"
        ], 
        [
            "boiled", 
            "heated", 
            "cooked", 
            "prepared"
        ], 
        [
            "receive", 
            "accept", 
            "answer", 
            "reply"
        ], 
        [
            "supper", 
            "drinking", 
            "reading", 
            "coffee"
        ], 
        [
            "stranger", 
            "knock", 
            "dog", 
            "man"
        ], 
        [
            "food", 
            "supper", 
            "coffee", 
            "plate"
        ], 
        [
            "lost", 
            "gone", 
            "missing", 
            "disappeared"
        ], 
        [
            "cost", 
            "spent", 
            "paid", 
            "took"
        ], 
        [
            "tried", 
            "hoped", 
            "managed", 
            "decided"
        ], 
        [
            "already", 
            "still", 
            "possibly", 
            "almost"
        ], 
        [
            "pleasant", 
            "exciting", 
            "friendly", 
            "lonely"
        ]
    ], 
    "answers": [
        "A", 
        "A", 
        "D", 
        "C", 
        "A", 
        "B", 
        "C", 
        "A", 
        "D", 
        "C", 
        "B", 
        "A"
    ], 
    "source": "high679"
}