{
    "article": "The moon had gone behind a cloud and there weren't many stars in the sky. I saw a flame in my neighbour's  kitchen  . I thought he was having a midnight fast food so I went back to my  _  . Soon, there was a  _  smell in the air and I guessed something was wrong.  At once  , I jumped out of bed and went downstairs to  _  . I saw fire coming out of my neighbour's kitchen. Right away, I  _  \"Fire! Fire!\" But there was no one nearby to  hear  my shouts for help. I  _  into my house, called the Fire Department and went back to my neighbour's house. I rang the doorbell, hit on the door and  called out  my neighbour's name but there was no  _  . I managed to  break into  the house and rescued a cat and a rabbit. I tried to throw water through the kitchen window  _  it was no use; the fire was too strong.  _  , a fire engine arrived and soon the firemen put out the fire. They arrived just  in time  as the fire was going to  _  to the other rooms in the house. When my neighbour came back, he was  _  because his kitchen was burnt down, but he thanked me for calling the Fire Department and for saving his  _  . He wanted to give me some money in return but I did not  _  it. Weeks later, my neighbour repaired and restored his kitchen. He  _  me to his new kitchen and there he gave me a medal that he had  _  ordered from a factory. It made me very happy.", 
    "options": [
        [
            "chair", 
            "table", 
            "bed", 
            "sofa"
        ], 
        [
            "big", 
            "hot", 
            "special", 
            "burning"
        ], 
        [
            "examine", 
            "search", 
            "listen", 
            "smell"
        ], 
        [
            "said", 
            "shouted", 
            "received", 
            "smiled"
        ], 
        [
            "walked", 
            "rushed", 
            "came", 
            "stepped"
        ], 
        [
            "answer", 
            "light", 
            "sound", 
            "fire"
        ], 
        [
            "and", 
            "but", 
            "because", 
            "so"
        ], 
        [
            "Luckily", 
            "Sadly", 
            "Unfortunately", 
            "Suddenly"
        ], 
        [
            "reach", 
            "spread", 
            "go", 
            "cover"
        ], 
        [
            "glad", 
            "sad", 
            "lucky", 
            "angry"
        ], 
        [
            "children", 
            "parents", 
            "life", 
            "pets"
        ], 
        [
            "expect", 
            "want", 
            "accept", 
            "get"
        ], 
        [
            "ordered", 
            "begged", 
            "suggested", 
            "invited"
        ], 
        [
            "mainly", 
            "particularly", 
            "specially", 
            "Naturally"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "A", 
        "B", 
        "B", 
        "A", 
        "B", 
        "A", 
        "B", 
        "B", 
        "D", 
        "C", 
        "D", 
        "C"
    ], 
    "source": "high1700"
}