{
    "article": "John Perry stood up and looked around again. The island had been a good place to find shells. But now how could he make the  _  move out to sea? If they swam out to sea he could jump in and get to shore  _  they saw him,\nHe saw the sharks rolling and playing. Their  _  was now gone and they were killing for fun. How could he make them move away?\nHe drew his knife from his belt. Sharks could  _  blood, he thought. He put the knife against his leg and cut deep into the  _  .The blood ran out and he caught it on his white shirt. When the shirt was red and wet he tied some cloth around his leg to  _  the flow of blood. He then tied a long piece of cloth to the shirt, threw it into the water and\n  _  it with the piece of cloth.\nThe sharks smelled the blood and came  _  toward the shirt. He ran down the sand reef pulling the shirt and the sharks raced after it. He was\n  _  them away from the shore. Suddenly he dropped the cloth, turned toward the  _  and ran as fast as he could. He jumped in the water and swam.\nHe was halfway across  _  he turned to look back. A high bony fin  was  _  through the water toward him. He put his face in the water, kicked and splashed himself  _  as fast as he could. The shore was near now.\nHe lifted his head again to  _  and he was the shore very near. From behind he left the water rush toward him, almost pushing him, helping him. And then a great gray body hit him and almost rolled him over in the water. He touched the shore with  his fingers  and he pulled himself up the stones. The sharks,  _  by the smell of blood and the chase , went wildly after him. Its great body crashed against  the stones  .\nThe end came quickly and the water was covered with the shark's blood. The injured shark was eaten up  _  by others as it tried to escape.\nPerry slowly struggled  _  his feet.\n\"So,\" he said,\"you did not get me.\" And he looked down at the sharks still eating  even though  they weren't hungry. He climbed up the stones and walked toward the village.", 
    "options": [
        [
            "boats", 
            "sharks", 
            "soldiers", 
            "shells"
        ], 
        [
            "before", 
            "after", 
            "until", 
            "when"
        ], 
        [
            "food", 
            "hunger", 
            "anger", 
            "wish"
        ], 
        [
            "fear", 
            "taste", 
            "drink", 
            "smell"
        ], 
        [
            "sand", 
            "shark", 
            "flesh", 
            "meat"
        ], 
        [
            "stop", 
            "keep", 
            "join", 
            "cause"
        ], 
        [
            "pulled", 
            "wrapped", 
            "connected", 
            "caught"
        ], 
        [
            "running", 
            "racing", 
            "swimming", 
            "jumping"
        ], 
        [
            "driving", 
            "keeping", 
            "preventing", 
            "leading"
        ], 
        [
            "sea", 
            "shore", 
            "island", 
            "sand"
        ], 
        [
            "before", 
            "while", 
            "unless", 
            "when"
        ], 
        [
            "going", 
            "running", 
            "cutting", 
            "swimming"
        ], 
        [
            "forward", 
            "backward", 
            "upward", 
            "downward"
        ], 
        [
            "cry", 
            "breathe", 
            "swim", 
            "escape"
        ], 
        [
            "interested", 
            "frightened", 
            "disappointed", 
            "excited"
        ], 
        [
            "lively", 
            "alive", 
            "dead", 
            "friendly"
        ], 
        [
            "on", 
            "by", 
            "to", 
            "with"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "B", 
        "D", 
        "C", 
        "A", 
        "A", 
        "B", 
        "D", 
        "B", 
        "D", 
        "C", 
        "A", 
        "B", 
        "D", 
        "B", 
        "A"
    ], 
    "source": "high1098"
}