{
    "article": "One month ago, my daughter started kindergarten. As usual, I wished her success. I was telling a lie. What I actually wish for her is   _  . I believe in the power of failure.\nSuccess is   _   in a sense. Success is proving that you can do something that you already know you can do, or doing something correctly the first time, which can   _   be a problematic victory. First-time success is usually a fluke  . First-time failure,   by contrast  , is expected; it is the natural order of things.\nFailure is how we learn. I have been told of an African phrase   _   a good cook as \"she who has broken many pots\". If you have spent enough time in the   _   to have broken a lot of pots, probably you know a fair amount about   _  . I once had a late dinner with a group of chefs, and they spent time   _   knife wounds and burn scars. They knew how much credibility   their   _   gave them.\nI earn my   _   by writing a daily newspaper column. Each week I am   _   that one column is going to be the worst column of the week. I don't just set out to write it; I try my best every day.   _  , every week, one column is inferior   to the others, sometimes extremely so.\nI have learned to   _   that column. A successful column usually means that I am treading   on   _   ground, going with tricks that work, or dressing up popular ideas in fancy words. Often in my inferior columns, I am trying to   get through   something I've never done before, something that I'm not even sure can be done.\nMy daughter is a perfectionist. She will feel her failures, and I will want to   _   her. But I will also, I hope,   _   her of what she learned, and how she can do   _   next time. I probably won't tell her that failure is a good thing, because that's not a(n)   _   you can learn when you're five. I hope I can tell her, though, that it's not the end of the world. Indeed, with luck, it is the   _  .", 
    "options": [
        [
            "success", 
            "failure", 
            "victory", 
            "sacrifice"
        ], 
        [
            "demanding", 
            "worthwhile", 
            "correct", 
            "boring"
        ], 
        [
            "often", 
            "rarely", 
            "always", 
            "hardly"
        ], 
        [
            "denying", 
            "describing", 
            "pointing", 
            "predicting"
        ], 
        [
            "dormitory", 
            "yard", 
            "kitchen", 
            "field"
        ], 
        [
            "gardening", 
            "training", 
            "displaying", 
            "cooking"
        ], 
        [
            "comparing", 
            "making", 
            "learning", 
            "curing"
        ], 
        [
            "wounds", 
            "failures", 
            "scars", 
            "strengths"
        ], 
        [
            "living", 
            "support", 
            "skill", 
            "similarity"
        ], 
        [
            "ambitious", 
            "grateful", 
            "confident", 
            "aware"
        ], 
        [
            "Moreover", 
            "Still", 
            "Otherwise", 
            "Therefore"
        ], 
        [
            "adapt", 
            "update", 
            "cherish", 
            "review"
        ], 
        [
            "accessible", 
            "similar", 
            "sensitive", 
            "familiar"
        ], 
        [
            "amuse", 
            "comfort", 
            "scold", 
            "reward"
        ], 
        [
            "warn", 
            "cheat", 
            "remind", 
            "suspect"
        ], 
        [
            "better", 
            "luckier", 
            "worse", 
            "less"
        ], 
        [
            "experience", 
            "trick", 
            "lesson", 
            "truth"
        ], 
        [
            "process", 
            "destination", 
            "ending", 
            "beginning"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "A", 
        "B", 
        "C", 
        "D", 
        "A", 
        "B", 
        "A", 
        "D", 
        "B", 
        "C", 
        "D", 
        "B", 
        "C", 
        "A", 
        "C", 
        "D"
    ], 
    "source": "high1014"
}