{
    "article": "A man found the cocoon of a moth . He took it home so that he could  _  the moth come out of the cocoon. On that day a small  _  appeared. He sat and watched the moth for several hours as the moth struggled to  _  the body through that little hole. Soon it seemed to stop making any progress. It appeared as if it had  _  as far as it could and it could go no further. It just seemed to be stuck. So the man, out of his kindness, decided to help the moth. He took a pair of scissors and cut off the  _  bit of the cocoon. The  _  then came out easily. But it had a swollen body and small, shriven wings. The man continued to watch the moth because he expected that, at any moment, the wings would enlarge and  _  to be able to support the  _  , which would get smaller in time. Neither happened! In fact, the little moth spent the rest of its life  _  around with a swollen body and shriven wings. It was  _  able to fly. What the man in his kindness  didn't understand  was that the small cocoon and the  _  of the moth to get through the  _  opening was a way to push fluid  _  the body of moth  _  its wings so that it would be ready to fly  _  it got out of the cocoon. Freedom and  _  would come only after the struggle. By taking the struggle away, he also took away the moth's health. Sometimes struggles are exactly what we need in our lives. If we were to  go through  our lives without any difficulties, we would become disabled. We would not be as  _  as what we could have been. Give every opportunity a chance. Leave no room for  _  .", 
    "options": [
        [
            "help", 
            "protect", 
            "watch", 
            "see"
        ], 
        [
            "opening", 
            "line", 
            "moth", 
            "butterfly"
        ], 
        [
            "push", 
            "draw", 
            "make", 
            "force"
        ], 
        [
            "got", 
            "done", 
            "tried", 
            "struggled"
        ], 
        [
            "covering", 
            "remaining", 
            "shell", 
            "skin"
        ], 
        [
            "moth", 
            "butterfly", 
            "cocoon", 
            "worm"
        ], 
        [
            "lessen", 
            "widen", 
            "expand", 
            "shorten"
        ], 
        [
            "standing", 
            "flight", 
            "themselves", 
            "body"
        ], 
        [
            "flying", 
            "crawling", 
            "walking", 
            "lying"
        ], 
        [
            "already", 
            "certainly", 
            "never", 
            "seldom"
        ], 
        [
            "crawling", 
            "struggle", 
            "fight", 
            "force"
        ], 
        [
            "tiny", 
            "beginning", 
            "right", 
            "above"
        ], 
        [
            "in", 
            "on", 
            "by", 
            "from"
        ], 
        [
            "into", 
            "to", 
            "in", 
            "onto"
        ], 
        [
            "after", 
            "once", 
            "before", 
            "until"
        ], 
        [
            "courage", 
            "hope", 
            "flight", 
            "survival"
        ], 
        [
            "great", 
            "determined", 
            "brave", 
            "strong"
        ], 
        [
            "regrets", 
            "death", 
            "failure", 
            "wishes"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "A", 
        "B", 
        "A", 
        "C", 
        "D", 
        "B", 
        "C", 
        "B", 
        "A", 
        "D", 
        "A", 
        "B", 
        "C", 
        "D", 
        "A"
    ], 
    "source": "high3040"
}