{
    "article": "At the age of three, I wasdiscovered to be totally deaf. Having consulted many specialists, my parents made a(n)  _  that would forever alter my future.  Instead of  sending me to a special education school for the deaf, they chose an ordinary one for me. All of my schoolmates and teachers there would have  _  hearing. I experienced great  _  throughout my primary school because, in addition to the problems of  fitting in  with the other students, I also  _  with most of my school work. I seemed to spend every spare moment doing homework just so I could  keep up  .  _  for me, Mrs. Jordan, my 5th grade teacher, changed all of that with a simple three-word phrase. One morning, she asked the class a question. I  _  her lips and immediately raised my hand. Here was an opportunity to impress the powerful teacher and even my classmates. Although a little afraid when I heard my named called, I felt unusually  _  because I was sure I had the right answer. I took a deep breath and  _  answered Mrs. Jordan's question. Her response  _  all of us. Mrs. Jordan enthusiastically  _  her right foot on the floor and turned her right hand around in a full circle  _  it pointed directly at me. With shining eyes she cried, \"THAT'S RIGHT, STEPHEN!\" For the first time in my young life, I was an instant star. My heart burst with  _  . Smiling widely, I sat a little taller in my chair. My confidence  _  like never before. I decided right then and there that I would make a(n)  _  in this world. No matter how many  _  I might come across in life, I knew I could overcome them. The very three-word phrase entirely  _  my young life. From that day on, my grades and speech improved greatly, my  _  among my classmates increased, and my viewpoint on life did a complete turnabout.", 
    "options": [
        [
            "decision", 
            "effort", 
            "commitment", 
            "attempt"
        ], 
        [
            "strong", 
            "normal", 
            "weak", 
            "sharp"
        ], 
        [
            "excitement", 
            "sympathy", 
            "anxiety", 
            "authority"
        ], 
        [
            "struggled", 
            "handled", 
            "impressed", 
            "absorbed"
        ], 
        [
            "Gradually", 
            "Eventually", 
            "Luckily", 
            "Subsequently"
        ], 
        [
            "found", 
            "read", 
            "observed", 
            "appreciated"
        ], 
        [
            "confident", 
            "embarrassed", 
            "frightened", 
            "jealous"
        ], 
        [
            "carelessly", 
            "nervously", 
            "casually", 
            "naturally"
        ], 
        [
            "fooled", 
            "delighted", 
            "surprised", 
            "upset"
        ], 
        [
            "hit", 
            "stepped", 
            "placed", 
            "settled"
        ], 
        [
            "unless", 
            "since", 
            "after", 
            "until"
        ], 
        [
            "regret", 
            "pride", 
            "envy", 
            "courage"
        ], 
        [
            "increased", 
            "declined", 
            "escaped", 
            "built"
        ], 
        [
            "fortune", 
            "impression", 
            "living", 
            "difference"
        ], 
        [
            "feelings", 
            "obstacles", 
            "competitions", 
            "opportunities"
        ], 
        [
            "devoted", 
            "surrounded", 
            "occupied", 
            "transformed"
        ], 
        [
            "hardship", 
            "character", 
            "popularity", 
            "health"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "C", 
        "A", 
        "C", 
        "B", 
        "A", 
        "B", 
        "C", 
        "A", 
        "D", 
        "B", 
        "A", 
        "D", 
        "B", 
        "D", 
        "C"
    ], 
    "source": "high2143"
}