{
    "article": "The cultures of the East and the West really distinguish each other a lot. This is because the culture systems are two  _  systems on the whole. The  _  of the eastern cultures is mainly from two countries: China and India. Both of the two cultures are gestated by  _  . In China, the mother river is the Yellow River while the Indian one is the Hindu River. These two cultures were developed for several thousand years and formed their own  _  . Then in Dang Dynasty of China, the Chinese culture  _  went overseas to Japan,  _  into the Japanese society and shaped the Japanese culture nowadays. Though a bit different from the Chinese one, it belongs to the same  _  . When the two mother rivers gave birth to the eastern culture, another famous culture was  brought up  on the Mesopotamian Plain ---- the Mesopotamian Civilization. This civilization later on developed into the cultures of the Ancient Greece and Ancient Rome. And these two are well-known as the  _  of the European culture. Like the Chinese culture, the European one also  _  waters. When the colonists of England  settled down  in America, their culture went with them over the Atlantic Ocean. So the American culture doesn't  _  from the European one a lot. At the same time, the difference of the language systems  adds to  the cultural differences. In the East, most languages belong to the pictographic language while the Western languages are mostly based on the Latin system, for example, the one I'm using to write this paper. Other factors like human race difference counts as well. But what's more, as a result of the far distance and the steepareas between the East and West, the two cultures seldom  _  until recent centuries. So they grew up totally in their own ways with almost no  _  with the other.", 
    "options": [
        [
            "connected", 
            "separate", 
            "ancient", 
            "remote"
        ], 
        [
            "preservation", 
            "development", 
            "resource", 
            "origin"
        ], 
        [
            "coasts", 
            "lakes", 
            "rivers", 
            "mountains"
        ], 
        [
            "styles", 
            "habits", 
            "ways", 
            "means"
        ], 
        [
            "hurriedly", 
            "gradually", 
            "unfortunately", 
            "suddenly"
        ], 
        [
            "made", 
            "crashed", 
            "mixed", 
            "applied"
        ], 
        [
            "culture", 
            "nation", 
            "influence", 
            "system"
        ], 
        [
            "bottom", 
            "key", 
            "base", 
            "basement"
        ], 
        [
            "crossed", 
            "drunk", 
            "swam", 
            "dived"
        ], 
        [
            "evolve", 
            "judge", 
            "distinguish", 
            "rise"
        ], 
        [
            "approached", 
            "contacted", 
            "involved", 
            "communicated"
        ], 
        [
            "impact", 
            "difference", 
            "connection", 
            "familiarity"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "C", 
        "A", 
        "B", 
        "C", 
        "D", 
        "C", 
        "A", 
        "C", 
        "D", 
        "C"
    ], 
    "source": "high1860"
}