{
    "article": "Many Tuesday mornings, I have coffee with my father. Although my father is a man of few words, I really  _  the time along with him. One recent Tuesday, I found it a bit  _  when I rang the doorbell, no one seemed to be home. I climbed in through the window, noticing the lights that shone from the kitchen, and  _  that my dad must be there, but he wasn't. I  _  through his home, checking every room. I tried not to  _  .Yet, upstairs, downstairs, no Dad anywhere. I was worried.  After all  , my father was seventyone years old. Anything could have happened to him. Then, I got in my car and drove to my mother's aerobics class. On the drive, I thought a lot about my father and our  _  together. Suddenly, I was three years old and he was  _  me up to the living room window to see the Christmas lights. In his  _  , I was safe and secure. At age ten, he used to wake me up with warm breakfast in bed. Then I was twelve and my dad was  _  all the kids at my birthday party with his magic tricks. I was so  _  of my father for being so  _  and talented. He'd made my party a  _  . As I entered my mother's class. I was nervous. My mom looked at me in  _  . \"Mom, where's Dad?\" I asked, \"He's working in the  _  on the side of the house!\" she answered. And I hurried to my car and  _  back to the yard.\"Hey, Dad!\" I yelled out and told him about my fears of the last half hour. My dad  _  laughing his typical laugh that was always  _  . I was so thankful that I still had my daddy. And so, as I  _  the door to my father's house, we went inside for our usual cup of coffee. Thanks, Daddy, for all the  _  and more importantly, for all your love.", 
    "options": [
        [
            "dislike", 
            "share", 
            "get", 
            "enjoy"
        ], 
        [
            "dangerous", 
            "unusual", 
            "joyful", 
            "relaxing"
        ], 
        [
            "decided", 
            "hoped", 
            "expected", 
            "wondered"
        ], 
        [
            "lived", 
            "pulled", 
            "hurried", 
            "came"
        ], 
        [
            "cry", 
            "panic", 
            "believe", 
            "confirm"
        ], 
        [
            "journey", 
            "family", 
            "interest", 
            "history"
        ], 
        [
            "holding", 
            "picking", 
            "calling", 
            "bringing"
        ], 
        [
            "heart", 
            "chest", 
            "eyes", 
            "arms"
        ], 
        [
            "amazing", 
            "cheating", 
            "inviting", 
            "providing"
        ], 
        [
            "sure", 
            "aware", 
            "proud", 
            "afraid"
        ], 
        [
            "honest", 
            "special", 
            "lucky", 
            "practical"
        ], 
        [
            "feast", 
            "prize", 
            "secret", 
            "success"
        ], 
        [
            "anger", 
            "worry", 
            "sorrow", 
            "surprise"
        ], 
        [
            "yard", 
            "kitchen", 
            "room", 
            "home"
        ], 
        [
            "fought", 
            "raced", 
            "looked", 
            "fled"
        ], 
        [
            "kept", 
            "remembered", 
            "began", 
            "stopped"
        ], 
        [
            "bitter", 
            "simple", 
            "familiar", 
            "tight"
        ], 
        [
            "closed", 
            "unlocked", 
            "kicked", 
            "knocked"
        ], 
        [
            "memories", 
            "chances", 
            "assistance", 
            "advice"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "A", 
        "C", 
        "B", 
        "D", 
        "A", 
        "D", 
        "A", 
        "C", 
        "B", 
        "D", 
        "D", 
        "A", 
        "B", 
        "C", 
        "C", 
        "B", 
        "A"
    ], 
    "source": "high2447"
}