{
    "article": "I was invited to attend a presentation at the Kentucky School. That evening I found gratitude had amazing  _  to change our attitude...and our life. The young musician Mr. Patrick was  _  onto the stage in his wheelchair and began to play the piano. His fingers danced across the keys as he  _  beautiful music. He then began to sing as he played, and it was wonderful. But what shocked me most was his  _  smile. Patrick was born with no eyes and an illness in the legs, which  _  him lame for life. However, as a child, he was  _  with artificial eyes and placed in a wheelchair. Before his first  _  , he discovered the piano. When his mom hit any note on the piano, and within one or two  _  , he'd get it. By his second birthday, he was playing \"Twinkle, Twinkle, Little Star\". His father was  _  . \"We might not play baseball, but we can play music together.\" When Patrick was at the University of Louisville, his father  _  classes with him. He was also a part of the 214-member marching band! He was a blind, wheelchair-bound trumpet player; and he and his father did it together. His father  _  the night shift in order to accompany his daytime band practice. Patrick says, \"My dad's my  _  .\" But even more than his  _  musical talent, it was Patrick's \"attitude of gratitude\" that  _  my soul. On stage, between songs, he talked to the audience about his life and about how  _  he was with a great father. When his performance was over, Patrick and his father were on the stage together. The crowd rose to their feet and  _  for over five minutes. We all face misfortune in our lives.  _  ,it's not the hardship but how we  _  to it that will determine the joy and happiness in our lives. During  _  times, do we spend too much time feeling  _  for ourselves, or can we, with gratitude, learn how to dance in the rain?", 
    "options": [
        [
            "knowledge", 
            "quality", 
            "wisdom", 
            "power"
        ], 
        [
            "rolled", 
            "held", 
            "allowed", 
            "dragged"
        ], 
        [
            "wrote", 
            "provided", 
            "made", 
            "gave"
        ], 
        [
            "strange", 
            "magic", 
            "bitter", 
            "friendly"
        ], 
        [
            "took", 
            "led", 
            "forced", 
            "left"
        ], 
        [
            "fitted", 
            "connected", 
            "associated", 
            "filled"
        ], 
        [
            "place", 
            "birthday", 
            "performance", 
            "attempt"
        ], 
        [
            "memories", 
            "words", 
            "tries", 
            "notes"
        ], 
        [
            "confused", 
            "amused", 
            "interested", 
            "overjoyed"
        ], 
        [
            "listed", 
            "found", 
            "attended", 
            "organized"
        ], 
        [
            "worked", 
            "found", 
            "refused", 
            "cancelled"
        ], 
        [
            "dream", 
            "hero", 
            "music", 
            "song"
        ], 
        [
            "unbearable", 
            "unbelievable", 
            "unconditional", 
            "unreasonable"
        ], 
        [
            "touched", 
            "calmed", 
            "freed", 
            "felt"
        ], 
        [
            "satisfied", 
            "concerned", 
            "blessed", 
            "laughed"
        ], 
        [
            "cheered", 
            "whispered", 
            "shouted", 
            "laughed"
        ], 
        [
            "Therefore", 
            "Otherwise", 
            "However", 
            "Besides"
        ], 
        [
            "see", 
            "react", 
            "agree", 
            "put"
        ], 
        [
            "happy", 
            "modern", 
            "tough", 
            "usual"
        ], 
        [
            "great", 
            "sorry", 
            "hopeful", 
            "proud"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "C", 
        "B", 
        "D", 
        "A", 
        "B", 
        "C", 
        "D", 
        "C", 
        "A", 
        "B", 
        "B", 
        "A", 
        "C", 
        "A", 
        "C", 
        "B", 
        "C", 
        "B"
    ], 
    "source": "high908"
}