{
    "article": "Seven loyal readers came to the Teens Office two weeks ago. They had a wonderful day learning how to make a newspaper. But what  _  made them excited was that they had their say. \"What most  _  me was when I was saying something, I found all eyes were on me,\" said Tang Shining, one of the students. Her friend, Li Chunbei  _  , and felt very glad that when she was talking, the editors nodded and  _  took notes. Students are happy to see the editors listen to their  _  . You may often  _  about being neglected by teachers and parents.  _  before complaining, please make sure that you have already spoken about your  _  Traditionally in China, teachers at school and parents were  _  the ones to tell teenagers what they should and shouldn't do. The young are  _  to doing what they are told, rather than thinking by themselves. But then their ideas would be locked in their brain and not be  _  . A girl wrote to Teens about her family story. She  _  to be very sad because her father seldom talked and played with her. After years of consideration, she  _  decided to write her father a letter, telling him about her sadness. To her  _  , the father  _  , saying that he didn't realize his mistake. From then on, he really  _  . Sometimes, we need to let our  _  be heard, so others can understand our thoughts and feelings. Don't be afraid of being  _  for what you have done. You know it is your  _  to speak your mind. Even if your suggestions are denied, at least you have tried your best. You will not be left with any  _  .", 
    "options": [
        [
            "directly", 
            "really", 
            "completely", 
            "immediately"
        ], 
        [
            "disappointed", 
            "frightened", 
            "impressed", 
            "horrified"
        ], 
        [
            "refused", 
            "disagreed", 
            "disliked", 
            "agreed"
        ], 
        [
            "even", 
            "yet", 
            "already", 
            "still"
        ], 
        [
            "speeches", 
            "opinions", 
            "songs", 
            "articles"
        ], 
        [
            "talk", 
            "complain", 
            "write", 
            "speak"
        ], 
        [
            "And", 
            "So", 
            "But", 
            "Instead"
        ], 
        [
            "pleasure", 
            "love", 
            "hatred", 
            "worry"
        ], 
        [
            "seldom", 
            "never", 
            "always", 
            "sometimes"
        ], 
        [
            "used", 
            "reduced", 
            "devoted", 
            "told"
        ], 
        [
            "remembered", 
            "used", 
            "touched", 
            "heard"
        ], 
        [
            "used", 
            "pretended", 
            "seemed", 
            "had"
        ], 
        [
            "sadly", 
            "suddenly", 
            "angrily", 
            "finally"
        ], 
        [
            "sorrow", 
            "disappointment", 
            "surprise", 
            "satisfaction"
        ], 
        [
            "apologized", 
            "smiled", 
            "laughed", 
            "sighed"
        ], 
        [
            "exchanged", 
            "changed", 
            "left", 
            "played"
        ], 
        [
            "voices", 
            "decisions", 
            "suggestions", 
            "secrets"
        ], 
        [
            "praised", 
            "blamed", 
            "beaten", 
            "fined"
        ], 
        [
            "duty", 
            "task", 
            "right", 
            "pleasure"
        ], 
        [
            "regret", 
            "sadness", 
            "trouble", 
            "difficulty"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "D", 
        "A", 
        "B", 
        "B", 
        "C", 
        "D", 
        "C", 
        "A", 
        "D", 
        "A", 
        "D", 
        "C", 
        "A", 
        "B", 
        "A", 
        "B", 
        "C", 
        "A"
    ], 
    "source": "high1755"
}