{
    "article": "Once upon a time, there were two very good friends who lived together in the shade of a rock. Strange as it may seem, one was a  _  and one was a tiger. They had met when they were too  _  to know the difference between lions and tigers. So they did not think their  _  was at all unusual. Besides, it was a peaceful part of the mountains, possibly  due to  the influence of a gentle forest monk who lived nearby. He was a hermit, one who  _  far away from other people. For some unknown reason, one day the two friends got into a silly  _  . The tiger said, \"Everyone knows the cold  _  when the moon wanes from full to new! \" The lion said, \"Where did you hear such nonsense? Everyone knows the  _  comes when the moon waxes from  _  to full! \" The argument got stronger and stronger. Neither could  _  the other. They could not  _  any conclusion to resolve the growing dispute. They  _  started calling each other names! Fearing for their friendship, they decided to go to ask the learned forest  _  , who would surely know about such things. Visiting the  _  hermit, the lion and tiger bowed respectfully and put their question to him. The friendly monk thought for a while and then gave his  _  . \"It can be cold in any phase of the  _  , from new to full and back to new again. It is the wind that brings the cold,  _  from west or north or east. Therefore, in a way, you are both right! And neither of you is  _  by the other. The most important thing is to live without conflict, to remain  _  . Unity is best by all means. \" The lion and tiger thanked the wise hermit. They were happy to  _  be friends.", 
    "options": [
        [
            "fox", 
            "hen", 
            "donkey", 
            "lion"
        ], 
        [
            "weak", 
            "unforgettable", 
            "young", 
            "poor"
        ], 
        [
            "friendship", 
            "difference", 
            "relationship", 
            "connection"
        ], 
        [
            "lived", 
            "survived", 
            "walked", 
            "moved"
        ], 
        [
            "argument", 
            "decision", 
            "activity", 
            "conference"
        ], 
        [
            "happens", 
            "bears", 
            "comes", 
            "seems"
        ], 
        [
            "clean", 
            "cold", 
            "cool", 
            "good"
        ], 
        [
            "wonderful", 
            "fresh", 
            "delicious", 
            "new"
        ], 
        [
            "solve", 
            "compete", 
            "convince", 
            "remind"
        ], 
        [
            "arrive", 
            "reach", 
            "cause", 
            "paint"
        ], 
        [
            "far", 
            "ever", 
            "yet", 
            "even"
        ], 
        [
            "monk", 
            "teacher", 
            "mother", 
            "parent"
        ], 
        [
            "kind", 
            "different", 
            "peaceful", 
            "rich"
        ], 
        [
            "answer", 
            "speech", 
            "comment", 
            "remark"
        ], 
        [
            "sun", 
            "weather", 
            "moon", 
            "day"
        ], 
        [
            "whether", 
            "until", 
            "if", 
            "when"
        ], 
        [
            "rewarded", 
            "won", 
            "defeated", 
            "awarded"
        ], 
        [
            "moved", 
            "united", 
            "interested", 
            "amused"
        ], 
        [
            "too", 
            "quite", 
            "also", 
            "still"
        ]
    ], 
    "answers": [
        "D", 
        "C", 
        "A", 
        "A", 
        "A", 
        "C", 
        "B", 
        "D", 
        "C", 
        "B", 
        "D", 
        "A", 
        "C", 
        "A", 
        "C", 
        "A", 
        "C", 
        "B", 
        "D"
    ], 
    "source": "high1625"
}