{
    "article": "A person may have a false idea about himself that will stop him from doing good work. He may have the belief that he is unable to do it. A child may think he is  _  because he doesn't understand how to make  _  use of his mental gifts. Old people may have a false idea that they are unable to learn new things because of their  _  . A person who believes that he is stupid will not make a real  _  because he feels that it would be useless. He won't go at a job with confidence necessary for  _  . Besides, he won't work his hardest way, even though he may think he is doing so.  _  , he is likely to fail, and the failure will  strengthen  his belief in his incompetence in turn. Alfred Alder, a famous doctor, had  an experience  like this. When he was a small boy, he had a poor  _  in math. His teacher told his parents he had no ability in math in order that they would not  _  too much of him. In this way, his teacher and parents  _  the idea. He  _  their false judgment of his ability, feeling that it was useless to  _  . Then, he was very poor at math,  _  as they expected. But one day everything changed. He worked out a problem which  _  of the other students had been able to solve. He  _  in solving the problem which gave him confidence. Soon he became especially good at  _  . Alder now  _  with interest, determination and purpose. He not only proved that he could learn math well, but luckily he learned it  _  , not too late. From his own experience, we can tell that if a person goes at a job with determination and purpose, he may  _  himself as well as others by his ability.", 
    "options": [
        [
            "stupid", 
            "shy", 
            "useless", 
            "clever"
        ], 
        [
            "big", 
            "full", 
            "high", 
            "straight"
        ], 
        [
            "ability", 
            "age", 
            "brain", 
            "knowledge"
        ], 
        [
            "decision", 
            "plan", 
            "promise", 
            "effort"
        ], 
        [
            "work", 
            "study", 
            "pleasure", 
            "success"
        ], 
        [
            "Therefore", 
            "Really", 
            "However", 
            "Truly"
        ], 
        [
            "state", 
            "mind", 
            "start", 
            "ending"
        ], 
        [
            "blame", 
            "expect", 
            "get", 
            "win"
        ], 
        [
            "discovered", 
            "organized", 
            "developed", 
            "found"
        ], 
        [
            "broke", 
            "refused", 
            "doubted", 
            "accepted"
        ], 
        [
            "manage", 
            "argue", 
            "act", 
            "try"
        ], 
        [
            "only", 
            "almost", 
            "just", 
            "then"
        ], 
        [
            "none", 
            "all", 
            "some", 
            "most"
        ], 
        [
            "succeeded", 
            "broke", 
            "failed", 
            "believed"
        ], 
        [
            "physics", 
            "medicine", 
            "English", 
            "math"
        ], 
        [
            "studies", 
            "plays", 
            "works", 
            "graduates"
        ], 
        [
            "early", 
            "deeply", 
            "late", 
            "simply"
        ], 
        [
            "discourage", 
            "love", 
            "surprise", 
            "disappoint"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "B", 
        "D", 
        "D", 
        "A", 
        "C", 
        "B", 
        "C", 
        "D", 
        "D", 
        "C", 
        "A", 
        "A", 
        "D", 
        "C", 
        "A", 
        "C"
    ], 
    "source": "high1375"
}