{
    "article": "Around the world more and more people are   taking part in  dangerous sports and activities. Of course there have always been\npeople who have  looked for  adventure--those who have\nclimbed the  _  mountains, explored unknown parts\nof the world or  _  in small boats across\nthe greatest oceans. Now, however, there are people who look for an immediate\npleasure from a  _  activity which\nmay only last a few minutes or even  _  .\nI would consider bungee jumping to be a good example of such an activity. You   _  from a\nhigh place about 200 meters above the ground with an elastic rope  _  to your ankles. You  _  at up to\n150 kilometers an hour until the rope stops you from  _  the ground. It is said that 2 million people around the world have\nnow  _  bungee jumping. Other activities,  _  most people would say are as dangerous as bungee jumping,  _  jumping from tall buildings and  _  into\nthe sea from the top of high rocks.\nWhy do people take part in such activities as these? Some psychologists  suggest that it is because life in   _  societies has become\nsafe and boring. Not very long ago, people's lives were constantly under  _     .They had to go out and hunt for  _  , and\nlife was a continuous battle for survival.\nNowadays, according to many people, life offers   _  excitement. They live and work in  ly\nsafe condition; they buy food in shops; and there are doctors and hospitals to  look after  them if they become ill. The answer for some of these people is to  seek for  danger in activities such as bungee jumping.", 
    "options": [
        [
            "lowest", 
            "highest", 
            "beautiful", 
            "wild"
        ], 
        [
            "sailed", 
            "swam", 
            "jumped", 
            "crossed"
        ], 
        [
            "safe", 
            "urgent", 
            "funny", 
            "dangerous"
        ], 
        [
            "years", 
            "seconds", 
            "hours", 
            "days"
        ], 
        [
            "jump", 
            "run", 
            "walk", 
            "cross"
        ], 
        [
            "followed", 
            "tied", 
            "brought", 
            "took"
        ], 
        [
            "go", 
            "run", 
            "fall", 
            "fly"
        ], 
        [
            "falling", 
            "running", 
            "flying", 
            "hitting"
        ], 
        [
            "tried", 
            "observed", 
            "found", 
            "studied"
        ], 
        [
            "that", 
            "which", 
            "it", 
            "what"
        ], 
        [
            "abuse", 
            "include", 
            "carve", 
            "conclude"
        ], 
        [
            "swimming", 
            "running", 
            "diving", 
            "skating"
        ], 
        [
            "old", 
            "modern", 
            "past", 
            "formal"
        ], 
        [
            "safety", 
            "excitement", 
            "danger", 
            "perfection"
        ], 
        [
            "animals", 
            "food", 
            "water", 
            "drug"
        ], 
        [
            "few", 
            "little", 
            "much", 
            "many"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "D", 
        "B", 
        "A", 
        "B", 
        "C", 
        "D", 
        "A", 
        "B", 
        "B", 
        "C", 
        "B", 
        "C", 
        "B", 
        "B"
    ], 
    "source": "high2659"
}