{
    "article": "Joe Biggs was a butcher. His shop was in a village in the beautiful south of England, and he  _  in it for many years while his father was there. Then when his father reached the age of 65, he stopped working in the shop, and Joe was alone in it, so he had to work  _  . Joe worked five and a half days a week. His shop  _  at one o'clock on Thursday, and it was closed the whole of Sunday. Saturdays were the  _  days. Most of Joe's  _  came to his shop from the nearest town, but sometimes he got up earlier than usual in the morning and  _  into the city to choose meat. It was  _  there. Joe had a big  _  in his shop, but he tried not to buy too  _  meat at a time, and to  _  it before he bought more. One  _  a woman came into the shop at five minutes to one. \"Sorry I'm late,\" she said, \"but some friends have just telephoned to say that they are coming to  _  tonight, and I need more  _  .\" Joe only had one piece of meat in the shop. He had sold all the others  _  in the day. He took the piece  _  and said to the woman, \"This is 6.5 pounds.\" \"That piece is too  _  .\" the woman said. \"Haven't you got anything bigger?\" Joe went  _  the room behind his shop, opened the refrigerator, put the piece of meat into it, took it out  _  and shut the door of the refrigerator  _  , then he brought the piece of meat back to the woman and said, \"This piece is bigger and more expensive. It's 8.75 pounds.\" \"Good,\" the woman answered with a smile, \"give me  _  of them, please.\"", 
    "options": [
        [
            "lived", 
            "studied", 
            "worked", 
            "played."
        ], 
        [
            "more", 
            "harder", 
            "later", 
            "again"
        ], 
        [
            "shut", 
            "started", 
            "opened", 
            "served"
        ], 
        [
            "hardest", 
            "easiest", 
            "quietest", 
            "busiest"
        ], 
        [
            "customers", 
            "meat", 
            "buyers", 
            "friends"
        ], 
        [
            "walked", 
            "flew", 
            "drove", 
            "ran"
        ], 
        [
            "easier", 
            "fresher", 
            "nearer", 
            "cheaper"
        ], 
        [
            "refrigerator", 
            "room", 
            "kitchen", 
            "cupboard"
        ], 
        [
            "much", 
            "expensive", 
            "fresh", 
            "adequate"
        ], 
        [
            "eat", 
            "cook", 
            "sell", 
            "freeze"
        ], 
        [
            "Thursday", 
            "Sunday", 
            "Monday", 
            "Saturday"
        ], 
        [
            "party", 
            "dinner", 
            "lunch", 
            "dance"
        ], 
        [
            "food", 
            "vegetable", 
            "meat", 
            "fruit"
        ], 
        [
            "later", 
            "earlier", 
            "quicker", 
            "cheaper"
        ], 
        [
            "in", 
            "up", 
            "away", 
            "out"
        ], 
        [
            "small", 
            "large", 
            "cheap", 
            "bad"
        ], 
        [
            "outside", 
            "from", 
            "into", 
            "through"
        ], 
        [
            "still", 
            "again", 
            "even", 
            "back"
        ], 
        [
            "carefully", 
            "quickly", 
            "lightly", 
            "heavily"
        ], 
        [
            "both", 
            "none", 
            "each", 
            "all"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "A", 
        "D", 
        "B", 
        "C", 
        "D", 
        "A", 
        "A", 
        "C", 
        "A", 
        "B", 
        "C", 
        "B", 
        "D", 
        "A", 
        "C", 
        "B", 
        "D", 
        "A"
    ], 
    "source": "high1782"
}