{
    "article": "The night started out ordinarily enough. Jack and Tara, our  _  , were in their small beds surrounded by toy animals. My husband, Pat, and I went to sleep  _  .  Sometime  after midnight, Jack quietly touched me. \"Mommy, I want to stay with you. I promise I won't take much room.\" I shifted  _  to make room. My son soon fell asleep. An hour later, Tara cried and I carefully went downstairs. \"Mommy, my  _  is all stuffed up . I can't really breathe very well. Will you please  _  with me a little while?\" Tara doesn't often get up at night,  so  I decided to be there for her. She soon fell asleep. I returned to my own bed. I was determined to sleep. But to my  _  , I found Jack sleeping on my side of the bed. He looked so  _  that I couldn't remove him. Quietly and carefully, I lay down between  Pat  and Jack. I did manage to get some sleep  _  I heard Tara's voice again. I returned to  look after  Tara. \"Mom, please lie down with me a little bit, I had a bad dream, and I'm so  _  .\" \"Of course, honey. It was only a dream. Mommy's here and  _  is okay.\" We fell asleep  _  each other's arms. Even in my sleepy state, I thought of  how soon  these nights of merry-go-round beds will be over. In their place, my twins will be grown.  No doubt  before I'm ready, our children' rooms will be much too  _  and empty. So it is especially on days when I'm worn out after a night on this mom's merry-go-round that I remind  myself  that these very days and nights are, in fact. \"the good old days\", ever so  _  .", 
    "options": [
        [
            "sons", 
            "twins", 
            "daughters", 
            "students"
        ], 
        [
            "downstairs", 
            "in", 
            "out", 
            "upstairs"
        ], 
        [
            "gently", 
            "kindly", 
            "rudely", 
            "impatiently"
        ], 
        [
            "nose", 
            "mouth", 
            "heart", 
            "eye"
        ], 
        [
            "come", 
            "stay", 
            "talk", 
            "play"
        ], 
        [
            "joy", 
            "anger", 
            "disappointment", 
            "surprise"
        ], 
        [
            "deeply", 
            "sound", 
            "content", 
            "deep"
        ], 
        [
            "before", 
            "when", 
            "after", 
            "until"
        ], 
        [
            "scared", 
            "exciting", 
            "excited", 
            "scaring"
        ], 
        [
            "something", 
            "anything", 
            "everything", 
            "nothing"
        ], 
        [
            "over", 
            "on", 
            "by", 
            "in"
        ], 
        [
            "noisy", 
            "quiet", 
            "still", 
            "calm"
        ], 
        [
            "potential", 
            "precise", 
            "precious", 
            "previous"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "A", 
        "A", 
        "B", 
        "D", 
        "C", 
        "A", 
        "A", 
        "C", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "high533"
}