{
    "article": "It was in my high school science class. I was doing a task in front of the classroom with my favorite shirt on. A  _  came. \"Nice shirt,\" I smiled from ear to ear. Then another voice said, \"That shirt belonged to my dad. Greg's mother works for my family. We were going to  _  that shirt away, but gave it to her instead.\" I was  _  . I wanted to hide.\nI stuck my shirt in the back of the closet and told my  _  what had happened. She then dialed her5 _ , \"I will no longer  _  for your family,\" she told him. That night, Mom told my dad that she couldn't just clean anymore; she knew her life's achievement was something  _  , so she decided to find another job.\nThe next morning she  _  with the personnel manager at the Board of Education. He told her that without a proper education she could not teach. So Mom decided to9 _ a university.\nAfter the first year in college, she went back to the personnel manager. He said, \"Are you serious? I think I have a  _  for you as a teacher's assistant. This  _  \ndeals with children who are mentally challenged with little or no chance of  _  .\" Mom accepted that job opportunity very  _  .\nFor almost five years, as a teacher's assistant, she saw teacher after teacher give up on the children and quit, feeling  _  . Then one day, the personnel manager and the principal showed up in her15 _ . The principal said, \"We have watched how you\n  _  the children and how they communicate with you, and we   _  your hard-working spirit over the last five years. We all  _  that you should be the teacher of this class.\"\nMy mom  _  more than twenty years there. During her career, she was voted Teacher of the Year. All of this came about because of the bad comment made in my classroom that day. Mom showed me how to handle  _  situations and never give up.", 
    "options": [
        [
            "voice", 
            "student", 
            "teacher", 
            "noise"
        ], 
        [
            "get", 
            "take", 
            "carry", 
            "throw"
        ], 
        [
            "thankful", 
            "silent", 
            "cheerful", 
            "careless"
        ], 
        [
            "father", 
            "sister", 
            "mother", 
            "classmate"
        ], 
        [
            "assistant", 
            "employer", 
            "director", 
            "adviser"
        ], 
        [
            "pay", 
            "apply", 
            "employ", 
            "work"
        ], 
        [
            "sweeter", 
            "quicker", 
            "greater", 
            "louder"
        ], 
        [
            "went", 
            "met", 
            "worked", 
            "stayed"
        ], 
        [
            "visit", 
            "build", 
            "attend", 
            "prepare"
        ], 
        [
            "position", 
            "duty", 
            "key", 
            "part"
        ], 
        [
            "event", 
            "problem", 
            "meeting", 
            "opportunity"
        ], 
        [
            "learning", 
            "judging", 
            "obeying", 
            "imagining"
        ], 
        [
            "patiently", 
            "eagerly", 
            "successfully", 
            "angrily"
        ], 
        [
            "upset", 
            "frightened", 
            "happy", 
            "comfortable"
        ], 
        [
            "home", 
            "classroom", 
            "apartment", 
            "car"
        ], 
        [
            "punish", 
            "beat", 
            "treat", 
            "touch"
        ], 
        [
            "hate", 
            "forget", 
            "admire", 
            "follow"
        ], 
        [
            "discuss", 
            "argue", 
            "disagree", 
            "agree"
        ], 
        [
            "waited", 
            "spent", 
            "took", 
            "wasted"
        ], 
        [
            "challenging", 
            "simple", 
            "dangerous", 
            "strange"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "B", 
        "C", 
        "B", 
        "D", 
        "C", 
        "B", 
        "C", 
        "A", 
        "D", 
        "A", 
        "B", 
        "A", 
        "B", 
        "C", 
        "C", 
        "D", 
        "B", 
        "A"
    ], 
    "source": "high1255"
}