{
    "article": "Coming home from school that dark winter day so long ago, I was filled with excitement of having the weekend off. But I was  _  into stillness by what I saw. Mother, seated at the far end of the sofa,  _  , with the second-hand green typewriter on the table. She told me that she couldn't type fast and then she was out of work. My shock and embarrassment at finding Mother in tears was a perfect proof of how  _  I understood the pressures on her. Sitting beside her on the sofa, I  _  began to understand. \"I guess we may all  fail  sometimes,\" Mother said quietly. I could  _  her pain and the tension of  holding back  the strong feelings that were interrupted by my arrival. Suddenly, something inside me turned. I  _  out and put my arms around her. She broke then. She put her face  _  my shoulder and sobbed . I held her  _  and didn't try to talk. I knew I was doing what I  _  , what I could and that it was enough. At that moment, feeling Mother's back with  my hand  , I understood for the first time her being so easy to  _  . She was still my mother,  _  she was something  _  : a person like me, capable of fear and  _  and failure. I could feel her pain as she must have felt mine on a thousand occasions when I sought  _  in her arms. A week later Mother took a job selling dry goods at half the salary the radio station  _  . \"It's a job I can do, though,\" she said simply. But the evening practice on the old green typewriter continued. I had a very  _  feeling now when I passed her door at night and heard her  _  away across the paper. I knew there was something more going on there than a woman learning to type.", 
    "options": [
        [
            "tired", 
            "ashamed", 
            "lazy", 
            "shocked"
        ], 
        [
            "crying", 
            "smiling", 
            "thinking", 
            "whispering"
        ], 
        [
            "eagerly", 
            "worriedly", 
            "little", 
            "much"
        ], 
        [
            "quickly", 
            "gradually", 
            "suddenly", 
            "proudly"
        ], 
        [
            "learn", 
            "watch", 
            "sense", 
            "recognize"
        ], 
        [
            "found", 
            "worked", 
            "reached", 
            "ran"
        ], 
        [
            "to", 
            "up", 
            "through", 
            "against"
        ], 
        [
            "tightly", 
            "thoughtfully", 
            "carefully", 
            "politely"
        ], 
        [
            "should", 
            "would", 
            "could", 
            "might"
        ], 
        [
            "content", 
            "break", 
            "fall", 
            "understand"
        ], 
        [
            "therefore", 
            "however", 
            "yet", 
            "though"
        ], 
        [
            "more", 
            "much", 
            "little", 
            "huge"
        ], 
        [
            "wound", 
            "defeat", 
            "cut", 
            "hurt"
        ], 
        [
            "coldness", 
            "memory", 
            "comfort", 
            "support"
        ], 
        [
            "supplied", 
            "offered", 
            "paid", 
            "contributed"
        ], 
        [
            "different", 
            "hard", 
            "pleasant", 
            "serious"
        ], 
        [
            "hitting", 
            "tapping", 
            "beating", 
            "striking"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "C", 
        "B", 
        "C", 
        "C", 
        "D", 
        "A", 
        "A", 
        "B", 
        "C", 
        "A", 
        "D", 
        "C", 
        "B", 
        "A", 
        "B"
    ], 
    "source": "high1758"
}