{
    "article": "\"Everything happens for the best, \"my mother said whenever I faced disappointment, \"If you  _  on, something good will happen some day.\" Mother was right, as I discovered after graduating from college. I had  _  myself for a sports announcer. So I went to Chicago to knock on the door of every station and was  _  every time. In one station, a kind lady told me that  _  stations wouldn't employ a person without  _  since I had just graduated. \"Go out in the town and find a small station that might give you a chance, \"she said. I returned to Dixon, where I had finished my high school education and had  _  in the school football team. My father said that our town had built a store and wanted a man to manage its sports department. The job sounded just  _  for me but I wasn't hired. My disappointment had  _  as if by design. \"Everything happens for the best,\" Mum  _  me. Dad lent me his car to look for a job. I tried WOC Radio Davenport. The program director told me they had already hired an announcer.  _  I left his office, I asked aloud,\"  _  can a fellow get to be a sports announcer if he can't get a job in a radio station?\" Suddenly, I heard the director  _  \"Do you know anything about football? \" Then he asked me to  _  an imaginary game. It was easy, and I did it without difficulty. The director was  _  and told me I would be broadcasting a game on the  _  Saturday.", 
    "options": [
        [
            "put", 
            "take", 
            "move", 
            "carry"
        ], 
        [
            "devoted", 
            "designed", 
            "found", 
            "enjoyed"
        ], 
        [
            "invited", 
            "promised", 
            "refused", 
            "accepted"
        ], 
        [
            "large", 
            "all", 
            "no", 
            "small"
        ], 
        [
            "experience", 
            "examination", 
            "agreement", 
            "college"
        ], 
        [
            "played", 
            "joined", 
            "taken", 
            "fought"
        ], 
        [
            "possible", 
            "successful", 
            "right", 
            "important"
        ], 
        [
            "shown", 
            "disappeared", 
            "resulted", 
            "turned"
        ], 
        [
            "woke", 
            "advised", 
            "demanded", 
            "reminded"
        ], 
        [
            "While", 
            "After", 
            "Before", 
            "So"
        ], 
        [
            "What", 
            "How", 
            "Whenever", 
            "Wherever"
        ], 
        [
            "calling", 
            "answering", 
            "broadcasting", 
            "announcing"
        ], 
        [
            "make", 
            "act", 
            "broadcast", 
            "play"
        ], 
        [
            "moved", 
            "sorry", 
            "thankful", 
            "satisfied"
        ], 
        [
            "future", 
            "coming", 
            "last", 
            "later"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "C", 
        "A", 
        "A", 
        "A", 
        "C", 
        "A", 
        "D", 
        "B", 
        "B", 
        "A", 
        "C", 
        "D", 
        "B"
    ], 
    "source": "high2036"
}