{
    "article": "A poor boy Howard Kelly was trying to make some money for school by selling goods. He found that he had only one coin left. He was so  _  that he decided to beg for a meal at the next house. However, he lost his courage when a lovely young  _  opened the door. Instead of asking for a meal, he asked for a drink of  _  . She smiled understandingly and brought him a  _  glass of milk. He drank it slowly and then asked, \"How much is it?\"\n\"You need pay nothing.\" she replied. \"Mother has  _  me never to accept pay for a  _  .\" As Howard  left  that house, he not only felt stronger  in body  , but it also made him believe in God and the human beings more. He was about to give up before this.\n  _  later, the young woman became very ill. She was sent to the big city,  _  Dr Howard Kelly, now famous, was called in for the treatment. When he heard the name of the  _  she came from, a  _  light filled his eyes. Immediately, he rose and went down through the hospital hall into her room. He  _  her at once. From that day on, he gave  _  attention to her case and  _  to do his best to save her life.\nAfter a long time, she recovered. The bill was sent to her room. She was  _  to open it because she knew it would  _  the rest of her life to pay it off. Finally she looked at the bill and saw these words on one side of it,\n\"Paid in full with   a glass of milk  .\"\n                    Dr Howard Kelly\nTears of  _  ran out of her eyes as she cried, \"Thank you,  _  . Your love has got around through human hearts and hands. \"", 
    "options": [
        [
            "worried", 
            "upset", 
            "ill", 
            "hungry"
        ], 
        [
            "gentleman", 
            "lady", 
            "doctor", 
            "mother"
        ], 
        [
            "soup", 
            "milk", 
            "water", 
            "wine"
        ], 
        [
            "large", 
            "small", 
            "hot", 
            "cold"
        ], 
        [
            "said", 
            "ordered", 
            "taught", 
            "allowed"
        ], 
        [
            "kindness", 
            "happiness", 
            "food", 
            "milk"
        ], 
        [
            "Days", 
            "Weeks", 
            "Months", 
            "Years"
        ], 
        [
            "when", 
            "where", 
            "then", 
            "that"
        ], 
        [
            "town", 
            "city", 
            "room", 
            "house"
        ], 
        [
            "silent", 
            "angry", 
            "strange", 
            "familiar"
        ], 
        [
            "treated", 
            "realized", 
            "recognized", 
            "saved"
        ], 
        [
            "special", 
            "small", 
            "little", 
            "large"
        ], 
        [
            "wished", 
            "ordered", 
            "made", 
            "decided"
        ], 
        [
            "afraid", 
            "excited", 
            "unable", 
            "certain"
        ], 
        [
            "pay", 
            "take", 
            "spend", 
            "cost"
        ], 
        [
            "comfort", 
            "joy", 
            "surprise", 
            "sadness"
        ], 
        [
            "Doctor", 
            "Mother", 
            "Boy", 
            "God"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "C", 
        "A", 
        "C", 
        "A", 
        "D", 
        "B", 
        "A", 
        "C", 
        "C", 
        "A", 
        "D", 
        "A", 
        "B", 
        "B", 
        "D"
    ], 
    "source": "high2451"
}