{
    "article": "He Had a Go\nIt was a cool spring evening in Melbourne, Australia.I drove to my boxing gym for a Friday night training session.After 36 _   up, I started training.Then I noticed a tall and slim young man walking through the doors.There was something about him that caught my 37 _  .\nBefore long, I realized that he might have a mental illness.Having volunteered for mental illness support groups, I really 38 _   his problems when I looked at him.\nHe paid for the session, put on a pair of gloves and then started hitting the punching bags.I watched him from a 39 _   and wanted to help him to punch straighter and better.Then I felt it was best to leave that up to the trainer who was 40 _   watching him.\nAfter a few seconds of punching the bag, he stopped and started staring at the 41 _  .The trainer went up to him and 42 _   to help him.It was almost like he woke up from a dream.He 43 _   eye contact with the ceiling at once.\nThen the bell rang and it was the end of the round.44 _   rounds we are required to do five push-ups , 45 _   all the boys that were training that night did five push-ups.He 46 _   to complete his five push-ups.The bell sounded again and the next round began.He punched the bags for a few seconds and then he 47 _  .This time he was staring at the walls which were decorated with boxing posters.\nIt was clear to me that he could not 48 _   for long.\nWhen I finished training, I decided to go up to him and offer him my help.I held the bag for him and asked him to punch.He 49 _   the bag a few times and then stopped again.\nI smiled at him and asked, \"Do you like boxing?\"\nHe replied with a very shy 50 _   on his face, \"Yes, boxing is alright.\"\nWhat else could I do than 51 _   this man and his willingness to give it a go? Most people put self-imposed 52 _   on their lives and stop themselves from having a go.I kept thinking about this man while admiring him for even turning up to a boxing gym, let alone training at what appeared to be his 53 _  .\nThere are many lessons to learn from this man.What I 54 _   admired about this man was that he had a go! That is what 55 _   ordinariness from greatness.\nSo what will you have a go at?", 
    "options": [
        [
            "lifting", 
            "running", 
            "warming", 
            "going"
        ], 
        [
            "heart", 
            "attention", 
            "breath", 
            "imagination"
        ], 
        [
            "experienced", 
            "mentioned", 
            "overcame", 
            "understood"
        ], 
        [
            "distance", 
            "box", 
            "poster", 
            "screen"
        ], 
        [
            "still", 
            "even", 
            "also", 
            "ever"
        ], 
        [
            "bags", 
            "walls", 
            "ceiling", 
            "trainer"
        ], 
        [
            "offered", 
            "promised", 
            "seemed", 
            "planned"
        ], 
        [
            "made", 
            "broke", 
            "kept", 
            "avoided"
        ], 
        [
            "Before", 
            "Through", 
            "During", 
            "Between"
        ], 
        [
            "for", 
            "but", 
            "or", 
            "so"
        ], 
        [
            "struggled", 
            "preferred", 
            "refused", 
            "decided"
        ], 
        [
            "slowed", 
            "stopped", 
            "continued", 
            "hesitated"
        ], 
        [
            "stand", 
            "stay", 
            "concentrate", 
            "remember"
        ], 
        [
            "hit", 
            "felt", 
            "grasped", 
            "watched"
        ], 
        [
            "view", 
            "look", 
            "sight", 
            "scene"
        ], 
        [
            "accept", 
            "appreciate", 
            "motivate", 
            "notice"
        ], 
        [
            "targets", 
            "burdens", 
            "limitations", 
            "minds"
        ], 
        [
            "worst", 
            "fullest", 
            "greatest", 
            "hardest"
        ], 
        [
            "really", 
            "hardly", 
            "merely", 
            "nearly"
        ], 
        [
            "prevents", 
            "protects", 
            "transforms", 
            "separates"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "D", 
        "A", 
        "C", 
        "C", 
        "A", 
        "B", 
        "D", 
        "D", 
        "A", 
        "B", 
        "C", 
        "A", 
        "B", 
        "B", 
        "C", 
        "D", 
        "A", 
        "D"
    ], 
    "source": "high2783"
}