{
    "article": "One morning, when I was 16, my father told me I could drive him to a remote village named Mijas, about 18 miles away,   _  that I take the car in to be\nserviced at a nearby  _  . Having just learned to drive, and hardly ever\nhaving the  _  to use the car, I readily accepted. I drove Dad into Mijas\nand  _  to pick him up at 4 P. M. ,then drove to a nearby garage and the\ncar  pulled up  in it. Because I had a few hours to  _  , I decided to see a\nmovie at a theater nearby. However, I was so  _  in the movie that I\ndidn't take any  _  of time. When the film was over, it was already\n6 o'clock.\n   I knew Dad would be angry if he found out I had been watching movies, and not let me drive again. A good idea   occured to  me. I drove up to Mijas until I saw Dad waiting  _  on the\ncorner, I explained to him that it was because the car had needed some major\nrepairs that I was  held up  . I will never forget the look he gave me.\n \"I'm so disappointed that you feel you have to lie to me. Jason. When you did not   turn up  , I called the garage to ask if there were any problems , and they told me\nthat you hadn't  called for  the car.\n  I can see a feeling of sadness  _  him.\n\"I'm angry, not with you but with myself. Now I am   _  that I have failed as a\nfather. I am going to walk home now and contemplate  _  I have done all\nthese years.\"\n\"But Dad, it is 18 miles to home. It's dark. You can't walk home.\"\n  My   _  , my apologies and the rest of my utterances were of no use .Dad\nwalked along the dusty roads silently in the dark,  lost in  thought. I pleaded\nall the way , telling him how sorry I was, but he simply  _  to pay\nany attention . Seeing my father in so much pain was the most painful\nexperience that I have ever faced,  _  it was also the most successful\nlesson.", 
    "options": [
        [
            "providing", 
            "supplying", 
            "offering", 
            "giving"
        ], 
        [
            "factory", 
            "station", 
            "store", 
            "garage"
        ], 
        [
            "challenge", 
            "courage", 
            "chance", 
            "potential"
        ], 
        [
            "pretended", 
            "struggled", 
            "required", 
            "commited"
        ], 
        [
            "practice", 
            "go", 
            "take", 
            "waste"
        ], 
        [
            "attracted", 
            "absorbed", 
            "addicted", 
            "adapted"
        ], 
        [
            "control", 
            "chance", 
            "notice", 
            "temper"
        ], 
        [
            "interestedly", 
            "gratefully", 
            "anxiously", 
            "casually"
        ], 
        [
            "through", 
            "on", 
            "by", 
            "in"
        ], 
        [
            "conscientious", 
            "confused", 
            "conscious", 
            "considerable"
        ], 
        [
            "what", 
            "why", 
            "where", 
            "when"
        ], 
        [
            "opinion", 
            "suggestion", 
            "opposition", 
            "thought"
        ], 
        [
            "cried", 
            "regretted", 
            "imagined", 
            "refused"
        ], 
        [
            "therefore", 
            "but", 
            "otherwise", 
            "consequently"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "C", 
        "D", 
        "B", 
        "B", 
        "C", 
        "C", 
        "D", 
        "C", 
        "A", 
        "C", 
        "D", 
        "B"
    ], 
    "source": "high1814"
}