{
    "article": "Ella Fant was a middle - aged lady who lived with her only son John in a small house. She   loved   John very much. In her   _   he couldn't do any thing wrong. Every morning she would give him breakfast in bed and bring him the papers to      _   . It isn't really true that he was too   _  to work. In fact he had tried a few    _   . First of all he was a window-cleaner and in his first week he managed to    _  at least six windows. Then he   _   a bus conductor and on his second     _   a passenger stole his bag with all the fares   collected. He even lost his job as a postman   because  he sent off all the letters when he should have taken them to people's houses. It seemed that there was   _   suitable work for him. So he   _   to join the army. Mrs Fant was so   _   about this that she told the   _   to all her neighbours. \"My John is going to be a soldier.\" She said. \"He is going to be the best soldier there   _   was, I can tell you!\"\nThen the great day came   _   he was to march past the palace in the parade  . The parade was full of sound and colour. But when John and his      fellow soldiers  came in sight, some of the people watching   couldn't help  laughing at the one who couldn't keep pace   with the others as they marched along.\nBut Ella Fant, who was filled with   _   , shouted at the top of her voice: \"Look at  _   ! They're all out of   _  except my John! Isn't he the best!\"", 
    "options": [
        [
            "hope", 
            "eyes", 
            "head", 
            "wish"
        ], 
        [
            "check", 
            "read", 
            "keep", 
            "sign"
        ], 
        [
            "lazy", 
            "young", 
            "weak", 
            "quiet"
        ], 
        [
            "one", 
            "years", 
            "weak", 
            "jobs"
        ], 
        [
            "make", 
            "drop", 
            "break", 
            "clean"
        ], 
        [
            "lowed", 
            "met", 
            "became", 
            "found"
        ], 
        [
            "day", 
            "try", 
            "route", 
            "chance"
        ], 
        [
            "some", 
            "such", 
            "less", 
            "no"
        ], 
        [
            "began", 
            "promised", 
            "managed", 
            "decided"
        ], 
        [
            "excited", 
            "worried", 
            "disappointed", 
            "surprised"
        ], 
        [
            "event", 
            "change", 
            "news", 
            "matter"
        ], 
        [
            "yet", 
            "ever", 
            "never", 
            "just"
        ], 
        [
            "where", 
            "since", 
            "when", 
            "till"
        ], 
        [
            "sadness", 
            "happiness", 
            "surprise", 
            "anger"
        ], 
        [
            "them", 
            "those", 
            "that", 
            "him"
        ], 
        [
            "sight", 
            "order", 
            "mind", 
            "step"
        ]
    ], 
    "answers": [
        "B", 
        "B", 
        "A", 
        "D", 
        "C", 
        "C", 
        "A", 
        "D", 
        "D", 
        "A", 
        "C", 
        "B", 
        "C", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "high758"
}