{
    "article": "One effective way of destroying happiness is to look at something and focus on even the smallest fault. It's like looking at the tiled ceiling and concentrating on the space where one tile is  _  Once I heard a bald man said, \"whenever I enter a room  _  I see is hair.\" Once you've  _  what your missing tile is, explore whether acquiring it will  _  make you happy. Then do one of the three things: get it, replace it with a different  _  , or forget about it and  focus on  the tiles in your life that are not missing. We all know people who have a relatively  _  life, yet are essentially unhappy. while people who have suffered a great deal but  _  remain happy. The first  _  is gratitude. All happy people are  _  . Ungrateful people cannot be happy. We tend to think that being unhappy leads people to  _  , but it's truer to say that complaining leads to people becoming unhappy. The second secret is  _  that happiness is a byproduct of something else. The most obvious  _  are those pursuit that give our lives purpose -- anything  _  studying insects to playing baseball. The more passions we have, the more happiness we are  _  to experience. Finally, the belief that something permanent goes beyond us and that our  _  has some larger meaning can help us to feel happier. We  _  a spiritual faith, or a philosophy, it should  _  this truth: if you choose to find the  _  in every situation, you will be blessed, and if you choose to find the awful, you will be cursed. As with happiness itself, this is  _  your decision to make.", 
    "options": [
        [
            "different", 
            "missing", 
            "short", 
            "broken"
        ], 
        [
            "nothing", 
            "none", 
            "all", 
            "anything"
        ], 
        [
            "determined", 
            "predicted", 
            "assumed", 
            "imagined"
        ], 
        [
            "completely", 
            "naturally", 
            "hopefully", 
            "really"
        ], 
        [
            "tile", 
            "brick", 
            "ceiling", 
            "house"
        ], 
        [
            "peaceful", 
            "difficult", 
            "easy", 
            "ordinary"
        ], 
        [
            "certainly", 
            "merely", 
            "hardly", 
            "generally"
        ], 
        [
            "secret", 
            "factor", 
            "rule", 
            "key"
        ], 
        [
            "wealthy", 
            "grateful", 
            "proud", 
            "generous"
        ], 
        [
            "upset", 
            "quarrel", 
            "complain", 
            "depress"
        ], 
        [
            "admitting", 
            "assuming", 
            "proving", 
            "realizing"
        ], 
        [
            "sources", 
            "results", 
            "answers", 
            "goals"
        ], 
        [
            "among", 
            "from", 
            "through", 
            "for"
        ], 
        [
            "probable", 
            "possible", 
            "likely", 
            "capable"
        ], 
        [
            "value", 
            "destination", 
            "survival", 
            "existence"
        ], 
        [
            "need", 
            "lack", 
            "demand", 
            "expect"
        ], 
        [
            "involve", 
            "include", 
            "absorb", 
            "mean"
        ], 
        [
            "worst", 
            "best", 
            "positive", 
            "negative"
        ], 
        [
            "absolutely", 
            "totally", 
            "exactly", 
            "largely"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "D", 
        "A", 
        "C", 
        "D", 
        "A", 
        "B", 
        "C", 
        "D", 
        "A", 
        "B", 
        "C", 
        "D", 
        "A", 
        "B", 
        "C", 
        "D"
    ], 
    "source": "high2841"
}