{
    "article": "The turning point of my life was my decision to give up a promising business career and study music. My parents, although sharing my love of music, didn't  _  it as a profession. My grandfather, having taught music for years at college and, though much  _  , earned merely enough to support his family. As a result of this  _  in the family, I went to college -----quite  _  , for although I loved my violin and spent most of my spare time practicing, I had many other  _  . Before my graduation from Columbia, I felt  _  my duty to leave college and take a job. Aside from the satisfaction of being able to  _  the family, money is all I got out of it. My only ambition was to save enough to  give up  the job and go to Europe to study  _  . I used to get up at dawn to practice  before  I left for \"downtown \"to work. . I continued to make money, and  _  , bit by bit, accumulated enough to enable me to  go abroad  . The situation of my family improved, and my help was  no longer  necessary, so I resigned from my  _  and, feeling like a man released from jail, sailed for  Europe  . I stayed four years, worked harder than I had ever dreamed of working before and  _  every minute of it. I was a  _  man and I was doing what I  _  to do and what I was meant to do. If I had stayed in business, I might be a quite wealthy man today,  _  I wouldn't have made a success of living . I would have  _  all those that money can never buy. Money is a wonderful thing, but it is possible to pay too high price on it.", 
    "options": [
        [
            "receive", 
            "accept", 
            "refuse", 
            "keep"
        ], 
        [
            "respected", 
            "hated", 
            "doubted", 
            "scolded"
        ], 
        [
            "excuse", 
            "chance", 
            "promise", 
            "example"
        ], 
        [
            "happily", 
            "sadly", 
            "hopelessly", 
            "nervously"
        ], 
        [
            "interests", 
            "pities", 
            "experiments", 
            "problems"
        ], 
        [
            "this", 
            "that", 
            "it", 
            "one"
        ], 
        [
            "question", 
            "help", 
            "warn", 
            "visit"
        ], 
        [
            "computer", 
            "law", 
            "history", 
            "music"
        ], 
        [
            "firstly", 
            "finally", 
            "generally", 
            "lately"
        ], 
        [
            "position", 
            "college", 
            "home", 
            "friends"
        ], 
        [
            "wasted", 
            "lost", 
            "forgot", 
            "enjoyed"
        ], 
        [
            "native", 
            "free", 
            "wise", 
            "weak"
        ], 
        [
            "repeated", 
            "offered", 
            "loved", 
            "signed"
        ], 
        [
            "so", 
            "and", 
            "but", 
            "for"
        ], 
        [
            "missed", 
            "gained", 
            "achieved", 
            "won"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "D", 
        "A", 
        "A", 
        "C", 
        "B", 
        "D", 
        "B", 
        "A", 
        "D", 
        "B", 
        "C", 
        "C", 
        "A"
    ], 
    "source": "high2405"
}