{
    "article": "Ever since I moved to Beijing in August, people have been telling me about the Fragrant Hills----   _   the autumn views they offer.\nSo last Sunday I   gathered up   two poor, simple laowai. We looked forward with childish   _   to golden leaves and the spiced smell of the pines in the crisp October air. After an hour-long subway and taxi   _  , we found ourselves on a vast ring road interchange,   _   with traffic and people coming from all directions. It seemed that all China had decided to come to the Fragrant Hills that day.\nThe words \"Fragrant Hills\" 41 _  a picture of natural beauty and harmony----not rows of shops and   _   vendors screaming at you to buy their goods.\nAfter half an hour of   _   through the sea of bodies, we made   _   into the park. All pretences of polite \"Britishness\" were washed away as we   _   moved people aside with two hands----the only way of making progress. A couple of times, we attempted a bit of wandering   _   the path, only to be stung by poison ivy. We sadly returned to the   _   . Then suddenly, just past a temple, we spotted a dirt track. The people  _  . We were the only ones there. There were our golden   _   and our peaceful pine forests.   _  , we collapsed onto rocks and brought out our lunchboxes.\nBut the time came   _   we had to grit our teeth and throw ourselves   _   again. It took another half hour of fruitless   _   before we could collapse into a taxi. At about 7 pm, I finally arrived at my   _   station, home sweet home, tired and aching. I had found my Fragrant Hills, my oasis of   _  , my harmony----in Chaoyang district.", 
    "options": [
        [
            "particularly", 
            "specially", 
            "surely", 
            "ly"
        ], 
        [
            "travel", 
            "excitement", 
            "interest", 
            "expectation"
        ], 
        [
            "street", 
            "ride", 
            "trip", 
            "journey"
        ], 
        [
            "crowded", 
            "busy", 
            "boiling", 
            "heavy"
        ], 
        [
            "write", 
            "show", 
            "paint", 
            "draw"
        ], 
        [
            "noisy", 
            "happy", 
            "ordinary", 
            "common"
        ], 
        [
            "walking", 
            "running", 
            "going", 
            "struggling"
        ], 
        [
            "it", 
            "one", 
            "ourselves", 
            "them"
        ], 
        [
            "slowly", 
            "quickly", 
            "physically", 
            "mentally"
        ], 
        [
            "through", 
            "off", 
            "across", 
            "on"
        ], 
        [
            "road", 
            "crowd", 
            "way", 
            "visitors"
        ], 
        [
            "lost", 
            "appeared", 
            "disappeared", 
            "came"
        ], 
        [
            "trees", 
            "sunshine", 
            "leaves", 
            "fruits"
        ], 
        [
            "Exhausted", 
            "Surprised", 
            "Excited", 
            "Disappointed"
        ], 
        [
            "which", 
            "what", 
            "that", 
            "when"
        ], 
        [
            "uphill", 
            "away", 
            "downhill", 
            "nowhere"
        ], 
        [
            "standing", 
            "yelling", 
            "waving", 
            "renting"
        ], 
        [
            "railway", 
            "bus", 
            "subway", 
            "city"
        ], 
        [
            "calm", 
            "thrill", 
            "frustration", 
            "satisfaction"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "B", 
        "C", 
        "C", 
        "A", 
        "D", 
        "A", 
        "C", 
        "B", 
        "B", 
        "C", 
        "C", 
        "A", 
        "D", 
        "B", 
        "C", 
        "C", 
        "A"
    ], 
    "source": "high1692"
}