{
    "article": "It was early in the morning, on a lonely road. It's  _  heavily. A 9-year-old boy was in the car with his mother, who was  _  him to school. Suddenly, the car went off the road, 38  _  several times, and came to rest upside down in a ditch filled with water. Luckily, both the mother and son were  _  seatbelts. The mother suffered a blow to her head and was unable to move. The boy was frightened but  _  . As water came through broken windows in the car, he  _  unbuckled himself, climbed out of the  _  window, made his way around to the driver's side, and reached inside the  _  to free his trapped mother. With great effort, he managed to  _  her, pull her through the window and up to the road, where they were soon  _  . His mother later recalled her experience of the  _  . Being unable to move or even  _  to offer instructions or encouragement to her son, she was  _  by her little son's action. She recalled  _  her boy saying out loud as he pulled her through the water, \"I think I can, I think I can!\" It seemed  _  that this little boy's act of courage was from one of his favourite books: The Little Engine that Could. In that  _  , when everyone else had  given up  hope, the Little Engine carried the heavy load of toys and good things to eat over the hill to the children waiting on the other side. He had  _  and took action. Obviously this book had left a  _  impression before the accident that rainy  _  and motivated the son to take action if the terrifying moments.", 
    "options": [
        [
            "snowing", 
            "smoking", 
            "blowing", 
            "raining"
        ], 
        [
            "ordering", 
            "driving", 
            "pushing", 
            "flying"
        ], 
        [
            "rolled", 
            "fell", 
            "moved", 
            "stopped"
        ], 
        [
            "making", 
            "watching", 
            "wearing", 
            "missing"
        ], 
        [
            "afraid", 
            "dead", 
            "tired", 
            "unhurt"
        ], 
        [
            "quickly", 
            "carefully", 
            "nearly", 
            "happily"
        ], 
        [
            "student", 
            "passenger", 
            "family", 
            "worker"
        ], 
        [
            "box", 
            "room", 
            "car", 
            "ditch"
        ], 
        [
            "respect", 
            "introduce", 
            "recognize", 
            "free"
        ], 
        [
            "accepted", 
            "rescued", 
            "welcomed", 
            "fed"
        ], 
        [
            "accident", 
            "experiment", 
            "travel", 
            "fire"
        ], 
        [
            "listen", 
            "sleep", 
            "speak", 
            "look"
        ], 
        [
            "excited", 
            "frightened", 
            "wounded", 
            "amazed"
        ], 
        [
            "seeing", 
            "hearing", 
            "smelling", 
            "feeling"
        ], 
        [
            "clear", 
            "sorry", 
            "useful", 
            "necessary"
        ], 
        [
            "poem", 
            "notice", 
            "story", 
            "dream"
        ], 
        [
            "courage", 
            "food", 
            "space", 
            "time"
        ], 
        [
            "bad", 
            "deep", 
            "false", 
            "general"
        ], 
        [
            "afternoon", 
            "night", 
            "morning", 
            "evening"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "A", 
        "C", 
        "D", 
        "A", 
        "B", 
        "C", 
        "D", 
        "B", 
        "A", 
        "C", 
        "D", 
        "B", 
        "A", 
        "C", 
        "A", 
        "B", 
        "C"
    ], 
    "source": "high537"
}