{
    "article": "Directions: For each blank in the following passage, there are four words or phrases marked A, B, C and D. Fill in each blank with the word or phrase that best fits the context.\n \n         Do you love to go shopping, but seem to spend all your hard-earned cash on just one or two items? If so, why   not consider   hunting around for cheaper, second-hand options? With a little time and patience, it's possible to find some great   _   . Take a look at the shopping alternatives which are not only lighter on your pocket, but also lots of fun!\nCar Boot   Sales\n         People bring unwanted things to a car boot sale. There, in a large car park or on a school playing field, they sell them or exchange them with other traders   _   something else. Anything from children's toys to sports equipment can   turn up   at these sales.\nSecond-hand shops\n         Good second-hand shops can be full of surprises and are often the   _   place to pick up a bargain! Many specialize in certain items such as rare books, designer clothes and old furniture . Always check things with care   _   you buy them as it may be difficult to exchange them or get the money back later. \nCharity Shops\n         People   _   used clothes , shoes, toys and other items to charity shops   _   you can usually buy them for next to nothing! The money often goes to help people who are hungry, homeless or who live in poor developing countries.\nChristmas Bazaars \n         These are wonderful places to buy handmade gifts, Christmas decorations and second-hand items. The beauty of these bazaars is that all the money   raised   usually goes to charity, so you can shop till you get tired knowing that it's all for a good cause!\n          So, next time you're in the mood to shop, instead of using your credit card, head for \"second-hand city\". You won't be   _  !", 
    "options": [
        [
            "bargains", 
            "profit", 
            "trade", 
            "costs"
        ], 
        [
            "to", 
            "at", 
            "for", 
            "on"
        ], 
        [
            "tough", 
            "rare", 
            "perfect", 
            "private"
        ], 
        [
            "before", 
            "since", 
            "unless", 
            "though"
        ], 
        [
            "pass", 
            "donate", 
            "owe", 
            "lend"
        ], 
        [
            "which", 
            "what", 
            "when", 
            "where"
        ], 
        [
            "shocked", 
            "satisfied", 
            "puzzled", 
            "disappointed"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "C", 
        "A", 
        "B", 
        "D", 
        "D"
    ], 
    "source": "high1313"
}