{
    "article": "Begin doing the work you love as soon as possible, even if you don't get paid for it, or if you can only work at it   _  . Albert Einstein was   _   to get a job as a physics professor. He could have said to himself, \"Well, I just don't have the work   to   _  . I should give up on it and settle for something else.\"   _  , he wrote the two most famous papers while   _   as a patent  office worker. After the   _  , there was not any major   _   in the world that would not have wanted him to work for them.\n   If you want to work as an artist and are   making a living   as waiter, don't think of yourself as a waiter who   _   one day to become an artist. That puts the   _   you love somewhere off in the distant future. Rather, think yourself as   an artist  , supporting yourself by waiting tables and paint, or draw as much as you can. It is   _   to earn a living wage as a waiter working 24 hours a week. That   _   plenty of time to devote to training or developing your craft  in the   _   hours.\n  While seeking the work you love   _   helps to expand your awareness into the universe of all possibilities. You don't want to be   limited to   the ideas of what you should do or what you have done before. Having opened to   _   possibilities, you can make a final   _   and select the work you love as your won.\n  Doing the work you love   _   that you be equally comfortable with the imaginative and the   _  . It requires the ability to dream big dreams and the ability to face and master all the little details that make dreams come true.", 
    "options": [
        [
            "full-time", 
            "hard", 
            "easily", 
            "part-time"
        ], 
        [
            "unable", 
            "able", 
            "unwilling", 
            "anxious"
        ], 
        [
            "science", 
            "maths", 
            "physics", 
            "money"
        ], 
        [
            "So", 
            "Instead", 
            "Therefore", 
            "And"
        ], 
        [
            "employed", 
            "regarded", 
            "worked", 
            "recognized"
        ], 
        [
            "invention", 
            "discovery", 
            "successes", 
            "papers"
        ], 
        [
            "city", 
            "factory", 
            "university", 
            "company"
        ], 
        [
            "thinks", 
            "imagines", 
            "hopes", 
            "decides"
        ], 
        [
            "man", 
            "woman", 
            "person", 
            "work"
        ], 
        [
            "impossible", 
            "possible", 
            "important", 
            "lucky"
        ], 
        [
            "sends", 
            "spares", 
            "leaves", 
            "takes"
        ], 
        [
            "on", 
            "office", 
            "business", 
            "off"
        ], 
        [
            "it", 
            "which", 
            "that", 
            "this"
        ], 
        [
            "no", 
            "all", 
            "few", 
            "both"
        ], 
        [
            "decision", 
            "plan", 
            "conclusion", 
            "judge"
        ], 
        [
            "suggests", 
            "requires", 
            "insists", 
            "encourages"
        ], 
        [
            "necessary", 
            "practical", 
            "careful", 
            "honest"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "C", 
        "B", 
        "A", 
        "A", 
        "C", 
        "C", 
        "D", 
        "B", 
        "C", 
        "D", 
        "A", 
        "B", 
        "A", 
        "B", 
        "B"
    ], 
    "source": "high336"
}