{
    "article": "The science teacher believed very strongly in practical work as a means of teaching science effectively, and she wanted her pupils' parents to see how well their children were learning  _  her methods. She therefore arranged for all the parents  to come  and see the results of one of the  _  experiments on a Saturday evening,  _  all of them were free. The children had been studying the growth of plants, and they  had planted  four pots of beans a few weeks before. They had put poor soil in one pot, to see  _  effect this would have  _  the growth of the beans in  _  ,and good soil in  the other  three pots. Then they had put one of the  _  in the dark for several days, and had given  a third  pot no water for the same length of time. At the end of the lesson on Friday afternoon, the teacher put little  _  on the four pots:'The beans in this pot were planted in poor soil.''This pot  has been kept  in the dark for four days.''These beans have had no water for four days.''These beans have had good soil, plenty of light and  _  water.' Then the teacher went home. When she arrived on  _  evening, half an hour before the  _  were due to come, she found this note beside the pots:'We read your notes  _  the school servant and thought we would help him, so we watered all the plants, changed the earth in the one with  _  soil, and  _  the light on above the one that had been left in the dark for four days. We hope that the plants will now grow  _  .' Your friends, 'The Boy Scouts.'", 
    "options": [
        [
            "by", 
            "with", 
            "in", 
            "through"
        ], 
        [
            "child", 
            "children", 
            "child's", 
            "children's"
        ], 
        [
            "when", 
            "as", 
            "because", 
            "since"
        ], 
        [
            "how", 
            "what", 
            "which", 
            "why"
        ], 
        [
            "in", 
            "on", 
            "for", 
            "with"
        ], 
        [
            "them", 
            "that", 
            "it", 
            "one"
        ], 
        [
            "beans", 
            "soil", 
            "plants", 
            "pots"
        ], 
        [
            "notes", 
            "messages", 
            "notices", 
            "announcements"
        ], 
        [
            "no", 
            "some", 
            "much", 
            "regular"
        ], 
        [
            "Friday", 
            "Saturday", 
            "Sunday", 
            "Monday"
        ], 
        [
            "children", 
            "students", 
            "parents", 
            "teachers"
        ], 
        [
            "to", 
            "for", 
            "from", 
            "on"
        ], 
        [
            "good", 
            "wet", 
            "dry", 
            "poor"
        ], 
        [
            "left", 
            "leave", 
            "kept", 
            "keep"
        ], 
        [
            "well", 
            "strong", 
            "better", 
            "good"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "A", 
        "B", 
        "B", 
        "C", 
        "D", 
        "C", 
        "D", 
        "B", 
        "C", 
        "A", 
        "D", 
        "A", 
        "C"
    ], 
    "source": "high239"
}