{
    "article": "My wife and I moved to the Cumberland Plateau of Tennessee in November, from New York to a very rural area. While moving we had the  _  of our adult daughter.\nDuring the  _  days of moving into our new home, we  ate out  n the local community a lot. One evening we decided to have a meal at a buffet style restaurant. It had been a long day of  _  boxes and furniture, and the next day would see us on the long drive back to our former home for another  _  , a thousand mile long trip. We were all  _  . But the buffet was great, and we  _  our meal feeling rested and relaxed.\nWhen I went to pay our bill,  _  in hand, the waitress cashier told me that they didn't  _  credit cards. Being from the big city, it was  _  to use a credit card. Oops!\nI had no  _  in my pocket, but about 10 miles back down the road I'd seen a bank with an ATM. I told the lady that I would  _  my family there and return in a few minutes to pay for our meals. \" Oh, you  _  do that,\" she told me. \" You just come back  _  time and pay us then.\" WHAT? I looked at her in  _  . These people had  _  seen me before, did not know if I would ever return, yet they  _  me to return to pay for three adult meals? This is not something that I had ever experienced in the big  _  , that's for sure.\nWe have lived there for almost six years, and every single week I see other acts of trust like this happening. It may be a \"country\" thing, or just  _  Southern hospitality. Whatever it is, I certainly like it, and I pass on this  _  every chance I get.", 
    "options": [
        [
            "help", 
            "advice", 
            "attention", 
            "command"
        ], 
        [
            "cold", 
            "quiet", 
            "big", 
            "busy"
        ], 
        [
            "choosing", 
            "moving", 
            "designing", 
            "watching"
        ], 
        [
            "load", 
            "sleep", 
            "visit", 
            "rest"
        ], 
        [
            "bored", 
            "tired", 
            "pleased", 
            "excited"
        ], 
        [
            "prepared", 
            "cooked", 
            "ordered", 
            "ended"
        ], 
        [
            "card", 
            "key", 
            "bill", 
            "menu"
        ], 
        [
            "believe", 
            "accept", 
            "need", 
            "admit"
        ], 
        [
            "special", 
            "necessary", 
            "common", 
            "difficult"
        ], 
        [
            "food", 
            "phone", 
            "wallet", 
            "cash"
        ], 
        [
            "send", 
            "leave", 
            "lose", 
            "show"
        ], 
        [
            "needn't", 
            "can't", 
            "shouldn't", 
            "mustn't"
        ], 
        [
            "each", 
            "last", 
            "some", 
            "that"
        ], 
        [
            "fear", 
            "satisfaction", 
            "anger", 
            "astonishment"
        ], 
        [
            "ever", 
            "seldom", 
            "never", 
            "sometimes"
        ], 
        [
            "trusted", 
            "demanded", 
            "forced", 
            "invited"
        ], 
        [
            "neighborhood", 
            "country", 
            "family", 
            "city"
        ], 
        [
            "serious", 
            "plain", 
            "unusual", 
            "formal"
        ], 
        [
            "confidence", 
            "courage", 
            "kindness", 
            "wisdom"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "B", 
        "A", 
        "B", 
        "D", 
        "A", 
        "B", 
        "C", 
        "D", 
        "B", 
        "A", 
        "C", 
        "D", 
        "C", 
        "A", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "high352"
}