{
    "article": "Zigfried, a little mouse, blew his breath on the frosty window of the farmhouse and rubbed it to see the outside. Still nobody came. Maybe today, he thought  _  . It was only a few days before Christmas and he was watching for a miracle . This farmhouse had been  _  too long. It needed a family. Zigfried's  _  made a noise. He realized that he hadn't eaten anything since yesterday. He jumped from the windowsill , took a  _  from his home, and went next door to Farmer Mike's. Farmer Mike's house had been a great place for the little mouse  _  the farmer married a wife who had a cat. Zigfried trembled  _  he thought of it. He looked around carefully as he  _  into the room where grain was stored and was quite  _  as he filled his bag with wheat. He was turning to leave when suddenly he  _  a hot breath about his ear. His heart beat  _  , and without thinking, he started to run and luckily  _  the cat's paws . The next afternoon Zigfried heard some good news: a  _  family would be moving into the farmhouse soon. Zigfried's granny would arrive on Christmas Eve to  _  with him. He hoped that the family would come before his granny came. Before long, a car came  _  the road leading to the house, with butter sandwiches, cheese and chocolate. Zigfried's Christmas miracle did arrive! The house came  _  the next few days. Zigfried  _  every single hour of them.  _  , the day before Christmas when he was drinking hot chocolate with a  _  smile at the door of his home, he heard the  _  of the children of the family about what they might get for Christmas. What? A cat? The  _  froze on his face; his mouth fell wide open. After a long while, he at last found his voice: \"Hey! Whose Christmas miracle is this?\"", 
    "options": [
        [
            "carefully", 
            "excitedly", 
            "hopefully", 
            "proudly"
        ], 
        [
            "cathy", 
            "noisy", 
            "messy", 
            "empty"
        ], 
        [
            "mouth", 
            "nose", 
            "stomach", 
            "throat"
        ], 
        [
            "bag", 
            "stick", 
            "bowl", 
            "coat"
        ], 
        [
            "although", 
            "until", 
            "after", 
            "unless"
        ], 
        [
            "if", 
            "because", 
            "when", 
            "unless"
        ], 
        [
            "broke", 
            "marched", 
            "paced", 
            "stole"
        ], 
        [
            "curious", 
            "nervous", 
            "pitiful", 
            "illegal"
        ], 
        [
            "took", 
            "held", 
            "felt", 
            "drew"
        ], 
        [
            "strongly", 
            "likely", 
            "slowly", 
            "wildly"
        ], 
        [
            "escaped", 
            "seized", 
            "rubbed", 
            "caught"
        ], 
        [
            "close", 
            "happy", 
            "new", 
            "young"
        ], 
        [
            "celebrate", 
            "communicate", 
            "compete", 
            "control"
        ], 
        [
            "across", 
            "from", 
            "off", 
            "up"
        ], 
        [
            "alive", 
            "loose", 
            "open", 
            "still"
        ], 
        [
            "counted", 
            "enjoyed", 
            "missed", 
            "wasted"
        ], 
        [
            "However", 
            "Instead", 
            "Moreover", 
            "Therefore"
        ], 
        [
            "embarrassed", 
            "forced", 
            "disappointed", 
            "satisfied"
        ], 
        [
            "introduction", 
            "discussion", 
            "revision", 
            "reduction"
        ], 
        [
            "blood", 
            "smile", 
            "tears", 
            "sweat"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "C", 
        "A", 
        "B", 
        "C", 
        "D", 
        "B", 
        "C", 
        "D", 
        "A", 
        "C", 
        "A", 
        "D", 
        "A", 
        "B", 
        "A", 
        "D", 
        "B", 
        "B"
    ], 
    "source": "high708"
}