{
    "article": "If you want your life to stand for peace and kindness, it's helpful to do kind, peaceful things. One of my  _  ways to do this is by developing my own  _  actions. These little acts of kindness are  _  to be of service and reminders of how good it feels to be  _  and helpful. We live in a rural area of the San Francisco Bay Area. Most of what we see is beauty and  _  One of the exceptions to the beauty is the  _  that some people throw out of their windows as they are  _  on the rural roads. One of the few drawbacks to  live in  the mountainous area is that public services, such as litter collection, are less  _  than those are closer to the city. A helping action that I practice  _  with my two children is picking up litter in our surrounding area. We' ve become so  _  to doing this that my daughters will often say to me in exciting  _  , \"There' s some litter, Daddy, stop the  _  !\" And if we have time, we will often pull over and pick it up. It may seem  _  , but we actually enjoy it. We pick up litter in parks, on sidewalks, practically  _  . Once I even saw a complete stranger picking up litter close to  _  we live. He smiled at me and said, \"I saw you doing it, and it seemed like a good  _  .\" Picking up litter is only one of an  _  supply of possible helping actions. You might like holding a door open for people,  _  lonely elderly people in nursing homes, or removing snow off someone else' s driveway. Perhaps you might  think of  something that seems effortless yet helpful. It' s fun, personally rewarding, and setting a good example. Everyone wins.", 
    "options": [
        [
            "favorite", 
            "familiar", 
            "difficult", 
            "different"
        ], 
        [
            "taking", 
            "placing", 
            "passing", 
            "helping"
        ], 
        [
            "customs", 
            "ceremonies", 
            "opportunities", 
            "occasions"
        ], 
        [
            "cruel", 
            "kind", 
            "proud", 
            "brave"
        ], 
        [
            "science", 
            "weather", 
            "universe", 
            "nature"
        ], 
        [
            "list", 
            "guidebook", 
            "litter", 
            "check"
        ], 
        [
            "driving", 
            "directing", 
            "floating", 
            "flying"
        ], 
        [
            "acceptable", 
            "available", 
            "horrible", 
            "honorable"
        ], 
        [
            "regularly", 
            "completely", 
            "calmly", 
            "roughly"
        ], 
        [
            "opposed", 
            "reduced", 
            "devoted", 
            "accustomed"
        ], 
        [
            "lungs", 
            "voices", 
            "sounds", 
            "noises"
        ], 
        [
            "horse", 
            "carriage", 
            "bike", 
            "car"
        ], 
        [
            "strange", 
            "sensitive", 
            "imaginable", 
            "necessary"
        ], 
        [
            "nowhere", 
            "anywhere", 
            "somewhere", 
            "everywhere"
        ], 
        [
            "why", 
            "when", 
            "which", 
            "where"
        ], 
        [
            "idea", 
            "plan", 
            "excuse", 
            "feel"
        ], 
        [
            "empty", 
            "endless", 
            "immediate", 
            "attractive"
        ], 
        [
            "describing", 
            "developing", 
            "visiting", 
            "valuing"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "C", 
        "B", 
        "D", 
        "C", 
        "A", 
        "B", 
        "A", 
        "D", 
        "B", 
        "D", 
        "A", 
        "B", 
        "D", 
        "A", 
        "B", 
        "C"
    ], 
    "source": "high1331"
}