{
    "article": "Home on the Way\nPeople need homes: children  _  their parents' place as home;  _  call school \"home\" on weekdays; married couples work together to build new homes; and travelers ... have no place to call \"home\",  at least  for a few nights. So how about people who have to travel for  _   periods of time? Don't they have the right to a home? Of course they do.\nSome regular travelers take their own  _  : like bed sheets, pillowcases and family photos to make them feel like home  no matter where  they are; some stay for long periods in the same hotel and  as a result  become very familiar with service and attendants; others may  _  put some flowers by the hotel window to make things more homely.  _  , driving a camping car during one's travels and sleeping in the vehicle at night is just like home -- only  _  !\nAnd how about maintaining relationships while in  _  ? Some keep  _  with their friends via internet; some send letters and postcards, or even photos; others may just call and say hi, just to let their friends know that they're still  _  and well. People find ways to keep in touch. Making friends on the way helps travelers feel  more or less  at home. Backpackers in youthhostelsmay become very good friends,  _  closer than siblings.\nNowadays,  _  people are working in their local towns, so how do they develop a  _  of belonging? Whenever we  step out of  our local boundaries, there is always another \"home\" waiting  to be found  . Wherever we are, with just a little bit of effort and  _  , we can make the place we stay \"home\".", 
    "options": [
        [
            "assign", 
            "assume", 
            "assist", 
            "associate"
        ], 
        [
            "boarders", 
            "farmers", 
            "scholars", 
            "residents"
        ], 
        [
            "expanded", 
            "extended", 
            "exposed", 
            "exploited"
        ], 
        [
            "belongings", 
            "property", 
            "treasure", 
            "furniture"
        ], 
        [
            "frequently", 
            "necessarily", 
            "simply", 
            "immediately"
        ], 
        [
            "However", 
            "Insetead", 
            "Furthermore", 
            "Still"
        ], 
        [
            "solid", 
            "fragile", 
            "dynamic", 
            "mobile"
        ], 
        [
            "transform", 
            "transit", 
            "transfer", 
            "translation"
        ], 
        [
            "control", 
            "connection", 
            "contact", 
            "contract"
        ], 
        [
            "busy", 
            "free", 
            "enjoyable", 
            "alive"
        ], 
        [
            "and", 
            "so", 
            "but", 
            "even"
        ], 
        [
            "fewer", 
            "more", 
            "many", 
            "most"
        ], 
        [
            "feeling", 
            "emotin", 
            "sense", 
            "expression"
        ], 
        [
            "preparation", 
            "imagination", 
            "impression", 
            "decision"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "B", 
        "A", 
        "C", 
        "C", 
        "D", 
        "B", 
        "C", 
        "D", 
        "D", 
        "B", 
        "C", 
        "B"
    ], 
    "source": "high1821"
}