{
    "article": "Everyday on the way to work I drive down a street lined with pine trees. One tree in particular  _  my attention. It must have suffered some  _  . Part of its trunk grew nearly parallel to the ground, and then in an effort to  _  its own course of life. The trunk took a 90-degree turn  _  to stand tall and stretch toward the sun. This tree became a  _  for me. Each day as I drove by, I saw this bent but determined tree and I would be  _  . It was a reminder to me that  even though  I may not have had the best start in life, I could change  _  in the parts of my life at any time. I was planning to stop one day to get a perfect  _  of my kindred-spirit tree. But that week I was  _  . After that busy week, I still didn't take any action. Every time I drove by the tree I would  _  myself, \"Tomorrow, I'll stop tomorrow to take one.\" Then one day, as I  _  by \"my\" tree, I glanced over, and much to my  _  , I found a sawed-off stump where that symbolic tree had stood. Gone. I had  put off  my plan until \"tomorrow\" and tomorrow proved to be too  _  . A picture of a tree is not of great  _  . But my lesson rang through clearly  _  I found out one of my colleagues had been  _  with stage-four cancer. He may no longer have many  _  . What have you been putting off? What would you do today if you knew you would  _  have the opportunity to do it again? Why not do those things that you have been putting off until tomorrow?", 
    "options": [
        [
            "paid", 
            "caught", 
            "fixed", 
            "escaped"
        ], 
        [
            "damage", 
            "influence", 
            "experience", 
            "defeat"
        ], 
        [
            "continue", 
            "design", 
            "change", 
            "imagine"
        ], 
        [
            "applying", 
            "attempting", 
            "happening", 
            "learning"
        ], 
        [
            "shelter", 
            "Signal", 
            "sign", 
            "symbol"
        ], 
        [
            "interested", 
            "satisfied", 
            "encouraged", 
            "educated"
        ], 
        [
            "purpose", 
            "plan", 
            "habit", 
            "direction"
        ], 
        [
            "glance", 
            "view", 
            "picture", 
            "knowledge"
        ], 
        [
            "busy", 
            "free", 
            "worried", 
            "bored"
        ], 
        [
            "call", 
            "help", 
            "tell", 
            "see"
        ], 
        [
            "wandered", 
            "drove", 
            "rode", 
            "ran"
        ], 
        [
            "surprise", 
            "pleasure", 
            "regret", 
            "happiness"
        ], 
        [
            "cold", 
            "far", 
            "sunny", 
            "late"
        ], 
        [
            "value", 
            "achievement", 
            "fun", 
            "disappointment"
        ], 
        [
            "when", 
            "before", 
            "because", 
            "unless"
        ], 
        [
            "linked", 
            "combined", 
            "provided", 
            "diagnosed"
        ], 
        [
            "lives", 
            "tomorrows", 
            "lessons", 
            "opportunities"
        ], 
        [
            "surely", 
            "almost", 
            "ever", 
            "never"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "B", 
        "D", 
        "C", 
        "D", 
        "C", 
        "A", 
        "C", 
        "B", 
        "A", 
        "D", 
        "B", 
        "A", 
        "D", 
        "B", 
        "D"
    ], 
    "source": "high1930"
}