{
    "article": "It was just getting dark. There was a touch of fog and I was on a lonely stretch of road.  _  I was going along cheerfully, thinking about the dinner I would eat when I got to Salistury . I was going along  _  at about thirty-five miles an hour when suddenly I heard a scream, a  _  scream--- \" Help! \" I looked round, but the only  _  of life was a large, black, rather suspicious--looking car just  _  a bend in the road about a hundred yards away. That was where the cry had come from. I  put on  speed and went after it. I think the driver saw what I was doing, for he did the same and began to draw  away from  me. As I drew near, the girl's voice came again, a lovely voice but trembling with  _  . \"Let me go, you coward; you're hurting me. Oh ! Oh ! \" I felt my  _  boil. The fog was coming down  _  now, and the countryside was lonelier. I had no  _  that the murderous guy in the car noticed this. Again came a cry. \"Drop that knife, you fool. Oh ! \" Then a cry and a groan . If I was to save her, it was now or  _  . Perhaps even now I was too late. But if I couldn't save the girl, I would at least try to bring the murderer to  _  . The car was only a couple of yards away now. I drove the bike right across its  _  , and its brakes screamed as the driver tried to pull it over and  _  into the ditch at the side of the road. The door of the car was pushed open angrily and a dark, evil-looking fellow stepped out . \"You fool!\" he shouted as he came towards me with his fist raised to hit me. But I was  _  than he. I put all I could into  a blow  that would have knocked out Joe Louis. It  _  him right on the point of the chin; his  _  slowly bent under him, and he dropped to the ground without a sound. I rushed to the car,  _  open the door and looked inside. There was no girl there. Suddenly from the back of the car came a voice. \"You have been listening to a radio play, Murder in Hollywood, with Mae Garbo and Clark Taylor. The news will follow immediately . \"", 
    "options": [
        [
            "And", 
            "Though", 
            "Therefore", 
            "But"
        ], 
        [
            "quietly", 
            "quickly", 
            "carefully", 
            "nervously"
        ], 
        [
            "boy's", 
            "man's", 
            "woman's", 
            "driver's"
        ], 
        [
            "person", 
            "sign", 
            "sound", 
            "form"
        ], 
        [
            "turning", 
            "crossing", 
            "going", 
            "driving"
        ], 
        [
            "joy", 
            "sorrow", 
            "fear", 
            "anger"
        ], 
        [
            "tears", 
            "heart", 
            "face", 
            "blood"
        ], 
        [
            "slighter", 
            "thicker", 
            "lower", 
            "harder"
        ], 
        [
            "need", 
            "effort", 
            "trouble", 
            "doubt"
        ], 
        [
            "never", 
            "late", 
            "ever", 
            "then"
        ], 
        [
            "justice", 
            "court", 
            "lawyer", 
            "sentence"
        ], 
        [
            "direction", 
            "path", 
            "front", 
            "nose"
        ], 
        [
            "drove", 
            "ran", 
            "crashed", 
            "sped"
        ], 
        [
            "slower", 
            "quicker", 
            "taller", 
            "heavier"
        ], 
        [
            "caught", 
            "struck", 
            "knocked", 
            "beat"
        ], 
        [
            "chin", 
            "fists", 
            "knees", 
            "body"
        ], 
        [
            "hit", 
            "brought", 
            "pushed", 
            "pulled"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "C", 
        "B", 
        "A", 
        "C", 
        "D", 
        "B", 
        "D", 
        "A", 
        "A", 
        "B", 
        "C", 
        "B", 
        "B", 
        "C", 
        "D"
    ], 
    "source": "high2394"
}