{
    "article": "A bar manager was so sure that he himself was the strongest man. Thus he made a bet and declared he would offer $1000 if  anyone  could beat him. The  _  was that the landlord would squeeze a lemon until all the  _  ran out into a beer glass, then hand the lemon to the customer. Anyone who could squeeze even one more  drop  out of the lemon would win the money. Over the years many people had tried this, truck drivers, weightlifters, karate masters, and  _  had failed. Then one day a geeky little fellow with heavy black rimmed glasses  came into  the bar and asked if he could try the challenge. After the laughter had quieted down the landlord said that it was only fair that the man should be given a  _  at the bet, so he picked up a lemon and started squeezing. Once he had done, he handed the  _  to the little man. Immediately, the little man promptly squeezed out 4 more drops of juice onto the bar! Everyone looked at the little man in  _  as the landlord handed over the prize and asked \"What do you do for a living that has given you such  _  ? Are you a lumberjack, weightlifter?\" \"No.\" the man replied, \"I work for the IRS.( )\"", 
    "options": [
        [
            "fact", 
            "trap", 
            "challenge", 
            "match"
        ], 
        [
            "flesh", 
            "juice", 
            "seeds", 
            "peel"
        ], 
        [
            "none", 
            "neither", 
            "either", 
            "all"
        ], 
        [
            "then", 
            "likely", 
            "fair", 
            "chance"
        ], 
        [
            "container", 
            "money", 
            "remains", 
            "other"
        ], 
        [
            "tears", 
            "amazement", 
            "trouble", 
            "time"
        ], 
        [
            "strength", 
            "bravery", 
            "skill", 
            "bet"
        ]
    ], 
    "answers": [
        "C", 
        "B", 
        "D", 
        "D", 
        "C", 
        "B", 
        "A"
    ], 
    "source": "high2122"
}