{
    "article": "In 1898 an 8.2 earthquake almost flattened America, killing over 30,ooo people in less than four minutes. In the middle of complete damage and disorder, a father rushed to the school where his son was supposed to be,  only to discover  that the building was  as flat as a pancake  .\nAfter the unforgettably shock, he  _  the promise he had made to his son: \" No matter  _  happens, I'll always be there for you!\" And tears began to  fill  his eyes. As he looked at the pile of ruins, it looked hopeless, but he kept remembering his  _  to his son. He rushed there and started  digging through  the ruins.\nAs he was digging, other helpless parents arrived ,  saying  : \"It's too late ! They are all dead!  Come on  , face reality; there's nothing you can do!\" To each parent he responded with  one line  : \"Are you going to help me now? \"No one helped. And then he continued to dig for his son, stone by stone.\nCourageously he went on alone because he needed to know  for himself  : \"Is my boy  _  or he is dead?\" He dug for eight hours ... 12 hours...36 hours...then , in  the 38\nth  hour , he pulled back a large stone and heard his son's  _  . He screamed his son's name, \"ARMAND!\" He heard back, \"Dad!?! It's me, Dad! I told other kids not to worry.  I told them that if you were alive, you  if  me and  _  you saved me, they'd be saved. You promised, 'No matter what happens, I'll always be there for you!' You did it, Dad!\"\n\"What's going on in there? \"the father asked\n\"There are 14 of  us  out of  33,Dad. We're scared, hungry, thirsty and thankful you are here. When the building collapsed, it made  a triangle  , and it saved us.\"\n\"Come out , boy!\"\n\"No, Dad! Let the other kids out first,  because  I know you'll get me! No matter what happens, I know you'll always be there for me!\"", 
    "options": [
        [
            "memorized", 
            "forgot", 
            "kept", 
            "remembered"
        ], 
        [
            "what", 
            "that", 
            "which", 
            "who"
        ], 
        [
            "picture", 
            "promise", 
            "present", 
            "encourage"
        ], 
        [
            "live", 
            "living", 
            "alive", 
            "lively"
        ], 
        [
            "sound", 
            "voice", 
            "noise", 
            "tone"
        ], 
        [
            "remained", 
            "missing", 
            "left", 
            "gone"
        ]
    ], 
    "answers": [
        "D", 
        "A", 
        "B", 
        "C", 
        "B", 
        "C"
    ], 
    "source": "high3081"
}