{
    "article": "Michael Greenberg is a very popular New Yorker. He is not famous in sports or the arts. But people in the streets  know about   him, especially those who are  _  .\nFor those people, he is \"Gloves\" Greenberg. How did he get that  _  ? He looks like any other businessman, wearing a suit and carrying a briefcase . But he's  _  . His briefcase always has some gloves.\nIn winter, Mr. Greenberg does not  _  like other New Yorkers, who look at the sidewalk and  hurry down  the street. He looks around at  people  . He stops when he  _  someone with no gloves. He gives them a pair and then he  moves on  , looking for more people with cold  _  .\nOn winter days, Mr. Greenberg  gives away  gloves. During the rest of the year, he  _  gloves. People who have heard about him  _  him gloves, and he has many in his apartment.\nMr. Greenberg  _  doing this 21 years ago. Now, many poor New Yorkers know him and  _  his behavior. But people who don't know him are sometimes  surprised by  him. They don't realize that he just wants to make them  _  .\nIt runs in the  _  . Michael's father always helped the poor as he believed it made everyone happier. Michael Greenberg feels the  _  . a pair of gloves may be a  _  thing, but it can make a big difference in winter.", 
    "options": [
        [
            "old", 
            "busy", 
            "kind", 
            "poor"
        ], 
        [
            "calm", 
            "name", 
            "chance", 
            "message"
        ], 
        [
            "calm", 
            "different", 
            "crazy", 
            "curious"
        ], 
        [
            "act", 
            "sound", 
            "feel", 
            "dress"
        ], 
        [
            "helps", 
            "chooses", 
            "greets", 
            "sees"
        ], 
        [
            "hands", 
            "ears", 
            "faces", 
            "eyes"
        ], 
        [
            "borrows", 
            "sells", 
            "returns", 
            "buys"
        ], 
        [
            "call", 
            "send", 
            "lend", 
            "show"
        ], 
        [
            "delayed", 
            "remembered", 
            "began", 
            "enjoyed"
        ], 
        [
            "understand", 
            "dislike", 
            "study", 
            "excuse"
        ], 
        [
            "smart", 
            "rich", 
            "special", 
            "happy"
        ], 
        [
            "city", 
            "family", 
            "neighborhood", 
            "company"
        ], 
        [
            "honor", 
            "pain", 
            "same", 
            "cold"
        ], 
        [
            "small", 
            "useful", 
            "delightful", 
            "comforting"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "B", 
        "A", 
        "D", 
        "A", 
        "D", 
        "B", 
        "C", 
        "A", 
        "D", 
        "B", 
        "C", 
        "A"
    ], 
    "source": "high233"
}