{
    "article": "What is true friendship? True friendship doesn't mean that when you need your friends' help, you will  _  them to dinner, and you will put your friends in a difficult  _  when you have to protect yourself.  On the contrary  true friendship is understanding of the souls and the  _  of the hearts. True friends are connected in hearts every minute whatever the  _  is. True friendship involves  _  : doing something for someone else while expecting nothing  in return  ; sharing thoughts and feelings  _  fear of judgment or negative criticism.  _  is essential to true friendship. We need to be able to  _  our deepest secrets with someone, without worrying that those secrets will  come up  on the Internet the next day! Failing to  _  those secrets can destroy a friendship in a hurry. True friendship has  _  to do with fame, power, or possessions. True friends  _  contact you at usual time, but come to you  each time  you need their help. They care not  _  you are, but who you are. You're not his stepping-stone to  _  but are his walking stick to  live through  difficulties. When you are happy, you are  _  to forget him, but when you are in trouble, he is the first one you will  turn to  for help.", 
    "options": [
        [
            "inform", 
            "regard", 
            "treat", 
            "advise"
        ], 
        [
            "situation", 
            "state", 
            "occasion", 
            "surrounding"
        ], 
        [
            "consideration", 
            "connection", 
            "attraction", 
            "communication"
        ], 
        [
            "distance", 
            "destination", 
            "position", 
            "ambition"
        ], 
        [
            "promise", 
            "action", 
            "belief", 
            "words"
        ], 
        [
            "with", 
            "without", 
            "despite", 
            "beyond"
        ], 
        [
            "Trust", 
            "Honesty", 
            "Kindness", 
            "Humor"
        ], 
        [
            "keep", 
            "unite", 
            "share", 
            "realize"
        ], 
        [
            "keep", 
            "prevent", 
            "protect", 
            "remain"
        ], 
        [
            "something", 
            "nothing", 
            "anything", 
            "everything"
        ], 
        [
            "frequently", 
            "regularly", 
            "seldom", 
            "usually"
        ], 
        [
            "where", 
            "who", 
            "how", 
            "what"
        ], 
        [
            "dream", 
            "future", 
            "success", 
            "aim"
        ], 
        [
            "possible", 
            "likely", 
            "probable", 
            "impossible"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "A", 
        "B", 
        "B", 
        "A", 
        "C", 
        "A", 
        "B", 
        "C", 
        "D", 
        "C", 
        "B"
    ], 
    "source": "high487"
}