{
    "article": "I dreamed I had an interview with God. \"So you would like to interview me?\" God asked. \"If you have the time,\" I said. \"My time is eternity ,\" God smiled, \"What questions do you have(1)  in mind  for me?\" \"What surprises you most about humankind?\" God answered, \"That they (2)  _  bored with childhood, they rush to grow up, and then long to be children(3)  _  . That they lost their health to make money... and then lost their money to restore their (4)  _  . Then by thinking anxiously (5)  _  the future, they forget the (6)  _  , so that they live in neither the present nor future. That they live as if they will never die, and die (7)  as though  they had never lived.\" God's hand took mine and we were silent for a while. And then I asked, \"(8)  _  a parent, what are some of life's lessons you want your children to(9)  _  ?\" He answered, \"To learn they (10)  _  make anyone love them. All they can do is to let themselves love(11)  _  . To learn that it is not good to compare themselves to others. To learn to forgive by practicing forgiveness. To learn that it only(12)  _  a few seconds to open profound wounds in those they love, and it can take many years to heal (13)  _  . To learn that a rich person is not one who has the most, but is the one who need the (14)  _  . To learn that there are people who love them(15)  _  , but simply have not yet learned how to express or show their(16)  _  . To learn that two people can look at the same thing and (17)  _  it differently. To learn that it is not enough that they forgive one(18)  another  , but they must also forgive themselves.\" \"Thank you for your(19)  _  ,\" I said humbly. \"Is there anything else you would like(20)  your children  to know?\" God smiled and said, \"Just to know that I am always here.\"", 
    "options": [
        [
            "run", 
            "live", 
            "get", 
            "prove"
        ], 
        [
            "either", 
            "too", 
            "further", 
            "again"
        ], 
        [
            "life", 
            "health", 
            "lives", 
            "spirits"
        ], 
        [
            "about", 
            "in", 
            "for", 
            "over"
        ], 
        [
            "children", 
            "living", 
            "time", 
            "present"
        ], 
        [
            "As", 
            "For", 
            "About", 
            "By"
        ], 
        [
            "listen", 
            "study", 
            "learn", 
            "attend"
        ], 
        [
            "can't", 
            "won't", 
            "needn't", 
            "mustn't"
        ], 
        [
            "others", 
            "anyone", 
            "everyone", 
            "someone"
        ], 
        [
            "gets", 
            "has", 
            "spends", 
            "takes"
        ], 
        [
            "it", 
            "them", 
            "themselves", 
            "these"
        ], 
        [
            "best", 
            "least", 
            "last", 
            "health"
        ], 
        [
            "mainly", 
            "lovely", 
            "dearly", 
            "fairly"
        ], 
        [
            "words", 
            "expressions", 
            "ideas", 
            "feelings"
        ], 
        [
            "see", 
            "watch", 
            "regard", 
            "treat"
        ], 
        [
            "time", 
            "word", 
            "belief", 
            "kindness"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "B", 
        "A", 
        "D", 
        "A", 
        "C", 
        "A", 
        "A", 
        "D", 
        "B", 
        "B", 
        "C", 
        "D", 
        "A", 
        "A"
    ], 
    "source": "high328"
}