{
    "article": "More good things come from small things About a year ago, a couple with three children moved into the apartment next door to me. I never heard any  _  from the children, but the parents were always shouting at the kids. We  _  often in the hallways when we were coming or going. I  _  spoke, but the only  _  I ever got was a hello from the four - year - old girl. I usually go out for breakfast and one day when I  _  they were just coming from their apartment and the little girl was holding the door  _  for the others. I  _  . The parents were  _  her to hurry and get in the car, I looked up and saw the little girl was  _  holding the door open,  _  for me. I hurried as much as I could and  _  her. She was smiling from ear to ear. That afternoon I saw a white toy bear, I  thought of  the little girl and said to myself, \"I  am sure  she would like that\" so I bought it. I wrote a note  _  how much her act of kindness had touched a soft spot in an old man's  _  . The next day there was a  _  on the door and  _  was the little girl and her father. She was so proud of her bear and thanked me. Then I  _  her mother and the other children were there in the hall too. The mother and father both thanked me. Now when we meet in the hall we all speak, and in a  _  manner, I might add  _  time passes, I don't hear that shouting as often. In fact, hardly at all.", 
    "options": [
        [
            "sound", 
            "noise", 
            "conversation", 
            "crying"
        ], 
        [
            "met", 
            "saw", 
            "visited", 
            "gathered"
        ], 
        [
            "never", 
            "sometimes", 
            "seldom", 
            "always"
        ], 
        [
            "reward", 
            "action", 
            "answer", 
            "prize"
        ], 
        [
            "moved", 
            "returned", 
            "started", 
            "drove"
        ], 
        [
            "open", 
            "closed", 
            "fit", 
            "active"
        ], 
        [
            "stopped", 
            "kept", 
            "worked", 
            "remained"
        ], 
        [
            "suggesting", 
            "telling", 
            "forcing", 
            "making"
        ], 
        [
            "ever", 
            "even", 
            "still", 
            "yet"
        ], 
        [
            "waiting", 
            "calling", 
            "leaving", 
            "asking"
        ], 
        [
            "replaced", 
            "encouraged", 
            "ignored", 
            "thanked"
        ], 
        [
            "saying", 
            "stating", 
            "reporting", 
            "writing"
        ], 
        [
            "mind", 
            "body", 
            "thought", 
            "heart"
        ], 
        [
            "hit", 
            "knock", 
            "drop", 
            "beat"
        ], 
        [
            "she", 
            "it", 
            "they", 
            "he"
        ], 
        [
            "noticed", 
            "watched", 
            "recognized", 
            "felt"
        ], 
        [
            "kindly", 
            "politely", 
            "coldly", 
            "friendly"
        ], 
        [
            "When", 
            "Since", 
            "As", 
            "While"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "D", 
        "C", 
        "B", 
        "A", 
        "D", 
        "B", 
        "C", 
        "A", 
        "D", 
        "A", 
        "D", 
        "B", 
        "B", 
        "A", 
        "D", 
        "C"
    ], 
    "source": "high210"
}