{
    "article": "Several months ago I was involved in a car accident. That moment  _  my views on life. All my life I had been waiting  _  I could get my driver's  _  and my first car. When I  _  got my license and my dad brought the car to the house, I felt very  _  . From that day on, the most  _  thing in my life was that car. Every day I would get home and  _  what else I could do to make it better. My car was my  _  and joy and when I had fixed it up into \"perfect\" condition, I finally began to  _  it. Every time I got into my car I felt the greatest,  as if  nothing could stop me, but one day I was  _  that just like any other person, I could be broken. One night, though it was too  _  outside to see clearly, I was in the  _  with my friends. I felt unstoppable while driving,  _  soon enough I was shown that I wasn't. While driving down a main street I felt I was  losing control of  the car. It was flying. When I  _  what was happening, the only thing I could do was protect my friends from being hurt badly. After the accident I don't remember much, but I do remember the  _  I was in, not only physical but also the thought that the lives of others were  in my hands  for a few seconds and I may have dropped them. The memory of that day will never  _  me. I learned that material things should  _  be the most important things in your life. I also learned that I need to appreciate the things and people around me.", 
    "options": [
        [
            "formed", 
            "changed", 
            "replaced", 
            "moved"
        ], 
        [
            "until", 
            "after", 
            "when", 
            "since"
        ], 
        [
            "test", 
            "guide", 
            "advice", 
            "license"
        ], 
        [
            "finally", 
            "happily", 
            "actually", 
            "immediately"
        ], 
        [
            "interested", 
            "surprised", 
            "excited", 
            "embarrassed"
        ], 
        [
            "difficult", 
            "comfortable", 
            "successful", 
            "important"
        ], 
        [
            "notice", 
            "watch", 
            "see", 
            "find"
        ], 
        [
            "pride", 
            "memory", 
            "task", 
            "inspiration"
        ], 
        [
            "repair", 
            "check", 
            "drive", 
            "clean"
        ], 
        [
            "shown", 
            "decided", 
            "thought", 
            "appeared"
        ], 
        [
            "cold", 
            "wet", 
            "dark", 
            "fine"
        ], 
        [
            "office", 
            "house", 
            "school", 
            "car"
        ], 
        [
            "so", 
            "because", 
            "but", 
            "before"
        ], 
        [
            "expected", 
            "realized", 
            "accepted", 
            "wondered"
        ], 
        [
            "situation", 
            "surprise", 
            "hospital", 
            "pain"
        ], 
        [
            "impress", 
            "leave", 
            "trouble", 
            "interrupt"
        ], 
        [
            "always", 
            "sometimes", 
            "never", 
            "mainly"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "D", 
        "A", 
        "C", 
        "D", 
        "C", 
        "A", 
        "C", 
        "A", 
        "C", 
        "D", 
        "C", 
        "B", 
        "D", 
        "B", 
        "C"
    ], 
    "source": "high877"
}