{
    "article": "Canadian smart phone maker Research In Motion (RIM), which makes the BlackBerry, says it's back. The company is   _   to reclaim a market it once dominated by   _   two new devices. The last few years have been a painful time for the company as customers deserted its platform in   _   of newer and more   _   devices. This may be the company's last chance to 40 _  a vital player in an increasingly crowded marketplace.\n    Two brand new devices are perhaps a fresh   _   for a company that has seen its global market share   _   from 20 percent three years ago to just over 3 percent today.\n    For BlackBerry CEO Thorsten Heins, it's another chance to remake a faded   _  . \"We have   _   been on a journey of transformation, not only a journey to transform our business and our brand,   _   one that I truly   _   transforms mobile communications into true mobile computing,\" he said. \n    The company promises the same   _   level of network security the BlackBerry is known for, 48 along with  a fast new browser and a more intuitive operating system. The Z10   _   much like the touch-screen phones popularized by its competitors, but the Q10 maintains the \"qwerty\" keyboard that has become BlackBerry's trademark.\n               Besides the technical and cosmetic   updates, Heins says the company will no longer be called RIM or Research In Motion. \n   \"Our customers use a BlackBerry, our   _   work for BlackBerry and our shareholders are owners of BlackBerry. From today on, we are BlackBerry 51 _  in the world,\" he said. \n    Shareholders will be watching if customers   _   the new devices. The company's stock has dropped as much as 90 percent in the last four years as it lost   _   to competitors. But company shares have doubled in the last four months as anticipation    _   for the new models.\nAnalysts say the new devices could make or   _   a company, which many people praise for starting the technological revolution in smart-phones.", 
    "options": [
        [
            "refusing", 
            "trying", 
            "urging", 
            "pretending"
        ], 
        [
            "introducing", 
            "reviewing", 
            "rejecting", 
            "discovering"
        ], 
        [
            "favor", 
            "charge", 
            "honor", 
            "defense"
        ], 
        [
            "popular", 
            "expensive", 
            "complicated", 
            "familiar"
        ], 
        [
            "replace", 
            "react", 
            "remain", 
            "reset"
        ], 
        [
            "record", 
            "dilemma", 
            "end", 
            "start"
        ], 
        [
            "lose", 
            "increase", 
            "rise", 
            "fall"
        ], 
        [
            "brand", 
            "trade", 
            "technique", 
            "phone"
        ], 
        [
            "specially", 
            "definitely", 
            "doubtfully", 
            "essentially"
        ], 
        [
            "and", 
            "or", 
            "but", 
            "so"
        ], 
        [
            "agree", 
            "believe", 
            "suspect", 
            "deny"
        ], 
        [
            "high", 
            "average", 
            "backward", 
            "normal"
        ], 
        [
            "sounds", 
            "smells", 
            "looks", 
            "finds"
        ], 
        [
            "employees", 
            "consumers", 
            "s", 
            "competitors"
        ], 
        [
            "however", 
            "whenever", 
            "nowhere", 
            "everywhere"
        ], 
        [
            "adapt", 
            "adjust", 
            "adopt", 
            "advocate"
        ], 
        [
            "land", 
            "ground", 
            "soil", 
            "earth"
        ], 
        [
            "dropped", 
            "changed", 
            "remained", 
            "grew"
        ], 
        [
            "desert", 
            "abandon", 
            "break", 
            "deny"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "A", 
        "A", 
        "C", 
        "D", 
        "D", 
        "A", 
        "B", 
        "C", 
        "B", 
        "A", 
        "C", 
        "A", 
        "D", 
        "C", 
        "B", 
        "D", 
        "C"
    ], 
    "source": "high2798"
}