{
    "article": "In a land far away, once upon a time there was great poverty ,and only the rich could manage without great  _  . Three of those rich men and their servants were  _  together on a road when they came to a very  _  village. The first could not stand seeing the poverty,  _  he took all the gold and jewels from his wagons and shared  _  out among the villagers. He wished them all the best of luck, and he left. The second rich man ,seeing the  _  situation, stopped for a short time and gave  the villagers  all his food and drink, since he  _  see that money would be of little  _  to them. He made sure that they each  _  their fair share and would have enough food to  _  for some time . Then, he left. The third rich man, on seeing such poverty,  speeded  and went straight through the  _  without stopping. The two other rich men saw this from a distance and commented with each other  _  the third rich man lacked sympathy. It was  _  that they themselves had been there to offer help. However, three days later, they  _  the third rich man ,who was coming in the opposite direction . He was  _  travelling quickly, but his wagons,  instead of  the gold and valuables they had been  _  ,were now full of farming tools and bags of  _  .He was rushing back to help them out of poverty.", 
    "options": [
        [
            "loss", 
            "expectations", 
            "success", 
            "problems"
        ], 
        [
            "standing", 
            "travelling", 
            "gathering", 
            "running"
        ], 
        [
            "faraway", 
            "poor", 
            "different", 
            "ancient"
        ], 
        [
            "unless", 
            "because", 
            "so", 
            "if"
        ], 
        [
            "them", 
            "anything", 
            "nothing", 
            "those"
        ], 
        [
            "curious", 
            "worrying", 
            "dangerous", 
            "puzzling"
        ], 
        [
            "could", 
            "might", 
            "should", 
            "must"
        ], 
        [
            "interest", 
            "concern", 
            "use", 
            "attraction"
        ], 
        [
            "returned", 
            "gained", 
            "offered", 
            "received"
        ], 
        [
            "remain", 
            "last", 
            "supply", 
            "share"
        ], 
        [
            "village", 
            "land", 
            "field", 
            "road"
        ], 
        [
            "whether", 
            "how", 
            "where", 
            "when"
        ], 
        [
            "good", 
            "certain", 
            "true", 
            "strange"
        ], 
        [
            "welcomed", 
            "met", 
            "taccepted", 
            "persuaded"
        ], 
        [
            "still", 
            "already", 
            "always", 
            "indeed"
        ], 
        [
            "loading", 
            "treasuring", 
            "carrying", 
            "earning"
        ], 
        [
            "food", 
            "jewels", 
            "money", 
            "seeds"
        ]
    ], 
    "answers": [
        "D", 
        "B", 
        "B", 
        "C", 
        "A", 
        "B", 
        "A", 
        "C", 
        "D", 
        "B", 
        "A", 
        "B", 
        "A", 
        "B", 
        "A", 
        "C", 
        "D"
    ], 
    "source": "high2117"
}