{
    "article": "I believe the best heroes are often the ones who haven't been publicly recognized. They're someone's hero just by living their life as  _  , not necessarily struggling for anything particular outside of survival. They're everyday ordinary people.  _  , my greatest hero without doubt isn't a famous person or someone who has a rags-to-riches story. In fact, this person isn't a  _  at all, but a heroine: my mother, who has been my greatest source of inspiration . A brief glance into this  _  woman's life makes it clear. My mother was married to a man who drank like a fish almost every day. As Mother  _  o us later in life, she simply didn't want us to be  _  by my father. So, one day she packed her seven kids into an old wagon , and headed back down south to Montgomery, Alabama. At five foot three, she was a black lady with a small figure, with no college education. She did whatever she had to do to  _  as a single parent and to successfully  _  all her children to adulthood. By high school I had started to  _  my mother had achieved something  _  as a single parent. Then, when I was seventeen years old, I signed up for the Marine Corps. The day I  _  for basic training, my mother told me, a very thin and nervous black kid, four  _  words: \"Just do your best.\" That  _  may be a cliche , but coming from her , it has given me a lifetime of powerful inspiration. I've had my  _  of ups and downs in my life. Whenever meeting with any difficulty, I would  _  to myself, \"If Mother overcame her challenges, I have no  _  not to do the same.\"  _  I grew, I admired her for what she had achieved. I graduated from community college with highest  _  , and now I'm a student at Columbia University. Every step of the  _  , I've been encouraged by the inspiration of my mother -- my heroine. I've never  _  . I've tried to do my best.", 
    "options": [
        [
            "much", 
            "usual", 
            "well", 
            "active"
        ], 
        [
            "Indeed", 
            "Otherwise", 
            "Therefore", 
            "Altogether"
        ], 
        [
            "hero", 
            "model", 
            "heroine", 
            "example"
        ], 
        [
            "educated", 
            "famous", 
            "generous", 
            "unusual"
        ], 
        [
            "explained", 
            "replied", 
            "devoted", 
            "responded"
        ], 
        [
            "employed", 
            "fooled", 
            "influenced", 
            "missed"
        ], 
        [
            "escape", 
            "survive", 
            "hide", 
            "recover"
        ], 
        [
            "raise", 
            "add", 
            "enrich", 
            "attract"
        ], 
        [
            "believe", 
            "imagine", 
            "determine", 
            "realize"
        ], 
        [
            "exciting", 
            "interesting", 
            "tiring", 
            "amazing"
        ], 
        [
            "waited", 
            "returned", 
            "left", 
            "came"
        ], 
        [
            "honest", 
            "simple", 
            "useless", 
            "extra"
        ], 
        [
            "answer", 
            "praise", 
            "expression", 
            "encouragement"
        ], 
        [
            "movement", 
            "experiences", 
            "origin", 
            "advantage"
        ], 
        [
            "think", 
            "lie", 
            "react", 
            "object"
        ], 
        [
            "demand", 
            "ability", 
            "cause", 
            "excuse"
        ], 
        [
            "As", 
            "Though", 
            "Unless", 
            "Before"
        ], 
        [
            "honors", 
            "flame", 
            "pressure", 
            "purpose"
        ], 
        [
            "escape", 
            "danger", 
            "way", 
            "hope"
        ], 
        [
            "appeared", 
            "stopped", 
            "knocked", 
            "glanced"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "D", 
        "A", 
        "C", 
        "B", 
        "A", 
        "D", 
        "D", 
        "C", 
        "B", 
        "C", 
        "B", 
        "A", 
        "D", 
        "A", 
        "A", 
        "C", 
        "B"
    ], 
    "source": "high1918"
}