{
    "article": "I truly feel that my mother led me here, to Morzaine, and to my future as a happy wife and businesswoman. When Mum  _  in October 2007, I was a cook. In December that year, while I was working for a wedding, a pearl necklace Mum had left me  _  . I was distraught . Some days later, I was  _  that a guy who was working with us that day, \"could probably have made a fortune  _  the necklace he found.\"  _  , he returned it. Hearing how I'd  _  Mum for six months before her death, he said, \"Christmas is going to be  _  --why not go out to the Alps for a couple of weeks?\" I came to Morzaine, a small, friendly village in the Alps and  _  fell in love with it. What was  _  to be a stopgap trip turned into a new life. I kept traveling between London and here and felt  _  than I had in months. In December 2008, I was  _  as a hotel manager and moved here full time. A month later, I met Paul, who was traveling here. We fell in love. In the beginning, I didn't want to discuss  _  , because the sadness of losing Mum  _  felt great. Paul understood that and never  _  me. But, by summer, we got married. A year later, we used his saving, and the money from the sale of Mom's house, to build our own  _  . We want to give our guests a  _  feel, so each room is themed (......) around memories from our lives. There are also styles to remind me of Mom--a tiny chair which  used to  be in her bedroom is set in one room. We are having a wonderful life and Mum  _  naturally part of it,  _  there's no way we would be here if it wasn't for the  _  she gave me. I know she's here in spirit, keeping an eye on us.", 
    "options": [
        [
            "died", 
            "came", 
            "returned", 
            "visited"
        ], 
        [
            "burned", 
            "disappeared", 
            "broke", 
            "dropped"
        ], 
        [
            "shown", 
            "comforted", 
            "persuaded", 
            "told"
        ], 
        [
            "hiding", 
            "stealing", 
            "selling", 
            "wearing"
        ], 
        [
            "Luckily", 
            "Naturally", 
            "Surely", 
            "Hopefully"
        ], 
        [
            "nursed", 
            "cured", 
            "missed", 
            "guarded"
        ], 
        [
            "long", 
            "hard", 
            "merry", 
            "free"
        ], 
        [
            "suddenly", 
            "finally", 
            "nearly", 
            "immediately"
        ], 
        [
            "said", 
            "proved", 
            "supposed", 
            "judged"
        ], 
        [
            "smarter", 
            "higher", 
            "firmer", 
            "lighter"
        ], 
        [
            "honored", 
            "hired", 
            "regarded", 
            "trained"
        ], 
        [
            "travel", 
            "business", 
            "children", 
            "marriage"
        ], 
        [
            "recently", 
            "once", 
            "still", 
            "first"
        ], 
        [
            "left", 
            "pushed", 
            "surprised", 
            "interrupted"
        ], 
        [
            "hotel", 
            "restaurant", 
            "home", 
            "shop"
        ], 
        [
            "homely", 
            "lively", 
            "motherly", 
            "friendly"
        ], 
        [
            "takes", 
            "keeps", 
            "looks", 
            "feels"
        ], 
        [
            "unless", 
            "while", 
            "because", 
            "though"
        ], 
        [
            "money", 
            "chair", 
            "house", 
            "necklace"
        ]
    ], 
    "answers": [
        "A", 
        "B", 
        "D", 
        "C", 
        "A", 
        "A", 
        "B", 
        "D", 
        "C", 
        "D", 
        "B", 
        "D", 
        "C", 
        "B", 
        "A", 
        "A", 
        "D", 
        "C", 
        "D"
    ], 
    "source": "high32"
}