{
    "article": "\"How does the yard look?\" My father asked, with his eyes shining. I could tell he was eagerly waiting for my  _  . \"Wonderful!\" I replied after I gave it a thorough  _  . Then I recited all the changes I had  _  in his yard and he smiled contently.\nWhen I was young, my mother  passed away  in a car accident, leaving my father alone to  _  their three young daughters. At the beginning, life was not always  _  and my younger sisters usually complained. However, Dad always  _  us to believe that life was good. Meanwhile, he tried his best to  _  that belief.\nIn 1972, my dad developed a piece of waste land that had been  _  on Okaloosa Island. Every year at the first sign of  _  , he would begin spending countless hours working there to make it be bursting with colors. Through his continuous hard work, the land  _  turned into a beautiful garden with different types of flowers and other unique plants. While our friends were enjoying their vacation through traveling to different places, we were  _  working with my dad in his yard, watering the flowers, weeding or cutting off the branches. Sometimes, our friends were envious of our working vacation, and we would  _  them. Dad made his yard very  _  so that it became our vacation paradise during our childhood.\nFor so many years, when we were  _  , we liked to visit Dad's yard, because it could  _  us of Dad's belief. It was Dad and his yard that gave us  _  that enabled us to survive and  _  major challenges in life. One day, it shocked us that Dad said he would not  _  the yard. Then he explained, \"Twenty years ago I decided to start my work in that yard to tell you life is good. Now my work is done.\" We were sitting in  _  , recalling what we had experienced. Life was good. Dad was right.", 
    "options": [
        [
            "excuse", 
            "answer", 
            "decision", 
            "suggestion"
        ], 
        [
            "clean", 
            "suggestion", 
            "inspection", 
            "arrangement"
        ], 
        [
            "achieved", 
            "imagined", 
            "discovered", 
            "promised"
        ], 
        [
            "scold", 
            "raise", 
            "rescue", 
            "persuade"
        ], 
        [
            "smooth", 
            "sorrowful", 
            "wealthy", 
            "lonely"
        ], 
        [
            "forced", 
            "allowed", 
            "authorized", 
            "encouraged"
        ], 
        [
            "change", 
            "prove", 
            "understand", 
            "criticize"
        ], 
        [
            "advertised", 
            "abandoned", 
            "disappeared", 
            "provided"
        ], 
        [
            "spring", 
            "summer", 
            "autumn", 
            "winter"
        ], 
        [
            "suddenly", 
            "gradually", 
            "temporarily", 
            "occasionally"
        ], 
        [
            "impatiently", 
            "carelessly", 
            "happily", 
            "unwillingly"
        ], 
        [
            "invite", 
            "challenge", 
            "accompany", 
            "consult"
        ], 
        [
            "unnecessary", 
            "unreasonable", 
            "disgusting", 
            "extraordinary"
        ], 
        [
            "confident", 
            "angry", 
            "guilty", 
            "low"
        ], 
        [
            "warn", 
            "accuse", 
            "remind", 
            "inform"
        ], 
        [
            "emotion", 
            "choices", 
            "strength", 
            "opportunities"
        ], 
        [
            "forget", 
            "admit", 
            "create", 
            "conquer"
        ], 
        [
            "continue", 
            "sell", 
            "challenge", 
            "extend"
        ], 
        [
            "safety", 
            "despair", 
            "doubt", 
            "silence"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "C", 
        "B", 
        "A", 
        "D", 
        "B", 
        "B", 
        "A", 
        "B", 
        "C", 
        "A", 
        "D", 
        "D", 
        "C", 
        "C", 
        "D", 
        "A", 
        "D"
    ], 
    "source": "high179"
}