{
    "article": "It was the end of the week at the village school. The bell had rung, and the children had run out into the bright sunshine, wild with laughter and fun. All were happy but poor Davy. He came out last and very  _  . He was in trouble, and the bright, golden sunlight did not make him  _  . He walked across the yard, and sat down on a stone behind the old maple. A little bird on the highest branch sang just to make him  _  . But Davy did not notice it. He was thinking of the  _  words that had been said about his ragged clothes. The  _  stole out of his eyes, and ran down his cheeks. Poor little Davy had no  _  , and his mother had to work hard to keep him at school all by herself. He did not wish to trouble his mother; so he  _  among the trees , and at last threw himself on the green moss under them. Just then his beloved teacher Mrs. Smith came  _  . She saw who it was, smith stopped to ask what was the  _  . Davy did not speak, but the tears began to start. Mrs. Smith waited patiently  _  Davy told her all his  trouble. When he ended, she said  _  , \"Davy. I have a plan which I think will help you.\" \"Oh , what is it ?\" He said, sitting up with a look of  _  while a tear fell upon a blue violet. \"Well, how would you like to be a little flower  _  ? And earn money?\" \"That would be jolly. But where shall I get my flowers?\" he asked. \"  Look around  my boy, the answer to the question is just right in there  _  .\" said Mrs. Smith. \"Here are lively blue violets, down by the brook are white ones, and among the rocks are ferns and mosses.  _  them all to my house, and I will help you  _  them.\" Davy nodded and went home happily. Day after day. Davy hunted the woods for the  _  flowers, and the most beautiful ferns and mosses. After his teacher had helped him with new clothes. But for the  _  , and sold them. He soon carted enough money to buy new clothes. But for the  _  of his teacher, he couldn't have solved his problem. Now he could see the bright sunshine and hear the bird's singing.", 
    "options": [
        [
            "steadily", 
            "slowly", 
            "rapidly", 
            "happily"
        ], 
        [
            "upset", 
            "worried", 
            "glad", 
            "tired"
        ], 
        [
            "cry", 
            "run", 
            "think", 
            "laugh"
        ], 
        [
            "cruel", 
            "kind", 
            "generous", 
            "scary"
        ], 
        [
            "sweat", 
            "tears", 
            "water", 
            "sunshine"
        ], 
        [
            "classmates", 
            "nephew", 
            "father", 
            "friends"
        ], 
        [
            "jogged", 
            "jumped", 
            "marched", 
            "wandered"
        ], 
        [
            "about", 
            "along", 
            "after", 
            "into"
        ], 
        [
            "matter", 
            "thing", 
            "question", 
            "time"
        ], 
        [
            "after", 
            "before", 
            "when", 
            "until"
        ], 
        [
            "cheerily", 
            "fluently", 
            "gratefully", 
            "casually"
        ], 
        [
            "anxiety", 
            "hope", 
            "doubt", 
            "disappointment"
        ], 
        [
            "assistant", 
            "farmer", 
            "merchant", 
            "teacher"
        ], 
        [
            "yards", 
            "fields", 
            "sunshine", 
            "woods"
        ], 
        [
            "Bring", 
            "Leave", 
            "Rate", 
            "Pick"
        ], 
        [
            "arrange", 
            "adjust", 
            "sell", 
            "fade"
        ], 
        [
            "wildest", 
            "prettiest", 
            "smallest", 
            "strangest"
        ], 
        [
            "remote", 
            "crowded", 
            "modern", 
            "near"
        ], 
        [
            "comfort", 
            "aid", 
            "connection", 
            "warning"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "D", 
        "A", 
        "B", 
        "C", 
        "D", 
        "B", 
        "A", 
        "D", 
        "A", 
        "B", 
        "C", 
        "D", 
        "A", 
        "A", 
        "B", 
        "D", 
        "B"
    ], 
    "source": "high331"
}