{
    "article": "Armed with two over-packed suitcases, we arrived at the airport just in time for my flight. As I watched her unload my luggage, I could see the  _  in her eyes. One last hug and a final good-bye, and I would be on my way to a new life  _  .\" You'd better go or you'll miss your flight,\" she said. \"I'll  miss  you,\" I replied, and with those words I  was off  . By the time I reached the customs, I was  _  . While boarding the plane I was still crying. I did not have the  _  to put my bag in the overhead locker, so I put it on the  _  seat next to mine. Born just fifteen months apart, we not only looked alike, we were alike. We both had that same mix of  _  and fear of all things unknown to us. One sunny summer day I was playing outside when she came  _  to me and said, \" Want to come to the attic ?\" The answer was always \"  _  \". We were frightened of the attic but also  _  by its smells and sounds. Together we would get through masses of dust and look through a lot of boxes  _  we found what we needed. The plane shook  _  and my bag fell onto the floor. My aspirin, hairbrush and some other things were  _  on the floor. I  _  over to gather them up when I saw a(an)  _  little book in the middle of my belongings. It was a diary. Immediately I  _  my sister's handwriting. \"Hi, Sis. What a day it has been today. You let me know that you are moving abroad...\" Only  _  did I realize that my sister had been  _  a diary for the past month. I read about my sister's comings and goings during the flight. Even though a large ocean  _  us, at some point it felt like she was actually there.", 
    "options": [
        [
            "honesty", 
            "concern", 
            "sadness", 
            "satisfaction"
        ], 
        [
            "abroad", 
            "home", 
            "again", 
            "along"
        ], 
        [
            "smiling", 
            "thinking", 
            "sighing", 
            "sobbing"
        ], 
        [
            "courage", 
            "energy", 
            "idea", 
            "spirit"
        ], 
        [
            "full", 
            "big", 
            "black", 
            "empty"
        ], 
        [
            "curiosity", 
            "anxiety", 
            "sympathy", 
            "worry"
        ], 
        [
            "about", 
            "across", 
            "down", 
            "up"
        ], 
        [
            "No", 
            "Yes", 
            "Sorry", 
            "Certain"
        ], 
        [
            "surprised", 
            "bored", 
            "attracted", 
            "interested"
        ], 
        [
            "until", 
            "unless", 
            "though", 
            "since"
        ], 
        [
            "hardly", 
            "slightly", 
            "weakly", 
            "heavily"
        ], 
        [
            "spread", 
            "put", 
            "pulled", 
            "pushed"
        ], 
        [
            "turned", 
            "lay", 
            "bent", 
            "looked"
        ], 
        [
            "similar", 
            "unfamiliar", 
            "important", 
            "unimportant"
        ], 
        [
            "knew", 
            "saw", 
            "observed", 
            "recognized"
        ], 
        [
            "when", 
            "that", 
            "then", 
            "this"
        ], 
        [
            "keeping", 
            "writing", 
            "using", 
            "making"
        ], 
        [
            "faced", 
            "separated", 
            "surrounded", 
            "blocked"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "B", 
        "D", 
        "A", 
        "D", 
        "B", 
        "C", 
        "A", 
        "D", 
        "A", 
        "C", 
        "B", 
        "D", 
        "C", 
        "A", 
        "B"
    ], 
    "source": "high470"
}