{
    "article": "Being alone in outer space can be  _  . That is one reason why astronauts on solo space flights were given plenty of work to keep them  _  . They were also in constant communication with people on the earth.  However  , being with people from whom you cannot get away might be even harder than being alone. This is what happens on long submarine voyages. It will also happen on  _  space flights in the future. Will there be special problems of adjustment under such conditions? Scientists have studied the reactions of men to one another during long submarine voyages. They have also found that the longer the voyage lasts, the more serious the problem of  _  is. When men are  shut up  together for a long period, they begin to feel  _  . Everyone has little habits of speaking and behaving that are ordinarily acceptable. In the limited space over a long period of time, however, these little habits may become very  _  . Apparently, although no one wants to be  _  all the time, everyone needs some degree of privacy. When people are enclosed together, they are in what is called stress situation. That means that they are under an unusual amount of  _  or stress. People who are well-adjusted are able to  _  stress situations better than others. That is one reason why so much care is taken in  _  our astronauts. These men undergo a long period of testing and training. One of the things tested is their behavior under stress, and thus they can do better than ordinary people.", 
    "options": [
        [
            "excited", 
            "frightening", 
            "confusing", 
            "brave"
        ], 
        [
            "tired", 
            "asleep", 
            "conscious", 
            "busy"
        ], 
        [
            "long", 
            "fast", 
            "dangerous", 
            "direct"
        ], 
        [
            "fuel", 
            "entertainment", 
            "adjustment", 
            "health"
        ], 
        [
            "uneasy", 
            "interested", 
            "comfortable", 
            "excited"
        ], 
        [
            "pleasing", 
            "annoying", 
            "common", 
            "valuable"
        ], 
        [
            "noisy", 
            "alone", 
            "personal", 
            "sociable"
        ], 
        [
            "emphasis", 
            "conflict", 
            "power", 
            "pressure"
        ], 
        [
            "handle", 
            "create", 
            "affect", 
            "investigate"
        ], 
        [
            "becoming", 
            "choosing", 
            "ordering", 
            "promoting"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "A", 
        "C", 
        "A", 
        "B", 
        "B", 
        "D", 
        "A", 
        "B"
    ], 
    "source": "high800"
}