{
    "article": "Over the years, thanks to my life's obstacles , I understood the meaning of faith and the strong will to survive. It was Hurricane Ike that made me fully  _  the beauty of our strength and a human's motivation to  _  . Mom had a two-week  _  in summer. While we enjoyed our holiday in Southeast Texas, we didn't realize the fact that Ike  _  cause months and likely years of \"labor\". By September 7 , the \"eyes of Texas\" were watching Hurricane Ike more  _  , making the typical mad rush for last-minute hurricane  _  . Two days later, both oil and ice were in  _  demand. In the early hours of September 11 , some neighbors were planning to  get through  the storm in their homes,  _  others were making final preparations to get away. At first, we decided to stay. But that afternoon, the Houston-Galveston area would be on the more  _  side of the storm. Mom and I packed some of our most  _  belongings in the car and  headed for  the East Texas town of Lufkin. As Ike pushed farther inland, we  _  power in Lufkin. On Sunday, our next-door neighbor told us via cell phone that our  _  had remained well. Our hopes could not have been  _  . But a few hours later, the neighbors reported that our brick chimney had  _  , and it was sitting on our living room,  _  a hole in the roof between two skylights . We wouldn't be allowed to return home  _  September 17 . I climbed upstairs, and looked toward the hole in the roof which showed a beautiful blue sky. Without hesitation, I shouted, \"Wow! A third skylight!\" My neighbors could not believe I was making jokes  instead of  crying, but  _  is always good medicine. It was with that joke that I knew, given time, everything would be okay.", 
    "options": [
        [
            "observe", 
            "appreciate", 
            "explore", 
            "improve"
        ], 
        [
            "work", 
            "apologize", 
            "recover", 
            "change"
        ], 
        [
            "vacation", 
            "journey", 
            "meeting", 
            "schedule"
        ], 
        [
            "must", 
            "might", 
            "should", 
            "would"
        ], 
        [
            "closely", 
            "constantly", 
            "warningly", 
            "differently"
        ], 
        [
            "adventure", 
            "equipment", 
            "supplies", 
            "reports"
        ], 
        [
            "basic", 
            "high", 
            "pure", 
            "neat"
        ], 
        [
            "since", 
            "when", 
            "until", 
            "while"
        ], 
        [
            "dangerous", 
            "abundant", 
            "peaceful", 
            "awesome"
        ], 
        [
            "available", 
            "concrete", 
            "prized", 
            "potential"
        ], 
        [
            "provided", 
            "reduced", 
            "produced", 
            "lost"
        ], 
        [
            "garden", 
            "house", 
            "pool", 
            "yard"
        ], 
        [
            "clearer", 
            "wilder", 
            "lower", 
            "higher"
        ], 
        [
            "passed", 
            "stood", 
            "gone", 
            "followed"
        ], 
        [
            "leaving", 
            "digging", 
            "filling", 
            "kicking"
        ], 
        [
            "by", 
            "before", 
            "until", 
            "after"
        ], 
        [
            "faith", 
            "will", 
            "strength", 
            "laughter"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "D", 
        "A", 
        "C", 
        "B", 
        "D", 
        "A", 
        "C", 
        "D", 
        "B", 
        "D", 
        "C", 
        "A", 
        "C", 
        "D"
    ], 
    "source": "high2800"
}