{
    "article": "I was never very neat, while my roommate Kate was extremely  _  . Each of her objects had its place, but mine  _  hid somewhere. She even labeled everything. I always  looked for  everything. Over time, Kate got neater and I got  _  . She would push my dirty clothing over, and I would  _  my books on her tidy desk. We both got tired of each other.\nWar broke out one evening. Kate came into the room. Soon, I heard her  _  , \"Take your shoes away!  _  under my bed! \" Deafened, I saw my shoes flying at me. I jumped  _  my feet and started yelling. She yelled back louder.\nThe room was  _  with anger. We could not have stayed together for a single minute but for a phone call. Kate  _  it. From her end of the conversation, I could  _  right away her grandma was  _  . When she hung up, she quickly crawled under her  _  , sobbing. Obviously, that was something she should not  go through  alone. All of a sudden, a warm feeling of  _  rose up in my heart.\nSlowly, I collected the pencils, took back the books, made my bed, cleaned the socks and swept the  _  , even on her side. I got  _  into my work that I even didn't  _  Kate had sat up. She was watching, her tears dried. Then, she reached out her hands to grasp mine. I looked up into her  _  . She smiled at me, \"Thanks.\"\nKate and I stayed roommates for the rest of the  _  . We didn't always agree, but we learned the key to living together: giving in, cleaning up and holding on.", 
    "options": [
        [
            "organized", 
            "planned", 
            "arranged", 
            "determined"
        ], 
        [
            "seldom", 
            "hardly", 
            "always", 
            "never"
        ], 
        [
            "messier", 
            "happier", 
            "cleaner", 
            "easier"
        ], 
        [
            "lie", 
            "hide", 
            "throw", 
            "lay"
        ], 
        [
            "talking", 
            "screaming", 
            "laughing", 
            "quarrelling"
        ], 
        [
            "What", 
            "When", 
            "How", 
            "Why"
        ], 
        [
            "to", 
            "off", 
            "at", 
            "on"
        ], 
        [
            "full", 
            "connected", 
            "filled", 
            "crowded"
        ], 
        [
            "heard", 
            "answered", 
            "received", 
            "replied"
        ], 
        [
            "say", 
            "see", 
            "speak", 
            "tell"
        ], 
        [
            "happy", 
            "dangerous", 
            "ill", 
            "upset"
        ], 
        [
            "covers", 
            "sheet", 
            "clothes", 
            "bed"
        ], 
        [
            "pride", 
            "sympathy", 
            "support", 
            "help"
        ], 
        [
            "courtyard", 
            "outside", 
            "floor", 
            "ceiling"
        ], 
        [
            "so", 
            "very", 
            "many", 
            "much"
        ], 
        [
            "understand", 
            "watch", 
            "think", 
            "notice"
        ], 
        [
            "face", 
            "heart", 
            "eyes", 
            "mind"
        ], 
        [
            "day", 
            "year", 
            "week", 
            "life"
        ]
    ], 
    "answers": [
        "A", 
        "C", 
        "A", 
        "D", 
        "B", 
        "D", 
        "A", 
        "C", 
        "D", 
        "D", 
        "C", 
        "A", 
        "B", 
        "C", 
        "A", 
        "D", 
        "C", 
        "B"
    ], 
    "source": "high1500"
}