{
    "article": "Cloze\nMuch time and effort has been devoted to researching the mental health benefits of flexible work environments, but can the ability to leave work early to watch your son's soccer game, or arrive at the office a bit later in the morning in order to   see to  some personal matters, have broader physical health benefits  _  making you feel a bit less tired?\nAccording to new research published in the Cochrane Library's Cochrane Database of Systematic Reviews, it seems so. In a review of 10 previous studies examining the health effects of flexible work conditions for more than 16,000 people,   _  from the U.K.'s Durham University and University of Newcastle, as\nwell as the University of Montreal, found that flexible work schedules -- when\nemployees can  _  their starting\ntimes, for example -- were associated with improvements in a person's overall\nhealth. And, perhaps unsurprisingly, in all of the studies included in the\nreview, researchers found no evidence for  _  effects of more flexible work schedules.\nThis initial analysis was intended to throw light on the potential health benefits of flexible work options, which are increasingly    _  throughout\nScandinavia, and have recently gained some ground in the U.K.  For example  , last April, the British government  _  a\npolicy that allowed parents of children ages six and under to request flexible\nwork arrangements to include parents of children ages 16 and younger. In the\nU.S., the phenomenon is a bit slower to catch on. Yet, the economic slowdown of\nrecent years may have contributed to  _  in\nworkplace flexibility -- as companies  _  to\nreward employees with bonuses  or raises may      turn to  other forms of\ncompensation , Reuters reported early last year.\nPrevious research too, of course, has indicated the benefits of flexible work environments toward positive mental health outcomes. And while these latest findings are promising, the researchers stress that more study is vital to understanding the detailed    _  between flexible work\nand improved health outcomes. To truly  _  the\nbenefits of flexible working conditions, the researchers say, additional study\nanalyzing health outcomes among a wide  _  of\nworkers -- from high-ranking executives to hourly employees -- is  _  , which helps to gain a deeper understanding of the issue, and\nto shape future workplace policy.", 
    "options": [
        [
            "across", 
            "besides", 
            "before", 
            "over"
        ], 
        [
            "officials", 
            "employers", 
            "executives", 
            "researchers"
        ], 
        [
            "spend", 
            "devote", 
            "shift", 
            "cancel"
        ], 
        [
            "changeable", 
            "positive", 
            "considerable", 
            "negative"
        ], 
        [
            "popular", 
            "interesting", 
            "adaptable", 
            "multiple"
        ], 
        [
            "extended", 
            "adopted", 
            "made", 
            "implemented"
        ], 
        [
            "decrease", 
            "beginning", 
            "freedom", 
            "growth"
        ], 
        [
            "willing", 
            "unable", 
            "determined", 
            "ready"
        ], 
        [
            "difference", 
            "relationship", 
            "progress", 
            "movement"
        ], 
        [
            "grasp", 
            "follow", 
            "fight", 
            "apply"
        ], 
        [
            "variety", 
            "change", 
            "range", 
            "gap"
        ], 
        [
            "critical", 
            "possible", 
            "feasible", 
            "demanding"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "C", 
        "D", 
        "A", 
        "A", 
        "D", 
        "B", 
        "B", 
        "A", 
        "C", 
        "A"
    ], 
    "source": "high2416"
}