{
    "article": "Have you ever seen a movie in which a building was burned down or a bridge was destroyed? Have you seen films in which two trains crashed or a ship  _  into the ocean? If  _  , you may have wondered how these things could happen without  _  the actors and actresses in the film.\nThe man who knows the  _  is the \"special-effects\" man. He has one of the most important  _  in the film industry. He may be ordered to  _  a flood or to make a battlefield explode. But he may also be told to create a  _  effect which is much less exciting,  _  just as important to the success of the film.\nIn a  _  for one movie there was a big glass bowl filled with water in which small fish were swimming. The director of the movie  _  the fish to stop swimming suddenly  so that  they seemed to stare at   an actor. Then the director wanted the fish to  _  staring and swim. But fish can't be ordered to do anything. It was quite a  _  .\nThe special-effects man thought about the problem for a long time. The result was an idea for  _  the fish with a harmless use of electricity.  First  he applied electricity to the fish bowl causing the fish to be absolutely  _  . Then he rapidly reduced the amount of  _  , allowing the fish to be free. Thus he got the humourous effect the  director  wanted.\nIn other parts of movie making there are also special-effects men who have developed  _  skills in creating certain kinds of effects. Jim White, who has been a special- effects man for thirty-two years, is best known for his  _  with ships and airplanes.", 
    "options": [
        [
            "buried", 
            "sank", 
            "fell", 
            "dropped"
        ], 
        [
            "so", 
            "such", 
            "possible", 
            "necessary"
        ], 
        [
            "telling", 
            "harming", 
            "protecting", 
            "organizing"
        ], 
        [
            "news", 
            "question", 
            "message", 
            "secret"
        ], 
        [
            "films", 
            "jobs", 
            "factories", 
            "companies"
        ], 
        [
            "prevent", 
            "fight", 
            "pour", 
            "create"
        ], 
        [
            "terrible", 
            "peaceful", 
            "funny", 
            "special"
        ], 
        [
            "or", 
            "as", 
            "though", 
            "only"
        ], 
        [
            "scene", 
            "step", 
            "stage", 
            "room"
        ], 
        [
            "ordered", 
            "wanted", 
            "decided", 
            "doubted"
        ], 
        [
            "return", 
            "continue", 
            "stop", 
            "start"
        ], 
        [
            "success", 
            "failure", 
            "problem", 
            "disappointment"
        ], 
        [
            "controlling", 
            "operating", 
            "driving", 
            "lighting"
        ], 
        [
            "pure", 
            "interesting", 
            "still", 
            "quiet"
        ], 
        [
            "fish", 
            "water", 
            "electricity", 
            "bowl"
        ], 
        [
            "fast", 
            "particular", 
            "humorous", 
            "careful"
        ], 
        [
            "imagination", 
            "work", 
            "repair", 
            "design"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "B", 
        "D", 
        "B", 
        "D", 
        "D", 
        "C", 
        "A", 
        "B", 
        "C", 
        "C", 
        "A", 
        "C", 
        "C", 
        "B", 
        "B"
    ], 
    "source": "high3025"
}