{
    "article": "Mother came from our home village. She stayed with us for ten days. When she was  _  to leave, she wanted to buy us something  _  a present. \"You've got  _  ,\" she said, \"but you seem to have got  _  . The TV set is yours, but the people who walk back and forth in it are all  _  , even murderers, corrupt officials and thieves come in and  out of  it from time to time. The radio cassette player is yours, but it's all others who  _  in it. The books on the shelf are yours, but they are all  _  by others. The fridge is yours, but all the year round it's  filled with  frost that comes from God knows where.  _  they make your life easy and comfortable,  none  of them BELONGS to you in the real sense of the word.  _  the day she was to leave for home, she got up early in the morning and  _  back a pickle pot from the market. \"  _  some pickle in it,\" she said, \"and have something  _  suits your own taste.\" Since then pickles of our own  _  had been added to our diet. When we had guests, we often had pickles  to go with  wine. Slightly intoxicated(excited greatly), everyone would say, \"A country flavor, not bad, Not bad, a country flavor \".  _  we had something to our own taste. When we looked at the  pot  , it was standing quietly at the corner. Amid the hustle and bustle of our  everyday  life and in the apartment of reinforced concrete, the pot stood there by itself, brewing an old and simple flavor.", 
    "options": [
        [
            "on", 
            "about", 
            "for", 
            "of"
        ], 
        [
            "since", 
            "because", 
            "as", 
            "for"
        ], 
        [
            "everything", 
            "something", 
            "nothing", 
            "anything"
        ], 
        [
            "everything", 
            "something", 
            "nothing", 
            "anything"
        ], 
        [
            "murderers", 
            "thieves", 
            "actors", 
            "strangers"
        ], 
        [
            "sing", 
            "dance", 
            "plays", 
            "act"
        ], 
        [
            "writing", 
            "written", 
            "read", 
            "reading"
        ], 
        [
            "As", 
            "But", 
            "Because", 
            "Though"
        ], 
        [
            "On", 
            "In", 
            "During", 
            "Of"
        ], 
        [
            "took", 
            "brought", 
            "fetched", 
            "carried"
        ], 
        [
            "Do", 
            "Cook", 
            "Make", 
            "Prepare"
        ], 
        [
            "what", 
            "/", 
            "that", 
            "as"
        ], 
        [
            "smell", 
            "sound", 
            "feel", 
            "taste"
        ], 
        [
            "But", 
            "So", 
            "And", 
            "Or"
        ]
    ], 
    "answers": [
        "B", 
        "C", 
        "A", 
        "C", 
        "D", 
        "A", 
        "B", 
        "D", 
        "A", 
        "B", 
        "C", 
        "C", 
        "D", 
        "B"
    ], 
    "source": "high2402"
}