{
    "article": "I'll never forget the summer day in 1965 when my mother suddenly died of an unexplained illness at the age of 36. Later that afternoon, a police officer came to ask for my father's  _  for the hospital to  _  Mother's valve . I was shocked. I ran into the house  in tears  . At 14 I just  couldn't  understand why anyone would take apart a person I loved.  _  my father told the police officer, \"Yes .\" \"How can you let them do that to her?\" I  cried at  him. \"Linda,\" he said quietly,  _  his arms around me, \"the greatest  _  you can give is a  _  of yourself. Your mother and I decided  long ago  that if we can  _  a difference in just one person's life after we die, our death will have  _  .\" The  _  my father taught me that day became one of the most  _  in my life. Years passed. I married and had a family of my own. In 1986, my father became seriously ill. He  _  told me that when he died, he wanted to donate  _  was in good condition, especially his eyes. My father died and we donated his eyes  _  he had wanted. Three days later, my daughter said, \"Mum, I'm so  _  of what you did for Grandpa. At that moment I realized that my father gave much more than his  _  . What he  _  behind sparkled in my daughter's eyes -- pride.", 
    "options": [
        [
            "advice", 
            "permission", 
            "suggestion", 
            "speech"
        ], 
        [
            "repair", 
            "operate", 
            "treat", 
            "use"
        ], 
        [
            "So", 
            "And", 
            "But", 
            "For"
        ], 
        [
            "carrying", 
            "putting", 
            "raising", 
            "pushing"
        ], 
        [
            "gift", 
            "wish", 
            "talk", 
            "regret"
        ], 
        [
            "health", 
            "body", 
            "part", 
            "value"
        ], 
        [
            "have", 
            "make", 
            "keep", 
            "tell"
        ], 
        [
            "pleasure", 
            "right", 
            "fun", 
            "meaning"
        ], 
        [
            "lesson", 
            "subject", 
            "thought", 
            "experience"
        ], 
        [
            "ordinary", 
            "important", 
            "useless", 
            "hard"
        ], 
        [
            "carefully", 
            "sadly", 
            "cruelly", 
            "cheerfully"
        ], 
        [
            "who", 
            "whatever", 
            "that", 
            "which"
        ], 
        [
            "as", 
            "when", 
            "while", 
            "where"
        ], 
        [
            "fond", 
            "tired", 
            "proud", 
            "afraid"
        ], 
        [
            "words", 
            "life", 
            "eyes", 
            "lessons"
        ], 
        [
            "taught", 
            "left", 
            "sent", 
            "gave"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "C", 
        "B", 
        "A", 
        "C", 
        "B", 
        "D", 
        "A", 
        "B", 
        "A", 
        "B", 
        "A", 
        "C", 
        "C", 
        "B"
    ], 
    "source": "high2065"
}