{
    "article": "Many theories concerning the causes of juvenile delinquency (crimes committed by young people) focus either on the individual or on society as the major contributing influence. Theories centering on the individual suggest that children  engage in  criminal behavior before they were not sufficiently  _  for previous misbehaviors or that they have learned criminal behavior through interaction with others. Theories focusing on the role of society suggest that children commit crimes in  _  to their failure to rise above their socioeconomic status or as a rejection of middle-class values. Most theories of juvenile delinquency have focused on children from disadvantaged families,  _  the fact that children from wealthy homes also commit crimes. The latter may commit crimes for lack of adequate control from parents. All  _  , however, are uncertain or unimproved and are of course challenged with criticism. Changes in the social structure may indirectly  _  juvenile crime rates. For example, changes in the economy that  _  to fewer job opportunities for youth and rising unemployment  in general  make gainful employment increasingly difficult to obtain. This results in dissatisfaction among youths and may in  _  lead more youths into criminal behavior. Families have also experienced  _  these years. More families consist of one parent households or two working parents;  _  , children are likely to have less supervision at home than was common in the traditional family  _  . This lack of parental supervision is thought to be an influence on juvenile crime rates. Other noticeable  _  of offensive acts include unfavorable experience or failure in school, the  _  availability of drugs and alcohol, and the growing phenomenon of child abuse and child neglect. All these conditions tend to increase the  _  of a child committing a criminal act, although a direct cause and effect relationship has not yet been established.", 
    "options": [
        [
            "punished", 
            "forgiven", 
            "forgotten", 
            "excused"
        ], 
        [
            "return", 
            "contact", 
            "reference", 
            "response"
        ], 
        [
            "considering", 
            "ignoring", 
            "highlighting", 
            "believing"
        ], 
        [
            "values", 
            "misbehaviors", 
            "criminals", 
            "theories"
        ], 
        [
            "affect", 
            "reduce", 
            "prevent", 
            "reflect"
        ], 
        [
            "point", 
            "lead", 
            "come", 
            "add"
        ], 
        [
            "case", 
            "short", 
            "turn", 
            "essence"
        ], 
        [
            "failure", 
            "miseries", 
            "development", 
            "changes"
        ], 
        [
            "contrarily", 
            "consequently", 
            "similarly", 
            "occasionally"
        ], 
        [
            "education", 
            "concept", 
            "structure", 
            "economy"
        ], 
        [
            "suggestions", 
            "causes", 
            "ideas", 
            "reports"
        ], 
        [
            "increased", 
            "restricted", 
            "reasonable", 
            "popular"
        ], 
        [
            "knowledge", 
            "aspect", 
            "strength", 
            "probability"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "B", 
        "D", 
        "A", 
        "B", 
        "C", 
        "D", 
        "B", 
        "C", 
        "B", 
        "A", 
        "D"
    ], 
    "source": "high1570"
}