{
    "article": "Directions: For each blank in the following passage there are four words or phrases marked A, B, C and D. fill in each blank with the word or phrases that best fits the context. It was raining outside. We all stood near the door of the supermarket, waiting. Suddenly I heard a sweet voice. \"Mom, let's  run through  the rain,\" said a six-year-old girl, with beautiful red hair, who had been shopping with her mum in Walmart. \"What? No, honey. We'll  _  until it stops raining so hard,\" the mother replied. The girl waited about one minute and repeated, \"Mom, let's run through the rain.\" \"We'll  get wet  if we do,\" the mother said. \"No, we won't, mom. That's not what you said this morning,\" the young girl said as she  _  out of her mom's arm. \" This morning?\" \"Yes, when you were talking to Daddy about his cancer, you said, 'If God can get us through this, he can get us through anything!'\" The whole crowd became  _  . We couldn't hear anything but  the rain  . We all stood there silently. Her mom thought for a moment and said, \"Honey, you're right. Let's run through the rain. If God lets us get wet, well, maybe we just need  _  .\" Then off they ran. We all stood there, watching and smiling as they ran through the rain. They held their shopping bags over their  _  just in case. Yes, they got wet. But they were followed by many  _  who screamed and laughed like children all the way to their cars. Memory is a fortune, a precious gift. I believe that somewhere down the road in life, the mother will  _  herself looking back on this moment and she will smile. So don't forget to make time and take the opportunities to make memories every day and take the time to run through the rain.", 
    "options": [
        [
            "leave", 
            "wait", 
            "imagine", 
            "jump"
        ], 
        [
            "pulled", 
            "pushed", 
            "carried", 
            "form"
        ], 
        [
            "noisy", 
            "calm", 
            "silent", 
            "frightened"
        ], 
        [
            "running", 
            "washing", 
            "walking", 
            "waiting"
        ], 
        [
            "hands", 
            "backs", 
            "heads", 
            "coats"
        ], 
        [
            "drivers", 
            "children", 
            "parents", 
            "adults"
        ], 
        [
            "find", 
            "stop", 
            "make", 
            "express"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "B", 
        "C", 
        "D", 
        "A"
    ], 
    "source": "high1541"
}