{
    "article": "People in communities have slowly been pushed apart through the years, mostly because people simply aren't taking the time to say a simple \"hello,\" After considering this phenomenon, I decided I was going to  _  the way I was doing things. My  _  came one morning when I was in the community library. I passed by a girl who  _  her books out of her locker .Thinking like most that someone else would help her pick them up, I continued my way. However, when I had to  go back  because I stupidly forgot my book, I noticed she had just finished packing them up by herself he one had stopped to  _  her. \"OK,\" I thought to myself, \"this is where I should have changed.\" My best opportunity came a few days later when I saw a man  _  by himself waiting for the library to open ,so I sat down next to him and began a  _  .It was difficult to get started ,and even when I had to say goodbye, almost every  _  from my new friend had a tone of doubt in it ,And who could blame him? People aren't used to making an  _  chat with a stranger. But a change, no matter how  _  it is needed, doesn't just happen. It takes people like us to make it possible. I  _  you to take a small step out of your comfort zone and try to make someone's day a little brighter, Together, we can really make come  _  as a whole.", 
    "options": [
        [
            "change", 
            "explain", 
            "learn", 
            "show"
        ], 
        [
            "trouble", 
            "doubt", 
            "wish", 
            "opportunity"
        ], 
        [
            "took", 
            "dropped", 
            "got", 
            "pulled"
        ], 
        [
            "please", 
            "greet", 
            "help", 
            "praise"
        ], 
        [
            "sitting", 
            "walking", 
            "riding", 
            "running"
        ], 
        [
            "discussion", 
            "lesson", 
            "report", 
            "conversation"
        ], 
        [
            "joke", 
            "response", 
            "cry", 
            "story"
        ], 
        [
            "unchangeable", 
            "unprepared", 
            "unforgettable", 
            "unfinished"
        ], 
        [
            "desperately", 
            "frequently", 
            "simply", 
            "widely"
        ], 
        [
            "allow", 
            "warn", 
            "order", 
            "advise"
        ], 
        [
            "tater", 
            "straighter", 
            "closer", 
            "slower"
        ]
    ], 
    "answers": [
        "C", 
        "D", 
        "B", 
        "C", 
        "A", 
        "D", 
        "B", 
        "B", 
        "A", 
        "D", 
        "C"
    ], 
    "source": "high2767"
}