{
    "article": "Dad taught me a lot about life, especially its hard times. I remembered one of his  _  one night when I was ready to quit  a political movement I was losing, and wrote about it in my diary.\nTired, feeling the many months of struggle, I went up to my study to make some notes. I was looking for a pencil in the back of my desk drawer when I  _  up one of Dad's old business cards that he was so proud of. Then I thought about how he  _  with difficult situation. A lot of pictures appeared into my idea, but one scene came sharply into view.\nWe had just moved to Hollywood, New York. We had our own house for the first time; it had some land around it, even  _  . One, in particular, was a great blue spruce  that must have been 40 feet tall.\nLess than a week after we moved in, there was a terrible  _  . We came home from the store that night to find the spruce  _  almost totally from the ground and thrown onto the street. When my brother Frankie and I saw the spruce, our heart  _  . But not Dad's.\nThe rain was  _  . Then he announced, \"Ok, we're going to push him up!\" \"What are you talking about, Dad? The roots are out of the ground !\" \"Shut up; we're going to push him up; he's going to  _  .\" We couldn't say no to him. So we followed him into the house and we got what rope there was and we tied the rope around the top of the tree that lay on the street and he stood up by the house, with me  _  on the rope and Frankie in the street in the rain, helping to  _  up the great blue spruce. In no time at all, we had it standing up straight again! Dad  _  stakes  in the ground, tied rope from the trunk  to the stakes, and said, \"Don't worry, he is going to grow again...\"\nI looked at the card and wanted to cry. I couldn't wait to get back into the movement.", 
    "options": [
        [
            "talks", 
            "lessons", 
            "lectures", 
            "classes"
        ], 
        [
            "came", 
            "took", 
            "picked", 
            "turned"
        ], 
        [
            "dealt", 
            "kept", 
            "helped", 
            "worked"
        ], 
        [
            "field", 
            "yard", 
            "trees", 
            "flowers"
        ], 
        [
            "rain", 
            "snow", 
            "weather", 
            "storm"
        ], 
        [
            "pulled", 
            "put", 
            "stuck", 
            "pushed"
        ], 
        [
            "rose", 
            "sank", 
            "fell", 
            "dropped"
        ], 
        [
            "going", 
            "coming", 
            "falling", 
            "stopping"
        ], 
        [
            "plant", 
            "grow", 
            "die", 
            "stay"
        ], 
        [
            "fixing", 
            "holding", 
            "pushing", 
            "pulling"
        ], 
        [
            "push", 
            "take", 
            "pull", 
            "put"
        ], 
        [
            "shook", 
            "cut", 
            "drove", 
            "made"
        ]
    ], 
    "answers": [
        "B", 
        "D", 
        "A", 
        "C", 
        "D", 
        "A", 
        "B", 
        "C", 
        "B", 
        "D", 
        "A", 
        "C"
    ], 
    "source": "high2397"
}