{
    "article": "Though there is much to be concerned about, there is far, far more for which to be thankful. Though life's goodness can at times be overshadowed , it is  _  outweighed. For every single act that is senselessly destructive,  _  are thousands more small, quiet acts of love,  _  and sympathy. For every person who seeks to hurt, there are many, many more who  _  their lives to helping and to healing. There is a goodness to life that  _  be denied. In the most remarkable views and in the smallest details, look  _  , because that goodness always comes shining through. There is no  _  to the goodness of life. It  _  more abundant each time you feel it. The  _  you experience and appreciate the goodness of life, the more there is to be lived. Even  _  the cold winds blow and the world seems to be  _  in foggy shadows, the goodness of life lives  _  . Open your eyes, open your heart,  _  you will see that goodness is everywhere. Though the goodness of life  _  at times to suffer hardships, it is always going on there. For in the  _  moment, it becomes more clear that life is a  _  treasure. And so the goodness of  _  is made even stronger by the very things that would go against it. Time and time again when you feared it was  _  forever, you found that the goodness of life was really only a / an  _  away. Around the next corner, inside every moment, the goodness of life is there to surprise and  _  you.", 
    "options": [
        [
            "always", 
            "never", 
            "often", 
            "usually"
        ], 
        [
            "there", 
            "here", 
            "they", 
            "those"
        ], 
        [
            "worry", 
            "anxiety", 
            "kindness", 
            "upset"
        ], 
        [
            "make", 
            "put", 
            "contribute", 
            "devote"
        ], 
        [
            "needn't", 
            "mustn't", 
            "can't", 
            "won't"
        ], 
        [
            "suddenly", 
            "closely", 
            "roughly", 
            "simply"
        ], 
        [
            "limit", 
            "denying", 
            "doubt", 
            "point"
        ], 
        [
            "loses", 
            "grows", 
            "plants", 
            "goes"
        ], 
        [
            "less", 
            "fewer", 
            "more", 
            "most"
        ], 
        [
            "when", 
            "if", 
            "though", 
            "before"
        ], 
        [
            "shone", 
            "covered", 
            "decorated", 
            "suffered"
        ], 
        [
            "with", 
            "by", 
            "through", 
            "on"
        ], 
        [
            "yet", 
            "or", 
            "and", 
            "still"
        ], 
        [
            "seems", 
            "looks", 
            "proves", 
            "appears"
        ], 
        [
            "shortest", 
            "darkest", 
            "brightest", 
            "fastest"
        ], 
        [
            "priceless", 
            "valueless", 
            "useless", 
            "worthless"
        ], 
        [
            "heart", 
            "life", 
            "wealth", 
            "health"
        ], 
        [
            "disappeared", 
            "lost", 
            "gone", 
            "left"
        ], 
        [
            "hour", 
            "mile", 
            "month", 
            "moment"
        ], 
        [
            "delight", 
            "regret", 
            "shock", 
            "disappoint"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "D", 
        "C", 
        "B", 
        "A", 
        "B", 
        "C", 
        "A", 
        "B", 
        "D", 
        "C", 
        "A", 
        "B", 
        "A", 
        "B", 
        "C", 
        "D", 
        "A"
    ], 
    "source": "high141"
}