{
    "article": "Lulu is a brave pet in our shelter. As you know, there are a lot of forest fires during the summer season. Many forests are badly damaged by fire each year. Not far from our shelter, a forest caught fire during this hot summer. We were in a heat wave which had been  going on  for three days. Lulu rushed towards the forest where flames sent out a terrible  _  .I no longer had any hope that Lulu would come back to the shelter.In fact, I was waiting for the firemen to announce his  _  in the forest, when suddenly, a fireman burst into my shelter and informed me that my dog Lulu had  _  to save four kittens who were trapped by the flames.According to the fireman, Lulu seized the kittens, one by one moving them to a safe place.I immediately accompanied the fireman to the forest to  pick up  the rescued kittens.When we arrived  _  the scene of the incident, we found Lulu was not there. Then we heard the  _  of a dog from the forest barking furiously . I recognized it was my dog Lulu.The fireman followed the tracks of the dog until we found him barking  _  by the side of an injured fireman who was lying on the ground and desperately waiting for rescue.Thanks to Lulu, four kittens and a fireman were saved. That day, I was very proud of Lulu for his two heroic  _  toward the kittens and the fireman.Lulu showed much compassion for both animals like him and for a human being who was trying to  put out  the fire with his colleagues . This true story of genuine love and compassion shows us that pets are loving, caring and considerate .We should love and protect them.One day they could do us a good turn.", 
    "options": [
        [
            "heat", 
            "energy", 
            "fever", 
            "burn"
        ], 
        [
            "return", 
            "honour", 
            "action", 
            "death"
        ], 
        [
            "tried", 
            "wanted", 
            "managed", 
            "failed"
        ], 
        [
            "at", 
            "in", 
            "on", 
            "to"
        ], 
        [
            "voice", 
            "noise", 
            "accent", 
            "sound"
        ], 
        [
            "heavily", 
            "strongly", 
            "loudly", 
            "weakly"
        ], 
        [
            "things", 
            "actions", 
            "sayings", 
            "reactions"
        ]
    ], 
    "answers": [
        "A", 
        "D", 
        "C", 
        "A", 
        "D", 
        "C", 
        "B"
    ], 
    "source": "high1380"
}