{
    "article": "Someone who deeply impressed you may have appeared in your life for just a few minutes. To celebrate my 10th birthday, I invited some friends to a fast food restaurant. We  _  hamburgers and Coca Cola at the counter. When our  _  came, I started walking towards a(n)  _  table. By bad luck, my purse strap got  _  on a chair and the tray that I was holding slipped from my hands and went flying in the air. The tray, and its contents,  _  on a man who was just about to  _  a bite of his sandwich. I stared, greatly  _  , as the drinks wet his white shirt badly. Then I closed my eyes and prepared myself for his burst of  _  . Instead, he said, \" It's OK\" to comfort me before he disappeared into the washroom. Still shaky and  _  what to do next, my friends and I went to a table and sat there, trying our best to look  _  . A moment later, the man came out of the washroom and  _  our table. My heart almost stopped beating. I thought he was going to ask for my father's  _  and call him. To my surprise, he  _  smiled at us, handed us some cash and said, \"Buy yourself new hamburgers.\" He then walked  _  away without even finishing his food. He could have made what was already an uncomfortable situation worse, but he chose a different way and gave us a reason to believe that there is still  _  in this world. I'll never forget his actions.", 
    "options": [
        [
            "made", 
            "ordered", 
            "required", 
            "demanded"
        ], 
        [
            "food", 
            "turn", 
            "bill", 
            "menu"
        ], 
        [
            "tidy", 
            "full", 
            "empty", 
            "crowded"
        ], 
        [
            "fixed", 
            "caught", 
            "cut", 
            "tied"
        ], 
        [
            "knocked", 
            "hung", 
            "threw", 
            "fell"
        ], 
        [
            "taste", 
            "take", 
            "swallow", 
            "chew"
        ], 
        [
            "discouraged", 
            "disappointed", 
            "shocked", 
            "annoyed"
        ], 
        [
            "bitterness", 
            "anxiety", 
            "anger", 
            "sorrow"
        ], 
        [
            "unsure", 
            "unrest", 
            "frightened", 
            "puzzled"
        ], 
        [
            "mild", 
            "honest", 
            "modest", 
            "calm"
        ], 
        [
            "drew", 
            "approached", 
            "pushed", 
            "laid"
        ], 
        [
            "help", 
            "position", 
            "number", 
            "job"
        ], 
        [
            "suddenly", 
            "strangely", 
            "excitedly", 
            "merely"
        ], 
        [
            "hurriedly", 
            "gradually", 
            "finally", 
            "slowly"
        ], 
        [
            "kindness", 
            "happiness", 
            "politeness", 
            "brightness"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "B", 
        "D", 
        "B", 
        "C", 
        "C", 
        "A", 
        "D", 
        "B", 
        "C", 
        "D", 
        "A", 
        "A"
    ], 
    "source": "high2039"
}