{
    "article": "Bobby was getting cold in the snow. His shoes had a few holes and did a poor job of keeping out the  _  . He had been out for about an hour already,   _  he could not hit an idea for his mother' s Christmas gift. \nEver since his father died three years ago, the family had   _    . His mother's small wage could   _  make ends meet. What the family lacked in   _   they made up for in love. Bobby' s sisters, clever with hands, had already   _  beautiful gifts for their mother. But Bobby had nothing. \nStanding up, Bobby walked to the street. It wasn't   _  without a father, especially when he needed a man to talk to. He walked from shop to shop. Everything seemed so beautiful and so out of   _  .\nIt was getting dark and Bobby turned to walk home when  _  his eyes caught something shining on the ground. He reached down and  _  a shiny dime(a coin of ten cents).Never before has anyone felt so   _  as Bobby felt at that moment.  _  spread throughout his body.  _  his new found treasure, he walked into a nearby store. His   _  quickly turned cold when knowing he could buy nothing with only a dime.\nThen he went into a flower shop. Bobby handed the dime and asked   _  he could buy one flower for his mother. Looking at Bobby and his dime, the shopkeeper   _  for a second and asked Bobby to wait there. Then he went in. Few minutes later, the shopkeeper came out with a bunch of beautiful red roses. Bobby' s heart   _  as the shopkeeper placed the roses gently into a beautiful box. He had only a dime !\n\"That will be ten cents, young man,\" the shop owner said.  _  Bobby gave the man his coin in disbelief. Could this be true?   _  the boy' s mind, the shopkeeper added, \"I just happened to have some roses on sale. Would you like them?\"\nThis time Bobby didn't  _  . Walking out of the door, Bobby heard the shopkeeper say, \"Merry Christmas, son. \"", 
    "options": [
        [
            "rain", 
            "cold", 
            "dark", 
            "dust"
        ], 
        [
            "yet", 
            "so", 
            "or", 
            "thus"
        ], 
        [
            "ended", 
            "moved", 
            "struggled", 
            "united"
        ], 
        [
            "hardly", 
            "probably", 
            "usually", 
            "totally"
        ], 
        [
            "time", 
            "spirit", 
            "money", 
            "education"
        ], 
        [
            "bought", 
            "made", 
            "ordered", 
            "exchanged"
        ], 
        [
            "safe", 
            "wise", 
            "strange", 
            "easy"
        ], 
        [
            "mind", 
            "control", 
            "reach", 
            "sight"
        ], 
        [
            "gradually", 
            "suddenly", 
            "hurriedly", 
            "deliberately"
        ], 
        [
            "searched", 
            "watched", 
            "placed", 
            "discovered"
        ], 
        [
            "popular", 
            "special", 
            "wealthy", 
            "comfortable"
        ], 
        [
            "Warmth", 
            "Panic", 
            "Regret", 
            "Ambition"
        ], 
        [
            "Choosing", 
            "Holding", 
            "Bringing", 
            "Fetching"
        ], 
        [
            "guilt", 
            "patience", 
            "curiosity", 
            "excitement"
        ], 
        [
            "what", 
            "why", 
            "if", 
            "when"
        ], 
        [
            "paused", 
            "looked", 
            "waited", 
            "prayed"
        ], 
        [
            "settled", 
            "sank", 
            "bled", 
            "relieved"
        ], 
        [
            "Slowly", 
            "Calmly", 
            "Secretly", 
            "Unwillingly"
        ], 
        [
            "Changing", 
            "Clearing", 
            "Occupying", 
            "Reading"
        ], 
        [
            "refuse", 
            "stop", 
            "insist", 
            "hesitate"
        ]
    ], 
    "answers": [
        "B", 
        "A", 
        "C", 
        "A", 
        "C", 
        "B", 
        "D", 
        "C", 
        "B", 
        "D", 
        "C", 
        "A", 
        "B", 
        "D", 
        "C", 
        "A", 
        "B", 
        "A", 
        "D", 
        "D"
    ], 
    "source": "high876"
}