{
    "article": "Last spring, I was fortunate to be chosen to participate in an exchange study program. In my application letter, I was careful to  _  how much I wanted to see France; evidently, my excitement really came through in my words. Once I  _  that I was going, all I could think about was the fun of foreign travel and making all sorts of new and  _  friends. While traveling was inspiring and meeting people was  _  , nothing about my term in France was what I  _  . The moment I arrived in Paris, I was  _  by a nice French couple who would become my host parents. My entire experience was joyous and exciting  _  I received some shocking news from my program coordinator : there had been a death in my host parents' extended family. They had to travel outside France for several weeks. That afternoon, I had to  _  out of one family's house and into another. The exchange coordinator told me I'd have a  _  this time and asked whether I could share a bedroom with an English speaker. To avoid the temptation to  _  my native language, I asked not to be  _  with an Englishspeaking roommate. When I got to my new room, I  _  myself to my new roommate Paolo, a Brazilian the same age as I, whom I was surprised to find playing one of my favorite CDs! In just a few hours, we knew we'd be good friends for the rest of the  _  . I left France with many  _  , so when people ask me what my favorite part of the trip was, they are always  _  to hear me talk about my Brazilian friend Paolo and the scores of weekdays in class, weeknights on the town, and weekends  _  France we enjoyed together. I love how people  _  seem so different, but end up being so  _  . The most valuable lesson I gained from studying in France wasn't just to respect the French people  _  to respect all people,for your next best friend could be just a continent away. I would recommend an exchange program to anyone who wants to experience foreign cultures and gain meaningful  _  .", 
    "options": [
        [
            "discuss", 
            "express", 
            "announce", 
            "argue"
        ], 
        [
            "approved", 
            "knew", 
            "warned", 
            "denied"
        ], 
        [
            "stubborn", 
            "anxious", 
            "universal", 
            "interesting"
        ], 
        [
            "boring", 
            "upsetting", 
            "exciting", 
            "promising"
        ], 
        [
            "expected", 
            "liked", 
            "doubted", 
            "feared"
        ], 
        [
            "sponsored", 
            "witnessed", 
            "greeted", 
            "supported"
        ], 
        [
            "until", 
            "when", 
            "since", 
            "while"
        ], 
        [
            "move", 
            "travel", 
            "walk", 
            "rush"
        ], 
        [
            "housekeeper", 
            "leader", 
            "roommate", 
            "colleague"
        ], 
        [
            "learn", 
            "appreciate", 
            "speak", 
            "master"
        ], 
        [
            "combined", 
            "fitted", 
            "involved", 
            "placed"
        ], 
        [
            "added", 
            "introduced", 
            "devoted", 
            "adapted"
        ], 
        [
            "term", 
            "week", 
            "month", 
            "vacation"
        ], 
        [
            "presents", 
            "suitcases", 
            "stories", 
            "dreams"
        ], 
        [
            "surprised", 
            "disturbed", 
            "embarrassed", 
            "concerned"
        ], 
        [
            "analyzing", 
            "exploring", 
            "describing", 
            "investigating"
        ], 
        [
            "need", 
            "shall", 
            "must", 
            "can"
        ], 
        [
            "generous", 
            "independent", 
            "similar", 
            "distant"
        ], 
        [
            "and", 
            "but", 
            "or", 
            "so"
        ], 
        [
            "instructions", 
            "friendships", 
            "facts", 
            "data"
        ]
    ], 
    "answers": [
        "B", 
        "B", 
        "D", 
        "C", 
        "A", 
        "C", 
        "A", 
        "A", 
        "C", 
        "C", 
        "D", 
        "B", 
        "A", 
        "C", 
        "A", 
        "B", 
        "D", 
        "C", 
        "B", 
        "B"
    ], 
    "source": "high2"
}