{
    "article": "One day, an expert in time-management was speaking to a group of business students. To make the point  _  , he used an illustration. As he stood in front of the group, he said, \"Okay, time for a quiz.\" He then pulled out a wide-mouth jar and set it on the table. Then he  _  placed about a dozen fist-sized rocks, one by one, into the jar. When the jar was filled to the  _  and no more rocks would fit inside, he asked, \"Is this jar  _  ?\" Everyone in the class said, \"Yes.\" \"Really?\" Then he  _  under the table and pulled out a bucket of gravel(,),dumped some in and  _  the jar, causing pieces of gravel to work themselves down into the space  _  the big rocks. Then he asked the group the same question. \"Probably not.\" One of them answered. \"Good!\" he replied. He reached under the table and  brought out  a bucket of sand. He started dumping the sand in the jar and it went into all the  _  left between the rocks and the gravel.  Once more  he asked the question. \"No!\" the class shouted. \"Good!\" Then he grabbed a can of water and began to pour it in  _  the jar was filled to the brim. Then the expert in time-management looked at the class and asked, \"What is the  _  of this illustration?\" It is such a seemingly easy question that one  _  student raised his hand and said, \"It is, however full your schedule is, if you try really hard you can always  _  some more things in it.\" \"No,\" the speaker replied, \"The truth it teaches us is that you will  _  get them in at all if you don't put the big rocks in first.  _  the big rocks in your life are, do things that you love and  _  for yourself. In your schedule if you value the little stuff then you'll fill your life with  _  things and you will never have the real quality time you need to spend on the big, important stuff. So, tonight, or in the morning, when you are  _  on this short story, ask yourself what are the 'big rocks' in your life? Then put those in your  _  first.\"", 
    "options": [
        [
            "harder", 
            "rougher", 
            "clearer", 
            "wiser"
        ], 
        [
            "carefully", 
            "firmly", 
            "actively", 
            "unwillingly"
        ], 
        [
            "edge", 
            "bottom", 
            "wall", 
            "top"
        ], 
        [
            "full", 
            "pure", 
            "enough", 
            "smooth"
        ], 
        [
            "sent", 
            "reached", 
            "managed", 
            "felt"
        ], 
        [
            "delivered", 
            "shook", 
            "dropped", 
            "held"
        ], 
        [
            "beneath", 
            "across", 
            "beyond", 
            "between"
        ], 
        [
            "spaces", 
            "caves", 
            "blanks", 
            "holes"
        ], 
        [
            "unless", 
            "until", 
            "before", 
            "while"
        ], 
        [
            "meaning", 
            "opinion", 
            "point", 
            "comment"
        ], 
        [
            "calm", 
            "awkward", 
            "nervous", 
            "eager"
        ], 
        [
            "add", 
            "fit", 
            "include", 
            "collect"
        ], 
        [
            "never", 
            "even", 
            "still", 
            "ever"
        ], 
        [
            "Whether", 
            "However", 
            "Whatever", 
            "Which"
        ], 
        [
            "conclude", 
            "encourage", 
            "fresh", 
            "time"
        ], 
        [
            "more", 
            "little", 
            "much", 
            "less"
        ], 
        [
            "reflecting", 
            "counting", 
            "deciding", 
            "insisting"
        ], 
        [
            "packet", 
            "can", 
            "jar", 
            "luggage"
        ]
    ], 
    "answers": [
        "C", 
        "A", 
        "D", 
        "A", 
        "B", 
        "B", 
        "D", 
        "A", 
        "B", 
        "C", 
        "D", 
        "B", 
        "A", 
        "C", 
        "D", 
        "B", 
        "A", 
        "C"
    ], 
    "source": "high3135"
}